{"_default": {"1": {"id": "1ezyzm8", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "34methylendioxy", "link_flair_text": null, "time": 1725072718.4109082, "created_utc": 1724481715.0, "url": "https://i.redd.it/a59akvji5kkd1.jpeg", "title": "This Easter egg Bar in GTA San Andreas with real life UFO pics", "permalink": "/r/ufo/comments/1ezyzm8/this_easter_egg_bar_in_gta_san_andreas_with_real/", "selftext": "", "media": null, "score": 498, "upvote_ratio": 0.98, "comment_count": 16, "over_18": false}, "2": {"id": "1f20ar2", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "thtflyingguy", "link_flair_text": "Clipping", "time": 1725072719.9673982, "created_utc": 1724708999.0, "url": "https://v.redd.it/v9vh0d1bx2ld1", "title": "UAP spotted at 35,000 feet", "permalink": "/r/UFOs/comments/1f20ar2/uap_spotted_at_35000_feet/", "selftext": "I’m an Airline pilot and was flying over the Atlantic Ocean when me and captain spotted these orb of lights that kept moving around each other and one point we saw them move at incredible speeds and stop and hover instantaneously. It was at that moment I took out my phone to record them. Through out the night we kept seeing them. One would show up then another out of nowhere. I have another video showing two of them and I turn the camera showing another group to the South. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/v9vh0d1bx2ld1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/v9vh0d1bx2ld1/DASH_96.mp4", "dash_url": "https://v.redd.it/v9vh0d1bx2ld1/DASHPlaylist.mpd?a=1727664718%2CZmZlMjU1MmNlZGU1MGM5MWRkMDc2YmE0ZTMzYThiOTBhNGZmYzkxNDU1ZjZlNjQ0MDBkNGUwNWE5MzQ2OThhYw%3D%3D&v=1&f=sd", "duration": 32, "hls_url": "https://v.redd.it/v9vh0d1bx2ld1/HLSPlaylist.m3u8?a=1727664718%2CYTQwNWMyMGJkY2NlYjIzZmQ5OTEwYTZjZDU3Yzg0YTA3NjVlNmZjMDM4NWEwOWMxZjAzMzBlZjUyNDVjOTc3MQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 10782, "upvote_ratio": 0.88, "comment_count": 988, "over_18": false}, "3": {"id": "1f3opb6", "locked": true, "subreddit": "aliens", "stickied": true, "category": "Aliens", "author": "BrushPass", "link_flair_text": "Image 📷", "time": 1725072721.7598195, "created_utc": 1724890060.0, "url": "https://www.reddit.com/r/aliens/comments/1f3opb6/ross_coulthart_ama/", "title": "Ross Coulthart AMA", "permalink": "/r/aliens/comments/1f3opb6/ross_coulthart_ama/", "selftext": "https://preview.redd.it/owr3ir8yuhld1.jpg?width=2224&format=pjpg&auto=webp&s=3706732584cb86d2fba8e7fabb1409194ad3113d\nHi, I'm Ross Coulthart - Special Correspondent with News Nation/Investigative journalist who recently interviewed Lue ELizondo for News Nation & Co-Host of Need to Know with Bryce Zabel.  ASK ME ANYTHING", "media": null, "score": 2673, "upvote_ratio": 0.89, "comment_count": 558, "over_18": false}, "4": {"id": "1f2mbsd", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": null, "time": 1725072722.5553632, "created_utc": 1724778368.0, "url": "https://v.redd.it/lammqfh4n8ld1", "title": "Former Pentagon insider, veteran and investigator Lue Elizondo on NBC News", "permalink": "/r/UAP/comments/1f2mbsd/former_pentagon_insider_veteran_and_investigator/", "selftext": "", "media": null, "score": 192, "upvote_ratio": 0.93, "comment_count": 55, "over_18": false}, "5": {"id": "1f3mek7", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "External-Noise-4832", "link_flair_text": null, "time": 1725072723.917199, "created_utc": 1724883933.0, "url": "https://i.redd.it/nw6byloidhld1.jpeg", "title": "Pure evil.", "permalink": "/r/conspiracy/comments/1f3mek7/pure_evil/", "selftext": "", "media": null, "score": 6458, "upvote_ratio": 0.9, "comment_count": 390, "over_18": false}, "6": {"id": "1f500rr", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "ZLast1", "link_flair_text": null, "time": 1725072724.2175362, "created_utc": 1725036523.0, "url": "https://i.redd.it/6qmpjk3ivp0d1.gif", "title": "Israel First", "permalink": "/r/conspiracyfact/comments/1f500rr/israel_first/", "selftext": "", "media": null, "score": 9, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "7": {"id": "1f2sh6f", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "rtlg", "link_flair_text": "merchandise", "time": 1725072725.461609, "created_utc": 1724793375.0, "url": "https://i.redd.it/w3ayylj8w9ld1.jpeg", "title": "Gift from my girl...she gets me", "permalink": "/r/bigfoot/comments/1f2sh6f/gift_from_my_girlshe_gets_me/", "selftext": "", "media": null, "score": 500, "upvote_ratio": 0.98, "comment_count": 15, "over_18": false}, "8": {"id": "1f046ym", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Agreeable-Ad7232", "link_flair_text": "Evidence", "time": 1725072725.9535987, "created_utc": 1724502809.0, "url": "https://i.redd.it/wcvs49g8wlkd1.jpeg", "title": "Loch Ness Monster fordyce Sighting 1910 One of the Most Interesting ", "permalink": "/r/Cryptozoology/comments/1f046ym/loch_ness_monster_fordyce_sighting_1910_one_of/", "selftext": "This has always been one of the sightings that interests me the most and it was done before the monster boom and it is one of the most interesting and credible the creature very similar to a camel Also having a long neck And it has a very sauropod-like appearance definitely one of my favorite sightings ", "media": null, "score": 713, "upvote_ratio": 0.98, "comment_count": 57, "over_18": false}, "9": {"id": "1f3090n", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "KOPHER_", "link_flair_text": "U.F.O. Humanoid", "time": 1725072726.2172823, "created_utc": 1724815227.0, "url": "https://www.reddit.com/gallery/1f3090n", "title": "Aliens with terrifying smile seen near RAF Ludham,Norfolk,England in May 1943.", "permalink": "/r/Humanoidencounters/comments/1f3090n/aliens_with_terrifying_smile_seen_near_raf/", "selftext": "John Warren was an armourer serving in the RAF during World War II. At the time of his encounter, he was stationed in Norfolk at RAF Ludham, a radar facility close to the large airfield at RAF Coltishall. What follows is from the archives of UFOData's features editor, Philip Mantle. Philip interviewed Mr Warren back in 1987 and he recounts a fascinating sighting during a late-night walk through the East Anglian countryside.\nOne night in May of 1943 (John could not give an exact date), Mr Warren had been to North Walsham, a town roughly nine miles from RAF Ludham, and had got a lift in a truck to Catfield, a village about three and a half miles from his camp. Being a little worse for wear, John, who was about twenty-two at the time, decided to sleep under a railway signal box. Some time later, he awoke and made the decision to walk back to the base.\nA little over a mile from the camp, he noticed a light in one of the fields that bordered the narrow, country lane.  As he drew closer, he saw a figure standing in the field. Not expecting to encounter anybody that late at night, John became a little nervous and quickened his pace slightly. As he drew closer, he noticed that the figure was wearing what appeared to be a greyish-white ‘boiler suit’. Attached to the front of the suit was a box that cast a greenish glow onto the face of the figure. The face was visible beneath the helmet that John likened to an old-fashioned divers’ helmet.\nThe figure stared at John as he approached, with a smile on its face that terrified the young airman. He said the face was round, without any noticeable cheekbones or chin.\nAs he passed the figure, which was standing behind the bushes that bordered the field and about thirty to a hundred yards away from John, he saw a large, domed object in the field behind this grinning entity. A second figure was moving around, doing something with the ground, as though taking samples.\nThe domed object reminded John of a large bell tent. It was stony-grey in colour and gave off no light.\nJohn passed their location and kept on going, walking quickly, terrified, but not running for his life. He glanced back and saw that both figures were now doing something in the ground around the ‘bell tent’. Then he looked forward again and kept going until he reached RAF Ludham.\nHe wondered if they were German agents that might have landed on the nearby coast. However, he could not imagine what they were doing in those odd suits with the green, glowing light. Also, a structure the size of the dome he saw would have been awkward to carry over the countryside from the coastline, some seven or eight miles distant.\nJohn got back to his camp and the safety of the Nissen huts in which the men were billeted. He settled into bed, wondering about what he had just witnessed, when he was startled by something coming through the window!\nFearful that the entities from the field had come for him, John was relieved to discover that it was a friend of his returning from a late-night romantic liaison. ‘Taffy’, though, looked scared to death when John saw him. He asked his friend if anything was wrong, but Taffy declined to elaborate. He just said that he had an early start and was going to bed.\nTaffy was a cook, so the next morning after breakfast, John asked him what had frightened him so much the previous night. Taffy explained that he had seen something outside of Catfield and had run all the way back to the base. John didn’t tell him that he had also seen something. Taffy didn’t go into any details beyond ‘seeing something’.\nBefore the night he saw the figures and their dome-shaped ‘craft’, John had used that road many times, going to a local swimming spot, but afterwards, he never went along that road alone and never went swimming there again. He confined his drinking to either the NAAFI (Navy, Army and Air Force Institutes) or went to the pub in Ludham, which took him along a different road.\nBeing 1943, John had never heard of flying saucers and didn’t even equate what he saw as having anything other than an earthly explanation, but as the years have passed, John now believes that what he saw was not of this world. This was reinforced when he saw a strange object that was shaped like an ice cream cornet over his home town of Batley, West Yorkshire, in about 1947. He and a friend saw this object in the sky before it simply disappeared in the blink of an eye.\nIf John Warren did see an extra-terrestrial craft in that East Anglian field in 1943, what were its occupants doing poking holes in the ground? Why did they simply watch him with a fixed grin as he hurried past? If they were German agents, surely they would have stopped this lone airman from divulging their location.\nSources: https://www.spookyisles.com/john-warren-1943-ufo-norfolk/", "media": null, "score": 141, "upvote_ratio": 0.97, "comment_count": 15, "over_18": false}, "10": {"id": "1f3nqq0", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "I_voted_4_Kodos", "link_flair_text": null, "time": 1725072726.638989, "created_utc": 1724887381.0, "url": "https://i.redd.it/j6jm631rnhld1.jpeg", "title": "I made a Mothman out of stained glass", "permalink": "/r/cryptids/comments/1f3nqq0/i_made_a_mothman_out_of_stained_glass/", "selftext": "", "media": null, "score": 1061, "upvote_ratio": 1.0, "comment_count": 59, "over_18": false}, "11": {"id": "1f31wiu", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "theonlyfeditrust", "link_flair_text": null, "time": 1725072726.8558779, "created_utc": 1724820918.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1f31wiu/according_to_my_mom_i_was_a_creepy_child_and_the/", "title": "According to my mom I was a creepy child, and the weird things didnt stop.", "permalink": "/r/Thetruthishere/comments/1f31wiu/according_to_my_mom_i_was_a_creepy_child_and_the/", "selftext": "I was too young to remember some of this but according to my mom, when I was around 3 or 4 she saw/heard things centered around me. In our first house: \n\n\nShe slept downstairs, I had a bedroom upstairs. Frequently she'd hear noises, glass breaking, doors opening, and when she'd check on me, nothing would be out of place. \n\n\nShe said I was always talking to someone, playing board games, and occasionally she'd find me just sitting and staring into closets or the wall. \n\n\nOne night she checked on me and she swore she saw red eyes in the window. A window that didn't face any streets.\n\n\nShe slept upstairs after that, and things calmed down. Then I started to hear the voices downstairs. My mom would wake up to find me standing at the top of the stairs in the middle of the night staring into the dark. I swore that someone was calling me, telling me to come downstairs. I remember there was a dark shadow sometimes in the corner of the living room where no shadow could have been made. \nWhen I got a few years older I remember having 2 reoccurring dreams, one where I killed my family in our car and the other was something digging it's way up from the ground outside my window. \nWe moved shortly after, but it didn't stop. In the next house I was visited constantly by a woman wearing white that would stand outside my bedroom door at night. Even if I didn't look at her I could feel her there. I never told my mom.\nAgain, we moved. (Unrelated) This place was the worst of them all. Even the neighbors said the property was spooky, stating you'd occasionally catch a glimpse of a woman in an old farming dress and a man with no features out of the corner of your eye. I knew he was there because you just suddenly felt absolute terror. Although my neighbors saw them, they said they never felt scared by them. But he took a liking to me. I always felt him when I'd walk past the old barn to catch the bus in the morning. One day my dog ran into the basement of the barn and when I went to get her I heard footsteps quickly making their way to the stairs, then heading down.. they got pretty close to the bottom, but there was no one there. I ran out of there so fast. He was in the house once, I could feel him standing in the other side of my door one day when I came home from school.\nEverything stopped the day I got my first period. No joke, it was like a switch had been turned off and a door was suddenly put up in my brain. Honestly, even though most of the experiences were terrifying,  I felt so alone. \nThings never happened again until I visited a graveyard almost 13 years later. That's when things got really weird. \nMy friend wanted to be an amateur ghost hunter, and I had just been through a breakup. We went to a civil war cemetery in the middle of the night, his friend lived on the property about 50 feet from it. We brought equipment and the like, but nothing seemed to be happening. I had to go to the bathroom so I went back to the house, used the restroom and headed back. I could see my friends flashlights in the distance at the edges of the property, near some woods. As I was at the first row of graves, I got horribly nauseous. It was so bad I stumbled to the ground holding my stomach trying to scream. The wind had been blowing pretty good all night but it picked up with such force, and at that moment it was like someone grabbed my head and held me down, forcing me to crawl towards one of the graves in front of me. I tried everything to stand up, but I couldn't. I used the stone to pull myself up, and I was kneeling at a grave. I couldn't move. All I could do was read the words on the stone. At that moment someone whispered in my ear, \"louder.\"\nIt took everything I had but I managed to scream his name. And then it all stopped. The wind, the nauseousness, the pressure. Totally gone. I looked around, my friends were still messing around at the edge of the woods.\nI managed to get back to them and I told them what happened, they said they saw me but I was just kneeling at a grave. The didn't hear anything. We tried to take some readings/pictures/recordings at the stone but we got nothing. I only remember that the name on the grave was Jesse, and I'm not friends with that guy anymore so I can't ask him the full name. I do remember we were able to find him and he was a soldier, nothing unusual about his death. \nOh and when I was kneeling at the grave of an infant and it's Mom, I got nauseous again, and I felt fingers push my knees back, as if pushing me off the grave. I felt like it was the mom, protecting her child.\nThat was 17 years ago, other than a couple of nauseous experiences at a funeral and someone's home, nothing weird has happened since. I've even gone to cemeteries and supposed haunted sites.\nFun fact: when my mom was a teenager her best friend was killed in a car accident. Before she received that phone call, she felt like someone was in her house. When the phone rang, it disappeared. She said her friend would have never left without saying goodbye. I'm named after her.", "media": null, "score": 105, "upvote_ratio": 0.96, "comment_count": 12, "over_18": false}, "12": {"id": "1f34vlt", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Ady85--", "link_flair_text": null, "time": 1725072727.1637676, "created_utc": 1724833173.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1f34vlt/i_wonder_if_im_being_paranoid_but_i_have_a_bad/", "title": "I wonder if I'm being paranoid, but I have a bad feeling about someone living near me.", "permalink": "/r/LetsNotMeet/comments/1f34vlt/i_wonder_if_im_being_paranoid_but_i_have_a_bad/", "selftext": "Hello everyone,\nHere I am, explaining what is happening to me and I will try to be as precise as possible. I have lived in the same neighborhood for many years. This is also the case for many people. Which means that even if everyone does not speak to each other, we often know people, at least by sight.\nA year ago, I passed a guy in the street, near my house, whom I had never seen before. And I noticed him because he had a rather unusual physique. About 50 years old, tall, thin, emaciated face, dressed in a suit and tie. From the look of his face, he does not seem to be in good health.\nIn short, nothing special so far. But what I have noticed for the past year is that there are times (of varying length) when he is everywhere I am.\nTo give an example, last Wednesday, I went to the pharmacy: he was behind me and also went to the pharmacy. Thursday I go to a neighboring town to do some shopping, I meet him in the street. Friday I leave my house to go to the gym, he is in front of my house and walks part of the way with me before taking another street.\nThis kind of thing can last several days, every day, then it stops, before I see him constantly for several days.\nHe is CONSTANTLY in a suit and tie. As if he was going to work, but I see him at any time : on weekdays, weekends, in the morning, in the afternoon, in the evening. \nI don't know where he lives exactly, but I know that he is not in my immediate vicinity. I never see him talking to anyone on the street.\nSo yes I know, coincidence, most certainly. But I admit that in the end, I ask myself questions. It gives me a feeling of \"followed\", even if I may be exaggerating.\nHas this kind of thing or strange feeling towards someone ever happened to you ?", "media": null, "score": 314, "upvote_ratio": 0.98, "comment_count": 44, "over_18": true}, "13": {"id": "1f2jbmr", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "AtmanDharma", "link_flair_text": null, "time": 1725072727.3587577, "created_utc": 1724771007.0, "url": "https://i.redd.it/g83czs0q18ld1.png", "title": "There are currently hundreds of deceased people in the US, including baseball legend Ted Williams, whose bodies are being frozen in liquid nitrogen in the hope that future technology will be able to revive them", "permalink": "/r/truecreepy/comments/1f2jbmr/there_are_currently_hundreds_of_deceased_people/", "selftext": "", "media": null, "score": 134, "upvote_ratio": 0.97, "comment_count": 28, "over_18": false}, "14": {"id": "1f1ntkh", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Voodevil", "link_flair_text": null, "time": 1725072727.558236, "created_utc": 1724677788.0, "url": "https://www.reddit.com/r/threekings/comments/1f1ntkh/give_me_the_most_dangerous_rituals_to_perform/", "title": "Give me the most dangerous rituals to perform.", "permalink": "/r/threekings/comments/1f1ntkh/give_me_the_most_dangerous_rituals_to_perform/", "selftext": "Call me insane or whatever, but I love paranormal and supernatural stuff.\nAnd I've conquered my fear (I still feel it, but it can't stop me involuntary as much anymore).\nNow, to correct some assumption's.\n1. I don't want to injure or hurt OTHERS. Myself is a different case, I can allow that within reason.\n2. I don't mean life threatening.\nWith that outta the way.\nWhat do I mean by dangerous then?\nI mean anything that attaches to me or an object. Preferably something that is also hostile (I'll sooner die by peanuts than a ghost anyway. I personally never heard of any deaths by ghost directly)\nAs well as anything that can/has the possibility to damage my psyche, mental state or physical body.\nI know the consequences of what could happen, and I am absolutely at peace with that.\nMy goal?\nTo have as much paranormal/supernatural stuff happen to/around me. Good or bad I don't care.\nSpirits, portals, demons, angels, ghosts, you name it. I just want to sate my curiosity.\nMy aim?\nTo document, prove and disprove what works and what doesn't. As well as satisfy a need to know.\nWill I share my findings?\nSure, with those that intend to help this happen, what they do with it afterwards is none of my concern. (Of course you can opt out of receiving it, and I will respect it)\nI will also post updates on progress and such.\nWhy?\nGot nothing else to do, and I want to use my time on something.\nAlso I highly doubt it would realistically work as 90% of it is either hallucinations or superstition.\nNow, I want to find out fact from fiction.\nHope y'all will help me figure this out.\nIf you wish to share, but don't want random people to be affected by it, you can dm me.\nI'll start trying your suggestions from September, onwards.\nEdit:\nLetter of intent ritual: done years ago to no reaction, but will do another test to make sure.", "media": null, "score": 24, "upvote_ratio": 0.93, "comment_count": 17, "over_18": false}, "15": {"id": "1f0k8w4", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Amused_Observer_", "link_flair_text": "Captured Apparition ", "time": 1725072728.425385, "created_utc": 1724546877.0, "url": "https://i.redd.it/9kvxubt5jpkd1.jpeg", "title": "Ghost in mirror | Old Sorrel-Weed House Museum Tour ", "permalink": "/r/Ghosts/comments/1f0k8w4/ghost_in_mirror_old_sorrelweed_house_museum_tour/", "selftext": "My sister isn’t on Reddit so I’m posting this for her. She did The Old Sorrel-Weed House Museum tour in Savannah, GA and took a photo in the mirror in what she said was the parlor room in the house. In the mirror, the lady on the left was part of the tour, but she has no idea who / what is on the right..", "media": null, "score": 613, "upvote_ratio": 0.87, "comment_count": 167, "over_18": false}, "16": {"id": "1f1gqov", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "mikeunt420", "link_flair_text": "Glitch Vid", "time": 1725072728.6965349, "created_utc": 1724650666.0, "url": "https://v.redd.it/3td1ewpv3ykd1", "title": "How do you explain this", "permalink": "/r/GlitchInTheMatrix/comments/1f1gqov/how_do_you_explain_this/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/3td1ewpv3ykd1/DASH_480.mp4?source=fallback", "has_audio": false, "height": 854, "width": 480, "scrubber_media_url": "https://v.redd.it/3td1ewpv3ykd1/DASH_96.mp4", "dash_url": "https://v.redd.it/3td1ewpv3ykd1/DASHPlaylist.mpd?a=1727664728%2CZjFjNmRmYzU2MmRmZWIwMjhmYjQ4N2U5MzNkYmM3ZWQ1YTE0NjA3YjI4Y2Q2OTRhMDc1NzkwOTA4ODdiNmE4Yg%3D%3D&v=1&f=sd", "duration": 7, "hls_url": "https://v.redd.it/3td1ewpv3ykd1/HLSPlaylist.m3u8?a=1727664728%2CMjdjYjUyM2ExYjk4MTZhMGVhZjU2OWZhOTNjYTRjMDE0MzRjYjVlODgyMmUzZTU0NjU3YmQxZGE3NTc4ZDE5MA%3D%3D&v=1&f=sd", "is_gif": true, "transcoding_status": "completed"}}, "score": 459, "upvote_ratio": 0.8, "comment_count": 230, "over_18": false}, "17": {"id": "1f1qqxt", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Downtown-Narwhal7591", "link_flair_text": "Black Vault", "time": 1725072730.4819782, "created_utc": 1724685448.0, "url": "https://www.reddit.com/gallery/1f1qqxt", "title": "I was able to zoom in and HDR EFFECT the now famous Kumbergaz, Turkey video still shot. ", "permalink": "/r/ufo/comments/1f1qqxt/i_was_able_to_zoom_in_and_hdr_effect_the_now/", "selftext": "I took a still of the video and clarified it as much as I could with smart HDR. It's the clearest that I could get it. Beside it is the before shot.  Hard to refute that evidence.", "media": null, "score": 402, "upvote_ratio": 0.81, "comment_count": 266, "over_18": false}, "18": {"id": "1f3d2n3", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "SysBadmin", "link_flair_text": "Video", "time": 1725072731.825718, "created_utc": 1724858811.0, "url": "https://v.redd.it/ovfztnndafld1", "title": "What the \"balls of light\" actually look like.", "permalink": "/r/UFOs/comments/1f3d2n3/what_the_balls_of_light_actually_look_like/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/ovfztnndafld1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/ovfztnndafld1/DASH_96.mp4", "dash_url": "https://v.redd.it/ovfztnndafld1/DASHPlaylist.mpd?a=1727664730%2CMjdhMWNmY2Q5NWQxZTU3NDQ5MmY5N2ZjZjJkMzkzMDgyZGM5ZWQwYjYzNDEwNmIyMDMyMDhiODZkODgzMGNhZg%3D%3D&v=1&f=sd", "duration": 171, "hls_url": "https://v.redd.it/ovfztnndafld1/HLSPlaylist.m3u8?a=1727664730%2CYzUyZWEzOTc2ZDI1YzZkMWY0YWVmNzQ2OTQ5ZGFlZmFkZDA4N2U4ZDI2Yjk4ZjY5MmZhZjRiNDUxMzEzZDkyOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4359, "upvote_ratio": 0.91, "comment_count": 666, "over_18": false}, "19": {"id": "1f46m7p", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Sky5759", "link_flair_text": "Evidence :upvote:", "time": 1725072733.6245878, "created_utc": 1724948550.0, "url": "https://v.redd.it/jf0esl1mpmld1", "title": "On October 4th 2001, a 22yr old Australian woman named Amy Rylance was abducted by a beam of light in full view of her friend Petra Heller. Three hours after her disappearance, she turned up 500 miles away across the country. If walked, it would take 200hrs, if driven, it would take 10hrs. ", "permalink": "/r/aliens/comments/1f46m7p/on_october_4th_2001_a_22yr_old_australian_woman/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/jf0esl1mpmld1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 480, "scrubber_media_url": "https://v.redd.it/jf0esl1mpmld1/DASH_96.mp4", "dash_url": "https://v.redd.it/jf0esl1mpmld1/DASHPlaylist.mpd?a=1727664732%2CMzZlOGI0ZjM3NzFlNzU5NWViNGNlM2VjODY0ZWUwMzY3NWM5ZGZmYzNhYTU1NTdiMThjMjY5NWU0YjhhNmRjYg%3D%3D&v=1&f=sd", "duration": 184, "hls_url": "https://v.redd.it/jf0esl1mpmld1/HLSPlaylist.m3u8?a=1727664732%2CNzcyOTU4MmIyYjYwMmY0Y2MzNDcyMjA5YWFiMmQ2ODQ4MTBiMDFiZTYyNzAwNDA0ZGJlZTQ3N2JmZGJkODk4Yg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1377, "upvote_ratio": 0.97, "comment_count": 184, "over_18": false}, "20": {"id": "1f2b8vj", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "AURORASPECTRE91", "link_flair_text": null, "time": 1725072734.4060938, "created_utc": 1724744052.0, "url": "https://www.reddit.com/r/UAP/comments/1f2b8vj/tim_burchett_confirms_more_hearings_are_coming/", "title": "Tim burchett confirms more hearings are coming. Determined to point fingers and names.", "permalink": "/r/UAP/comments/1f2b8vj/tim_burchett_confirms_more_hearings_are_coming/", "selftext": "https://youtu.be/RZjSC9Qy_tM?si=PjpjdOoKcHyoBv22", "media": null, "score": 86, "upvote_ratio": 0.92, "comment_count": 11, "over_18": false}, "21": {"id": "1f2ywnb", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "TheRightToKnow", "link_flair_text": null, "time": 1725072736.0912917, "created_utc": 1724811019.0, "url": "https://i.redd.it/y8su6soocbld1.jpeg", "title": "His Name Was Gary Webb. RIP. ", "permalink": "/r/conspiracy/comments/1f2ywnb/his_name_was_gary_webb_rip/", "selftext": "", "media": null, "score": 4159, "upvote_ratio": 0.97, "comment_count": 127, "over_18": false}, "22": {"id": "1f03erg", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1725072736.375115, "created_utc": 1724500180.0, "url": "/r/RedditIsAwfulBiased/comments/1f03avb/rtropicalweather_removes_any_post_about_saharan/", "title": "r/TropicalWeather removes any post about Saharan dust, which is a major component of tropical weather in the Atlantic Ocean. ", "permalink": "/r/conspiracyfact/comments/1f03erg/rtropicalweather_removes_any_post_about_saharan/", "selftext": "", "media": null, "score": 4, "upvote_ratio": 0.75, "comment_count": 0, "over_18": false}, "23": {"id": "1f15ney", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "adamjames777", "link_flair_text": "crosspost", "time": 1725072737.2282987, "created_utc": 1724616737.0, "url": "https://v.redd.it/mqkb3nqz4pkd1", "title": "What is that sound coming from the forest? 😳", "permalink": "/r/bigfoot/comments/1f15ney/what_is_that_sound_coming_from_the_forest/", "selftext": "", "media": null, "score": 477, "upvote_ratio": 0.95, "comment_count": 161, "over_18": false}, "24": {"id": "1f1t6n9", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "jesusknowsbest69", "link_flair_text": "Art", "time": 1725072737.6882153, "created_utc": 1724691418.0, "url": "https://i.redd.it/1atl7ul2h1ld1.jpeg", "title": "1", "permalink": "/r/Cryptozoology/comments/1f1t6n9/1/", "selftext": "", "media": null, "score": 471, "upvote_ratio": 0.99, "comment_count": 12, "over_18": false}, "25": {"id": "1f55144", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Vivid_Plastic_741", "link_flair_text": "U.F.O. Humanoid", "time": 1725072738.2258494, "created_utc": 1725049092.0, "url": "https://www.reddit.com/gallery/1f55144", "title": "Weird Alien Encounter in Veneto, Italy, 1998.", "permalink": "/r/Humanoidencounters/comments/1f55144/weird_alien_encounter_in_veneto_italy_1998/", "selftext": "Location: Veneto, Italy.\nDate: December 19th, 1998.\nGiuseppe, a local truck driver, was awakened by a roaring noise. Looking out he saw a bright object with several windows and a brilliant glow underneath, which apparently was very close to the ground. The object was over 30 feet in length. He then saw two beings; three-feet tall\nwalking near the object. They were dressed in gray coveralls and moved with a mechanical motion. The witness was less than 100 feet from the object and after 30 minutes the beings went into the object, which ascended. A circular mark was found on the ground with holes in an equilateral triangle, 13.5 feet on each side. A glassy material was found at the landing site.\nSource: UFO e Alieni in Italia (Moreno Tambellini).\nOther Sources: Mauricio Vega, Antonio Chiumiento.", "media": null, "score": 93, "upvote_ratio": 0.98, "comment_count": 8, "over_18": false}, "26": {"id": "1f3vjo2", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "midnight_staticbox", "link_flair_text": null, "time": 1725072738.6541286, "created_utc": 1724912415.0, "url": "https://i.redd.it/pk4b36j7qjld1.png", "title": "Anybody recognize this?", "permalink": "/r/cryptids/comments/1f3vjo2/anybody_recognize_this/", "selftext": "Anybody know what this is supposed to be? Saw it on a random video and the guy said it was a skin walker which seemed dumb but what do I know.", "media": null, "score": 910, "upvote_ratio": 0.93, "comment_count": 560, "over_18": false}, "27": {"id": "1f1mwp0", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "National-Proposal-58", "link_flair_text": null, "time": 1725072738.8546596, "created_utc": 1724675148.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1f1mwp0/first_experience_with_st_anthony_lost_object/", "title": "First experience with St. Anthony! Lost object miraculously appears.", "permalink": "/r/Thetruthishere/comments/1f1mwp0/first_experience_with_st_anthony_lost_object/", "selftext": "I lost my case of Airpods. They were in my pocket and vanished into thin air as I was laying down on the couch in the living room watching Youtube videos. I realized I needed to charge them, and noticed they weren’t on my person. They weren’t on the table. They weren’t on the floor. I tore the whole living room apart looking for them. I even retraced my steps from my car, and they were not in there. The “Find My” app claimed they were right next to me somewhere and the app said they were connected 5 minutes ago but I could NOT for the life of me find them. \n“Tony Tony look around, something is lost and can’t be found”\nI found this prayer after searching on the internet if anybody else experienced something vanishing into thin air. So I prayed it. I said it out loud.\nLiterally 10 seconds later the kitchen light near the front door turns on. I am not kidding. I’m not home alone but nobody went in the kitchen and nobody would turn that light on for no reason. I took it as a sign and looked in the kitchen. They weren’t in there but something was telling me to look outside in my car again. I looked in the little cubby on the bottom of the door panel and I couldnt believe it. There they were. I swear I checked that same cubby before when I was outside and nothing was in there. Now they were. I said out loud thank you to St. Anthony. I’m writing this in total shock. I’ve never had a religious experience happen to me like this before. Has this happened to you?", "media": null, "score": 49, "upvote_ratio": 0.82, "comment_count": 10, "over_18": false}, "28": {"id": "1f0gqub", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "lowtaperfade_", "link_flair_text": null, "time": 1725072739.0669286, "created_utc": 1724536676.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1f0gqub/i_think_i_was_almost_kidnapped/", "title": "I Think I Was Almost Kidnapped", "permalink": "/r/LetsNotMeet/comments/1f0gqub/i_think_i_was_almost_kidnapped/", "selftext": "So, this is something I've kept completely to myself - except for a confused call to my best friend the morning after to try and figure out if what I thought happened, actually happened. Truthfully, the event that incited this incident was my fault and also so stupid, so I think I've been too embarrassed or mad at myself to share the story.\nI had only been living in New Orleans for about 2ish weeks the night this occurred, and while I'd never been to New Orleans once in my life prior to moving there (a decision resulting from my desperation to get a job out of college), I am from a similarly large metro area in the American South. So, I'm familiar with the dynamic of a city like this; one minute you'll see kids playing catch in the streets and young couples walking arm-in-arm down tropically adorned sidewalks, and the next dilapidated houses (still not made whole since Katrina and further degraded from Ida), gang violence, young boys posted up on street corners and unimaginable poverty tied to rampant drug abuse. In the end, it's just all about knowing where to go, and which areas to avoid entirely.\nAnyway, I was driving home from running some obscure errand at night around 9:30pm that caused me to drive through St. Claude - for y'all that don't know, this is certainly one of those neighborhoods that should be avoided, if possible. As I came upon a stop sign right next to a small community center/food bank place, I suddenly slammed on the breaks due to driver's instinct before really even understanding why I did it. Standing there just feet away from my front bumper was a teeny tiny cat, it's wide eyes staring back at me in terror at it became briefly blinded by my headlights. That damn cat.\nThis is where my stupidity comes into play. I didn't really know where I was and how dangerous of an area it was, and without even thinking for a single damn moment, I stepped outside of the car to assess the situation, maybe see if I could help the little guy. I didn't even remove my keys from the ignition as I figured i'd only be there for a tiny bit, didn't even grab my phone from the charger. I figured I'd either be able to beckon over the little cat and help it or watch it dart away before slipping back into my car and continuing on home. What I didn't realize when I knelt down on the pavement was that my clumsy ass was too close to the barely open car door, and when I stood up, of course, I bumped it and it immediately swung shut.\nNo big deal, I thought, convincing myself that that door would be unlocked, only to feel my whole heart sink like a stone into my stomach when the door didn't budge. Well, f*ck.\nI didn't panic immediately. After trying all four doors and cursing myself for a solid minute for being such an idiot, I spotted a man sitting on the steps of the community center eating, and he spotted me. Noticing my situation and to my dismay, he slowly stood and came to the back of my car with his bag of Raising Cane's chicken, plopped it down on the hood, and proceeded to enjoy his dinner on the back of my Subaru. I'd already been there for a good 10 minutes by this point, so honestly the company of another person was relieving - I didn't look as helpless to passerbys with him there. For context, I'm 5' and was wearing a tiny tank top to fend off the brutal New Orleans summer heat. After I explained my situation he explained he could try to jimmy-rig the door open, and desperate to get back in, I agreed. It was useless, unfortunately, and I could tell he was just fiddling around.\nI trotted over to a small church across the intersection where I spotted a few people closing up for the night. Sanctuary, I thought. Nice churchgoers have to help a woman lost and alone, right? Wrong. The man locking up looked straight through me, back at the man now clearly trying to open a locked car, shook his head and shot me a glance that said \"Do you think I'm stupid?\" and stepped right into his unlocked vehicle. It was at this point that I felt the tears welling up but quickly told myself to suck it up and walked dejectedly back over to my car. By the grace of god, the random stranger let me use his phone to call a locksmith (tastefully called \"Pop a Lock\") who told me he'd be there anywhere between 45 minutes and 4 hours. Great.\nAfter about 25 minutes of chit-chatting, the man informed me that his shift was about to start, and just as quickly as he appeared, he was gone. This is when the gravity of my situation really began to sink in and I became acutely aware of my surroundings. Acutely aware of the men who had been circling the block on their bicycles during our conversation. I don't know about y'all, but I don't know many grown-ass men who ride around leisurely on bikes after 10 pm just for the fun of it, especially not in the same big circles in the same neighborhood. I heard the distant squeak of the wheels, and before I could duck for cover, they lapped the block again, now aware that I was, in fact, utterly alone. They continued down the block and I realized quickly that I needed to find somewhere to be by the time they returned.\nI swiftly walked towards the community center where I'd planned on sitting on the stairs, but quickly realized it was entirely too illuminated and i'd be making myself a beacon amid the darkness of the neighborhood. Plus, as I rounded the corner I saw a tall man standing in total darkness along the side of the building, just staring straight forward facing the steps not 10 feet away from them. Getting desperate I jogged over to the church and, hearing the wheels nearing again, I squatted down behind the big sign in front of the building. As I sat there in the dirt I couldn't help it anymore and cried just a little bit. The combination of fear and frustration really put it over the edge.\nAfter a while, I didn't hear any more movement, and because my butt hurt from sitting on the ground and the bugs were starting to come out beneath me, I decided to move spots like some stupid game of hide-and-seek. I had spotted a fenced-off area that appeared to be a restaurant earlier, and after finding the door to be unlocked I darted inside and latched it behind me, sighing with relief.\nAt that point, I situated myself at a table where I could peer through the fence at my car to see if the locksmith pulled up and waited. After what felt like days but was probably more like 1-2 hours the horrifying realization dawned on me that I had only made one singular call to the Pop-a-Lock people and gave a vague description of the intersection where I was at. What if they couldn't find me? What if they had already driven past long ago and, not seeing me there, were long gone by now? I didn't know if I should keep waiting or venture back out in hopes of catching them if they were circling the block looking for my car. After about 30 minutes I decided I would just have to go out there. The men were gone and although it was a bad neighborhood, it'd just get progressively worse come the early hours of the morning and I didn't want to find out.\nIt is so painfully obvious in retrospect, but of course, the moment I left the safety of my little restaurant hideaway, those damn wheels began to round the corner - shit. I literally could not have looked more out of place and vulnerable. I felt so exposed, but there was no time to go back across the intersection to the fenced-off area, and to get to the church i'd have to run through the bike path of the two men. As I sprinted toward my car a black truck rolled by, and to my horror, stopped just moments after passing me, put it in reverse, and began to roll slowly back in my direction. I almost resigned myself to my seemingly inevitable capture, assault and god knows what as I watched it roll toward me. I pretended to walk away as if I were not utterly aimless, trying to give off the impression that I wasn’t locked out of my still running car without any and all resources. The men on the bikes were so close now.\nThen, as if in an episode of CSI, the f*cking Pop a Lock truck rounded the corner. I instantly began waving my arms to flag them down, and as the truck drove off, my savior parked his van. Apparently he had been looping around the area for 20 minutes trying to find me and was about to give up to go help another stranded woman. If I had stayed behind the fence he likely would have, and I would have been left without any means of communication to call anyone else for help.\nThe moment I got inside my beloved Subaru I began sobbing at the click of the locks behind me. God it was pure relief to be secured within a locked space.\nEven as I'm writing this now I feel dramatic, like I was freaking out over nothing. But, in my recollection, working through the details does help to validate my experience.\nSo, to those men on their dinky little bikes, let's never meet again.\nEdits: grammar", "media": null, "score": 166, "upvote_ratio": 0.93, "comment_count": 15, "over_18": true}, "29": {"id": "1f4afwy", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "sasbergers", "link_flair_text": null, "time": 1725072739.260162, "created_utc": 1724957873.0, "url": "https://i.redd.it/g4tuw4ddhnld1.jpeg", "title": "Aurora Rodríguez Carballeira attempted to create an ideal human being through her daughter, Hildegart. Hildegart read at 2, spoke 4 languages at 8, joined law school at 13, becoming professor there at 18. Her mother killed her when she tried to run away.", "permalink": "/r/truecreepy/comments/1f4afwy/aurora_rodríguez_carballeira_attempted_to_create/", "selftext": "", "media": null, "score": 130, "upvote_ratio": 0.99, "comment_count": 5, "over_18": false}, "30": {"id": "1f3b979", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Inevitable_Pace_773", "link_flair_text": null, "time": 1725072739.478196, "created_utc": 1724854377.0, "url": "https://www.reddit.com/r/threekings/comments/1f3b979/my_friend_saw_an_entity_a_couple_days_ago/", "title": "My friend saw an entity a couple days ago", "permalink": "/r/threekings/comments/1f3b979/my_friend_saw_an_entity_a_couple_days_ago/", "selftext": "A couple days ago, a friend of mine saw a black figure while he was lying on his bed. He truly considers that is his grandmother, cuz his father saw it a year ago at the same room. After this, there are weird noises at his home, and he isn't able to sleep properly. Not only has happened this but also he's been having nightmares for a whole year.\nWe went to an esoteric shop where the owner gave us a kind of liquid which is suposed to prevent poltergeists and paranormal activities. However, I thought that asking for some kind of advice would be ideal in order to solve this situation. I am deeply concerned about the situation of my friend and we really need some advice.\nI'll be grateful for any kind of advice, I will answer every doubt in order to make everything clear.\nI wanna make clear that my friend wasnt dreaming while he saw the entity.", "media": null, "score": 10, "upvote_ratio": 1.0, "comment_count": 8, "over_18": false}, "31": {"id": "1f4xn6q", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Theedarktemptress", "link_flair_text": "Paranormal Community [Discussion]", "time": 1725072740.2981648, "created_utc": 1725030578.0, "url": "https://i.redd.it/swdwlpakhtld1.jpeg", "title": "What's the scariest thing to ever happen to you at 3am?", "permalink": "/r/Ghosts/comments/1f4xn6q/whats_the_scariest_thing_to_ever_happen_to_you_at/", "selftext": "", "media": null, "score": 587, "upvote_ratio": 0.94, "comment_count": 592, "over_18": false}, "32": {"id": "1f1208n", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ShDXR", "link_flair_text": "Glitch Pic", "time": 1725072740.5663693, "created_utc": 1724607416.0, "url": "https://i.redd.it/jf4gids9jukd1.jpeg", "title": "Glitch in the Matrix", "permalink": "/r/GlitchInTheMatrix/comments/1f1208n/glitch_in_the_matrix/", "selftext": "", "media": null, "score": 111, "upvote_ratio": 0.92, "comment_count": 8, "over_18": false}, "33": {"id": "1f08u3l", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Stephen_P_Smith", "link_flair_text": null, "time": 1725072741.954978, "created_utc": 1724515584.0, "url": "https://www.dailymail.co.uk/sciencetech/article-13774287/I-witnessed-UFO-crash-aliens-flee-ship-piece-craft-prove-it.html", "title": "I witnessed a UFO crash and aliens flee the ship - and I have a piece of the craft to prove it", "permalink": "/r/ufo/comments/1f08u3l/i_witnessed_a_ufo_crash_and_aliens_flee_the_ship/", "selftext": "", "media": null, "score": 256, "upvote_ratio": 0.88, "comment_count": 84, "over_18": false}, "34": {"id": "1f44mu0", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "NHI", "time": 1725072743.4273617, "created_utc": 1724943676.0, "url": "https://i.redd.it/y2ukw8zpamld1.png", "title": "10 days ago a senior aide to 4 US presidents (JFK, LBJ, Nixon and Ford) just said he was briefed on \"otherworld technologies\" by the head of Skunkworks and one of the most important spy masters in CIA history, and was sworn to secrecy. There has been zero mainstream media coverage so far. ", "permalink": "/r/UFOs/comments/1f44mu0/10_days_ago_a_senior_aide_to_4_us_presidents_jfk/", "selftext": "", "media": null, "score": 2232, "upvote_ratio": 0.96, "comment_count": 211, "over_18": false}, "35": {"id": "1f2oz65", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "BankHot3840", "link_flair_text": "Evidence :upvote:", "time": 1725072745.2455812, "created_utc": 1724784749.0, "url": "https://v.redd.it/kyt306oi69ld1", "title": "Aquatic Aliens. East coast USA", "permalink": "/r/aliens/comments/1f2oz65/aquatic_aliens_east_coast_usa/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 450, "fallback_url": "https://v.redd.it/kyt306oi69ld1/DASH_270.mp4?source=fallback", "has_audio": true, "height": 480, "width": 270, "scrubber_media_url": "https://v.redd.it/kyt306oi69ld1/DASH_96.mp4", "dash_url": "https://v.redd.it/kyt306oi69ld1/DASHPlaylist.mpd?a=1727664743%2CYjZjM2VjNDA2NTdjODhkOWRkNDNmNDllNzAyOGIwOTM3MjI2NzE5NmQ5YjkwOWYwYTZjYTViNDYwYTMyZDc2NA%3D%3D&v=1&f=sd", "duration": 67, "hls_url": "https://v.redd.it/kyt306oi69ld1/HLSPlaylist.m3u8?a=1727664743%2CMzFmYmMzNDdkZDUxNjIxZWQzOTg0OGQ1NWY3NTQwMmYyYWE2OTI3ZWE0ZjliNTg5NjkxMDkyOWVkZjkxMDI0YQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1321, "upvote_ratio": 0.84, "comment_count": 519, "over_18": false}, "36": {"id": "1f12xmq", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Discussion", "time": 1725072745.9434521, "created_utc": 1724609747.0, "url": "https://x.com/Halsrethink/status/1827748092281589832?t=qw88u89wbyNMMpgyCNg-sQ&s=19", "title": "\"BEFORE JFK was sworn as POTUS, he was already aware of high level US Government UAP knowledge. I learned later LBJ &Nixon fully briefed.\" - Harald Malmgren 🛸", "permalink": "/r/UAP/comments/1f12xmq/before_jfk_was_sworn_as_potus_he_was_already/", "selftext": "", "media": null, "score": 75, "upvote_ratio": 0.9, "comment_count": 3, "over_18": false}, "37": {"id": "1f4sgk1", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "External-Noise-4832", "link_flair_text": null, "time": 1725072747.3759654, "created_utc": 1725015819.0, "url": "https://i.redd.it/75m86iko9sld1.jpeg", "title": "What the hell is going on!", "permalink": "/r/conspiracy/comments/1f4sgk1/what_the_hell_is_going_on/", "selftext": "Harrowing new footage has captured the moment an alleged Venezuelan gang seized control of an apartment complex in Aurora, Colorado. \nThe heavily-armed mob are seen storming through the residence brandishing guns in the video that emerged on Wednesday. A man in a hoodie lugs a high-powered rifle and pounds on a door in the building, while several others wield pistols. - Source\nThe Mayor of Aurora, Colorado just CONFIRMED that Venezuelan illegal migrant gangsters have taken over several apartment complexes and have pushed out property managers to EXTORT rents from the tenants directly. - Source", "media": null, "score": 2650, "upvote_ratio": 0.86, "comment_count": 983, "over_18": false}, "38": {"id": "1f2sjj1", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1725072747.6718705, "created_utc": 1724793548.0, "url": "https://www.youtube.com/watch?v=29VRA4YnI4M", "title": "Two amazing videos, filmed in Brazil and above the clouds, clear video footage of a UFO.", "permalink": "/r/conspiracyfact/comments/1f2sjj1/two_amazing_videos_filmed_in_brazil_and_above_the/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Two amazing videos, filmed in Brazil and above the clouds, clear video footage of a UFO.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/29VRA4YnI4M?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Two amazing videos, filmed in Brazil and above the clouds, clear video footage of a UFO.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/29VRA4YnI4M/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 3, "upvote_ratio": 0.8, "comment_count": 0, "over_18": false}, "39": {"id": "1f3taag", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Necessary_Rule6609", "link_flair_text": "PGF", "time": 1725072748.6496747, "created_utc": 1724903803.0, "url": "https://i.redd.it/aqhvz1jl0jld1.gif", "title": "It's a North West thing", "permalink": "/r/bigfoot/comments/1f3taag/its_a_north_west_thing/", "selftext": "Hi all!  First, let me start by saying that I've never seen one.  I've seen what some might call trace evidence, heard vocalizations I can't explain, even got pelted by rocks in a place I knew I was the only human for miles. ...but I've never actually seen one.  I recently got into a deep dive discussion with an older gentleman from Arkansas that states when he was in the Marine Corp in the late 70's, stationed in Southern California, that he saw what he believed to be a Bigfoot in roughly the Riverside area of Los Angeles County.  His description of the being, was \"Tall and thin, with light colored body hair; gray or blonde, a small rounded head and a big square jaw, stooped or slouching posture with long arms, hands stopping just above the knees.  The gentleman claims to have watched it walk (from his left to his right, or from north to south) across an alfalfa field for approximately 5 to 10 minutes, approximate distance traveled 1.7 miles.\nMy question is, Is the subject in the Patterson Gimlin film what one might refer to as an Atypical Sasquatch of that region, or do they differ not only in appearance, but in behavior just as greatly in one region as they appear to across the continent?  I personally have only talk to a handful of eyewitness's in southern California and there descriptions were very different.  I realize some might be nomadic, which could potentially explain the vast differences in appearance.", "media": null, "score": 242, "upvote_ratio": 0.9, "comment_count": 86, "over_18": false}, "40": {"id": "1f32itl", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Meme", "time": 1725072749.093083, "created_utc": 1724823292.0, "url": "https://i.redd.it/y1ovr077dcld1.jpeg", "title": "Man makes worst cryptozoology sign ever sacrificed to local cryptids ", "permalink": "/r/Cryptozoology/comments/1f32itl/man_makes_worst_cryptozoology_sign_ever/", "selftext": "", "media": null, "score": 402, "upvote_ratio": 0.96, "comment_count": 49, "over_18": false}, "41": {"id": "1f11k55", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "CarolCricket", "link_flair_text": "Just plain weird", "time": 1725072749.3415408, "created_utc": 1724606292.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1f11k55/1970s_game_show/", "title": "1970s Game Show ", "permalink": "/r/Humanoidencounters/comments/1f11k55/1970s_game_show/", "selftext": "Around 1978, I was home on a snow day in Kentucky. I was around 8 years old. We didn’t have cable tv. Just your typical 5 channels air antenna tv. I was watching a game show. I honestly don’t remember which one. I remember it was 2 contestants. One of the contestants was like a humanoid. I honestly don’t know what he was. He walked out and just completely froze. He didn’t talk, no response to questions, no blinking. It was a male  and he looked so much like a mannequin. The host kept yelling at him and he didn’t move, he didn’t blink, or respond at all! It was so strange, I’ll never forget it. I was frightened by it! I have brought it up over the years. My daughter suggested bringing it up on Reddit. Has anyone else witnessed a humanoid or weird mannequin-like human on television? ", "media": null, "score": 57, "upvote_ratio": 0.86, "comment_count": 24, "over_18": false}, "42": {"id": "1f3v544", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Acheron98", "link_flair_text": null, "time": 1725072749.7494233, "created_utc": 1724910713.0, "url": "https://i.redd.it/7kbe4mf5ljld1.jpeg", "title": "Anyone know the backstory behind this supposed pic of a Mexican Skinwalker?", "permalink": "/r/cryptids/comments/1f3v544/anyone_know_the_backstory_behind_this_supposed/", "selftext": "Randomly stumbled onto this. It’s supposedly a Nahual (a practitioner of black magic with the ability to shapeshift: i.e. a skinwalker) \nNo obvious signs of fakery that I can spot, although I’m far from an expert. \nI’ve only found a handful of articles covering the thing, but they were all short, and almost exclusively in Spanish. \nNow, I can read Spanish just fine, but they were the Mexican equivalent of the National Enquirer, so I figured I’d ask on here to see if anyone has anything more solid than the speculations of a tabloid lol.\nEither way, I sure as fuck wouldn’t want to run into this thing on a desert road at night.", "media": null, "score": 592, "upvote_ratio": 0.88, "comment_count": 211, "over_18": false}, "43": {"id": "1f1c2mt", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "imscaredmommy", "link_flair_text": null, "time": 1725072749.9371953, "created_utc": 1724634787.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1f1c2mt/my_old_house/", "title": "My old house", "permalink": "/r/Thetruthishere/comments/1f1c2mt/my_old_house/", "selftext": "So this is more of a list of weird incidents that happened in my previous house. For reference, I live in Singapore, a SEA country, meaning asian culture and beliefs are what the general populace follow. Also, here in SG most of us stay in government-built apartment housing. I say all this because when my parents bought the place long ago, we had a next door neighbour whose job was being a taoist medium.\nHe had since moved out, but before, my parents had seen him performing rituals along the corridors, with chickens, dogs and occasionally random women dressed in black. My mom swore she heard chains and screams from her room late at night, and my brother and I would often have to spend the night at my grandmother's if a ritual was taking place to prevent us being too exposed to it.\nAnyways like i mentioned, the guy moved out eventually and his daughter moved in. All round good natured family, all things considered. Nothing weird from them and very friendly. But even after he left and the rituals stopped, my family would continually get disturbed by incidences that we couldnt really explain. I'll go chonologically.\n\n\nAs an infant, I would apparently stare at the balcony lights when they were off and scream like no tomorrow. According to my parents I'd be inconsolable and pointing at the light screaming. Perhaps a child's imagination though, who can tell?\n\n\nMy brother and I would often hear a woman sobbing and weeping in the corridor that led to our toilet. It would always begin around 2am, but we never had the balls to go check, and fell asleep eventually so i cant tell you when it ended usually.\n\n\nWe would constantly see shadows gliding up the staircase into what would eventually be my room, and we'd stare at them without blinking till they disappeared. Their behavior never changed.\n\n\nWhen I was 17, I had a friend over late working on a school project and it was pretty quiet, other than our small comments to each other on what to change. All of a sudden, we heard a knock on the coffee table next to us, and someone male said loudly \"Hello, excuse me?\"\n\n\nMy friend just stood up and said something similar to \"Whelp, it's late, time for me to head back\" and he did. I just booked it upstairs and dove into bed.\n\nMy brother was alone one day in the house and he decided to have a shower. While bathing he heard my mom calling for him from downstairs. Went something like this:\n\n\"S----, can you come down and help me?\"\n\"I'm in the shower!\"\n\"It's really heavy, just quickly come and take it!\"\n\"Argh! Okok!\"\nTowels himself quickly and runs down, only to see my mom and my aunt just turning into the drive way. Clarified with them afterwards that, no, she did not in fact say anything or come home for that matter till then.\n\nWe would often hear footsteps running in the apartment above us, starting from as early as 9pm till late into the night. They were most definitely barefeet, but light enough that you could definitely mistake them for children playing. The closest way I can describe it is that kids were doing their Shuttle Run practice, and we could tell by the squeak their feet made when they pivotted around.\n\nI once played christian hymns when i heard it, in an attempt to ward it off, but apparently the sounds seem to escalate, becoming like there were 3 kids instead of 1 up there running around.\nMy brother, who worked as a real-estate agent after we grew up, went to the house above, under the guise of checking if they wanted their house sold. No one was in so he checked with some of his colleagues and apparently one of them actually was actively trying to get it sold already. The owner's mom was supposed to live in that house, but due to mental issues was already staying in a mental hospital for a long period of time. No, she did not have young children in the house, and no she did not do any vigorous exercises due to her age.\nThat's all I can think of at this point, maybe Ill add more in another post if I can remember them. Cheers!", "media": null, "score": 18, "upvote_ratio": 0.95, "comment_count": 1, "over_18": false}, "44": {"id": "1f1fpnj", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "wigglee1004", "link_flair_text": null, "time": 1725072750.2099512, "created_utc": 1724646610.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1f1fpnj/years_later_i_realized_that_stalker_caller_was_my/", "title": "Years later, I realized that stalker caller was my male friend (now ex friend)", "permalink": "/r/LetsNotMeet/comments/1f1fpnj/years_later_i_realized_that_stalker_caller_was_my/", "selftext": "Honestly, this is going to sound like a terrible movie. Listen, I was naive. Despite my abusive childhood, I was still too trusting. Looking back now, I'm like duh, of couse it was that AH. In the end, I'm just so grateful I wasn't hurt, physically.\nI (37F) was 18 living on my own in a studio apartment on the first floor of a very shady apartment complex. I have at least four creepy \"let's not meet\" stories from just being a resident there for only six months. They all would 100% qualify for this sub.\nThis story isn't one of those four stories. However, the fact I was a 18 year old female living on the first floor is important to know. \nLet me start at the end. I was at a downtown street party with my sister. As we waded through the crowd, I saw \"Peter\" (not real name obv) amongst the other party goers. I hadn't seen or spoken to him for a few years. The second I saw him, that night, the creepy calls, and the voice came flooding back to me. That's when I realized that creep that called me that night was him!\nPeter (was 21 at the time I was 18) and I were coworkers at a restaurant that we would have the same shift a couple times a week. We were just starting to get to know each other. One night, we were talking on the phone. It was storming. I'd joked that weird stuff always happens on nights like this. I didn't think too much of it. We hung up around 10pm. Not 10 minutes later, I get a call from a private number.\nI answer it. The caller said in a raspy male voice,  \"I'm watching you.\" I hung up immediately. They called again. I didn't answer. But they kept on calling. I finally answered to tell them to leave me alone. They then said, \"I'm watching you though your window.\" I yelled at them to leave me alone and hung up. I turned off my lights, checked the door lock, and huddled into a corner out of sight of the window. They kept calling. Then stopped.\nI called Peter scared out of my mind but he didn't pick up. I figured he'd still be up, that's why I called him. I called a few more times. He finally called back some 30 minutes later. He fed me this story how his mom went to the emergency room for a heart condition. I frantically told him about the creepy caller. He was adamant about coming to my apartment to stay the night, even though his mom was in the hospital. He did spend the night, on the couch. The next morning, he drove me to school. No discussion about what happened the night before, nothing.\nAs time passed, I realized I didn't have romantic feelings for him at all. He did. Needless to say, we had a falling out. Then went our separate ways. That night haunted me for years. Among other things, mostly I was paranoid about having open curtains. I was relieved when I moved from that apartment complex to a second floor apartment. But that night poisoned my mind.\nWhen I saw Peter at that party, after my matured brain finally made the connection, I wanted to confront him. But all I could do is leave and never see his awful face or hear his voice again. I really hope he didn't pray on other woman the way he did with me.\nI'd like to mention that I don't recall but I could have told him about the weird maintenance guy for the complex and how I suspected he entered my apartment when I was gone. Or I may have told him about a male stalker when I was 16, whom I never found out their identity. So, he could have used this as fuel to try to frighten me into his (Peter's) arms.\nWell, Peter, thank God your plan didn't work. Let's never ever meet again.", "media": null, "score": 161, "upvote_ratio": 0.91, "comment_count": 15, "over_18": true}, "45": {"id": "1f3j3fl", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "GINKO-ULTRA-3000", "link_flair_text": null, "time": 1725072750.3891466, "created_utc": 1724873516.0, "url": "https://v.redd.it/vtuas9flhgld1", "title": "Gravity 重力", "permalink": "/r/truecreepy/comments/1f3j3fl/gravity_重力/", "selftext": "Live Action Anime by GINKO ULTRA ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/vtuas9flhgld1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/vtuas9flhgld1/DASH_96.mp4", "dash_url": "https://v.redd.it/vtuas9flhgld1/DASHPlaylist.mpd?a=1727664750%2CMmNjYmE3Yzk4MGMzNDEzMjg5ODkwOWY5NmQyYjQxOTZiZWQ5NDEyZmQ2M2Q4ZTE3NDUzNTIxODVjOTRiMzE0YQ%3D%3D&v=1&f=sd", "duration": 80, "hls_url": "https://v.redd.it/vtuas9flhgld1/HLSPlaylist.m3u8?a=1727664750%2COWYwZjI1MGQzOWY2ZWZmMThlYmVhMTBkNTBkMTk4NmE5N2ZlOTE1YzYxNDVhZDVjNjFjZTZlNTc5OTVlZTM1Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 12, "upvote_ratio": 0.83, "comment_count": 1, "over_18": false}, "46": {"id": "1f53qsz", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "CreatureOfLegend", "link_flair_text": null, "time": 1725072750.61149, "created_utc": 1725045844.0, "url": "https://www.reddit.com/r/threekings/comments/1f53qsz/good_grade_ritual_of_mercury/", "title": "Good Grade ritual of Mercury", "permalink": "/r/threekings/comments/1f53qsz/good_grade_ritual_of_mercury/", "selftext": "Do this ritual on a Wednesday, preferably waaay in advance of of your next exam (the more time the magick has to manifest your desired result, the better)\nPrint out this sigil: https://imgur.com/a/tRrKvpk\nTrace it manually by hand on top of the printer ink while concentrating on the fact that it is the sigil of the Archangel Raphael and is a gateway to talk to him.\nIn orange ink, write a petition to Raphael like this:\n“Archangel Raphael, In the name of יהוה I ask you to help me get a good grade on my next _____ exam.” (Fill in the blank with what exam you want to get a better grade in) The name in Hebrew is that of Yaweh, the Abrahamic (Judaism/Christianity/Islam) god and the deity Raphael answers to. Fold the petition towards yourself after it’s written. Turn it clockwise, then fold it towards yourself again.\nGet an orange candle and a dinner plate with no writing on it. The dinner plate should be orange or white (or a combination thereof)\nGet an orange chime candle (preferably orange, but white can do in a pinch) (don’t get a large candle, because you’ll need to have it burn down all the way without putting it out and re-lighting it. It takes chime candles between 1.5 to 3 hours to burn all the way down. Larger candles can take days. Don’t leave lit candles unattended or sleep with them)\nWith a pin, or a thin permanent marker scribe the following sigil on the candle from the wick to the base: https://imgur.com/a/YpDC2c5\nGet a chime candle holder or a fireproof container to act as such.\nAt a time (on a Wednesday) when you know you can be with the candle for a few hours until it burns down do the ritual:\nPut the dinner plate on your table or altar. In the center, put the round sigil of Raphael that you printed out and traced over earlier. On top of the sigil put your folded petition. On top of the petition put the candle holder with the candle.\nWhen you speak in the ritual, do it with a confident and commanding voice (but not a rude one). Pretend you are a king and your words will always be obeyed, not because your subjects fear you but because they respect you and your authority.\nLight the candle.\nSay: “I call upon the powers of Mercury and Air”\nSit for a minute or two, imagining glowing yellow and orange energy feeling the air in front of you and around you, and the altar. Imagine it so strongly that you almost feel it on your skin.\nThen say: “I call upon the Archangel Raphael, in the name of iiiii aaaaah ooooh eeeeeh*!”\n*Stretch the sounds out. “i” is pronounced like in “lease”, “ah” as in “Ralph”, “oh” as in “ocean”, and “eh” as in “rest”. But stretch them out and “vibrate” them as if you’re singing those sounds.\nAfter a few seconds, say “Raphael, help me get a good grade on my next _____ exam. When I study, let it be that which I’ll be tested on. Help me remember what I study. Help me understand the questions on the exam and answer them correctly. Do all that is needed for me to get an excellent grade on this exam, in the name of iiiiii aaaaah oooooh eeeeeh!”  Imagine that it's after your exam is done and you've just received a good grade. Feel the relief, pride, and satisfaction from getting a good grade on your exam. You want to feel it like it's actually happening. This, in addition to the written and spoken words, is a way to help communicate to the angel what you want.\nClose your eyes and say “Thank you” while feeling appreciation in your heart as if Raphael has already fulfilled your command and you got a great grade on your test.\nNow wait for the candle to burn all the way down. You don’t have to sit there staring at it, just be in the room to make sure you don’t start a fire. Bury what remains in your yard. If no yard, wrap the remains of the ritual up and keep them under your bed until after you get your grade back. I’m talking about the leftover wax (if any) and paper, not the plate and candle holder.\nWash the plate and candle holder out with soap and salt water before re-using them.\nAfter you do the ritual, try to forget about it. Don’t keep thinking about it or worry if it will work. That can fuck your magick up. Know that it will work, as long as you do your end (studying to the best of your ability)\nPractice fire safety. Make sure the plate and candle holder are fireproof materials (not plastic) and don’t leave burning candles unattended.\nReport back with results. :)", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "47": {"id": "1f0ni3z", "locked": true, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Separate_Clue_8367", "link_flair_text": "Paranormal 9-1-1 [EMERGENCY ADVICE NEEDED]", "time": 1725072751.4214516, "created_utc": 1724557609.0, "url": "https://v.redd.it/7gkqbnw1fqkd1", "title": "Negative Energy and Events Happening in House Since Divorce", "permalink": "/r/Ghosts/comments/1f0ni3z/negative_energy_and_events_happening_in_house/", "selftext": "So, in January I left my ex wife after catching her in December (about as much detail as I’ll give). The marriage was very negative near the end obviously as a result and she moved out shortly thereafter. During this time my mother also died on December 27. She died in Colorado, not in the home. Very shortly after my mother died and my ex had moved out. Extremely bizarre things began happening around the house. \nFirst came the smoke detectors all went off in the house simultaneously, which I know is not odd but what was odd was that I had to physically remove every detector and even after flipping the breaker, they did not stop until even the batteries were removed (each one, after the hard wire had already been removed). In case you’re asking yourself, my mother was cremated. \nNext came the first of several pictures falling. The first was a large shadow box that slid down the wall and shattered on the floor. It was hung with command hanging methods, not nails so I didn’t think much of it. \nNext came my infamous balloon incident. So from the video you can tell this is my son’s playroom. This metal balloon had survived by this time already over a month and had never left that room. On this night I had gone to a show and when I came home I found this balloon had traveled out of the room, down the hall, and up to the ceiling in the living room and had wedged under my ceiling fan blade. I left it there. When I woke up at around 4 to use the restroom, when I came out of my master bath, the balloon was now in my bedroom and I literally ran into it. There were numerous videos I captured of this balloon moving around the playroom at every height, a few even passed directly in front of the camera at about 2ft high. I wasn’t able to get it to repeat when I put the balloon back. \nAfter that incident I had another painting fall except this time, it flung. It was also held by command strips but instead of sliding down the wall, it flipped and landed top corners first about 4ft away from the wall and the command hook was another 4 or so ft away to the left of it… the camera didn’t capture it but it appeared pulled rather than just falling given how far it was from the wall. \nI decided to reach out to this group tonight because my dog is now having anxiety issues and is pacing my son’s playroom when the house is empty. Whining and panting non stop. I sent my neighbor over and she tells me there is a palpable difference in the house. I don’t believe that it’s necessarily my mother or even a ghost but does anyone have experience with so much negative energy being expelled into the house that it can change the environment? How do I go about fixing this? With a very bad divorce with a very traumatic breakup, followed by death it just seems likely that the house atmosphere it self is negative. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/7gkqbnw1fqkd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/7gkqbnw1fqkd1/DASH_96.mp4", "dash_url": "https://v.redd.it/7gkqbnw1fqkd1/DASHPlaylist.mpd?a=1727664750%2CNjdlMWRkZjYwMTA0ZmZhNTcwMjQ4NmY2NzhiZGZkYTcwZjU2MzkzNDI4YTU4MTg3NDk4YTZmY2E1OWZiNzZjYw%3D%3D&v=1&f=sd", "duration": 48, "hls_url": "https://v.redd.it/7gkqbnw1fqkd1/HLSPlaylist.m3u8?a=1727664750%2CMWIxMGVjMTRhOWVlOWYyNDIzNDcyMjZlYTYyYjhlNjEzMDAzYWNkYWMzN2IyY2UwNGZkN2QwMjA1ZTZmZWU4ZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 523, "upvote_ratio": 0.66, "comment_count": 349, "over_18": false}, "48": {"id": "1f363gv", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "abbasi6622", "link_flair_text": "Glitch Pic", "time": 1725072751.7119832, "created_utc": 1724838469.0, "url": "https://www.reddit.com/gallery/1f363gv", "title": "Blue lines at sunset. Plz explain", "permalink": "/r/GlitchInTheMatrix/comments/1f363gv/blue_lines_at_sunset_plz_explain/", "selftext": "", "media": null, "score": 87, "upvote_ratio": 0.79, "comment_count": 34, "over_18": false}, "49": {"id": "1f4kiov", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "psychonautix66", "link_flair_text": null, "time": 1725072753.198106, "created_utc": 1724985211.0, "url": "https://i.redd.it/o5uy7g8nqpld1.jpeg", "title": "Anyone know where I can find the video of this? The \"biblically accurate angel\" from December 2022, can't seem to find the original video anywhere. Hopefully this isn't breaking rule 2, I really just want someone else to remember this cause it was blowing up for a little while and now it's gone", "permalink": "/r/ufo/comments/1f4kiov/anyone_know_where_i_can_find_the_video_of_this/", "selftext": "", "media": null, "score": 220, "upvote_ratio": 0.86, "comment_count": 103, "over_18": false}, "50": {"id": "1ezuvxr", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "foxtailguy73", "link_flair_text": "Podcast", "time": 1725072754.672248, "created_utc": 1724466944.0, "url": "https://x.com/lueelizondo/status/1827142003169124805?s=46", "title": "Lue on why he avoided talking about “Imminent” on the Rogan podcast: “Because I was invited to talk about the topic, not sell a book.”", "permalink": "/r/UFOs/comments/1ezuvxr/lue_on_why_he_avoided_talking_about_imminent_on/", "selftext": "“", "media": null, "score": 2072, "upvote_ratio": 0.91, "comment_count": 605, "over_18": false}, "51": {"id": "1ezuu0s", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "accounts_redeemable", "link_flair_text": "News :illuminati:", "time": 1725072759.0514789, "created_utc": 1724466770.0, "url": "https://www.reddit.com/r/aliens/comments/1ezuu0s/lou_elizondo_revealed_that_nhi_biologics_are/", "title": "Lou Elizondo revealed that NHI biologics are being studied at Fort Detrick in Maryland. This is the same facility the biologist who did an AMA here over a year ago claimed to work at.", "permalink": "/r/aliens/comments/1ezuu0s/lou_elizondo_revealed_that_nhi_biologics_are/", "selftext": "Here is a link to the video with Lou: https://x.com/UAPJames/status/1827163452990738682\nHere is a link to the thread with the biologist: https://www.reddit.com/r/aliens/comments/14rp7w9/from_the_late_2000s_to_the_mid2010s_i_worked_as_a/\nI saw someone on X also noticed this, but I couldn't find it posted here. It provides for some interesting corroboration.", "media": null, "score": 1319, "upvote_ratio": 0.97, "comment_count": 149, "over_18": false}, "52": {"id": "1f1isj6", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": null, "time": 1725072759.794784, "created_utc": 1724659398.0, "url": "https://www.reddit.com/r/UAP/comments/1f1isj6/something_is_wrong_here_why_does_googlewikipedia/", "title": "Something is wrong here 🤔 Why does Google/Wikipedia display Lue Elizondo as a 'conspiracy theorist,' but when you click, he is not described that way 🤔", "permalink": "/r/UAP/comments/1f1isj6/something_is_wrong_here_why_does_googlewikipedia/", "selftext": "https://preview.redd.it/yuhi3nkttykd1.jpg?width=717&format=pjpg&auto=webp&s=4b67d5366b4f78e3bbed5bd1e64354d88247b937\nhttps://preview.redd.it/me5cq5jttykd1.jpg?width=720&format=pjpg&auto=webp&s=067b86741f527efe8cfefd68a90678e41f79d8c4\nSomething's not right. Why is Lue Elizondo pejoratively described as a 'conspiracy theorist' on Google's desktop?\nIf it is not described as such within the Wikipedia article itself, then why does Google display it like that?!\nWhy does this happen? Why is this happening? Is it someone inside Google or Google itself or a Wikipedia error?\nI honestly don't know. Is the system trying to somehow take away Lue's credibility or is it simply a real error?\nI'll take the first option.", "media": null, "score": 68, "upvote_ratio": 0.79, "comment_count": 43, "over_18": false}, "53": {"id": "1f1epta", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "External-Noise-4832", "link_flair_text": null, "time": 1725072760.9799619, "created_utc": 1724643105.0, "url": "https://i.redd.it/un3if4rehxkd1.jpeg", "title": "Rumble’s founder has fled Europe after the arrest of Telegram’s founder in France.", "permalink": "/r/conspiracy/comments/1f1epta/rumbles_founder_has_fled_europe_after_the_arrest/", "selftext": "Rumble founder, Chris Pavlovski, leaves Europe, due to the arrest of Telegram's Durov.  \nAfter the arrest of Durov, the founder of the YouTube competition - Rumble, left Europe in fear. - X", "media": null, "score": 2317, "upvote_ratio": 0.96, "comment_count": 246, "over_18": false}, "54": {"id": "1f1qj7v", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Vib_ration", "link_flair_text": null, "time": 1725072761.2925227, "created_utc": 1724684926.0, "url": "/r/Spiritualchills/comments/1f1pkew/you_can_tap_into_your_endorphins_to_go_beyond/", "title": "You can tap into your endorphins, to go beyond physical pain, whenever you want with this special skill.", "permalink": "/r/conspiracyfact/comments/1f1qj7v/you_can_tap_into_your_endorphins_to_go_beyond/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 0, "over_18": false}, "55": {"id": "1f1b7ih", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "milehighguy70", "link_flair_text": "tattoo", "time": 1725072762.249747, "created_utc": 1724632117.0, "url": "https://www.reddit.com/gallery/1f1b7ih", "title": "Finally got My Bigfoot Tattoo!!", "permalink": "/r/bigfoot/comments/1f1b7ih/finally_got_my_bigfoot_tattoo/", "selftext": "", "media": null, "score": 200, "upvote_ratio": 0.92, "comment_count": 31, "over_18": false}, "56": {"id": "1f0stzh", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "VampiricDemon", "link_flair_text": null, "time": 1725072762.7083797, "created_utc": 1724579751.0, "url": "https://i.redd.it/dcv5w5cz8skd1.jpeg", "title": "Just a picture of a thylacine I took in a natural history museum.", "permalink": "/r/Cryptozoology/comments/1f0stzh/just_a_picture_of_a_thylacine_i_took_in_a_natural/", "selftext": "", "media": null, "score": 385, "upvote_ratio": 0.99, "comment_count": 15, "over_18": false}, "57": {"id": "1f0q6d6", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "bonnie69420", "link_flair_text": "Personal", "time": 1725072762.9955018, "created_utc": 1724567968.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1f0q6d6/encounter_with_woods_creature_redone/", "title": "Encounter With Woods Creature (Redone)", "permalink": "/r/Humanoidencounters/comments/1f0q6d6/encounter_with_woods_creature_redone/", "selftext": "2024, Dublin, Ireland\nThis only happened about a month ago.\nI was walking around my area and decided to head into the forest since I hadn't been there in a while. I've had encounters with things in these woods before but it's a rare occurrence.\nEverything was going smoothly, found some new paths I hadn't seen before, and barely any people around. Eventually I got to a point where there was a fork in the path, I took the right side and eventually learned that that way was blocked by thorns and nettles a bit down the path.\nAs I stopped and went to turn around and go the other way, I noticed about 8 feet infront of me, where I intended to end up, a man standing there. He had completely normal skin and a healthy body(important for next part), and im not joking when I say this,he had the same build as Joe Rogan.\nHe was just staring at me, I froze for a second but then figured he probably got startled by me the same way he started me, so I kept going to turn around. But when I got about 2 steps down the left path I stopped, he was still standing there. Except there was something seriously off, he was slumped over in an inhuman position, like his spine had moved up and snapped. His skin was pale and covered in bruises. And he was still just standing there.\nI quickly turned around and got the fuck out of there, not looking back. I only stopped when i found another person, at that point i slowed down to walking again. I'm usually not afraid of the things in those woods but I wasn't gonna risk fucking with whatever that was", "media": null, "score": 56, "upvote_ratio": 0.92, "comment_count": 22, "over_18": false}, "58": {"id": "1f406c1", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "niiggueuegehe", "link_flair_text": null, "time": 1725072763.4401038, "created_utc": 1724931490.0, "url": "https://i.redd.it/uxwbz6gxalld1.jpeg", "title": "Can anybody tell me the origins of this photo??", "permalink": "/r/cryptids/comments/1f406c1/can_anybody_tell_me_the_origins_of_this_photo/", "selftext": "Hey, I’m not sure if it’s the right subreddit to post in but I was wondering if anybody can tell me the origins of this picture I’ve been searching and I just can’t seem to find where it’s from!", "media": null, "score": 202, "upvote_ratio": 0.86, "comment_count": 85, "over_18": false}, "59": {"id": "1f3e9j4", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Ms_Black_Eyeliner", "link_flair_text": null, "time": 1725072763.6332817, "created_utc": 1724861680.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1f3e9j4/this_is_just_a_reminder_that_ghosts_may_be_spooky/", "title": "This is just a reminder that GHOSTS may be spooky, but they don't BITE.", "permalink": "/r/Thetruthishere/comments/1f3e9j4/this_is_just_a_reminder_that_ghosts_may_be_spooky/", "selftext": "", "media": null, "score": 7, "upvote_ratio": 0.73, "comment_count": 5, "over_18": false}, "60": {"id": "1f46ep9", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "MilfLover2210", "link_flair_text": null, "time": 1725072763.8452492, "created_utc": 1724948038.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1f46ep9/im_never_going_on_a_night_ride_alone_again/", "title": "Im never going on a night ride alone again", "permalink": "/r/LetsNotMeet/comments/1f46ep9/im_never_going_on_a_night_ride_alone_again/", "selftext": "So earlier this summer, I (M16) got my driving license for a 50cc moped (common and popular thing here in Europe) and I was so hyped to finally get to ride with my friends and explore places I couldn’t have explored before without my moped, and everything went great for the first couple of days until one day me and my friends were just out cruising and having fun, and it was a warm and sunny summer evening so we decided to go ride on some smaller gravel roads in the countryside, so we did that and we were riding there for maybe an hour until everyone had to get home but me.\nIt was propably like 1-2AM at that point but I still decided to stay there and just ride around and listen to some music in my headphones, so I started riding towards this one small village surrounded by fields and there was a lot of farms there, so I rode a bit slower than usual so there wouldnt be any accidents with all the tractors and farm vehicles, but after I got through the village and closer to a bigger road, the sun was almost gone and it was getting seriously dark outside.\nIt had been a nice ride and I decided to start heading home on this almost empty highway even though the speedlimit was 100km/h and its not allowed to ride a 50cc moped on the highways but I did it anyway.\nHome was almost 30km away from where I was at that point so I was just riding full speed in case to get home before my parents found out that I’d been outside until 3AM, but when i had been riding for like 15 minutes, I saw a car stopped on the side of the road with the lights on and it got me a bit creeped out to be honest but I just pushed it out of my mind and kept going since I was almost halfway home, but after a few minutes I noticed the car from earlier speeding up after me and since I have a moped that only goes like 80-90km/h, the car caught up to me pretty quickly, and then the car started to pass me, and when it got beside me, I looked in there and I saw a man covered in blood and he was looking straight at me with ”the crazy eyes” if you get what im saying and he was smiling at me, so I got very scared and he rode alongside with me for propably a minute but it felt like hours with him just staring at me and looking at the road every once in a while. Then the man raised his other hand and waved me goodbye before putting his finger on his lips and doing the shush thing🤫, and after that he sped off and got off the highway onto a ramp to a smaller road and when he did that i saw that the car didnt even have license plates.\nThat was a super creepy experience and I dont know why the man was covered in blood and why had he been parked on the side of a empty road at 3AM but what I know for sure is that he was somebody that I never want to meet again.", "media": null, "score": 63, "upvote_ratio": 0.9, "comment_count": 6, "over_18": true}, "61": {"id": "1f0mkig", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "DefinedByFaith", "link_flair_text": null, "time": 1725072764.229599, "created_utc": 1724554386.0, "url": "https://www.reddit.com/r/threekings/comments/1f0mkig/could_this_be_related_to_some_kind_of_ritual/", "title": "Could this be related to some kind of ritual?", "permalink": "/r/threekings/comments/1f0mkig/could_this_be_related_to_some_kind_of_ritual/", "selftext": "Found near a family home. Just curious if this could be related to a specific ritual of some kind?\n\npartially burned bible\nrattle? snake (now dead) with a piece of oxidized metal in its mouth and a burn mark on its body\n-what looks like a woman's bra wrapped around some other personal item\n-something unique (to me) that seems to be made of brass,but there are two of them, almost round, but not, and tied together by some rooe/string\nOther items I can't identify from the picture.\n\nIs this related to some sort of ritual? I tried to post a picture, but the system won't let me. ", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 3, "over_18": false}, "62": {"id": "1f19hxg", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "One_Investigator1107", "link_flair_text": "EVP", "time": 1725072765.0270226, "created_utc": 1724627003.0, "url": "https://v.redd.it/jsrd1qni5wkd1", "title": "Creepy voice heard , I don’t know what it’s saying. ", "permalink": "/r/Ghosts/comments/1f19hxg/creepy_voice_heard_i_dont_know_what_its_saying/", "selftext": "I came downstairs to get a drink, while everyone in my house is sleeping upstairs. My dog is on the couch sleeping. The voice is heard as I’m looking in the cabinet.  Some people have heard whispering also. Let me know what you think. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/jsrd1qni5wkd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/jsrd1qni5wkd1/DASH_96.mp4", "dash_url": "https://v.redd.it/jsrd1qni5wkd1/DASHPlaylist.mpd?a=1727664764%2CMjIxNjlhYjkyNWJkYWEyMzNlMmYzYWJmZDIxMzA0NmFkODM1NGJiZmUwZTlmNGVlM2E5NzQ2NDdlMTk2YTAwMA%3D%3D&v=1&f=sd", "duration": 37, "hls_url": "https://v.redd.it/jsrd1qni5wkd1/HLSPlaylist.m3u8?a=1727664764%2CMzllYzEzOWQ4MGFjMDI4YjI2NGJiZTQ2YWYyOWExZGY5ZDZmZDA5YTZlMmE1OTk5ZDFiYjEwOTg5ZDkwOGQ1MQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 414, "upvote_ratio": 0.94, "comment_count": 335, "over_18": false}, "63": {"id": "1f2qohk", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "DutchSlv", "link_flair_text": "Glitch Pic", "time": 1725072765.3212953, "created_utc": 1724788870.0, "url": "https://i.redd.it/3eq3hifui9ld1.jpeg", "title": "Portal found in Germany", "permalink": "/r/GlitchInTheMatrix/comments/1f2qohk/portal_found_in_germany/", "selftext": "", "media": null, "score": 53, "upvote_ratio": 0.81, "comment_count": 10, "over_18": false}, "64": {"id": "1f2gw94", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "blablabla5551", "link_flair_text": null, "time": 1725072766.8450923, "created_utc": 1724764812.0, "url": "https://www.reddit.com/gallery/1f2gw94", "title": "NASA's put a drawing of an alien on ISS?", "permalink": "/r/ufo/comments/1f2gw94/nasas_put_a_drawing_of_an_alien_on_iss/", "selftext": "Just scrolled through the live stream and caught this 👽 A joke from the crew?", "media": null, "score": 216, "upvote_ratio": 0.85, "comment_count": 58, "over_18": false}, "65": {"id": "1f0ykk5", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "News", "time": 1725072768.8470457, "created_utc": 1724598670.0, "url": "https://i.redd.it/3bc1ruv9ttkd1.jpeg", "title": "Former head of NOAA and Rear Admiral Tim Gallaudet corroborates Lue Elizondo's statement about an USO in the ocean traveling 500+ mph that was bigger than an oil rig. \"Both the USS Maury and USCG Bittersweet had similar encounters in the Pacific and Atlantic at the end of WWII\"", "permalink": "/r/UFOs/comments/1f0ykk5/former_head_of_noaa_and_rear_admiral_tim/", "selftext": "", "media": null, "score": 2063, "upvote_ratio": 0.93, "comment_count": 329, "over_18": false}, "66": {"id": "1f1epns", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Open-Storage8938", "link_flair_text": "News :illuminati:", "time": 1725072770.6823626, "created_utc": 1724643091.0, "url": "https://v.redd.it/8anj0t82hxkd1", "title": "Rep. Tim Burchett on the next UAP hearing: “We’ll be announcing something… We’re gonna get to the bottom of a lot of things.”", "permalink": "/r/aliens/comments/1f1epns/rep_tim_burchett_on_the_next_uap_hearing_well_be/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/8anj0t82hxkd1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 358, "width": 640, "scrubber_media_url": "https://v.redd.it/8anj0t82hxkd1/DASH_96.mp4", "dash_url": "https://v.redd.it/8anj0t82hxkd1/DASHPlaylist.mpd?a=1727664769%2CNjEzZDExZDM0ODdkODVkZjVjNzBlNmI1MDg4NDVlM2Q0ZTdmYjIyZTRmNDA3ODNjYTRkNGVhZjI3ZGM0MWJlYQ%3D%3D&v=1&f=sd", "duration": 31, "hls_url": "https://v.redd.it/8anj0t82hxkd1/HLSPlaylist.m3u8?a=1727664769%2CZjRlOTVjYjI4N2FlMTM5Njc2YTk0NmNmM2VhZDVkOTdkMTY1ZjY3MTU2NTNiODZhMTAyNTg5ODE1NTc5MDQ3MA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 848, "upvote_ratio": 0.92, "comment_count": 157, "over_18": false}, "67": {"id": "1f3vci7", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "SolomonTaurus", "link_flair_text": null, "time": 1725072771.5456314, "created_utc": 1724911571.0, "url": "https://www.reddit.com/r/UAP/comments/1f3vci7/ross_coulthart_mentioned_that_a_dia_senior/", "title": "Ross Coulthart mentioned that a DIA senior official has their religious views listed on their bio on an official website.", "permalink": "/r/UAP/comments/1f3vci7/ross_coulthart_mentioned_that_a_dia_senior/", "selftext": "Apparently this person is an evangelical Christian who believes that the nonhuman remains are demons and thus the whole phenomena is demonic in nature. This is revealed in Lue’s new book and elaborated on a little more in Ross’s news nation interview with Rennenkampff following the Lue interview.   Just curious if anyone can identify any officials in the defense department that mention being evangelical Christians?", "media": null, "score": 58, "upvote_ratio": 0.89, "comment_count": 80, "over_18": false}, "68": {"id": "1f239xk", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "TheOracle2024", "link_flair_text": null, "time": 1725072772.8564565, "created_utc": 1724716995.0, "url": "https://i.redd.it/mkghrnd4l3ld1.jpeg", "title": "It’s time…", "permalink": "/r/conspiracy/comments/1f239xk/its_time/", "selftext": "", "media": null, "score": 2172, "upvote_ratio": 0.77, "comment_count": 640, "over_18": false}, "69": {"id": "1f11ro7", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "WackHeisenBauer", "link_flair_text": "merchandise", "time": 1725072773.9348342, "created_utc": 1724606822.0, "url": "https://i.redd.it/wmjl5gqihukd1.jpeg", "title": "Socksquatch sighting!", "permalink": "/r/bigfoot/comments/1f11ro7/socksquatch_sighting/", "selftext": "Purchased on the edge of potential Bigfoot territory in the Adirondacks at Lake Placid. ", "media": null, "score": 171, "upvote_ratio": 0.95, "comment_count": 5, "over_18": false}, "70": {"id": "1f4drv8", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Art", "time": 1725072774.3929982, "created_utc": 1724966175.0, "url": "https://i.redd.it/xwko5oz16old1.jpeg", "title": "Antarctic Godzilla vs the Allier River Monster", "permalink": "/r/Cryptozoology/comments/1f4drv8/antarctic_godzilla_vs_the_allier_river_monster/", "selftext": "", "media": null, "score": 366, "upvote_ratio": 0.98, "comment_count": 14, "over_18": false}, "71": {"id": "1f3imlc", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Johanharry74", "link_flair_text": "U.F.O. Humanoid", "time": 1725072774.6592767, "created_utc": 1724872344.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1f3imlc/humanoid_close_encounter_cases_from_the_nordic/", "title": "Humanoid close encounter cases from the Nordic countries - part 3", "permalink": "/r/Humanoidencounters/comments/1f3imlc/humanoid_close_encounter_cases_from_the_nordic/", "selftext": "The aliens seem to enjoy to visit the Nordic countries as well. So here is another part in the series. And as usual I have four new intresting cases from Sweden, Norway, Denmark and Finland.\nThe peeping-alien in the window.\nHärja, western Sweden, August 25 1958.\nIvar Neumann and his wife had rented a small cabin for the summer, from a farmer, Oskar, who lived in a bigger house across the yard from the cabin. This was in the farmlands of Västergötland in Sweden. At around midnight August 25, Ivar was sitting at the cabin’s kitchen table reading a book. His wife had already gone to bed and was probably sleeping. When he put the novel away to lit his pipe, he glanced out of the window beside him. Then he saw a figure moving near the outhouse. It was dark outside and he couldnt see the figure clearly, so he thought it was the farmer Oskar. Ivar continued to read the book, but then after a short while it suddenly felt like he was being watched. He turned around and looked at the window, and stared straight into a face, not more than 50 cm (20 inches) from him. Only the glass separated them. Ivar first thought it was a human, but then he quickly saw that the ”person” standing outside was shorter than a human, height like a child of elelven or twelve. The head was covered by a hood or helmet, and it was shining in a blue, cold light. The being wore a kind of jumpsuit or overall in the same shining blue color. Ivar was not sure about the skin color, but it was lighter than the clothes, maybe greyish. They eyes were definately larger than a human’s and they were dark, almost completely black. ”His or hers gaze had an unexplained effect and it hypnotized me.” – Ivar said.\nIvar felt like someone was watching him and turned around and was face to face with a strange being in the window. (artisitic impression)\nFor some reason Ivar was not scared of the mysterious creature and hastly put on his shoes and jacket and rushed outside. He saw that the being was already running away, and it had jumped over a low fence and was now in a field behind the cabin about 100 meters (300 feet) away from him. So Ivar ran out on the gravel road near the house to try to intercept the creature. After running for a while he finds himself standing in a wheat field just staring in awe. 25 meters (75 feet) up ahead he could see a strange craft. Ivar had never believed in UFO tales, but here was one now, just in front of him. The craft was quite big. About 12 meters (36 feet) in diameter, and in the shape of a disc. Now Ivar felt a wierd smell and also felt tired in an unreal way. At this moment he could also see that the small being had reached the craft and started to climb a long ladder. The being then disappeared up into the ship. Suddenly he hears a buzzing sound like an electric motor increasing in speed. The three telescopic legs under the craft retracts into the hull, and the craft now starts to slowly rise into the air. Ivan is tries to move, but notice that he is completely paralyzed and can’t move. The craft starts to accelerate and flies over some nearby birch trees, that sways in the wind draft from it. In just a few seconds the UFO disappears high up in the night sky. When the craft was gone, Ivar could move again, and in the air an odor of ozone could be felt. With a thousand thoughts in his head, Ivar walked back towards the cabin. He woke up his wife to tell her about what had just happened, but she didn’t believe him and said he probably only had a nightmare.\nClearer image from the somewhat messy original sketch in the old report. It shows info about the saucer parked in the field.\nThe next morning Ivar is back at the landing site in the wheat field, but now he is joined by the farmer Oskar. They search around and find three deep impressions in the soil with a depth of 30 cm (12 inches) and a width of 20 cm (8 inches). The vegetation was also pressed down in a circle that measured the outer dimensions of the craft, 12 meters (36 feet). Ivar Neumann reported the incident to investigators. This is just one of many old cases found in the Arhive for the Unexplained.\nSource: Håkan Blomqvist’s blog and Archive for the Unexplained\nMap of the encounter with added text in english. (Source: Archive for the Unexplained)\nThe car mechanics from Space.\nSlagelse, southern Denmark, April 27 1960.\nThe man who submitted the report chose to remain anonymous, so we call him \"A.N.\".\nEarly in the morning on April 27, 1960 at about 03.00 am, A.N. is driving in his Opel Rekord courier van from 1953, on the country road between Slagelse and Næstved. On the way he passes the old estate \"Gyldenholm\". His speed is 60 km/h (37 Miles/h) and there is some night fog and light wind. Suddenly he gets a strange feeling that he is being watched. As he is heading out of the forest surrounding the estate's grounds, he sees a bright light in the sky to the southwest, which begins to resemble a ring as it approaches at high speed. In just 3-4 seconds, the glowing ring has come very close and stops just a short distance away from him. Then the car's engine light suddenly starts to shine, the car's lights go out and the car starts coughing and sputtering. When he notices that the car can't drive and is about to die, he brakes and rolls to the side of the road on the right side and stops. A.N. is now standing with his car by large fields on both sides of the road, and the shining object is no further than about 6-7 meters (18-24 feet) to his right.\nThe craft that landed in the field. (source: UFO-nyt)\nThe observer now sees that it is a kind of craft (see picture), which is about 9x6 meters (27x18 feet) in width/height. The shape is like two bowls placed against each other and with a wide, shining band in the middle. There is an even narrower luminous band above. At the top there is something that looks like a superstructure of a smaller bowl. It too has a glowing band on it at the top. On the lower part of the craft there are three luminous circles that look like windows. The entire craft glows in a gray-green glow and it hovers about 3 meters (9 feet) above the field. While A.N. looks at the object, three telescoping legs slides out from holes on the underside of the craft. Just before they reach the ground, a thick tube slides out of the center of the bottom. The pipe stops just before the ground and a square opening at the bottom appears.\nA.N. does not feel frightened by what is happening, but he gets a strange feeling of apathy. He thinks about getting out of the car, but remains seated, because now four humanoids come out of the door in the thick pipe in the middle. They move towards the car with slow, graceful movements. It looks like they are divers walking on the sea floor. The beings are dressed in green shimmering jumpsuits and on their chests they have symbols in the form of three dark vertical lines, the middle of which is a little longer than the others. While the four are on their way to A.N. and his car, a thick cable emerges from the underside of the craft. The cable seems to move by itself and coils towards the car almost like a snake. The cable stops about 2 meters (6 feet) from the car's windshield at a height of 1 meter (3 feet). A.N. now sees that the end of the cable consists of a square screen with a round, white, glowing lens in the center, which is aimed at him.\nMeanwhile, the four humanoids have started to move around the car, two of them now standing by the car's left door. In their hands, everyone has something that looks like a stick lantern. They put this against the car in different places, as if they were measuring something. A.N. describes the beings as human-like, though shorter, only about 1 meter (3 feet) tall. The faces were similar to ours, but a little flatter. They looked as if they were talking to each other because they were moving their mouths, but A.N. could not hear anything from them. No sound at all was heard during the entire observation, except for a hum as from a high voltage powerline.\nSketch of the meeting. This is showing the event a bit wrong, because the man did not get out of the car while the aliens were present. (source: Unknown)\nShortly thereafter, the four humanoids disappeared back into the craft again. The door closed behind them and the cable was retracted into the hull. After that, the landing gear was pulled up and the craft began to move upwards, then with a flash of light, it shot off at high speed into the sky, in the same direction it came from. In just a few seconds it was out of sight and gone. After that, the ignition light on the car started to light up again and the strange apathetic feeling stopped. A.N. now got out of the car and then smelled a strange smell (ozone?), which he could not identify. He went out into the field where the craft had landed, and put his hands against the marks of the landing feet. He felt that the ground there was very hot. And when he got back into the car and tried to start it, it started right up. He considered the observation to take about 4 minutes, as his wristwatch was now 4 minutes too slow.\nDuring a couple of years after the observation, A.N. went back to the site and checked. He then saw that there had been bare spots in the field, where nothing had grown where the craft stood. Only after a few years, the vegetation came back. But since as A.N. first reported the event in 1966, UFO researchers have not been able to verify this. There were places in the field where the saucer is said to have landed, where it grew poorly, but it might as well have been due to other causes. The observer was a house painter by profession, and the investigators rated the man as trustworthy and honest.\nWhy were the beings so interested in the car and what did they want? Why do they stop a random car on a lonely road in Denmark in the middle of the night? And what was that strange cable that came up to A.N's vehicle? This is indeed a strange story, but in this there are some familiar things that are recurring and that we recognize from so many other UFO cases. We have the classic story of a car that suddenly stops due to engine failure near a UFO. We have small and short humanoid creatures. We also see that the man in the story experiences a form of apathy, where he cannot move. And we also have the mysterious so-called \"Oz factor\". This means that the observer experiences a kind of stillness, as if he is in a bubble where no sound is heard and time sometimes slows down. A typical close contact in other words.\nSource: UFO-nyt, #6 1978 and https://hiddenmark.dk/ufoer/the-gyldenholm-landing/\nThe Luumäki encounter.\nLuumäki in southeast Finland, August 19 1965.\nA family of four, Matti, Maria, Teuvo and Tapani went to the forest near the village of Hermunen to pick blueberries. They scattered in four directions however always keeping eye contact with each other. About noon, two of them, father Matti and his eldest son Teuvo had an experience they shared with the others only later. Already when they had arrived at the forest, Matti Kuningas had observed a large, round rock (or so it looked like?), which he had never seen before, although this part of the forest was very familiar to him. The distance to the rock was about 30 meters (90 feet). The rock was about 2 meters (6 feet) high and 3 meters (9 feet) in width and on it there was some green moss and a very small, baby rowan tree on top. Suddenly a gust of wind rose, which astonished Teuvo Kuningas since the day was clear and calm. Both he and his father Matti observed now from their respective positions a little man, about one meter tall, which appeared near the rock. The man’s skin was reddish like that of a carrot and he wore a green overall or jumpsuit. The head was large and his shoulders broad. Teuvo Kuningas observed a box in the man’s chest, from which it came some kind of light flash. Now the little man started to run away from the rock, and Matti Kuningas, who was closer, heard him make a “mourning” like sound.\nTeuvo Kuningas heard a voice resembling human speech. Suddenly the little man turned and ran towards Matti Kuningas. He stopped at a distance of 15 meters (45 feet) and for a minute or so and looked at Matti. He seemed to have a human like face, however it appeared a little wrinkled and elderly. Then he turned and started to run away. About 50 meters (150 feet) from Matti, he seemed to do an incredible somersault and disappear. Teuvo also saw the disappearance, but he also saw the man reappear, now closer to him. He was now somehow deterred by some unknown force and could not even look at the man properly. He could not move either. He also smelled a terrible odor in the air. After the man disappeared once again, he heard a noise from the direction of the rock, but nothing could be seen. And then the man was gone and didnt show up anymore.\nNear the big moss covered rock, they saw a serious looking, orange-skinned, short and bulky humanoid dressed in a green jumpsuit, suddenly appear out of nowhere. (artistic impression)\nWhen the whole thing was over, Teuvo noticed to his astonishment that over a half an hour had passed. They went deeper into the forest and continued with the blueberry picking for a while, and when they were done and were on their way to the car, they passed the place were they encountered the little man. Teuvo decided to have a closer look at the rock to see if there were any footprints. When he came near, he also noticed the moss and the little rowan tree and some silvery gray on its surface. When he tried to get closer to the rock and touch it with his berry basket, the same unknown force deterred him again and even turned him around and forced him to go walk away. He thought of throwing a stick at it, but could not do that either. Later, back in the car, he suddenly found himself unusually tired. He intended to tell the others about the experience, but soon it all vanished from his thoughts. Only gradually could he remember the incident, and six months passed before he told of the experience to his younger brother Tapani. Teuvo had thought that he had been the only one to have seen the little man, but found out that his father Matti also saw him that day.\nThis is a very strange humanoid case. Since there was no apparant UFO involved, should we categorize this as a cryptid- or as an alien encounter? It leans towards the latter, since the small humanoid had some kind of technological box on his chest. And what about the large moss covered rock that repelled Tuevo Kuningas? Could that have been a camoflaged UFO? No one knows, and we can only speculate. The other brother, Tapani Kuningas, thought a lot about this incident and even though he didnt see the little, orange man himself, the story affected him deeply. He started to grow a big intrest in the paranormal, and later he would become one of Finland’s leading Ufologists.\nSource: thinkaboutitdocs\nThe ”spacemen” on the mountain.\nNorway at Hardangervidda, October 1992\nIn the fall of 1992, a strange craft was observed landing at a cabin near Odda. This place is about 800 meters (2500 feet) above sea level at Hardangervidda, which is a famous bare mountain region in western Norway. It was October and the snow had not yet arrived. At dusk on this day, observer Torbjørn Reinsnos (TR) saw an object land about 100 meters (300 feet) from his cabin. It appeared to be 6-8 meters (18-24 feet) wide and trapezoidal in shape. After a short while, he saw two humanoid beings emerge from the ship. They appeared to be a little shorter than humans, about 1.4 meters (4 ft, 7 in) tall. The creatures had silver colored tight clothes and helmets on their heads. One of them also carried a black device, but it was not possible to see what it was. TR had plenty of time to observe both ships and beings through the binoculars. But pretty soon he started to get anxious and therefore sent a warning shot at the beings with his shotgun. They got scared and quickly disappeared into the ship through a hatch. The ship took off and flew away over Lake Reinsnosvatnet a kilometer (0.6 miles) away. There it turned and then came back and hovered over Torbjørn's cabin. After a short while it flew back towards the lake and then up towards the Middal’s peak and then disappeared.\nA squared looking craft landed near the man's cabin on the mountain, and two small \\\"spacemen\\\" came outside. (artisitic impression)\nThe next day, TR investigated the landing site. He had two neighbors with him (father and son) as witnesses. They found four footprints in the ground, which they believed to be from the craft’s landing gears. Where the prints were, the ground was also white with frost and this would remain for a long time. The imprints from the landing gears were visible until the following spring and summer, and then UFO-Norway was supposed to come there and take samples. Earlier in the winter, UFO-Norway had received a report by telephone about the incident from TR. Then TR also promised that the UFO investigators would be allowed to come up to his land and look around and interview him, as soon as the snow melted away. But unfortunately TR later changed its mind and did not want UFO-Norway to come there. In fact he didn’t want to speak anymore of the incident at all. So unfortunately there was not a scientific investigation of the ground and a follow-up more in-depth interview about the encounter.\nSource: UFO temahefte – Norske nærkontakter av 3. grad", "media": null, "score": 26, "upvote_ratio": 0.93, "comment_count": 2, "over_18": false}, "72": {"id": "1f0vgw3", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "KasketDreadful", "link_flair_text": null, "time": 1725072775.0809984, "created_utc": 1724589814.0, "url": "https://i.redd.it/6eh11lyx2tkd1.jpeg", "title": "Does anyone remember this cryptid toy line?", "permalink": "/r/cryptids/comments/1f0vgw3/does_anyone_remember_this_cryptid_toy_line/", "selftext": "So, I had this Bigfoot figure when I was a kid, must have been in the late 90's when I lived in Liverpool. These pictures are the only ones I can find of the figures online, and that was from searching without the name, which according to Figure Realm is 'Extra Ordinary', although the link from these images doesn't lead to a page about these figures.\nThese images aren't great, but Bigfoot wasn't articulated, was made of hollow plastic, and came with a stand with his footprints in it.\nI'd love to find a set to buy, but I'd just be happy to get some clearer pictures if anyone has a set.", "media": null, "score": 111, "upvote_ratio": 0.98, "comment_count": 12, "over_18": false}, "73": {"id": "1f3myoi", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Evol-Chan", "link_flair_text": "Discussion/Advice", "time": 1725072775.3143895, "created_utc": 1724885348.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1f3myoi/weird_noises_in_the_living_room/", "title": "Weird noises in the living room.", "permalink": "/r/Thetruthishere/comments/1f3myoi/weird_noises_in_the_living_room/", "selftext": "This is something that happened a while ago. This isn't the most in-depth or interesting story probably but  this is one thing that has happened recently that sticks out to me.  It was  noises coming from the living room. All of my family members were asleep.  I have two cats but one of them were in the room with me, the other, who Is a small cat and was in the living roo, It seems unlike her to be making so much noise like that, which was coming from the PC desk. The noises sounded like a person searching very roughly through the PC desk I use every day. As if they were moving stuff around in a hastily manner, looking for something in a rush.\nThis event came to my mind again last night and I thought how spooked I was when I heard that noise. I had my room's door closed and kept it close with no intent of wanting to check it out. I had a feeling it wasn't any of my family members and it just really spook me, which now that I think about it, me being so afraid of a noise is kind of weird and not really normal for me.\nI asked my sister about this the next day and she said she assumed it was me.  She told me I should of checked out the noise (Seems like she didn't want to check it out either, lol). Also, I know my family, they would never waste precious hours of sleep on any day for a dumb joke. Especially on a weekday.  This all leads to my other cat that is the most likely suspect but its still pretty unlike her.  I have never heard this kind of noise ever again since that night when she , the cat, spends most of the nights in the living room. Also, I felt like I would of heard that noise again if she really enjoyed being on the desk playing around. Her other playmate was in the room with me, although cats can play by themselves but its just seems off to me.\nI have heard tons of stuff that sounded weird to me before but I can reasonable explained. This one just kind of stumps me. And thinking about it today,  I am not sure why I would of even felt scared like I did that night. I have heard noises before from the kitchen and stuff at night that checked out with no problem. When I heard that noise, my mind just went \"That is not my family,  keep my door shut and be alert. \"  Like, I will admit, I am a bit more spook at night but just never like that night.  Maybe I am overthinking it but its been a while and I have never experienced something like that again.\nEdit: I had wanted to ask, forgot to ask. Has anyone ever had a similar experience? ", "media": null, "score": 7, "upvote_ratio": 0.71, "comment_count": 6, "over_18": false}, "74": {"id": "1f1zc18", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "violet_rosess", "link_flair_text": null, "time": 1725072775.5337422, "created_utc": 1724706505.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1f1zc18/a_man_took_pictures_of_me_while_i_was_working/", "title": "A man took pictures of me while I was working", "permalink": "/r/LetsNotMeet/comments/1f1zc18/a_man_took_pictures_of_me_while_i_was_working/", "selftext": "This story occurred a couple of years ago when I was working in my hometown. \nI got hired for a retail job in October of 2020 and it was my first ever job. I was one of those first-time workers who was heavily devoted to pleasing the boss for more hours so as I had become better at my job, I would be assigned the sales section which at the time was closest to our only entrance at the time and faced all the people walking by the store. I had been assigned this section for about two weeks. \nIt was around Christmas time so a few months into me being there and I had already encountered one weird man who was either a dad or an uncle (assumed because he asked me about buying children's clothes for Christmas) where I tried telling him we didn't have what he was looking for. He followed up by asking me if I lived around the area, what else I did other than work, etc. I shot him down when I told him a blatant lie about me not having a phone number to give him or any social media to give him either because I'm not into that. I already felt on edge with this man but what came a few days after had scared me.\nWhile I was working in the sales section, I noticed the men who wouldn't go with their wives into the store next door because of what the store sold, predominantly for women. I would notice a lot of men would wait for their wives outside the store and maybe glance at me fixing clothes. However, there was this one guy who I didn't see have a wife or girlfriend go into the store but he was not simply giving me some glances, he was not hiding the fact that he was looking at me. \nI tried ignoring him because I felt incredibly weird when I made eye contact with a man especially while working. However, I noticed this man was holding up his phone in a way where he was clearly taking a photo or photos of me just working. He held his phone with one hand clearly pressing a button near the bottom and his other hand was cupping the front of the phone, imagine how your parent would be taking a picture of you. He held his phone there for more than a few seconds and just smiled afterward. I told my boss later about it and she asked why I didn't tell her about the man earlier. I explained that I was new to being approached in a work setting, and tried justifying what this guy was doing. I truly don't know why he took this photo of me since I was covered up because of how cold it was and was wearing a mask due to COVID-19. To this random man who was taking photos of me, I hope you deleted them and I hope for my sake, let's not meet again. ", "media": null, "score": 53, "upvote_ratio": 0.89, "comment_count": 4, "over_18": true}, "75": {"id": "1f4exia", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "ramienthedragon", "link_flair_text": null, "time": 1725072775.921039, "created_utc": 1724969170.0, "url": "https://www.reddit.com/r/threekings/comments/1f4exia/is_there_any_rituals_recommended_for_a_beginner/", "title": "Is there any rituals recommended for a beginner?", "permalink": "/r/threekings/comments/1f4exia/is_there_any_rituals_recommended_for_a_beginner/", "selftext": "i've been looking into the rituals in this Subreddit for a bit and while they seem interesting, i feel like the one's i looked at either required a very big bunch of steps, or had dangerous outcomes.", "media": null, "score": 1, "upvote_ratio": 0.67, "comment_count": 1, "over_18": false}, "76": {"id": "1f1777o", "locked": true, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "koalatastic_", "link_flair_text": "Captured Apparition ", "time": 1725072776.6426542, "created_utc": 1724620713.0, "url": "https://i.redd.it/ihwwt9xtmvkd1.jpeg", "title": "thoughts on this picture i took during a power outage?", "permalink": "/r/Ghosts/comments/1f1777o/thoughts_on_this_picture_i_took_during_a_power/", "selftext": "picture wasn't edited beyond me blacking out my moms face. \nthe only two sources of light in the entire picture are the candles on the table and my moms phone (which she had set on the desk in front of her.)\ni didn't take the picture with flash, and the only reason i took this photo at all was to show my friends in our groupchat that we had lost power (i was the only one amongst us who had.)\nthere's no reflective surface of any sort on the wall where the 'eyes' appear to be, no glass, mirror, framed photo, window, etc. \ni'm a bit of a skeptic myself and wanted some extra opinions on this photo, so theorize away! ", "media": null, "score": 209, "upvote_ratio": 0.8, "comment_count": 145, "over_18": false}, "77": {"id": "1f2tsvj", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Pink-Goro", "link_flair_text": "Glitch Pic", "time": 1725072776.9210124, "created_utc": 1724796726.0, "url": "https://i.redd.it/0tlvpn976ald1.jpeg", "title": "Poorly rendered shadows", "permalink": "/r/GlitchInTheMatrix/comments/1f2tsvj/poorly_rendered_shadows/", "selftext": "", "media": null, "score": 21, "upvote_ratio": 0.79, "comment_count": 3, "over_18": false}}}