{"_default": {"1": {"id": "18bg5e0", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Ad1714", "link_flair_text": null, "time": 1702094471.4603775, "created_utc": 1701794443.0, "url": "https://www.dailywire.com/news/schumer-warns-ufo-disclosure-legislation-is-about-to-get-rejected", "title": "Schumer Warns UFO Disclosure Legislation Is About To Get Rejected", "permalink": "/r/ufo/comments/18bg5e0/schumer_warns_ufo_disclosure_legislation_is_about/", "selftext": "", "media": null, "score": 606, "upvote_ratio": 0.97, "comment_count": 92, "over_18": false}, "2": {"id": "18aua4o", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "shogun2909", "link_flair_text": "News", "time": 1702094472.9338403, "created_utc": 1701723821.0, "url": "https://v.redd.it/wbjaslklec4c1", "title": "Senator Schumer blames the House Republicans for trying to kill the UAP provision", "permalink": "/r/UFOs/comments/18aua4o/senator_schumer_blames_the_house_republicans_for/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/wbjaslklec4c1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 636, "scrubber_media_url": "https://v.redd.it/wbjaslklec4c1/DASH_96.mp4", "dash_url": "https://v.redd.it/wbjaslklec4c1/DASHPlaylist.mpd?a=1704686471%2COTgyZGY2Mjc5ZjE5NzJlMmY5Mzg2ZmNlNjJiMWQ2MTAyMWY1ZDNjM2VkYjk3YWJjNTZjOGQ4NDgxYjM1NjIzNA%3D%3D&v=1&f=sd", "duration": 62, "hls_url": "https://v.redd.it/wbjaslklec4c1/HLSPlaylist.m3u8?a=1704686471%2CODA2M2Q5YWE2YjVmZGUzNDMzZTM3Y2Q0MTRkZGQ5OTc3ZDAyYTJiMTZhNmFhNzQ1YTUzZmZkYzg3ZTkwNTEyYQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4154, "upvote_ratio": 0.9, "comment_count": 448, "over_18": false}, "3": {"id": "18ai63x", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "AltF4_Bye", "link_flair_text": "Evidence :upvote:", "time": 1702094474.6465867, "created_utc": 1701688931.0, "url": "https://www.reddit.com/gallery/18ai63x", "title": "MJ-12 Field SOP (Crash Retrieval)", "permalink": "/r/aliens/comments/18ai63x/mj12_field_sop_crash_retrieval/", "selftext": "Came across this interesting field manual doing some research on black projects. I’ve been around the military my entire life  & seen manuals written in almost identical vernacular but for conventional things. From the logs, to the Kirtland AFB stamps, and the detailed instructions..  this thing looks super legit. \nTo make this even crazier on the \n(Recieving Facilities) portion, it looks like a lot of recovered material was as supposed to go the Area-51 (S-4) \nWhoever made it, took a lot of time & dedication doing so.. what are y’all’s thoughts?", "media": null, "score": 1923, "upvote_ratio": 0.97, "comment_count": 480, "over_18": false}, "4": {"id": "18auypx", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Video", "time": 1702094475.5053935, "created_utc": 1701725621.0, "url": "https://v.redd.it/m7lk4oqjjc4c1", "title": "Senator Chuck Schumer on the Senate floor today calls out House Republicans for blocking the UAP Disclosure Act in the NDAA 24.", "permalink": "/r/UAP/comments/18auypx/senator_chuck_schumer_on_the_senate_floor_today/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/m7lk4oqjjc4c1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/m7lk4oqjjc4c1/DASH_96.mp4", "dash_url": "https://v.redd.it/m7lk4oqjjc4c1/DASHPlaylist.mpd?a=1704686474%2CNTU4ODkyOGQ5ZTBiMTVmZDUzNzc4NGQ4NjBlOWQ3MGY3YTVmZjM5ZjNhYjYwYjM1YjdhZDAxYWU3MDJjZmM2Yw%3D%3D&v=1&f=sd", "duration": 57, "hls_url": "https://v.redd.it/m7lk4oqjjc4c1/HLSPlaylist.m3u8?a=1704686474%2CZTFiYzQ1ZTRiODRmNmM1YTRkZTQ0ZjE0ZTM4NjEyMWUxZDU2OGZhYmFiM2EwODA4YzZiOTdlMWU4YTc1MzQ4YQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 848, "upvote_ratio": 0.95, "comment_count": 66, "over_18": false}, "5": {"id": "18b8h0t", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "No-Truth3802", "link_flair_text": null, "time": 1702094476.5102806, "created_utc": 1701769328.0, "url": "https://i.redd.it/s6n5i6bx5g4c1.png", "title": "Well fuck", "permalink": "/r/conspiracy/comments/18b8h0t/well_fuck/", "selftext": "That's just disgusting, no wonder people are struggling to be able to purchase homes.", "media": null, "score": 2875, "upvote_ratio": 0.97, "comment_count": 392, "over_18": false}, "6": {"id": "18bhvv9", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "meSh_1985", "link_flair_text": null, "time": 1702094476.8494098, "created_utc": 1701798984.0, "url": "https://v.redd.it/w0i8bwj2mi4c1", "title": "Trump isn´t one of yours, never was.", "permalink": "/r/conspiracyfact/comments/18bhvv9/trump_isnt_one_of_yours_never_was/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/w0i8bwj2mi4c1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/w0i8bwj2mi4c1/DASH_96.mp4", "dash_url": "https://v.redd.it/w0i8bwj2mi4c1/DASHPlaylist.mpd?a=1704686476%2COTBkMTUwN2YyNzEwNTgwMWYwMTM5NDRiYTU4OTJlNjdjMjI1MWRlY2RlMjEwN2I3ZmU5YmNlOTFmZDNlYjNjZQ%3D%3D&v=1&f=sd", "duration": 101, "hls_url": "https://v.redd.it/w0i8bwj2mi4c1/HLSPlaylist.m3u8?a=1704686476%2CNzA0YTNkMWI2MGMyOTdlNjZjMmMxYzQzYzdhNzdhYTgzODVlYjg1Y2JjOGJhYjMxZWRmZTk2M2JjYTNlMzM0OQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 38, "upvote_ratio": 0.88, "comment_count": 11, "over_18": false}, "7": {"id": "18bqijm", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Sunshine9227", "link_flair_text": "bigfoot sign/cutout/statue/etc", "time": 1702094477.6276467, "created_utc": 1701820844.0, "url": "https://i.redd.it/nsmgb8y3fk4c1.jpg", "title": "Just saw in Gainesville, FL", "permalink": "/r/bigfoot/comments/18bqijm/just_saw_in_gainesville_fl/", "selftext": "", "media": null, "score": 201, "upvote_ratio": 0.92, "comment_count": 18, "over_18": false}, "8": {"id": "18dpcx5", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Discussion ", "time": 1702094478.1879818, "created_utc": 1702049623.0, "url": "https://i.redd.it/p6xlixkab35c1.png", "title": "Discussing cryptozoology can be rough online", "permalink": "/r/Cryptozoology/comments/18dpcx5/discussing_cryptozoology_can_be_rough_online/", "selftext": "", "media": null, "score": 277, "upvote_ratio": 0.93, "comment_count": 70, "over_18": false}, "9": {"id": "189jhkg", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "speaknowow", "link_flair_text": "Personal", "time": 1702094478.3653092, "created_utc": 1701570805.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/189jhkg/there_is_something_in_my_yard/", "title": "There is something in my yard", "permalink": "/r/Humanoidencounters/comments/189jhkg/there_is_something_in_my_yard/", "selftext": "I live in a small wooded area in a small city in Kentucky. A couple weeks ago, November something-th, I was taking my dog outside. My dog’s legs were going out and she couldn’t walk very well cus she was old (she was put down earlier this week.) So she’s taking a while. I stand out there with her to make sure she’s okay. She liked to go in the backyard to do her business. She’s doing said business, and I hear footsteps in the woods. I assume it’s a deer or something and just tell my dog to hurry up. The steps sounded like they were all over the place. Close then far then close again. Once they sounded really close, I got my dog inside. Since I’m an idiot, I went back outside to check it out. \nAgain, I hear footsteps and again, they’re all over. Then it was suddenly really close and I saw a parting in the bushes and it was HUGE. I ran to my house as fast as I could (and I think I sprained my ankle while doing so lol) and didn’t look back.\nThe next day, I’m taking my dog out again. This time, I heard a sort of whispering (?) from all around me in the woods. Once again, told my dog to hurry tf up and got inside. \nMaybe this part is unrelated, but Tuesday this week, an old man in a bright orange jacket and a cane and a hat was walking up and down my road back and forth for about 4 hours. Btw, it was like 20 degrees out that day. As soon as I pointed him out to my mom, he was gone, never saw him again. My house has cameras, so I went back through the footage to see if I could find videos of him. You know what I found? Nothing. Absolutely nothing. Despite me seeing him on our cameras multiple times. \nDon’t know what it is. I’ve just had a lot of strange encounters since that day I took my dog out and it’s freaking me out.\nedit to explain why seeing the guy was really weird: i don’t really live in a neighborhood and i don’t have any neighbors actually. there’s my house, then road, and a lot of people have died on my road so it’s not a place people walk on, there’s no sidewalk or anything, just road then woods. so seeing some guy walking on it for hours was really strange and not at all something i’ve seen while living there. might not be related and i might be paranoid or on edge, just a lot of strange occurrences that happened since that first one and something isn’t right.", "media": null, "score": 272, "upvote_ratio": 0.93, "comment_count": 122, "over_18": false}, "10": {"id": "18c81t1", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Pool_True", "link_flair_text": null, "time": 1702094479.1858878, "created_utc": 1701880905.0, "url": "https://i.redd.it/rzhl9vfpdp4c1.jpg", "title": "What evolutionary advantage would a Jackalope's horns give it?", "permalink": "/r/cryptids/comments/18c81t1/what_evolutionary_advantage_would_a_jackalopes/", "selftext": "Long time believer, first time redditer. I've actually seen a Jackalope back when I lived in Southern Arizona. But I always wondered what the horns on the Jackalope would give it as far as any kind of evolutionary advantage? \nI understand how evolution works. Random mutations that when beneficial end up passed down to their descendants, thus a new species is born. That being said, a creature of that size with such light bone structure wouldn't be able to make very good use of the horns as a weapon. Jack rabbits don't live in burrows but if one were to dig the horns would just get in the way. They might even make the Jackalope top heavy and therfore mess with their speed, balance, and ability to jump. \nIt not being very beneficial might explain the species population being small enough that many don't believe they exist. So tell me what do you guys think. Are the horns on a Jackalope truly useless, or is there something I'm missing?", "media": null, "score": 179, "upvote_ratio": 0.95, "comment_count": 92, "over_18": false}, "11": {"id": "18arwvb", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "garden_fairy_333", "link_flair_text": "Child Sensitivity", "time": 1702094479.293903, "created_utc": 1701717830.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/18arwvb/waking_up_and_seeing_foggy_misty_people_standing/", "title": "Waking up and seeing foggy/ misty people standing around my bed as child", "permalink": "/r/Thetruthishere/comments/18arwvb/waking_up_and_seeing_foggy_misty_people_standing/", "selftext": "I was reflecting on a recurring childhood experience. I've openly discussed it with friends, but no one shares the same childhood memory. Curious, I've come to Reddit to see if anyone else has had a similar experience.\nAs a child, I had incredibly vivid dreams and struggled with falling asleep alone, a challenge that persists slightly to this day. Between ages 9-10, I often woke up in the night to see several white smokey/ misty figures standing at the end of my bed. They appeared to be conversing and I knew it was about me, but I couldn't hear them. This used to understandably scare me. After multiple occurrences over the years, one night, I asked them if they needed to watch over me could they please do it without being visible because seeing them made me scared, and I never saw them again after that. Has anyone else had a similar experience?", "media": null, "score": 44, "upvote_ratio": 0.87, "comment_count": 19, "over_18": false}, "12": {"id": "18aukwy", "locked": true, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Putrid-Assistance-27", "link_flair_text": null, "time": 1702094479.4398472, "created_utc": 1701724616.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/18aukwy/my_ex_boyfriend_sex_trafficked_me_and_i_want_to/", "title": "My ex boyfriend sex trafficked me and I want to press charges 10 years later", "permalink": "/r/LetsNotMeet/comments/18aukwy/my_ex_boyfriend_sex_trafficked_me_and_i_want_to/", "selftext": "I met my ex online when I was 19. When we began dating, I was shunned from the small Pentecostal church I grew up in my entire life. So naturally, as a 19 year old i clung to him because everyone I was allowed to know had cut me out of their life. Why did they cut me off? Well the believed I was “unequally yoked with a nonbeliever” because I was dating a black man with long hair who listened to AC/DC. I thought they were judgmental and I was drawn to the outcasts because I felt I understood them.\nMy relationship with him was great for the first two years. I was incredibly inexperienced in his eyes sexually, he made me feel inadequate. The dynamic of our relationship was that he was 3 1/3 years older, knew much more about life than I did, and that I should listen to his advice on things because he knew better than I did. \nAround the two year mark of being together, I noticed he stopped going to bed with me, he was staying up late and doing things on his computer. I later found out he was sending nsfw photos to other women and getting them in n return. When I confronted him he simply said well are you leaving me? And I was heartbroken, felt I only had him, so I stayed. He explained that he felt he had “met the right person at the wrong time” explaining he felt I was his person but he didn’t get to show his wild oats so to speak… I was devastated because essentially he told me he wanted to fuck other people. That’s when he pressured me into the swinging lifestyle.\nIt started out with meeting other couples. He arranged everything, he dressed me and took photos of me.. he spoke as me to these other people in order to get play dates. When the “play dates” would happen he couldn’t get hard, and then he blamed me for his insecurities. I felt almost mindfucked into doing whatever I could to make him happy/satisfied. You might ask me why I didn’t just leave… well he convinced me my friends and family didn’t love me or support my decisions in life. He was an elaborate thinker, he had a reason for everything. He knew how to play on my emotions knowing I cared for him, he spun everything in a way to make me feel he was caring for me and wanted to see me in the third person. I was treated as his “property” or prized possession. \nHe began controlling how I dressed, and started setting up dates with men I didn’t know requesting that I take videos and pictures to share with him later on. I’ve always been a one man type of girl. This was so out of my element and I didn’t feel safe,  it I didn’t feel I could speak up or he would believe I didn’t trust him. I began going on these “arranged play dates” with men to make him happy. Each time nearly having a panic attack not knowing the situation I was walking into. One time coming back from a play date, the man had claimed he recorded our session for me but recorded the wall instead. That was the first time he physically laid hands on me. \nI learned the coping mechanism of disassociation very quickly… I entered survival mode and made myself into someone else to make him happy, and when I was at home I was me. \nUntil one evening where he told me he arranged a playdate for me, while simultaneously he quit his job. I was confused. Why would you just quit your job without discussing with me first? I went on this “play date” and met a man I would’ve never touched with a 10 foot pole, who was offering me 200$ to have sex with me. I was stunned/horrified/and felt like I was living in a dream. He had quit his job and when I confronted him on arranging a paid exchange for sex with a man who I would’ve never touched, his response was it was my turn to provide for us. Rent was due in 2 weeks and we had 30$ in our bank account. I felt I had no choice. \nThis went on for 5 months. He put me in lingerie, took photos of me in any position you could think of, put them on escort websites with an alias name and a text app to text clients. I never was allowed to keep the money, have a say in who I saw, and at the end of every weekend he would thank me by a nice dinner and keep the rest of the money to fix up his busted 1974 Ferrari. Afterwards I would lay in bed and just cry myself to sleep. I told him so many times I wasn’t happy doing this but he told me we needed to pay our bills. He was intimidating, demeaning and a shell of the man I thought I loved. \nMy last client I ever had was law enforcement. They knew about him because he would stay in the lobby while I met clients. They separated me from him and asked me to tell them what my partner was making me do. I lied to them and told them I was compliant and a willing party because I was taught not to be a snitch or trust law enforcement. I got a misdemeanor charge for prostitution, I left him 2 weeks later while he was at his new serving job, packed all my shit and went back home. \nThis was 2014. Since then I’ve gotten married and had two children. But I recently discovered videos of me that he uploaded on porn sites that have been there since 2014. One of them shows my face in it with over half a million hits. Is it too late to press charges for sex trafficking? This was in the state of Virginia. The video of my face on this porn site was a private video with my ex and I. I need it to be removed. I have a career and I have three brothers and. Have a husband and children who never need to learn about this. I don’t know my rights but I don’t know how to handle this situation because I’ve avoided it since I escaped that life and now all these feelings are flooding back to me. He has stolen my innocence, made me feel shame for telling my story, lied on my name to everyone we know to cover himself. He’s now married in a different state but has me blocked on all accounts but I have access to his wife’s page. What would you do and any advice???", "media": null, "score": 581, "upvote_ratio": 0.9, "comment_count": 87, "over_18": true}, "13": {"id": "18d7n7l", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "itsst1324", "link_flair_text": null, "time": 1702094479.603822, "created_utc": 1701988496.0, "url": "https://i.redd.it/v1l6xfem9y4c1.jpeg", "title": "Can you explain me this?", "permalink": "/r/truecreepy/comments/18d7n7l/can_you_explain_me_this/", "selftext": "I saw this in my frnds gallery", "media": null, "score": 42, "upvote_ratio": 0.8, "comment_count": 15, "over_18": false}, "14": {"id": "189ralb", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "L3xi_Gr4ce_Ny1a", "link_flair_text": null, "time": 1702094479.7160633, "created_utc": 1701601400.0, "url": "https://www.reddit.com/r/threekings/comments/189ralb/red_door_yellow_door/", "title": "Red door yellow door", "permalink": "/r/threekings/comments/189ralb/red_door_yellow_door/", "selftext": "Me, my sister (Nyla), and my best friend (Grace) were playing red door yellow door. Nyla and Grace could both get into the game but I couldn’t. Mine started to form but then stopped after a little bit of a hall way formed. Any tips or help you can give to help me get into the game? It would be appreciated!\nThank you for reading.", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 4, "over_18": false}, "15": {"id": "18bm0ec", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "GrumblyGoose", "link_flair_text": "WDYT? (What Do You Think?)", "time": 1702094480.275204, "created_utc": 1701809502.0, "url": "https://www.reddit.com/gallery/18bm0ec", "title": "Was on a ghost walk in Charleston. Regular picture and zoomed in.", "permalink": "/r/Ghosts/comments/18bm0ec/was_on_a_ghost_walk_in_charleston_regular_picture/", "selftext": "", "media": null, "score": 840, "upvote_ratio": 0.84, "comment_count": 238, "over_18": false}, "16": {"id": "18dxr71", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Cactive", "link_flair_text": "Glitch Pic", "time": 1702094480.4586654, "created_utc": 1702072467.0, "url": "https://www.reddit.com/gallery/18dxr71", "title": "My unbroken locket has just fallen off the unbroken/unopen chain on my neck! Absolutely confused how this can happen?", "permalink": "/r/GlitchInTheMatrix/comments/18dxr71/my_unbroken_locket_has_just_fallen_off_the/", "selftext": "", "media": null, "score": 83, "upvote_ratio": 0.85, "comment_count": 23, "over_18": false}, "17": {"id": "18a1q5d", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "ForestedBlues", "link_flair_text": "Article", "time": 1702094482.2743928, "created_utc": 1701633404.0, "url": "https://agitator.substack.com/p/sean-kirkpatricks-new-job-is-at-a", "title": "Sean Kirkpatrick's new job is at a UFO hotspot run by the Department of Energy and Battelle Institute", "permalink": "/r/ufo/comments/18a1q5d/sean_kirkpatricks_new_job_is_at_a_ufo_hotspot_run/", "selftext": "", "media": null, "score": 482, "upvote_ratio": 0.97, "comment_count": 69, "over_18": false}, "18": {"id": "18askmz", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "CreditCardOnly", "link_flair_text": "Photo", "time": 1702094483.5030243, "created_utc": 1701719486.0, "url": "https://i.redd.it/oru9iayp1c4c1.jpg", "title": "Ross Coulthart: “The UAP Disclosure Act has been gutted.”", "permalink": "/r/UFOs/comments/18askmz/ross_coulthart_the_uap_disclosure_act_has_been/", "selftext": "", "media": null, "score": 3638, "upvote_ratio": 0.86, "comment_count": 1066, "over_18": false}, "19": {"id": "18b1de4", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "AbrocomaElectrical63", "link_flair_text": "Evidence :upvote:", "time": 1702094485.149643, "created_utc": 1701743156.0, "url": "https://www.reddit.com/r/aliens/comments/18b1de4/official_bombshell_document_reveals_that_roswell/", "title": "Official BOMBSHELL Document Reveals that Roswell Was Real and a USAF intelligence officer met two aliens at a prearranged location in the Desert", "permalink": "/r/aliens/comments/18b1de4/official_bombshell_document_reveals_that_roswell/", "selftext": "​\nWelcome to Project Aquarius, Project SIGMA, Under the Umbrella of MJ-12\n​\nConfirmation that Roswell Did Happen\n​\nUSAF Made First Hand Contact with Exotic Beings\nLink to Official Documents\nRonald Reagan Library: Document\nFBI Gov: \"BOGUS\" LOL\nAuthenticity of these Documents at 90%, these documents corroborate what witnesses have stated has happened on Roswell\nWhat do YOU Think?", "media": null, "score": 1528, "upvote_ratio": 0.91, "comment_count": 327, "over_18": false}, "20": {"id": "18bk8d9", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Article", "time": 1702094485.8840127, "created_utc": 1701805010.0, "url": "https://thehill.com/opinion/national-security/4341947-powerful-members-of-congress-are-dead-set-on-killing-ufo-transparency/", "title": "[The Hill] Powerful members of Congress are dead-set on killing UFO transparency", "permalink": "/r/UAP/comments/18bk8d9/the_hill_powerful_members_of_congress_are_deadset/", "selftext": "", "media": null, "score": 369, "upvote_ratio": 0.96, "comment_count": 48, "over_18": false}, "21": {"id": "18br99x", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "4FR33D0M", "link_flair_text": null, "time": 1702094486.8084693, "created_utc": 1701822939.0, "url": "https://www.reddit.com/r/conspiracy/comments/18br99x/a_dude_snuck_into_bohemian_grove_and_posted_the/", "title": "A dude snuck into Bohemian Grove and posted the video 3 days ago", "permalink": "/r/conspiracy/comments/18br99x/a_dude_snuck_into_bohemian_grove_and_posted_the/", "selftext": "Seriously why aren’t we talking about this?\nhttps://youtu.be/reHm2F-CBxY\nDude uses a child’s kayak and a cast iron pan as a paddle, sneaks into Bohemian Grove, runs around for awhile, and posted the video on December 2. \nThere’s a building with a poster on the wall for the movie Kidnapped.\nHe finds the owl and it’s hollow. He gets a closeup of the ritual bowl in front of it. \nSo many other things - and it’s all in 4k.\nEDIT: there’s a guy who walked into BH in 2022 during the day and took video inside several buildings. He even took a seltzer from their refrigerator.\nHere’s one reel but there are several. \nhttps://www.instagram.com/reel/CrM8_89xHpz/", "media": null, "score": 2173, "upvote_ratio": 0.94, "comment_count": 408, "over_18": false}, "22": {"id": "189zgjw", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "deanmanga", "link_flair_text": null, "time": 1702094487.1559072, "created_utc": 1701627463.0, "url": "https://i.redd.it/xz4u0azywx3c1.png", "title": "Yes, discounts and sales these days are just an illusion to trick the consumer. You're actually paying full price.", "permalink": "/r/conspiracyfact/comments/189zgjw/yes_discounts_and_sales_these_days_are_just_an/", "selftext": "", "media": null, "score": 12, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "23": {"id": "189cj31", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Cosmicmimicry", "link_flair_text": "photo", "time": 1702094487.8865304, "created_utc": 1701549386.0, "url": "https://www.reddit.com/gallery/189cj31", "title": "Found the \"second\" photo", "permalink": "/r/bigfoot/comments/189cj31/found_the_second_photo/", "selftext": "The story that goes along with this photo is from a lady, who was out in the woods walking when she suddenly began to feel a sense of anxiety, and dread. \nAfter the feeling began to escalate, she used the photoburst mode on her phone and spun around capturing this.\nI assumed there were multiple photos, but it is just the one, with a brightened version that has been shared with relative frequency.\nCould very well be a model, puppet, or potentially even an ai generated image. But if it's none of those then it is a photo of a genuine sasquatch.", "media": null, "score": 183, "upvote_ratio": 0.84, "comment_count": 128, "over_18": false}, "24": {"id": "189t8ph", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Cheliceratan", "link_flair_text": "News ", "time": 1702094488.3692195, "created_utc": 1701609204.0, "url": "https://i.redd.it/sjwy7pssx24c1.jpeg", "title": "The Vangunu Giant Rat (Uromys vika) captured on camera for the first time in Nov. 2023. Previously only known through holotypes and local legend.", "permalink": "/r/Cryptozoology/comments/189t8ph/the_vangunu_giant_rat_uromys_vika_captured_on/", "selftext": "Lavery et al.: https://onlinelibrary.wiley.com/doi/10.1002/ece3.10703", "media": null, "score": 183, "upvote_ratio": 0.98, "comment_count": 25, "over_18": false}, "25": {"id": "18buvv7", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Ufonauter", "link_flair_text": "Abduction Event", "time": 1702094488.528673, "created_utc": 1701833880.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/18buvv7/in_2001_a_man_would_experience_an_abduction_like/", "title": "In 2001 a man would experience an abduction like none other, as he is rescued from his captors by other alien beings.", "permalink": "/r/Humanoidencounters/comments/18buvv7/in_2001_a_man_would_experience_an_abduction_like/", "selftext": "Reported to NUFORC in 2007, this anonymous report would detail one of the most spectacular abduction experiences as well as a potential origin point for the phenomenons most infamous entity. The following is the text from said [encounter] (https://nuforc.org/sighting/?id=57243) (edited slightly for spelling errors on the original posters end).\nThis is a recounting of an abduction experience I've had about 6 years ago. Nobody knows about it, or the other countless abductions I've had for as long back as I remember. The first time I remember there being quiet bright lights in the sky above the back yard. I felt this strong urge to go outside and check it out. and when I did, they took me. And they've been taking me ever since. Sometimes they'd come for me, other times they called me and I would have no choice but to them. I did tell my parents about it once, as a little kid, around 6 years old, when the Greys left me in my living room instead of dropping me back in my bedroom. They blamed it on sci-fi movies and videogames and I got yelled at for making up stories. That was the only time I tried to tell anyone. When I moved from home into my apartment, I slept with a 9mm. under my pillow for months, but I was always paralyzed when they would come for me, so that idea was a bust. Setting up video cameras in my bedroom proved ineffective as well. In the morning, the tapes would be blank, like I never set them to record at all. And after a while, the fear disappeared from the abductions and I started to accept that getting pulled out of my room on random nights was just something I'd have to deal with.\nOne night in July of 2001, I was abducted. It seemed business as usual. I was called to the room of my apartment and then the flash filled my eyes, and when it cleared, I was laying on the table again. The grays usually planted dozens of acupuncture type needles in my chest, stomach, neck. Rarely they would insert a tube into my ear or throat which was quite painful. This time was the tube in my throat. As the machine was being prepared, several of the grays seemed to rush in from another room. They spoke to the ones about to experiment on me, and they all ran from the room. I felt a rumble in the table I was laying on and heard a loud explosion, followed by what seemed to be weapons fire. Several minuets passed and then a tall, armored figure wearing a blank faced mask entered the room, carrying a type of weapon, resembling an assault rifle. The figure removed the mask to reveal a very canine like face, with bright orange eyes, covered by short, blue fur. The usual abduction experience was frightening, but seeing this new creature made me feel like my heart would beat out of my chest. The being leaned over the instrument table the grays kept their tools on and began touching the objects there. Suddenly I could move again. The creature came over to me and gently helped me into a sitting position on the table. Then, in plane English, asked if I was alright. I told her(I say 'her' because the voice of the being sounded most definitely female to me) yes and asked what was happening. I rose from the table, and she led me from the exam room. Outside the room, in the large halls of the ship, there were dead bodies of grays around every corner. Creatures like her, and several other new strange creatures were at control panels and moving about the ship. The creature introduced herself at this point as Boudica(boo-dee-ca) and told me that this ship was going to be destroyed. I asked her why and what was going on. She then explained to me something I never thought of in all the time I was being abducted: The grays, in reality were a cybernetic lifeform created by Boudica's race and more than 3 dozen other races in contact with each other on the other side of the Milky Way. Centuries ago, they formed a union with each other to establish trade, travel and the discovery of new lifeforms across the universe. However, space travel was a long, difficult affair. So these large, strong alien races created the small, weak looking grays as sort of advanced scouts, used to seek out, examine and greet new intelligent lifeforms as they found it. They gray body design was chosen because the alien union thought that body shape the least threatening. They in general being tall and muscular, they couldn't see the gray body type being a threat to anyone.\nAs I proceeded through the ship, I noticed gray bodies being carried through the hall, some in pieces. And sure enough, in the open wounds of the grays there were servos, wires and components I could not identify in my limited experience. Boudica took me to a room filled with several other large aliens. One alien, an 8 foot tall being who appeared to have a reptilian face with a feathery red crest around its head, asked how long they grays had been taking me. I told him(?) the last 15 years and he apologized to me for all the pain and trouble I've been through. Then he promised me I'd never have to go through any of that again. Boudica told me I'd have to be put to sleep to be transported back to my apartment, because they didn't fully understand the methods the grays used to teleport people from place to place. She took a long rod like instrument from the control panel and waved it once in front of my face. That is the last I remembered from the gray ship.\nIt has been more than 6 years since I've been abducted. I've tried to make sense of the events on the gray's ship that night. As far as I can figure, they grays were supposed to be a scouting party to survey newly discovered intelligent races in secret. For whatever reason, they failed their mission, and would not stop abducting people and experimenting on them. So, the Alien union who created them is now in the process of finding and destroying them. It is my belief that when the Alien union finally destroys the threat to Earth posed by the grays, then they might finally make their existence known to humanity and induct us into their collection of races across the universe.", "media": null, "score": 148, "upvote_ratio": 0.94, "comment_count": 29, "over_18": false}, "26": {"id": "18b43wm", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "houselegs", "link_flair_text": null, "time": 1702094489.2983816, "created_utc": 1701751774.0, "url": "https://i.redd.it/cl7zzo9qpe4c1.jpg", "title": "I made some playing cards with my Mothman painting", "permalink": "/r/cryptids/comments/18b43wm/i_made_some_playing_cards_with_my_mothman_painting/", "selftext": "", "media": null, "score": 74, "upvote_ratio": 1.0, "comment_count": 9, "over_18": false}, "27": {"id": "18bavsb", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "fenangle", "link_flair_text": "Discussion/Advice", "time": 1702094489.4001782, "created_utc": 1701779176.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/18bavsb/astral_projection_lights/", "title": "Astral projection, lights", "permalink": "/r/Thetruthishere/comments/18bavsb/astral_projection_lights/", "selftext": "I have been practicing astral projection. I started with the gateway and have had some pretty amazing experiences. (Pretty much everything they talk about during \"death and back\" stories)  About 2 months ago, I started to see white stars that once focused on, start to move and form geometric shapes. In the beginning, a circle, the next time a triangle, and last was a metatrons cube. Once the geometric shape forms, it comes flying at me and it goes into my head and I'm off in the astral. Last night, while in my meditative state, I saw blue stars. They were not forming geometric shapes though. There were 4 of them and they were forming a straight horizontal line, then moved up in sequence from right to left, each blue star lower than the previous. Like a wave. I've never seen blue stars, they were harder to focus on. Any ideas what all these lights are, or if the color has any significance? I did not project with the blue lights, I couldn't focus on them.", "media": null, "score": 6, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "28": {"id": "1897j1k", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Burnt_Rat13", "link_flair_text": null, "time": 1702094489.5425377, "created_utc": 1701535209.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1897j1k/i_almost_got_kidnapped_by_a_fake_hotel_employee/", "title": "I almost got kidnapped by a fake hotel Employee", "permalink": "/r/LetsNotMeet/comments/1897j1k/i_almost_got_kidnapped_by_a_fake_hotel_employee/", "selftext": "This happened when I was 10 years old. I was at a ski resort with my dad, stepmom, and 3 sisters. \nwhen this happened my 2 sisters, dad, and stepmom were still out skiing but me and my sister Ava got cold so we went back to the hotel to get some food. We sat at the restaurant in the hotel until my step mom came down. We asked her if she could hold the table so we could go up to the room quickly so that we could drop off our ski jackets. So take the elevator and once we get off we start to walk too our room. That’s when I hear someone behind me go “hey!” (Keep in mind we were both about 11 at the time) i didn’t think he was talking to us so i just ignored it. We walked into our room but before we can close the door the man steps in the door way he was tall probably about 6 ft and looked pretty old Mabey about in his early 60’s or late 50’s and he was wearing the hotel staff uniform but just without the logos. The thing that raised a big red flag was that he was wearing black surgical gloves. He says “hey i was talking to you” we spin around caught off guard. Ava says “ Us?” He goes “ya you, I was wondering if you could grab a pitcher for me and come into my room to poor some water for me” our parents always told us never trust strangers and we already got a bad vibe from him so we politely declined. His tone then got a bit annoyed and he said “it will just take a second can you please just poor me some water in my room” at this point we already knew this wasn’t right so we said no again. This conversation went back and forth for about 3 mins until he tried to walk into our room. Our instincts kicked in at this point and I ran words the door and said “sir we are good” and I slammed the door on him. Ava and I sat in the hotel room for about 10 min panicking on how we are going to leave to talk our parents because we had left our phones downstairs. We looked out of the peephole and he was gone so we bolted down the hallway and ran back down the stairs to the restaurant. Once we told our stepmom she was mortified and went to office security. They interviewed us and asked for his description because they didn’t have any cameras in the hallway. We gave them the description and they told us that nobody with that description worked there and that most of them were young broke  collage students. At this point it really set in that if I had accepted and just helped him I might have died. So everyone teach your kids stranger danger and creepy hotel guy let’s not meet again", "media": null, "score": 259, "upvote_ratio": 0.97, "comment_count": 7, "over_18": true}, "29": {"id": "18bn28m", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "internetgrrll", "link_flair_text": null, "time": 1702094489.6985984, "created_utc": 1701812121.0, "url": "https://www.reddit.com/r/truecreepy/comments/18bn28m/footprintsfingerprints_pt2/", "title": "Footprints/Fingerprints Pt2", "permalink": "/r/truecreepy/comments/18bn28m/footprintsfingerprints_pt2/", "selftext": "wow I NEVER expected to have to make a part two on this. \nmy roommate says that person has come back 3 times after when i wasnt there and banged on a different window. \nI was on the phone with my friend and had youtube on in the background and as my friend is talking I hear the metal of the ac unit bend, like someone was climbing on it again. I freeze and I tell my friend to stop talking. I don't hear the tapping this time but in my stupid white girl fear state, I look outside and see a fully black figure crouched down, looking up at the window. thankfully, that person didn't see me and I didn't get any kind of description of them because my vision is very bad (-4.00 vision). I'm fucking terrified at this point, should I involve the police?? I'll probably have the video I took on a different subreddit, and I'll link it in the comments. we've already ordered cameras to put up and around. is there anything else I could do???? I'm worried for my safety at this point. here's part 1 and the video to go with it", "media": null, "score": 6, "upvote_ratio": 0.87, "comment_count": 5, "over_18": false}, "30": {"id": "18a8hhq", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "PhatTumbleweed", "link_flair_text": "Personal Encounter ", "time": 1702094490.4892592, "created_utc": 1701651777.0, "url": "https://www.reddit.com/r/Ghosts/comments/18a8hhq/two_people_died_in_our_new_house_and_no_one_found/", "title": "Two people died in our new house and no one found the bodies 3 weeks.", "permalink": "/r/Ghosts/comments/18a8hhq/two_people_died_in_our_new_house_and_no_one_found/", "selftext": "6 months ago, my wife (27) and I (32) bought a house (200k) in a small town in raual Texas, everyone knows everyone kind of town. During closing, we went to get the house insured. Come to find out, there was an 80k open insurance claim on the property. Digging into this, the grandparents of the estate passed away. No one found them for 3 weeks. They family used the money to clean out, disinfect. In Texas, you only have to disclose murder and I think suicide. Not death from natural causes.  \nAnyway, we bought signed at closing, and the very next day, I have to be in Cleveland, Ohio, for work. We didn't actually move into the house until almost a month later. That next day, my wife was moving stuff into the house. She came in and yelled, \"This is my house now. You need to leave!\" The front door opened. \nThe first night stayed in the house, at about 11 pm. we heard this loud bang, coming from the bathroom next to our bedroom. We didn't think anything of it. Act like we didn't hear it. We go to bed. The next morning, we woke up, and our sons bath toys had fallen in the bathtub. No biggie. I go to take a shower, and my wife goes to make coffee. While I'm getting out of the show, I start to hear our Echo Show start speaking. My wife runs into the room screaming, \" What did you just ask echo?\" I said, nothing. She then proceeded to get on the Alexa app. The echo heard, \"echo, what year was,\"? Answers with \"2021\" are pretty creepy. Since that day, we have encountered the following events. \nOwls, whoing right outside our window at night. Next-door neighbors never hear them. They have a pool and hot tub, and they're outside all the time. \nThe doorbell rings, and no one is there. We have a ring. I've checked voltage from the transformer. Called ring and everything fine. \nWe will have Netflix paused, and it will start playing again by itself. \nOur dog ( American Pit ) never barks. He sleeps with us every night. Will just randomly start growling and barking in the middle of the night. \nWe have put our baby down a few times. He usually bounces for a bit more than passes out. A few times, he will be out cold around 1130PM. to 1AM. He will just start laughing, like peak comedy. \nLights will turn off. I've since changed out the switches and got a new electric panel with a surge protector. They still turn off randomly. \nMy little brother is all about facts and stayed with us the night of Thanksgiving. We decided to have a fire and listen to the coyotes and owls. I have my old truck packed by my old barn about 11 pm that night. we saw what looked like a beam on light without the throw of a flash light hit the front of my truck. He kind of tripped us out, but he seemed to think it was a shooting start reflecting off my truck.\nMy wife has this system of washing the bedding. We each have our own blanket. So she will wash two one week and use the other two the next week. We lost a blanket. I mean, we have looked everywhere. The attic, every corner of the house, even looked the chimney, we have no clue where it went. It is a king-size blanket. We have since jokingly blamed my parents. \nWe had guests over that don't know about anything going on in the house, and some people will just get a sick feeling out of nowhere. \nJust a few odd things.\nEDIT: Both of their obituaries read the same date. The only thing we got from their old insurance agent. They both passed away, and no one found them for 3 weeks. \nDuring our housing inspection, the inspector found both chimney flues were rusted shut. I was talking with one of my neighbors. He said it was the \"slight killer, they forgot to open the flue.\" I told him both flues are rusted shut. \nAnother neighbor said, \"They knew the lady had Alztimers, and she was always looking out the front window. They went to say they think. The man fell, and the lady couldn't survive without care. \nWe are not really scared, just annoyed. Also, everyone in this small town knows what happened here. At least the story of them passing and not finding out for a few weeks. \nWe know a good number of people and some bruja's my wife knows have come over. Didn't seem to do anything, but it's like once a month something odd happens. ", "media": null, "score": 680, "upvote_ratio": 0.92, "comment_count": 181, "over_18": false}, "31": {"id": "18ah88b", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "PinguinBen", "link_flair_text": "Glitch Pic", "time": 1702094490.6658854, "created_utc": 1701684882.0, "url": "https://i.redd.it/l3gdtfqt694c1.jpeg", "title": "Snowy patch doesn’t want to melt", "permalink": "/r/GlitchInTheMatrix/comments/18ah88b/snowy_patch_doesnt_want_to_melt/", "selftext": "", "media": null, "score": 43, "upvote_ratio": 0.84, "comment_count": 9, "over_18": false}, "32": {"id": "18aleh4", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "mindracer", "link_flair_text": null, "time": 1702094491.7166016, "created_utc": 1701700257.0, "url": "https://www.mediaite.com/news/there-is-something-real-here-some-level-of-ufo-knowledge-is-being-covered-up-by-govt-journalist-and-congressman-tell-chuck-todd/", "title": "‘There IS Something Real Here’: Some Level Of UFO Knowledge Is Being Covered Up By Gov’t, Journalist And Congressman Tell Chuck Todd", "permalink": "/r/ufo/comments/18aleh4/there_is_something_real_here_some_level_of_ufo/", "selftext": "", "media": null, "score": 369, "upvote_ratio": 0.97, "comment_count": 44, "over_18": false}, "33": {"id": "18aaoxx", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Boonshark", "link_flair_text": "News", "time": 1702094493.1220975, "created_utc": 1701658809.0, "url": "https://www.reddit.com/r/UFOs/comments/18aaoxx/urgent_danny_sheehan_call_to_arms_lets_mobilize/", "title": "URGENT - Danny Sheehan call to arms - let's mobilize the UFO community now", "permalink": "/r/UFOs/comments/18aaoxx/urgent_danny_sheehan_call_to_arms_lets_mobilize/", "selftext": "This is your moment, you've lived all of your life on the sidelines and now you can be part of the biggest moment in human history. You need to upvote this post if you care about this topic.\nIn That UFO Podcast, Danny Sheehan pleaded for support from our community, this means you!\nThere are corrupt forces fighting against us, you can help. Firstly you can help by at the very least upvoting this post, but please consider not just being a spectator and contacting the members of Congress concerned (easy to do, template provided below)\nSheehan said:\n\"The bottom line is, is that we are at a extraordinarily important pivot place in history, right now. This is one of the most important events in all of human history. That's taking place right in front of you right now.\nAnd so, what you want to do is not be your spectators in this. You want to exercise your authority in every single government. Every single country in the world and turn your focus on the United States government right now and these members of Congress and write to them and call them and email them. Go on the internet and find out what the what the email addresses are for these for these senators in congress, people in communication with them, \nWhat we have to do is submit to them this overflow of information coming in from the citizenry around the world demanding, that this bill be put into the National Defence. Authorisation Act and be operational. That's what we have to do. We want to do this before the kind of weird chaos that might ensue around the 2024 election.\"\nStarts at 51:47secs\nhttps://youtu.be/_o-lkQ4-4oM?si=Z29atljyJ5X2tRma\nThe Congress members opposing this:\nRep. Mike Turner (R-Ohio)\nRep. Mike Rogers (R-Ala.)\nSenate Minority Leader Mitch McConnell (R-Ky.)\nSpeaker of the House Mike Johnson (R-La.)\nHere's some proposed text to contact your representative, please feel free to edit/ use as necessary.\nSubject: Urgent Action Required: Citizens Demand Inclusion of Schumer Amendment (Proposed Legislation) in National Defence Authorization Act\nDear [Congress Member's Name],\nI trust this message finds you well. I am writing to you as a concerned citizen, representing a growing global community that is deeply committed to addressing critical issues within the National Defence Authorization Act, specifically the proposed legislation known as the Schumer Amendment.\nOur collective concern revolves around the need for proactive and responsible governance, not just within our nation but also on a global scale. It is with utmost urgency that we turn our focus to the United States government and its esteemed members of Congress, including yourself.\nWe firmly believe that this is a pivotal moment for you, as our elected representative, to act decisively and champion the inclusion of the Schumer Amendment (Proposed Legislation) in the National Defence Authorization Act.\nOur request is clear: We implore you to submit the Schumer Amendment (Proposed Legislation) for consideration and ensure that it becomes operational. The issues at hand impact not only the United States but also resonate globally. As such, we are mobilizing citizens to engage with their elected representatives to achieve this crucial objective.\nWe respectfully urge you to respond to this call for action by:\n\nAdvocating for the inclusion of the Schumer Amendment (Proposed Legislation) in the National Defence Authorization Act.\nChampioning this cause within your congressional peers.\nTaking the initiative to communicate the urgency and significance of this matter to your constituents.\n\nTogether, we hope to exert the necessary pressure and secure the inclusion of the Schumer Amendment (Proposed Legislation) before any potential disruptions surrounding the 2024 election.\nYour dedication to the welfare of our nation and the world is pivotal. We humbly request your support in this critical initiative. Please join us in our mission to effect positive change and uphold the values we hold dear.\nThank you for your time, and we eagerly await your affirmative response.\nSincerely,\n[Your Name]\n[Your Contact Information]", "media": null, "score": 3019, "upvote_ratio": 0.89, "comment_count": 258, "over_18": false}, "34": {"id": "18cgurv", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "alesneolith", "link_flair_text": "Discussion :table:", "time": 1702094494.7383337, "created_utc": 1701903621.0, "url": "https://www.reddit.com/r/aliens/comments/18cgurv/i_have_secondhand_knowledge/", "title": "I have secondhand knowledge", "permalink": "/r/aliens/comments/18cgurv/i_have_secondhand_knowledge/", "selftext": "Introduction\nPlease note that I will be vague in some places about any identifying information, credentials, locations, people, procedures, etc.  I don’t want to be identified and harassed.\nI have a professional background in anthropology. I also have some informal experience in philosophy, which unexpectedly ended up being the most useful of my skills on this project. Previously, I worked for a university in the western United States. For cultural reasons, students and faculty at this particular university are more likely to be selected for sensitive government work. I suspect that I was selected because of my low profile, my squeaky clean history, a lack of any drug or alcohol use, my broad range of skills and knowledge related to human civilization, and some connections that I have in academia. My most significant work has been in ethnography and cultural anthropology.\nWhy Reddit?\nI’m sure you’re wondering why I am posting this here instead of sending this information somewhere more important. Since the UAP hearing happened and other whistleblowers have come forward, I felt safe enough to speak out privately. I don’t know how useful my testimony was, and I felt like I was brushed off.  As I’ll get into later, I don’t have any documents to hand over or any firsthand experience with UFOs or ETs. I do have trust in our institutions to do their job, come to the right conclusions, and eventually begin disclosure.  I have a hope that the truth will be widely known in the near future.\nI wasn’t interested in or involved in the UFO/alien phenomenon prior to starting my work.  As the work progressed, I became convinced that there was something very real behind all of this, and now that I’m released from the project, Ufology has become a special interest of mine.  I think now is a good time to put my story out there.\nThe Work\nIn early 2017, I was contacted by one of my connections at the university, who urged me to apply for a position in a ‘special research project,’ claiming that the project needed someone with my experience, the pay would be good, and that they would help me get in. This individual helped me apply and gave me a rundown about what to expect from the hiring process.  This process involved an extensive background check, applying for a security clearance, several interviews, and training for security, communication, and working with sensitive information.  Going through the ratmaze took several months, but I made it through much faster than anticipated and was finally ready to actually begin working in early 2018.\nI was apprehensive on my first day of work.  I had jumped through all the hoops, and I still didn’t know what the subject of the research was.  I didn’t feel comfortable with all the security.  (I’m on the spectrum, and while I’m good at masking, procedures and bureaucracy make me confused and nervous.)  The workday began by entering a secure facility where my identity was verified with ID and biometrics.  After passing through, I would go to my workplace and have to pass through another layer of security.  In the workspace we were monitored constantly and subject to random security checks.   \nThe workspace was a medium-sized set of offices where I and six other researchers worked, one of which was assigned to train me.  Each of these researchers had different backgrounds and were assigned to a different part of the project.\nOver the next few days, my trainer walked me through the research process.  It was then when I finally learned what the subject of the research was.  My trainer gently explained that we were working with information about an ‘exotic intelligence,’ meaning a sapient non-human species of an unknown origin.  Our job was to take the information that had been provided for us from outside sources, sort it based on its content and usefulness, and in the end produce a comprehensive report that summarized what we know about this intelligence, with a special focus on its motivations and intentions.  This report could then be used to brief elected officials in the future, and even the public.  We were allowed to make certain assumptions in the report, such as that these beings and their motivations could be understood by humans and that the information we have is accurate.\nI had endless questions and became distraught, and I think they could tell because my trainer figured it would be best if I was given time to myself to read some of the material and digest the information.  As I learned more, the shock faded and my fear was replaced with curiosity.\nA lot of the work wouldn’t be very interesting to the members of this sub.  The average workday consisted of going through security, getting permission to retrieve certain documents, then organizing and annotating the documents.  Much of the documents were only related to the subject in tangential ways and didn’t convey very much of use.  In a sense, we were separating the wheat from the chaff and getting the material ready to be used for the project.  After finishing, we would secure the workplace and leave.  Over the months that followed, we slowly built up a corpus of useful information.\nI obviously do not have the report with me, and it has been a while, but I will now relate to you the most important information that I can recall related to these beings.  Feel free to ask questions.  Note that I worked the most on information related to their society and motivations.\nOrigins\nWe know more about every other aspect of these beings than we do about where they actually come from. We do have some tentative ideas and speculation, but multiple hypotheses are still on the table.  As I’ll get into later, there is good evidence that life on earth and these beings share a common ancestor.  Our job is to keep an open mind and let the evidence lead the way instead of falling for our own pet theories or cultural prejudice.  The extraterrestrial hypothesis makes some sense but it’s not the only option.  During work, my colleagues often called them ‘aliens’ or ‘ETs.’\nIn the interviews I’ve read, the interview subjects are vague, absurd, contradictory, or evasive when asked about their origins.  Perhaps this is because we aren’t in a position to understand where they come from, or perhaps there are problems with communication.  Maybe they simply don’t want us to know.\nAppearance and Biology\nIn regards to the appearance of the ETs, UFO mythology is dead on.\nGenerally, they look like diminutive humanoids with large heads, reduced facial features, and very large eyes, which are sometimes covered in a transparent black film. (Earlier specimens usually do not have the film, later specimens do.) Their average height is \\~5 feet tall.  They have two long arms and two legs.  They have three long fingers and an opposable thumb.  They have feet with four toes.  They may have fingernails and toenails, but not always.  When they do, they are mottled and dark.  They have no reproductive organs or anus, and they secrete waste through their skin, similar to how we sweat.  They ingest liquid food just like we do.  They wear clothing, usually in the form of a very thin blue or gray high-collared garment, as well as boots.\nTheir heads are large, as mentioned before.  In some individuals there are pronounced ridges on the head and upper back, which seem to relate to different kinds of implants in a way that is not understood.  As far as we can tell, every individual has an artificial lattice woven through their brain and nervous system.  I’ll get into that later.\nNo two individuals look exactly alike.  Head shape, eye shape and size, the patterns and protrusion of the ridges, and skin color vary between individuals.\nLife on earth and the ETs share the same kind of biochemistry.  They are made of cells, use DNA, proteins, etc.  They can be studied and understood with the same principles that we use to study life on earth.  This has fed into speculation about their origins.  The most conservative hypothesis is that they share our biochemistry because they also originate from earth, but there are other theories.  Life on Earth and wherever they come from could both be descended from a common ancestor.  Perhaps life everywhere in the universe shares the same biochemistry.  \nThe striking similarities between their anatomy and human anatomy leads me to wild speculation about whether the individuals we see are specifically designed to resemble humans in order to facilitate interaction.  There is a small collection of biological material that has been retrieved from craft that shares no resemblance to humans and defies description.  This material is like a web of nervous tissue which is interlaced into the structure of the craft itself.\nTechnology\nBefore, I mentioned an artificial lattice which is integrated into the nervous system.  This lattice is at the heart of their technology.  In interviews with subjects, they demonstrated the ability to communicate with and detect the presence of others of their kind in the same facility, in different rooms.  Tools retrieved from craft would be responsive to the touch and intentions of the ETs but would be totally inert in the hands of human operators.  This lattice is probably what makes these abilities possible.  It is made of ordinary elements like copper and aluminum, and there is no discernable reason why it should be able to do what it seems to do.\nWe were allowed access to documents that described the capabilities of their craft as well as eyewitness encounters, but we were not allowed any data that would explain how their propulsion systems work or about anything regarding the reverse-engineering of craft.  The reasoning behind this is obvious.  The special interests involved have begrudgingly begun to accept that disclosing the existence of the intelligence is necessary over the long term, but the one thing they refuse to do is relinquish their monopoly over exotic technology.  I don't have much insight to give about the craft because the project focused more on the extraterrestrials themselves, their society, and implications for our society.\nThe craft have a wide range of appearance, size, and behavior.  It seems like each craft is designed for a specific purpose.  Every craft is different, but they can be grouped based on shape and purpose.  There are some edge cases that won’t fit into this neat categorization.  \nThere are hundreds of objects in orbit that are likely created by this intelligence.  At first glance, they look like commonplace space debris, but on rare occasions they will move in a way that is not attributable to gravity, meet with another object, or expel an object.  Tracking these is very difficult, and we know very little about them, including their size.\nThe most commonly seen objects are large reflective orbs or pills that move at high speeds.  Usually they are only seen for a second, but on other occasions they follow aircraft, hover over sensitive locations, move in strange, illogical ways, and even suddenly disappear.  At night these orbs sometimes emit orange light, although other colors can also be seen.  These objects have been seen submerging into the ocean as well as other bodies of water.\nThere are egg-shaped craft which move in more predictable ways, although they move much faster than man-made aircraft.  We were allowed to have a lot of information related to these.  These craft are the most likely to fail, and they are manned.  Biological material and even living organisms have been recovered from these craft.  These are the most interesting to me, as they contain occupants, living spaces, and large rooms full of equipment.  We speculate that these are surveyors or scientists.  In one particular case, a craft of this kind contained samples of earth biota.  There are no control panels or any kind of obvious mechanism for controlling the craft.  This kind of craft has unfortunately become more uncommon over time.\nThe classic flying discs and crescents have the greatest presence in popular culture but they are not the most common object.  These are speculated to be stealth vehicles that are used for reconnaissance and research.  On many occasions these have landed, completely empty.\nThe Interviews\nBecause of my past work experience, most of my work on the report was related to actual interviews that had taken place with ETs.  They were retrieved from crashes but also from landings, where the craft seemed to have landed on purpose and the beings came voluntarily.  Reading these was very surreal, and I suspect the context of these interviews is part of the reason for so much secrecy.  The way that they were treated was inhumane and very unethical.\nThe ETs have a very close relationship with their technology.  They cannot survive very long while separated from their craft and from each other.  They can’t eat anything other than a special kind of liquid food, and human-made substitutes were not sufficient replacements.  Throughout their stay on Earth, they would suffer from malnutrition and a kind of toxic buildup in the body.  Because of how valuable they were, every effort was taken to keep them alive and conscious, even against their wishes.  The situation reminded me of the case of Hisashi Ouchi.\nSomething that deeply frustrated me was that they seemed to want to show us so much more, but because of the irresponsible behavior of the program, they could not.  They were separated from their craft permanently so the craft could be hauled off elsewhere and auctioned off, and so that the program would have total control over the interview process.  Because of this separation, the ETs would slowly die.\nCommunication took place through telepathy.  They can read our thoughts and ‘send’ thoughts and impressions into our minds. However, this takes a lot of concentration on the part of the interviewer and communication would break down as the health and consciousness of the subject declined. The interviewer and the ET would communicate telepathically, then the interviewer would say the exchange out loud for it to be recorded.\nSociety & Motivations\nFrom reading interviews with detained subjects, I and other researchers were able to put together a rough picture of how this species works and why they are here.  Instead of having any kind of formal social structure, these beings form a dynamic superintelligence that is a composite of all of their minds.  Reproduction doesn’t take place biologically, instead they are artificially created, with each one designed for a specific purpose as their society has need.  The intimate interlinking of their minds causes them to behave as one superorganism rather than individuals.\nTo get into why they are here, we have to understand their philosophy.  ‘Philosophy’ is a human word made for human contexts, so it may not be appropriate to use that label, but I will use it anyway.  They have a monistic, reductionist ontology which bears heavy similarities to cosmopsychism or objective idealism.  As far as I can tell, their philosophy is naturalistic but has some elements that could be misconstrued as religious.  They reduce time, space, and everything to the behavior of a single unitary consciousness.  (Not to be confused with the superintelligence that I mentioned earlier.)  This consciousness behaves entirely spontaneously, without deliberation or forethought. \nAccording to them, the minds of living organisms are parts of this consciousness that has ‘looped in’ on itself, creating separation and individuality.  The process of evolution has caused some organisms (such as ourselves) to develop higher cognitive faculties and mental complexity which allows for complex thought and self-reflection.\nOur perceptions are the mental activity of this unitary consciousness as it is filtered through our minds and presented in a way that is most advantageous to our survival as individual ‘loops’.  We model the patterns of our observations as the laws of physics, but the laws of physics have no inherent existence except as the patterns of this universal mental activity.\nThey believe that as life continues to grow and complexify, it will have an effect on the unitary consciousness that constitutes the universe.  As life proliferates and complexifies, it will cause it to attain higher cognitive functions and eventually reach self-awareness.  They believe that the universe is already blindly striving toward self-awareness and complexity, and they seek ‘move it along,’ so to speak.  This is their goal, and it’s presumably why they are here on earth.  They are guiding the development of life on this planet to help serve this end.  I have no clue why they are so motivated to move toward this goal or what the actual implications would be if they succeeded.  It also leads to other questions.  If any of this is true, time itself is merely a construct created by this unitary consciousness, so how could it change and develop?  How does this universal consciousness fragment into individual minds, and what relationship does this have to biology and the origin of life?\nThey are not afraid of dying because they believe that death is just a process where individuality breaks down and the mind ‘unloops’ and becomes reintegrated into the unitary consciousness.  They believe that memories and life experiences are reabsorbed into the consciousness during this process, perhaps this is the mechanism that allows it to develop.  Whether or not this is true, it seemed to bring them a lot of peace during their tormented final moments.  Even in death, they served their purpose.\nTheir philosophy shapes the way their society is organized in profound ways.  They have intentionally designed their technology in a way that integrates the mind and obscures individuality.  They do not fear death, and even embrace it when they have fulfilled their purpose.  They have a positive attitude toward living organisms and ecosystems, because the flourishing of life is integral to them achieving their goals.  However, they do not respect individuality and they see individuals (including themselves) and species as expendable in the service of their goals.  In the interviews, they voiced concern with the impact that humanity is having on life on this planet but also see us as a step in a process of complexification.  They are definitely monitoring how life is developing on this planet, and it is very probable that they are subtly manipulating it to serve their goals.  The similarity between their biology and ours makes me wonder whether they seeded earth with life to begin with.  Maybe this planet has been their project from the beginning.\nMy thoughts on disclosure\nI’ve been keeping up with this topic for a while now and despite recent events, I feel very optimistic about disclosure.  This isn’t the kind of thing that can be kept a secret forever.  They are here to stay, and a secret this large can only be kept for so long.  None of the information (At least none that I learned during the project) is anything that would threaten civilization or cause a mass panic, people are much more resilient than that.  The cat is clawing its way out of the bag, and I don’t think it’s going to be forced back in without tremendous effort.  The important thing is that ordinary people like you keep putting up resistance and support whistleblowers.  I hope that the report I helped to write eventually gets out to the public, me and my coworkers put a lot of effort into writing it.", "media": null, "score": 1465, "upvote_ratio": 0.98, "comment_count": 607, "over_18": false}, "35": {"id": "18cmvyk", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Podcast", "time": 1702094495.912734, "created_utc": 1701921575.0, "url": "https://v.redd.it/2fw2aswcqs4c1", "title": "Journalist Michael Shellenberger has a new article coming out soon about UAP crash retrievals, “It’s not the property of the US Gov, it’s not the property of Lockheed Martin, or of an Aerospace Corporation…\" & \"We've had multiple well placed sources say that the US Gov has 12 to 30 or so crafts\"", "permalink": "/r/UAP/comments/18cmvyk/journalist_michael_shellenberger_has_a_new/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/2fw2aswcqs4c1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/2fw2aswcqs4c1/DASH_96.mp4", "dash_url": "https://v.redd.it/2fw2aswcqs4c1/DASHPlaylist.mpd?a=1704686494%2CY2Y4YjE1ZDMyZGZlZmMyMGQwNzVjOTY3MmY4OWQwZjExN2NjNjA2NjYxODI0Yjc5MGY3YWUzMDM5ZjE1YjkyMg%3D%3D&v=1&f=sd", "duration": 562, "hls_url": "https://v.redd.it/2fw2aswcqs4c1/HLSPlaylist.m3u8?a=1704686494%2COWEwNmE4MTVlNTIxNjcwZmUzZjJmYzliYjZjYzdlY2M0OTAzYTRkMzkwYTc1OTI0ZjY1YWE4NDczNzI3OTY4Zg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 336, "upvote_ratio": 0.99, "comment_count": 35, "over_18": false}, "36": {"id": "189f7r2", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Fit_Psychology_1536", "link_flair_text": null, "time": 1702094497.0456483, "created_utc": 1701557226.0, "url": "https://i.redd.it/ltpvt8h8ny3c1.jpeg", "title": "What possible reason could he have to block this??", "permalink": "/r/conspiracy/comments/189f7r2/what_possible_reason_could_he_have_to_block_this/", "selftext": "Firstly, (and possibly most importantly) please don't make this Red vs. Blue --- screw both sides. \nSecond, so far I'm unable to find out if this was possibly blocked by Durbin because it was included in a larger bill or if it was a stand alone blockage. I think that matters.\nLink to Original X Post:  https://twitter.com/realannapaulina/status/1730713142529786191?t=VAUalEdMQXnyPQbLMOXshQ&s=19", "media": null, "score": 1979, "upvote_ratio": 0.88, "comment_count": 300, "over_18": false}, "37": {"id": "18buq3h", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "DieSystem", "link_flair_text": null, "time": 1702094497.3160124, "created_utc": 1701833396.0, "url": "https://israelpalestinenews.org/iak-investigation-international-campaign-is-criminalizing-criticism-of-israel-as-antisemitism/", "title": "International campaign is criminalizing criticism of Israel as 'antisemitism'", "permalink": "/r/conspiracyfact/comments/18buq3h/international_campaign_is_criminalizing_criticism/", "selftext": "", "media": null, "score": 7, "upvote_ratio": 0.83, "comment_count": 1, "over_18": false}, "38": {"id": "189tp2j", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "ITSYOURBOYTUNA", "link_flair_text": "encounter story", "time": 1702094498.1927948, "created_utc": 1701610783.0, "url": "https://www.reddit.com/r/bigfoot/comments/189tp2j/ive_got_a_good_one/", "title": "I've got a good one.", "permalink": "/r/bigfoot/comments/189tp2j/ive_got_a_good_one/", "selftext": "13 year special operations spook here. Worked as senior analyst, intelligence surveillance and reconnaissance (ISR) tactical controller (ITC), chief of weapons and tactics, etc, etc... \nOne time I was on day shift working near real time ops in Afghanistan, in this case Kandahar province, so it was night there. Watching five dudes sitting around a fire near some agricultural fields... Well this fucking yeti comes into the field of view (FOV). It crosses a field and walks towards these 5 adult males down a path. It must have made a sound because they startled, but they couldn't see it from their position. They head up the path and this fucking thing rushes them. They scatter and regroup.\nThis thing was at least 7-9 feet tall, and its arm span was equally as long. It kinda slipped as it slashed at one then backed up back into the agricultural field. The adult males sort of in a super spooked way try and walk towards where it was on the path and this thing lays down in the field to hide. At least 7-9 feet tall for real. They get a bit close and it gets up and rushes them again and they scatter. Then it walked back the way it came from and that was it. We didn't follow it. \nShit was for sure a yeti.", "media": null, "score": 162, "upvote_ratio": 0.86, "comment_count": 183, "over_18": false}, "39": {"id": "18ab1ws", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "ethbullrun", "link_flair_text": null, "time": 1702094498.6539264, "created_utc": 1701659954.0, "url": "https://i.redd.it/njluy8gvq54c1.jpg", "title": "🔥mole not seen since 1936 found", "permalink": "/r/Cryptozoology/comments/18ab1ws/mole_not_seen_since_1936_found/", "selftext": "", "media": null, "score": 167, "upvote_ratio": 0.99, "comment_count": 19, "over_18": false}, "40": {"id": "18a8pyp", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Ufonauter", "link_flair_text": "Flying Humanoid", "time": 1702094498.8207304, "created_utc": 1701652516.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/18a8pyp/in_1979_mrs_jean_hingley_would_have_one_of_the/", "title": "In 1979 Mrs. Jean Hingley would have one of the most peculiar yet casual NHI encounters ever recorded when three fairy-like beings barged their way into her home", "permalink": "/r/Humanoidencounters/comments/18a8pyp/in_1979_mrs_jean_hingley_would_have_one_of_the/", "selftext": "This account was first published in early 1979 just after her encounter in The Dudley Herald it was expanded upon by UFO researching and main interviewer to Jean Hingley, Eileen Morris and first detailed description to the UK publication The winged beings of Bluestone Walk\", Flying Saucer Review 25(6): pp 24 - 27 (Nov - Dec 1979, published April 1980 and the following is a direct transcript from said article with some minor spacing for readability.\nOn the morning of January 4, 1979, a cold dark morning with snow on the ground, I had the strangest experience in my whole life.\n     I live in a small council house in Bluestone Walk, Rowley Regis, near Birmingham. The house is one of a number on a small estate surrounded by waste land and quarries. We are near Hailstone quarry and our road is named after the Bluestone Quarry. We, my husband Cyril and myself, have lived here for nine years. We have an Alsatian dog, Hobo, who is two and a half years old.\n    I work at a factory making sound proofing for cars and my husband is employed at a Cement Works.\n    The house has a small front garden and a small lawn at the back about seventeen feet by eleven feet. There is a carport at the end of the lawn and a shed. A door opens to a road at the back of the house.\n     At seven o'clock on January 4th my husband was going to work by car and I stood at the back door to wave him off. Hobo, our Alsatian dog, was by my side.\n     When my husband had gone I saw a light in the garden and thought, \"Cyril has left the light on in the car port.\" I went down the garden to the car port but saw that the light was switched off.\n     As we turned to go back to the house I saw an orange light over the garden which gradually turned white. It lit the whole garden.\n     We went into the back door of the house. Suddenly with a sound like Zee . . . zee . . . zee . . . three \"beings\" floated past me through the open door. They glowed with a brilliant light and seemed to float about a foot [30 cm] above the floor. As they floated past me into the lounge I saw that they had wonderful wings. I was so terrified that I grabbed the steel sink in the kitchen. I couldn't speak. I was frozen.\n     I looked at Hobo. He seemed to \"hobble\" to his drinking bowl, swaying from side to side. His hair was sticking out all over like a hedgehog's. Yet Hobo is afraid of nothing. He seemed as though he was drugged. He just flopped down and lay on the floor, stiff, with his eyes open.\n     I felt as though all the blood in my body had drained out through my toes. I was paralysed. My mouth was wide open. I couldn't move or speak.\n     After a while the fear seemed to leave me. I felt as if I were lifted up. I wondered what was happening to me. I felt as if I were a different person; as though I was in Heaven although I was still at home. I seemed to float into the lounge. I held the door but my feet didn't touch the ground. The doors were wide open and it was a bitterly cold morning but I felt warm. All the downstairs lights were on as it was dark outside.\n    I could hear the little artificial Christmas tree shaking but the light was so brilliant that I had to cover my eyes. The three \"creatures\" seemed to read my mind. It was like a light or an X-ray penetrating my mind.\nWhen I took my hands from my eyes I could see. They seemed to have turned down the light that surrounded them. There was a glow round their heads. I could see them clearly. They were shaking and tugging at the little Christmas Tree. There they were - three little slim \"men\" in silvery-green tunics and silver waistcoats with silver buttons or press studs. They were about three feet six inches to four feet high, all alike. Their pointed hands and feet were covered in the same silvery-green, and they had pointed caps on their heads of the same colour and with something like a lamp on top. They had transparent \"fish bowl\" helmets over their heads which rested on their shoulders. There were no eyebrows or ears to be seen.\n    Their faces were waxy white, corpse like, and they had \"black diamond\" eyes. I don't know much about precious stones but that is how I would describe them. I didn't notice their noses. Their mouths were very thin.\n     Their wings were wonderful, large, oval-shaped and glowing with rainbow colours - red, violet, gold, blue, green - but more beautiful than our earthly colours. Their wings were covered in dots like \"Braille\" dots. I thought of \"Joseph's coat of many colours.\" Our colours seems like \"chemical\" colours compared to them.\n     They were floating round the lounge touching everything - the Christmas cards, the clock, the radio and all the furniture.\n     At last I could speak. I said: \"Three of you and one of me. What are you going to do? What do you want with me?\"\n     Each of them put their hands to their chests with their pointed hands and seemed to manipulate the buttons. A \"beep\" sound came from each \"being's\" chest and then the voice came from the chest. The mouths never moved. They all spoke together: \"We shall not harm you.\"\n     \"Where have you come from?\" I asked, and they said: \"We come from the sky.\"\n     They started to shake the little Christmas tree again and the little fairy fell from the top. I still seemed paralysed. I couldn't move to pick it up.\n     I said: \"We put up a tree at Christmas because we believe Jesus was born then.\" They said, \"We know all about Jesus.\"\n     They were looking at the Sunday papers on the table. There was an Honours list on the front page. I said, \"These people have been made lords.\" They said: \"There is only one Lord.\"\n     They looked at a picture of the Queen, and I said, \"You should go to the Queen or go see a real lady.\" I wondered why they came to me as I am just a working woman. They said, \"You are a lady.\"\n      We have a large lounge with a corner unit couch. They sat on the couch and bounced like children. I said: \"Be careful of my furniture,\" and they stopped.\n     When I spoke sharply they put the light up, so I thought I had better be friendly with them. They were only small but they seemed to have power in their bodies that might have harmed me.\n     My eyes still felt sore from the bright light but I felt happy with them. They looked at me with friendly eyes, I thought. I said: \"I can't call you 'creature' so I shall call you 'gentlemen.' I started to say, \"Nice to see you! Nice.\" They replied: \"Nice.\"\nWhen they floated about the room their wings fluttered gently - there was no sound. When they moved through the open door to the hall they folded their wings behind their backs like pleated fans. They circled in the hall then floated upstairs. The doors to the upstairs rooms were closed and they floated down again.\n     They picked up the tapes for the tape recorder and looked at the packets of cigarettes on the sideboard. There were bottles of whisky and sherry on the sideboard as it was not long after Christmas. I asked: \"Do you want a drink?\" They said \"Water\" three times. I went to the kitchen and fetched four glasses of water. I put them on a metal tray. I thought I would bring one for myself as well - to show that it wasn't poisoned - and to drink with them to keep them company. As I came near them with the metal tray I could hardly hold it. The tray seemed to be magnetised towards them. I put the tray down on the table and each of them picked up a glass when I lifted mine. They seemed about to lift their masks but when they saw me watching they put the \"power light\" on. I didn't actually see them drink but when they put the glasses back on the tray the water was gone.\n     They said: \"We have been to Australia, New Zealand and America. We come down here to try to talk to people but they don't seem to be interested.\"\n     \"Shall I tell people on earth about it?\" I asked, and they replied \"Yes.'\n     They said: \"We have been here before,\" and \"We shall come again.\" Another thing they said was, \"Everybody will go to Heaven. There are beautiful colours there.\"\n     They seemed to put a light on me to draw out the words they wanted to hear. I was stuttering with nervousness. I was talking about politics and women going to work and said, \"It's a man's world.\" They seemed interested and excited as though they were listening and understanding. I told them I had not been to chapel for a year or two as chapels had pop groups and guitarists these days and I didn't like that kind of service.\n     \"There is no need to worship in synagogues,\" they said. I didn't know until my husband told me later that it was the name of the Jewish place of worship. I said: \"The bible is hard to understand,\" and they seemed to know what I meant.\n     I  told them that I had looked after foster children for seven years and at one time I looked after thirteen stray dogs. The neighbours' children used to come with me to take them for walks.\nThen I went to fetch a plate of mince pies for them. I put six on a plate and told them to help themselves. They each lifted a mince pie from the plate as though their hands were magnetic. I saw that they were looking at the cigarettes again. \"I'll show you how people smoke these,\" I said. I struck a match and lit a cigarette. They leapt back as though they were frightened and began to float towards the back door. I stubbed out the cigarette and called out \"Come back! Come back!\" I still seemed to be floating as I followed them and as they went through the back door I saw an orange coloured glowing \"thing\" in the back garden - a \"space ship.\" It must have been eight to ten feet long [2½ to 3 metres] long and four feet high. It had round windows or portholes. It seemed to be covered with a kind of shining plastic. I couldn't see through the portholes. There was something like a \"scorpion tail\" at the back and a kind of \"wheel\" on top.\n     They still held a mince pie each as they went towards the \"space ship\" and entered it. They flashed the lights twice as if to say \"Goodbye.\" Then they took off over the fence and away across the open ground towards Oldbury. The sky was still dark, with no stars, and there was snow on the ground.\n     Hobo came to life then and wandered around the garden as though he was looking for them.\n     There was a deep impression on the back garden where the \"space ship\" had settled.\n      I felt warm and happy although it was such a cold morning. I felt \"good,\" as though I had been blessed.\n     When I went into the house and looked around I realised that the clock and the radio had stopped. I spoke to my next door neighbour and she said: \"You should ring the police.\" I rang the Oldbury police and they said they would come.\n     I rang my husband but he couldn't leave his job. I said to him: \"I have had visitors with wings.\" He said: \"What do you mean? Birds?\" I was shaking and crying. I said, \"No. Men with wings.\" He laughed and said: \"Why don't you go and have your hair done and tell the girls about it.\" I did that later on, and they were very kind.\n     The police came from West Bromwich Police Station. They looked around and said: \"You look pale as though you have had a shock.\" They couldn't do much - they couldn't take finger prints. They went away and came back later. They rang UFO Investigation Service in Birmingham. The people came and measured the impression on the ground in the back garden. It was eight feet by foot feet. They also took soil samples for analysis. I haven't heard the results yet.\nI have had a lot of nice letters from people who were interested after reading reports in the papers. Some people sent tapes to be returned to them with my own story.\n     The West Bromwich College of Technology - Television Production Course students have made a film of me telling my story. It was filmed at the Technical College on March 19, 1979.\n     My eyes were sore for about a week and I had to wear dark glasses. I have had to have some weeks away from work as I haven't felt well and the doctor advised me to have a rest. My jaws ached after staring with my mouth open with shock when I first saw the \"beings\".\n     I have never read books about UFOs. I only read the papers. I don't look at a lot of television, but like the Crossroads programmes and Coronation Street, and love stories.\n     Some people have made jokes about me, but people who know me believe me as they know I am truthful. [In a taped interview I heard, she told of receiving envelopes containing Mars Bar wrappers.]\n     Some people have written to say that they think the visitors were elves or beings from the Fairy Kingdom, or even robots, but I don't know what to think. I know I shall never forget them if I live to be a hundred.\n     A few days later we tried the \"tapes\" that had been handled by the \"beings.\" They were so distorted that they were ruined. Before January the 4th they were quite normal.\nI have attempted to locate the filmed interview with Mrs. Hingley but have so far been unsuccessful in locating it, if anyone knows of such a recording still in existence please make it known. Additionally if anyone knows the original Birmingham ufo group that took those soil samples that would be of use as well.", "media": null, "score": 83, "upvote_ratio": 0.98, "comment_count": 1, "over_18": false}, "41": {"id": "189tihx", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "No-Poem-5540", "link_flair_text": null, "time": 1702094499.7177389, "created_utc": 1701610153.0, "url": "https://i.redd.it/25mrd84m034c1.png", "title": "The Bigfoot", "permalink": "/r/cryptids/comments/189tihx/the_bigfoot/", "selftext": "", "media": null, "score": 48, "upvote_ratio": 1.0, "comment_count": 5, "over_18": false}, "42": {"id": "18anrzj", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "DearProof9851", "link_flair_text": null, "time": 1702094499.9852839, "created_utc": 1701707047.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/18anrzj/the_false_death_of_my_father/", "title": "The False death of my Father", "permalink": "/r/LetsNotMeet/comments/18anrzj/the_false_death_of_my_father/", "selftext": "I have a story to tell you that happened to me on Sunday, October 29, 2022.\nMy father, for the story, will be Daniel Trucmuche, and I, Joan Trucmuche.\nI currently live near the Swiss border but reside in France, originally from Grenoble, where my entire family, parents, and sister live. My parents live in their apartment on the outskirts, and my sister lives in Grenoble.\nAfter a pleasant weekend with my girlfriend, visiting our families, we return home. After a 1.5-hour drive, we grab some McDonald's and settle in front of a series.\nAt that moment, I receive a call from an unknown number (starting with 07) at 9:00 PM. Generally, I don't answer unknown numbers, especially at this hour, due to harassment issues in school that left lasting effects (I'm 26). However, I felt a strange sensation and decided to answer, thinking it might be important.\nI answer, and after saying \"Hello,\" someone immediately asks, \"Are you the son of Daniel Trucmuche?\" I, of course, answer yes. It didn't surprise me at the moment because my father has been a salesman for 35 years in the same company, and my phone number was his 15 years ago. So, I sometimes get calls from very old clients of his. We don't have the same voice, so it didn't surprise me to be asked, \"Are you the son of?\"\nAfter confirming, the person says directly, \"Your father had a car accident.\" Panic rises in me; I start trembling. My girlfriend is next to me and immediately senses that something is wrong. I was petrified because the tone used by this stranger clearly meant \"he is dead.\" In panic, I ask: where, how, and the crucial question: WHO ARE YOU?\nThey tell me they are a witness to the accident, and my father was taken to the hospital. I panic and shout, asking where, where did the accident happen, how? The person says the car flipped. Trembling, I explain to my girlfriend, and he says he wants to call his wife. I hang up immediately.\nAt that moment, I conclude that my mother wasn't with him. For your information, my parents sometimes have significant arguments, and my dad occasionally goes for a drive. My mother has been ill for years and goes to bed at 6:00 PM every day, so I knew I wouldn't reach her, but I try. I call my mother, no answer, and I call my sister, who is more sensitive and has a panic attack, screaming on the phone. I tell her to wake up mom immediately because she's not answering the phone. At the same time, my girlfriend calls her mother to ask her to call hospitals around Grenoble to find out where he is.\nMeanwhile, I call the number again for more information, repeating: where did it happen, where? The person avoids the question, and after a few seconds, gives me the road number. I shout at him: WHO KNOWS ROAD NUMBERS? Toward where, which city, which village? He says towards Angers.\nAnd then it clicks; I think: wait, I was with my father at 5:00 PM, I'm home now, it's impossible for him to have traveled from Grenoble to Angers in 4 hours! At the same moment, my girlfriend, with an incredible reflex, hears me say \"Angers???\" and immediately calls my father on his mobile. My father answers disdainfully: \"Yes?\" She says, \"Daniel, you didn't have an accident,\" and he laughs and says: absolutely not, I'm on my couch, watching football.\nI tell the person on the phone that my father is online. He says: \"But you're not Matheo Trucmuche.\" I reply that I have no Matheo in my family and that I am Joan.\nThe man apologizes, but in a way that gave me a chilling feeling, as if he had achieved what he wanted, to see me panic.\nAnd I asked him five times how he got my number, and he never answered. He says, \"Sorry for scaring you,\" I hang up, inform my sister, calm her down.\nLater, I exchanged messages with him because I didn't understand how he got my number, which is literally nowhere on the Internet. He told me that my number was displayed on the first page of Google in a directory.\nI searched the internet thoroughly with my girlfriend that evening, and it's impossible.\nAnd the messages were strange. He mentioned a Laurent even though he clearly said my dad's name, he apologized for his clumsiness, that he managed to contact his wife, that this person is deceased.\nAfter a few days, my sister-in-law, who is a surgeon, told me that it's the firefighters who contact the family, not random people like that, even those involved. Moreover, when there are deaths on the road, there is always a press article, or even an obituary that I never found.\nI tried calling the number a week later for answers, and the number was no longer assigned.\nWas it a bad joke? Was it someone who wanted to see me panic? How did he get my number? Just writing and remembering this moment gives me chills.", "media": null, "score": 93, "upvote_ratio": 0.99, "comment_count": 15, "over_18": true}, "43": {"id": "18a0pnh", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Lonesqui", "link_flair_text": null, "time": 1702094500.1301067, "created_utc": 1701630749.0, "url": "https://youtu.be/46k4aUokBZc", "title": "The Most Disturbing Tape Ever Found | Part 1", "permalink": "/r/truecreepy/comments/18a0pnh/the_most_disturbing_tape_ever_found_part_1/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "TRUE SCARY STORY | The Darkest And Most Disturbing Tape Ever Recorded | Part 1", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/46k4aUokBZc?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"TRUE SCARY STORY | The Darkest And Most Disturbing Tape Ever Recorded | Part 1\"></iframe>", "author_name": "Graveyard Chef", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/46k4aUokBZc/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@Graveyard_Chef"}}, "score": 0, "upvote_ratio": 0.47, "comment_count": 1, "over_18": false}, "44": {"id": "18ayecg", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Training_Beat7600", "link_flair_text": null, "time": 1702094500.906285, "created_utc": 1701734579.0, "url": "https://v.redd.it/iwzua32lad4c1", "title": "Here’s an update from last post you can see it on my account!", "permalink": "/r/Ghosts/comments/18ayecg/heres_an_update_from_last_post_you_can_see_it_on/", "selftext": "The entity replied! I don’t know if I’m doing this correctly but 🤷🏽‍♂️", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/iwzua32lad4c1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/iwzua32lad4c1/DASH_96.mp4", "dash_url": "https://v.redd.it/iwzua32lad4c1/DASHPlaylist.mpd?a=1704686500%2CODg1YWQwMGMzMGFkYTVjZGVhOTI2MjA1NDE2Nzc5NmE2YTQ2NTY2ZTI5MmVkYzM2NDZhMmMzMDhjNzFmZTFiYg%3D%3D&v=1&f=sd", "duration": 12, "hls_url": "https://v.redd.it/iwzua32lad4c1/HLSPlaylist.m3u8?a=1704686500%2CMWY1Yjc4Mzk0NzY1ZTEwODI4MTllNzUzYjJhZWQxYzU3MDI3YjA1ZTA1YTEzMDgwZTJmMGY5NTE0OGUxYTdmMg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 457, "upvote_ratio": 0.76, "comment_count": 140, "over_18": false}, "45": {"id": "18ddmq4", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "mikewantsfriends", "link_flair_text": "Glitch Vid", "time": 1702094501.0894456, "created_utc": 1702006464.0, "url": "https://v.redd.it/0ri8t2vxqz4c1", "title": "This bird is stuck in place", "permalink": "/r/GlitchInTheMatrix/comments/18ddmq4/this_bird_is_stuck_in_place/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/0ri8t2vxqz4c1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/0ri8t2vxqz4c1/DASH_96.mp4", "dash_url": "https://v.redd.it/0ri8t2vxqz4c1/DASHPlaylist.mpd?a=1704686501%2CNDlhMzkwZTY0NmVjMDdiNTI1NjVjMzQ1YTQ1YmU3ZTRjMWYzYWIyMzFiNWU5NGNkZjMxYzQxN2IzYWI0YmU3Ng%3D%3D&v=1&f=sd", "duration": 12, "hls_url": "https://v.redd.it/0ri8t2vxqz4c1/HLSPlaylist.m3u8?a=1704686501%2CMTgwYTgxN2E1NWE3N2QyOTI5NTExN2I0N2JjMjZmZDRhZmJmYjQxMzgzOTRjOWEwYWQyYzMzODE5ODhlZjMyYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 30, "upvote_ratio": 0.8, "comment_count": 14, "over_18": false}, "46": {"id": "189a569", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Inflation-Witty", "link_flair_text": null, "time": 1702094502.700392, "created_utc": 1701542588.0, "url": "https://www.reddit.com/r/ufo/comments/189a569/i_think_catastrophic_disclosure_is_just/", "title": "I think catastrophic disclosure is just catastrophic for the people trying to conceal the truth. For the rest of us its regular good disclosure", "permalink": "/r/ufo/comments/189a569/i_think_catastrophic_disclosure_is_just/", "selftext": "I was going to mention this before but paused and realise everyone has the same thought.\nAll these people talking about slowly parsing out the truth, and using the same rational that the people keeping it secret wouldve maintained the cover up for. \nIts catastrophic for their systems, their societal control, for their energy control for their control. We are all just happy that finally we get the truth and alot of us are happy because this may get rid of their control systems… we arent panicing mfs we’re excited!!!", "media": null, "score": 325, "upvote_ratio": 0.97, "comment_count": 67, "over_18": false}, "47": {"id": "18a5u8z", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "twist_games", "link_flair_text": "News", "time": 1702094504.2232082, "created_utc": 1701644103.0, "url": "https://twitter.com/UAPJames/status/1731445991662907824?t=evbCtaivxpt7LqczTwjdZA&s=19", "title": "President Joe Biden supports the UAP Disclosure Act, per Danny Sheehan.", "permalink": "/r/UFOs/comments/18a5u8z/president_joe_biden_supports_the_uap_disclosure/", "selftext": "In the new liberation times article danny Sheehan says that Joe biden supports the UAP legislation. Remember Danny Sheehan is the first person to mention grusch and karl nell. This was one of the reasons david grusch's story needed to be released as fast as possible. 2024 will be a interesting year it seems. Danny Sheehan has made allot of comments these past few days.", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/UAPJames/status/1731445991662907824", "author_name": "UAP James", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">President Joe Biden supports the UAP Disclosure Act, per Danny Sheehan.<br><br>His statement follows speculation that Senator Chuck Schumer coordinated with the White House and its National Security Council while drafting the UAPDA.<a href=\"https://t.co/NQ6iZTDLPG\">https://t.co/NQ6iZTDLPG</a><a href=\"https://twitter.com/hashtag/ufox?src=hash&amp;ref_src=twsrc%5Etfw\">#ufox</a> <a href=\"https://twitter.com/hashtag/ufotwitter?src=hash&amp;ref_src=twsrc%5Etfw\">#ufotwitter</a> <a href=\"https://twitter.com/hashtag/ufo?src=hash&amp;ref_src=twsrc%5Etfw\">#ufo</a> <a href=\"https://twitter.com/hashtag/uap?src=hash&amp;ref_src=twsrc%5Etfw\">#uap</a> <a href=\"https://t.co/Ohbqfk7dTy\">pic.twitter.com/Ohbqfk7dTy</a></p>&mdash; UAP James (@UAPJames) <a href=\"https://twitter.com/UAPJames/status/1731445991662907824?ref_src=twsrc%5Etfw\">December 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n", "author_url": "https://twitter.com/UAPJames", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 2451, "upvote_ratio": 0.93, "comment_count": 318, "over_18": false}, "48": {"id": "18cle2k", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Obvious_Factor7103", "link_flair_text": "Analysis Required :snoo_thoughtful:", "time": 1702094506.288364, "created_utc": 1701916845.0, "url": "https://www.reddit.com/gallery/18ciaig", "title": "Pictures of recovered bodies, leaked on 4chan today 12/6/2023", "permalink": "/r/aliens/comments/18cle2k/pictures_of_recovered_bodies_leaked_on_4chan/", "selftext": "", "media": null, "score": 1345, "upvote_ratio": 0.92, "comment_count": 232, "over_18": true}, "49": {"id": "18c79i1", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Smurphilicious", "link_flair_text": "Discussion", "time": 1702094507.25116, "created_utc": 1701878808.0, "url": "https://www.reddit.com/r/UAP/comments/18c79i1/sheehan_this_is_just_exactly_like_we_did_in_the/", "title": "Sheehan: \"This is just exactly like we did in the Pentagon Papers... Either they're going to accept a reasonable process by means of which this information can be vetted, or in fact, we're going to come forward with this information.\"", "permalink": "/r/UAP/comments/18c79i1/sheehan_this_is_just_exactly_like_we_did_in_the/", "selftext": "This is for those of you who are curious about Sheehan's track record, and more importantly his sources. Disclosure is happening right now, we are already in it, with or without the UAPDA. \n\nSheehan @ 27:06\n\nAnd what happened is because they were so resistant to this particular eminent domain provision, I reached out to sources that I have had for years.\nthat have worked with us in the Iran-Contra case. They worked with us in the Karen Silkwood case.\nThat's how we found out about the smuggling of the 98% pure bomb-grade plutonium out of the Kerr-McGee nuclear facility in Oklahoma to Israel and to Iran under the Shah.\nIt's the same way that we found out these sources, the same way we found out in the Iran-Contra case that they were smuggling the weapons through Ilopongo, the El Salvadorian military base, into John Hull's ranch down in Costa Rica, into the Contras.\nThis is an alliance of actually primarily former US military intelligence people.\nthat I've been in communication with all the way back to the time when I was one of the lawyers for the New York Times in the Pentagon Papers case, where I developed a relationship at that time with the commander of the CID, the Criminal Investigations Division of the U.S.\nArmy, who has passed away now. But we have a dozen, at least, actually more than that, particular people who are deeply embedded intelligence officials who have taken a position that they're opposed to the criminal use of the secrecy that has been provided\nto the intelligence agencies, the pursuit to which they're not only smuggling weapons to extreme reactionary people around the world, but they're smuggling cocaine and heroin.\nand they're secretly utilizing gold that has been recovered from the Philippines.\nThis is all true. And these people were so offended at what was going on in the deep bowels of the national security state that they've made the information available to me.\n\n\n\nYou know, and either you set up a responsible process by means of which this can be provided to the Congress, or we're going to demonstrate to you that we're in possession of this information and we're going to come forward with the information.\nSo that's, that's this process that I've been engaged in for 50 years, you know, like in the same way that when people wanted to know when we published the Pentagon Papers back in June of 1971, the incident that, you know, I'm the one that got the call from the New York Times and James Goodell, who was chief counsel for the New York Times, called me because I was the one that initiated the case that went to the United States Supreme Court.\n\n\nSheehan @ 36:36\n\nThis is just exactly like we did in the Pentagon Papers. We told the Nixon administration that the New York Times were going to be publishing portions of this.\nAnd they came forward and demanded an injunction from the federal court in the Southern District of New York against us.\nAnd they refused to communicate to us what the pieces of information were that they thought would irreparably damage the national security of the United States if they were revealed.\nAnd because they wouldn't do that, we came forward with all 47 volumes.\nAnd that's what's happening here again. Either they're going to accept a reasonable process by means of which this information can be vetted, or in fact, we're going to come forward with this information.\n\n\n^Edit: ^I ^corrected ^\"and ^they're ^secretly ^utilizing ^gold ^that ^has ^been ^recovered ^from ^the ^Philippines.\", ^I ^skipped ^over ^it ^accidentally ^when ^copy ^pasting ^the ^transcript. ^I ^also ^corrected ^format ^/ ^added ^the ^missing ^line ^break ^between ^\"they've ^made ^the ^information ^available ^to ^me\" ^and ^\"You ^know, ^and ^either ^you ^set ^up\". ^No ^other ^edits ^made.\n^Edit2: ^Added ^36:36 ^time ^stamp ^for ^clarity", "media": null, "score": 333, "upvote_ratio": 1.0, "comment_count": 25, "over_18": false}, "50": {"id": "18ayt28", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "EuphoricTrilby", "link_flair_text": "Rule 6 Reminder", "time": 1702094508.492594, "created_utc": 1701735691.0, "url": "https://i.redd.it/tkfgj7lvdd4c1.png", "title": "The full life cycle of a conspiracy theory", "permalink": "/r/conspiracy/comments/18ayt28/the_full_life_cycle_of_a_conspiracy_theory/", "selftext": "", "media": null, "score": 1636, "upvote_ratio": 0.91, "comment_count": 121, "over_18": false}, "51": {"id": "18bkj2c", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnthonyofBoston", "link_flair_text": null, "time": 1702094508.8206966, "created_utc": 1701805774.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/18bkj2c/confirmed_investor_sentiment_and_terror_attacks/", "title": "Confirmed. Investor sentiment and terror attacks linked. This article from the Guardian says investors are under investigation for short selling around the time of Hamas attacks", "permalink": "/r/conspiracyfact/comments/18bkj2c/confirmed_investor_sentiment_and_terror_attacks/", "selftext": "​\nIsrael investigates claims investors made millions short-selling before Hamas attacks\nhttps://www.theguardian.com/world/2023/dec/04/israeli-authorities-investigate-claims-of-short-selling-before-hamas-attack\nEither these investors know about Hamas attacks in advance, OR are simply compelled by Mars to have a gloomy and negative outlook. OR these investors know about the link between Mars, stock declines, and terror attacks against Israel\nI have been posting documents linking Mars to Hamas attacks and stock market declines. Here are the documents again.\nhttps://www.academia.edu/109012627/Apprehending_Mars_influence_on_Stock_Market_Crashes_and_Terror_Attacks\nhttps://www.academia.edu/109471936/Correlations_between_Mars_Hamas_Islamic_Jihad_terror_and_Stock_Market_downturns_since_2007", "media": null, "score": 2, "upvote_ratio": 0.75, "comment_count": 0, "over_18": false}, "52": {"id": "18a5wwj", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "DerpaloSoldier", "link_flair_text": "merchandise", "time": 1702094509.6103709, "created_utc": 1701644315.0, "url": "https://i.redd.it/t3d60ol6u54c1.png", "title": "1oz fine silver", "permalink": "/r/bigfoot/comments/18a5wwj/1oz_fine_silver/", "selftext": "", "media": null, "score": 151, "upvote_ratio": 0.98, "comment_count": 17, "over_18": false}, "53": {"id": "18cch8v", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Raptor_Jake", "link_flair_text": null, "time": 1702094510.1158605, "created_utc": 1701892284.0, "url": "https://i.redd.it/oq2rqujjbq4c1.jpeg", "title": "Cryptids Only Sighted Once Iceberg", "permalink": "/r/Cryptozoology/comments/18cch8v/cryptids_only_sighted_once_iceberg/", "selftext": "I announced that I’d do this a while back, and now I finally did it!", "media": null, "score": 158, "upvote_ratio": 0.95, "comment_count": 57, "over_18": false}, "54": {"id": "189m8wq", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Zealousideal-Tough35", "link_flair_text": "Outside site", "time": 1702094510.282153, "created_utc": 1701580137.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/189m8wq/help/", "title": "help", "permalink": "/r/Humanoidencounters/comments/189m8wq/help/", "selftext": "think i saw a skinwalker today. I live in aquidneck island. (area in ri) I was walking home earlier tonight from a local gas station i was walking threw a elementary school playground, when me and my girlfriend saw this creature in front of us. At first i thought it was one of my friends who left a couple minutes prior but once i started to get closer i noticed its body started to deform from a skinny tall into a wide short frame, it looked weird like a woman for a second. i got a weird sense that this thing wasn't human then it lowered it shoulder i noticed it had long ass hair that was covering its body. і didn't stick around for much more and started high tailing it out of there i don't know what i saw anything i think it would be a skinwalker but i have no clue if anyone can help me out it would be much appreciated.", "media": null, "score": 7, "upvote_ratio": 0.67, "comment_count": 14, "over_18": false}, "55": {"id": "18dndqz", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Otherwise_Sky1739", "link_flair_text": null, "time": 1702094511.0732212, "created_utc": 1702043870.0, "url": "https://i.redd.it/f1hr7i8au25c1.jpeg", "title": "My little cryptid bumper sticker collection", "permalink": "/r/cryptids/comments/18dndqz/my_little_cryptid_bumper_sticker_collection/", "selftext": "", "media": null, "score": 49, "upvote_ratio": 0.98, "comment_count": 3, "over_18": false}, "56": {"id": "18bxsq2", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "SongBirdExile", "link_flair_text": null, "time": 1702094511.3336203, "created_utc": 1701843846.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/18bxsq2/stalker_in_a_safe_city/", "title": "Stalker in a Safe City", "permalink": "/r/LetsNotMeet/comments/18bxsq2/stalker_in_a_safe_city/", "selftext": "I'm writing this because I firmly believe it is still happening and I want to write a warning. I don't care about sharing location because I moved on - but it is critical to this story. I've never written a post on Reddit before this, but if I can save anyone from the years of hell I went through, it's worth it.\nMy grandma moved to an apartment complex called Brampton Moors in Cary. You can look up the state. It's a beautiful city, low crime rate, and lots of trails (this is a critical part of this story). My grandma moved in 2017 to a ground level apartment near a trail that connects to the entire greenway system. It was accessible, therefore, it was the only option. It wasn't soon after (since I lived with her) that very strange events began.\nI noticed at night that I'd hear pine straw rustling around and shadows outside changing. The construction of this place is bad enough that you can hear outside clearly. I didn't think much about it because I thought it was wildlife from the trail  and there was a lamp post right near that window where I was staying. Wrong. I used to go on the trail during the day and I always carried self-defense items, but I started to feel like my movements from the apartment were being tracked to when I was staying over or not. My grandma's side didn't experience as much because it was farther from the trail, but it was darker on her side. One night, she did report someone trying to pop her window. The police dismissed her because of her age.\nSoon after, it got worse. Every summer night that year I heard more atypical noises and a shadow of a person. It scared me to death because I was a young adult and I feared the escalation process (I have a sociology degree). I would call the non-emergency line for the PD first, talking as quiet as I could so they could catch this guy, but he'd escape every time on the trail. Maintenance put in metal pieces and jammers on all windows and my grandma was finally convinced to install a security system on every single entry way because it would not stop. The PD would not do anything until this guy hurt me.\nEssentially, I had two choices: become nocturnal or beg friends to sleep at their houses to feel safe sleeping. My ex (partner at the time) lived across the street from my grandma's place and I often stayed the night at this point because I was terrified. One night, my ex was taking me back to my grandma's apartment at night and we saw this guy dressed in all black walking on the sidewalk away from the complexes toward stairs that lead from the sidewalk to the path below around midnight. That is NOT NORMAL for Cary. At all. Not even in summer. We saw that he pivoted back to the apartments to look into apartments behind bushes, so my ex shined the brights on their car and I took a very detailed description based on the illumination. I was certain I was going to get a visit again that night because this person was in a position to see when I came and went from the apartment.\nSure enough, I heard the rustling, the breathing, the pine straw, the trees, and the tapping near the window. I quietly called 911 and also reported the other apartment numbers and buildings he was peering into. I gave them the description, the direction he was probably going to flee in after hearing me on the phone, and everything. He fit the description of a previous tenant who stalked women in the complexes before. Cary PD finally took me seriously on that report the next day because the other women in those apartments caught him looking into their homes as well through the windows because there were dark patches and easy access to the greenway. I made a huge fuss and a group of us filed a police report. For privacy reasons, they wouldn't even tell us who it was but that they knew who it was - therefore, I could never get enough info to defend myself further. The complex installed very bright lamp lights, I bought a tazer and slept with a hunting knife near me when I could sleep, but he would still come to my window and I would hear him most nights. I started cursing him out and yelling, telling him that I'd take out all the anger I had at my horrible childhood on his ass and that if he ever dared to go further, I would make sure he'd meet the Devil soon. I got angry to the point where I would yell through the window at this asshole.  I called the PD each and every time. Nothing done. No fingerprints taken. I put up curtains, I tried my best, but this guy continued to terrorize me while I lived with my grandma until I could not take it anymore and I left to live with a different person. This is a key reason I lost a lot of years with my grandma who recently died.\nFor those in the area, he's a bald  white man who wears a black baseball hat, dark beard, stands around 5'9, wears all black shirt, black cargo shorts, and black shoes. He is probably in his late 30s to early 40s now. He hangs around the lake trail that descends into the woods where the trail goes under the road to enter the park greenway. People say he's a former tenant who was told to stay off the grounds, but the complex doesn't care for the residents. He stalks women on the first floor apartments and I do fear that something might happen. My grandma most likely wasn't targeted as much as me because I fit the target demographic. I went insane to the point where I had to take zzzquil during the day to sleep to make up for night-watch and making sure this creep didn't break in and assault me AND my grandma. Nobody should ever go through that. I was scared of every shadow I saw, the footsteps I heard, and the breathing. I couldn't go to sleep at all until 4 or 5 a.m. - he likes to be active anywhere from past midnight to around 2-3 a.m. being peak hours. He escapes via the greenway into the woods every time. \nSo many women reported experiencing the same thing and the complex ignoring it and the police also avoiding addressing the issue. This \"just doesn't happen\" in Cary. But it will get worse. And I hope by posting this that I will be wrong. \nTo my stalker that took my sanity, safety, and years with my grandma while her health declined because I felt my life was in danger when I stayed there: let's not meet because I will absolutely take out my grief on you. You don't scare me anymore; if anything, be scared that I caught you in the act and will always testify to the terrors you caused. You are a sick, twisted person that deserves the uneasy insomnia you inflicted on others.", "media": null, "score": 75, "upvote_ratio": 0.94, "comment_count": 6, "over_18": true}, "57": {"id": "18bnui2", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Traditional-Yak2810", "link_flair_text": null, "time": 1702094512.2593467, "created_utc": 1701814055.0, "url": "https://youtu.be/yepj3jeeTBk", "title": "POSSESSION of ELTON CASTEE at HAUNTED BRUSHY MOUNTAIN PRISON", "permalink": "/r/truecreepy/comments/18bnui2/possession_of_elton_castee_at_haunted_brushy/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "POSSESSION of ELTON CASTEE at HAUNTED BRUSHY MOUNTAIN PRISON", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/yepj3jeeTBk?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"POSSESSION of ELTON CASTEE at HAUNTED BRUSHY MOUNTAIN PRISON\"></iframe>", "author_name": "All & Nothing", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/yepj3jeeTBk/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@allnothing4617"}}, "score": 0, "upvote_ratio": 0.29, "comment_count": 2, "over_18": false}, "58": {"id": "18cxf98", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Thewriterdue25", "link_flair_text": "Personal Encounter ", "time": 1702094512.8752823, "created_utc": 1701961212.0, "url": "https://www.reddit.com/r/Ghosts/comments/18cxf98/i_think_my_dad_is_still_trapped_in_this_house_and/", "title": "I think my dad is still trapped in this house and haunting us", "permalink": "/r/Ghosts/comments/18cxf98/i_think_my_dad_is_still_trapped_in_this_house_and/", "selftext": "Sorry in advance for the long post. \nFor context, there were 7 people living in the house including me, my husband, our daughter, my mom, my dad, my younger sister, and her fiancé. just over three weeks ago my dad committed suicide in his room while my mom was away for the weekend. I had seen him the night previous around 6pm. In the house  was me, my husband, our daughter, and my dad. I found him the next morning after 8am when I went to wake him up to ask him a question. From what the medical examiner said he had been gone for at least 8-12hrs when I had found him. We had to wait a few hours after discovery for him to be removed because of investigation, the medical examiner, and for transportation. \nMy mom was freaked out the most because he had been in there so long without the windows opened. We have always heard that you should open the windows of the room someone passed away in so that their spirit doesn’t linger and moves on. We were able to open them after all the police left and we gutted the room of everything. Got my mom all new furniture and cleaned the room. \nThere’s been things here and there that have seemed off like he might still be here. The first was the random smells of a bonfire coming from rooms that face our backyard fire pit area. He loved having bonfires and get togethers back there. A board game got knocked over that had been sitting in that spot for days undisturbed. It was a game he specifically bought for my daughter on her bday. The thermostat was turned way down or off. He was notorious for always turning it down claiming to be too hot when the rest of us were fine or even cold. Objects being missing or not where we last remembered them being. I’ve had a couple dreams where he was there. My sister has been seeing shadows moving out of the corner of her eye downstairs. \nBut this morning was the worst. I have had issues in the past with dreams where I feel trapped or like I’m awake, but can’t control anything. Definitely borders on sleep paralysis. This morning I was sleeping on the couch upstairs after dropping my husband off to work. I had my phone playing white noise next to me. I had a hard time falling asleep and I didn’t even realize I had. I could feel myself laying there with my eyes closed. I could hear the white noise. Then I suddenly heard his voice clear as day. “Hey!” “Hey (my nickname)!” I remember feeling paralyzed and terrified like I couldn’t breathe. I tried to ignore it and hope it would go away. Then he started talking more and I’m paraphrasing but it was like “are you going to help me? I need help with something. Can you come here?” \nI felt myself get up and I stumbled toward the room, but I couldn’t really open my eyes. It felt like every time I tried to they would close immediately. When I got to the bedroom I saw a flash of him and he was trying to play fight with me like we used to do. He was talking but I could barely hear him. Then he ran past me down the stairs into the basement into blackness saying something about “going to get my girls.” And he laughed. Then I woke up suddenly on the couch.\nThere’s been this weird heavy feeling in the house now. \nMy nerves are fried and I think I’m about to spend the day saging the whole house.", "media": null, "score": 309, "upvote_ratio": 0.89, "comment_count": 52, "over_18": false}, "59": {"id": "18a6z1d", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Ok-Temporary-8407", "link_flair_text": "Glitch Pic", "time": 1702094513.0896487, "created_utc": 1701647307.0, "url": "https://i.redd.it/d4xymwh3364c1.jpg", "title": "Repeated same day", "permalink": "/r/GlitchInTheMatrix/comments/18a6z1d/repeated_same_day/", "selftext": "", "media": null, "score": 32, "upvote_ratio": 0.92, "comment_count": 6, "over_18": false}, "60": {"id": "18b0v55", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Awstun_", "link_flair_text": null, "time": 1702094514.9162078, "created_utc": 1701741665.0, "url": "https://i.redd.it/8o6jsjcovd4c1.jpeg", "title": "Execute ‘CATASTROPHIC DISCLOSURE’", "permalink": "/r/ufo/comments/18b0v55/execute_catastrophic_disclosure/", "selftext": "Today, Mike & Mike successfully quelled the UAP Disclosure Act. This House Republican minority defeated a bill that passed the Senate with bipartisan support. It would have brought unprecedented oversight including Title 50 access giving Congress the ability to challenge any government agency on the issue, including the CIA. \nThe DoD may have won the battle, but they won’t win the war. The American people know that the overwhelming majority of the $800B we give to the Pentagon in taxpayer funds each year is unaccounted for. They’ve never passed an audit. \nWe ask for whistleblowers who have first-hand experience of NHI to please come forward. My hope is that a majority of them don’t support this treason.", "media": null, "score": 295, "upvote_ratio": 0.97, "comment_count": 40, "over_18": false}, "61": {"id": "18dnjgp", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "disclosurediaries", "link_flair_text": "Video", "time": 1702094516.1474986, "created_utc": 1702044317.0, "url": "https://v.redd.it/55rsj3rfv25c1", "title": "So...catastrophic disclosure it is, then?", "permalink": "/r/UFOs/comments/18dnjgp/socatastrophic_disclosure_it_is_then/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/55rsj3rfv25c1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1728, "scrubber_media_url": "https://v.redd.it/55rsj3rfv25c1/DASH_96.mp4", "dash_url": "https://v.redd.it/55rsj3rfv25c1/DASHPlaylist.mpd?a=1704686515%2CYjZkYWVjYmNmYTg4ODdlMmY5MTZhYmI2NTg0NmVlNGRlZmUzNmMxMDlhZDExOTJmMWUyNWQxNjlmN2Y3MzZiNg%3D%3D&v=1&f=sd", "duration": 54, "hls_url": "https://v.redd.it/55rsj3rfv25c1/HLSPlaylist.m3u8?a=1704686515%2CYzEyMDNhZjg4MzFhM2JlNjU1MmVkOWUwYmI3ZDY1NDRiYTNlOTI3OWRhNjBhNzNkZjMzODY4Yjk0MmVhYzFjZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2351, "upvote_ratio": 0.84, "comment_count": 836, "over_18": false}, "62": {"id": "18a3z8i", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "TimeCntrlingUnicorn", "link_flair_text": "Video", "time": 1702094518.0894754, "created_utc": 1701639164.0, "url": "https://v.redd.it/9tcqssqnw44c1", "title": "Brazilian indigenous people reacting to a picture of a “grey alien”", "permalink": "/r/aliens/comments/18a3z8i/brazilian_indigenous_people_reacting_to_a_picture/", "selftext": "", "media": null, "score": 1215, "upvote_ratio": 0.93, "comment_count": 127, "over_18": false}, "63": {"id": "18a9is5", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "ForestedBlues", "link_flair_text": "Article", "time": 1702094518.8618488, "created_utc": 1701655075.0, "url": "https://agitator.substack.com/p/sean-kirkpatricks-new-job-is-at-a", "title": "Sean Kirkpatrick's new job is at a UFO hotspot run by the Department of Energy and Battelle Institute", "permalink": "/r/UAP/comments/18a9is5/sean_kirkpatricks_new_job_is_at_a_ufo_hotspot_run/", "selftext": "", "media": null, "score": 249, "upvote_ratio": 0.98, "comment_count": 20, "over_18": false}, "64": {"id": "18ct6tj", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "ClockworkSkyy", "link_flair_text": null, "time": 1702094519.897483, "created_utc": 1701946822.0, "url": "https://www.reddit.com/r/conspiracy/comments/18ct6tj/i_work_with_the_public_and_im_seeing_so_much/", "title": "I work with the public and I'm seeing so much cognitive decline lately", "permalink": "/r/conspiracy/comments/18ct6tj/i_work_with_the_public_and_im_seeing_so_much/", "selftext": "I've worked with the public for the last decade. It used to bring me so much joy but now not so much. I'm starting to notice a decline in people's cognitive abilities and their ability to reason. \nSelfishness and entitlement is absolutely rife yet people are bled dry of every penny and they sit and accept it. \nPeople's ability to reason and critically think about a given situation is none existent. They go from 0-100 over the slightest thing. The get so enraged over the slightest thing and even more so if you don't agree with their narrative views. This is both online and in the physical world. \nI used to enjoy conversations with people about general topics. Not so much anymore, after a few sentences people tend to resort to talking about the fear mongering that they're hypnotised by and can't hold a normal conversation. \nEDIT: example, I'll be discussing let's say football. Normally it'll be a nice debate but lately if you don't agree with them or have different views then you're like a mortal enemy. This is a likely outcome across the board of topics. \nGo shopping in retail when it's busy and you'll see what I mean. Take a drive during rush hour and you'll see what I mean.", "media": null, "score": 1608, "upvote_ratio": 0.9, "comment_count": 639, "over_18": false}, "65": {"id": "1898yk3", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1702094520.2452514, "created_utc": 1701539237.0, "url": "https://youtu.be/cum5UyyeQes", "title": "Meng Zhaoguo claims he ‘slept with an alien’ and is now waiting for a hybrid child", "permalink": "/r/conspiracyfact/comments/1898yk3/meng_zhaoguo_claims_he_slept_with_an_alien_and_is/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Meng Zhaoguo claims he ‘slept with an alien’ and is now waiting for a hybrid child", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/cum5UyyeQes?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Meng Zhaoguo claims he ‘slept with an alien’ and is now waiting for a hybrid child\"></iframe>", "author_name": "Paranormal Highway", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/cum5UyyeQes/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@ParanormalHighway"}}, "score": 3, "upvote_ratio": 0.71, "comment_count": 1, "over_18": false}, "66": {"id": "18afk0t", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "helboudicca", "link_flair_text": "tattoo", "time": 1702094521.017258, "created_utc": 1701676971.0, "url": "https://i.redd.it/5thhvvv8j84c1.jpeg", "title": "I got Bigfoot tattooed on my leg", "permalink": "/r/bigfoot/comments/18afk0t/i_got_bigfoot_tattooed_on_my_leg/", "selftext": "Been obsessing over Bigfoot for years, thought it was time to take the commitment up a notch and get the legend permanently imprinted in my skin.", "media": null, "score": 137, "upvote_ratio": 0.91, "comment_count": 19, "over_18": false}, "67": {"id": "18c1cs3", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "MrGoldenEra", "link_flair_text": "Discussion ", "time": 1702094521.6632762, "created_utc": 1701859592.0, "url": "https://i.redd.it/hdsuhrvbmn4c1.jpg", "title": "Most Credible Lake and or Sea Serpent/Cryptid Reports, Photos, and Videos?", "permalink": "/r/Cryptozoology/comments/18c1cs3/most_credible_lake_and_or_sea_serpentcryptid/", "selftext": "Hey guys! \nRecently I’ve had a resurgence of research on lake cryptids and sea monsters. \nI’m from Wisconsin so there aren’t many if not any lake cryptids in my state personally that I found. \nI believe that these group of cryptids are the most intriguing yet terrifying due to the fact that we barely have tapped the depths of the oceans and even our lakes, so anything really can be hiding down there. \nWhat do you guys believe are the most credible photos and videos of said creatures, let me know below!", "media": null, "score": 149, "upvote_ratio": 0.97, "comment_count": 48, "over_18": false}, "68": {"id": "18d9ojh", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "c4vem4n-oz", "link_flair_text": null, "time": 1702094522.846928, "created_utc": 1701994203.0, "url": "https://i.redd.it/3bldddjlqy4c1.jpg", "title": "Who can name them all?", "permalink": "/r/cryptids/comments/18d9ojh/who_can_name_them_all/", "selftext": "Bonus points if you know them all...sure I'm going to get the usual but such n such isn't cryptid message but it's all good.", "media": null, "score": 42, "upvote_ratio": 0.94, "comment_count": 23, "over_18": false}, "69": {"id": "18bz6nd", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "_internet_rat_", "link_flair_text": null, "time": 1702094523.1090581, "created_utc": 1701849750.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/18bz6nd/clown_on_a_lawnmower/", "title": "Clown on a lawnmower?", "permalink": "/r/LetsNotMeet/comments/18bz6nd/clown_on_a_lawnmower/", "selftext": "So, I have contemplated telling this forever because it sounds so not real, but I love this sub so much, so I've decided to share it here.  When I was in high school, I worked at the local Pizza Hut and I was a closing server, so after closing down the salad bar and mopping I got out of there pretty late. I had this ritual of texting my dad when I was almost done to let him know I was almost home but mostly it was to test and see if him and my mom were awake or not, if they weren't I would take the long way home on the old country roads (I lived on a dog breeding farm 20 mins outside of town) and I would smoke a joint or two and jam out. \nOne particular night I decided to do this, and I was riding along a backroad about 3/4 mins from my house, this is a road I know very well, my bus took this road my whole childhood. One thing to note about my area is I live in the deep woods of East Texas so most people who own property put their houses about 1/4-1/2 of a mile back on their property and keep their exposed woods as basically a natural fence and defense. So, while you can see a lot of driveways and mailboxes you can see almost no houses, just woods with chunks taken out. \nAs I'm driving, I come upon a toolbox (like the ones that sit up in the back of work trucks) smack dab in the middle of the tiny dirt road. I pull up to it and stop and open my door stepping out but not away from my car, as I take in my obstacle, I realize my headlights are not the only light in the road, there are headlights, small ones, coming up a driveway that was parallel with the toolbox. \nI sit back down in my car and close my door till only a crack is open, so that in a moment's notice I can close it, go off into the grass and get tf outta there. A small riding wheel lawnmower comes out from the trees and riding it is a man in a full clown suit and mask with a shotgun layed across his lap. He turns and looks directly through my windscreen and into my eyes and brings the shotgun up out of his lap. Now I am a country boy through and through I can smell when I'm somewhere I'm not wanted so before he even got the butt of that thing to his shoulder my car was in drive and in the side ditch of the road. I got out of there, threw my joint out, went home crawled in bed and never spoke about it again. I don't know what that guy was doing seeing as this was probably 2018-19 so after the \"killer clown\" craze. Whether it was a dumb kid or some crazy backwoods man, Mister Clown, let's not meet again. Please.", "media": null, "score": 46, "upvote_ratio": 0.97, "comment_count": 3, "over_18": true}, "70": {"id": "18aaaf7", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "forhealthy", "link_flair_text": null, "time": 1702094523.2628002, "created_utc": 1701657512.0, "url": "https://www.youtube.com/watch?v=YhplvVHPG4I", "title": "Very clear video footage of a UFO in the sky of Spain - exciting scenes and details.", "permalink": "/r/truecreepy/comments/18aaaf7/very_clear_video_footage_of_a_ufo_in_the_sky_of/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Very clear video footage of a UFO in the sky of Spain - exciting scenes and details.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/YhplvVHPG4I?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Very clear video footage of a UFO in the sky of Spain - exciting scenes and details.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/YhplvVHPG4I/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 0, "upvote_ratio": 0.17, "comment_count": 2, "over_18": false}, "71": {"id": "18a4lsf", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Training_Beat7600", "link_flair_text": "Is this undeniable evidence?", "time": 1702094523.9773908, "created_utc": 1701640796.0, "url": "https://v.redd.it/1hwi1wtoj54c1", "title": "Poltergeist activity in new apartment. Any advice?", "permalink": "/r/Ghosts/comments/18a4lsf/poltergeist_activity_in_new_apartment_any_advice/", "selftext": "Moved into an apartment/ house that was built in 1912 after the old tenant “suddenly left”. I did some research and I did a spirit box session and it kept saying FIRE FIRE FIRE. Turns out the basement of this place had an accidental fire around 1965. Here’s the video ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/1hwi1wtoj54c1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/1hwi1wtoj54c1/DASH_96.mp4", "dash_url": "https://v.redd.it/1hwi1wtoj54c1/DASHPlaylist.mpd?a=1704686523%2CYWM4NTYzYjUxNDYwNzYxOThmMWRjMjYwNTg2ZTkzMDA3MWYyYzhiYjBhNzBhNGU4NDk3ODU1NDQ4YTk5ZDY0Mg%3D%3D&v=1&f=sd", "duration": 22, "hls_url": "https://v.redd.it/1hwi1wtoj54c1/HLSPlaylist.m3u8?a=1704686523%2CYTM1N2ZlM2I0ODk2ZjFkMzRiZGUzYWMzMGY4NDBjZjJiYzk3NTkxOTBmNGMzNWFmZGIxMjU5NzNmNTc5NGFjNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 288, "upvote_ratio": 0.84, "comment_count": 128, "over_18": false}, "72": {"id": "18ctb9r", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "UrFavAnimeWhore", "link_flair_text": "Glitch Pic", "time": 1702094524.1688771, "created_utc": 1701947292.0, "url": "https://i.redd.it/1vtlpfw3vu4c1.jpg", "title": "Tried to open this nature valley bar and turns out they double packaged it lmao", "permalink": "/r/GlitchInTheMatrix/comments/18ctb9r/tried_to_open_this_nature_valley_bar_and_turns/", "selftext": "", "media": null, "score": 14, "upvote_ratio": 0.77, "comment_count": 1, "over_18": false}}}