{"_default": {"1": {"id": "1bo615x", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Stonetown_Radio", "link_flair_text": "Discussion", "time": 1711775682.8283753, "created_utc": 1711454116.0, "url": "https://www.reddit.com/gallery/1bo615x", "title": "A friend of mine was photographing starlink last night in the sky over northern New Jersey. Something else caught his eye. We zoomed in on the picture and can’t figure out what it is. Any ideas?", "permalink": "/r/ufo/comments/1bo615x/a_friend_of_mine_was_photographing_starlink_last/", "selftext": "The wide angle photo shows star link in the center. The object at 11 o’clock is what caught my friends attention. The close-up picture is just a cropped version of the wide angle.", "media": null, "score": 717, "upvote_ratio": 0.95, "comment_count": 233, "over_18": false}, "2": {"id": "1bnkb62", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TasteeBeverage", "link_flair_text": "Sighting Report", "time": 1711775684.3596637, "created_utc": 1711389751.0, "url": "https://v.redd.it/qakqnx4csiqc1", "title": "UAP Observed from Cruise Ship in Gulf of Mexico", "permalink": "/r/UFOs/comments/1bnkb62/uap_observed_from_cruise_ship_in_gulf_of_mexico/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/qakqnx4csiqc1/DASH_360.mp4?source=fallback", "has_audio": false, "height": 360, "width": 640, "scrubber_media_url": "https://v.redd.it/qakqnx4csiqc1/DASH_96.mp4", "dash_url": "https://v.redd.it/qakqnx4csiqc1/DASHPlaylist.mpd?a=1714367683%2CY2FkMWEzNGY5OWUzMDY4NDRjZTM4NGQ5YTc3ZTkxZTU2MmUyMDhjMzY1MzBiNmI2YzhmMmQ1NDFkYmNhYTRlMQ%3D%3D&v=1&f=sd", "duration": 24, "hls_url": "https://v.redd.it/qakqnx4csiqc1/HLSPlaylist.m3u8?a=1714367683%2CYjZmNGRiMTJmZjdkYWJkYmMxODkwZTdmZGQ5N2E4NzgzMmViNmRmNTFiOGVjYTQxMDA1OTM2MzlhYzdiN2MzNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2823, "upvote_ratio": 0.89, "comment_count": 567, "over_18": false}, "3": {"id": "1boi61z", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Realmtek", "link_flair_text": "Discussion :table:", "time": 1711775686.1142402, "created_utc": 1711484962.0, "url": "https://i.redd.it/rfpn39xhnqqc1.jpeg", "title": "Who else? ", "permalink": "/r/aliens/comments/1boi61z/who_else/", "selftext": "", "media": null, "score": 1377, "upvote_ratio": 0.96, "comment_count": 324, "over_18": false}, "4": {"id": "1bpm6hv", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "paulreicht", "link_flair_text": "Discussion", "time": 1711775686.440706, "created_utc": 1711598053.0, "url": "https://www.reddit.com/r/UAP/comments/1bpm6hv/ufonuke_mystery_goes_global_india_cites_craft/", "title": "UFO-nuke mystery goes global: India cites craft over nuclear power plants 'every few days'", "permalink": "/r/UAP/comments/1bpm6hv/ufonuke_mystery_goes_global_india_cites_craft/", "selftext": "An Indian newspaper reports craft flying over nuclear power plants 'every few days'. Roughly one dozen incidents were reported. Senior law enforcement in India investigated and video-taped eerie UFO sightings over nuclear plants across the Asian nation last year, a local news report revealed.\nOne witness, a police sub-inspector and engineer by training, said he was '100-percent sure' the object he taped, with its high-speed 'zigzag movements,' could not be explained by human tech.\nPolice sub-inspector Syed Abdul Kader, assigned to the technical wing of the Tirunelveli office an hour's drive north of the Kudankulam nuclear plant, told UFO expert Sabir Hussain that he filmed two videos of the unusual airborne phenomena.\nThe region near the bustling city of Chennai is home to the Madras Atomic Power Station (MAPS) in Kalpakkam. Kader's video-taped sightings, Hussain told DT Next, 'happened jus10 days after former DGP [Director General of Police] Prateep V. Philip took pictures of a UFO on [the] Muttukadu sea shore near Chennai.'\nThe roughly dozen or so incidents all involved apparent craft loitering oddly near the Kudankulam nuclear plant at the southern tip of the subcontinent and the Madras atomic power station near Kalpakkam along the country's east coast\nKader's 2023 sightings to the south, overlapped with weeks of sightings in July and August up the eastern coast along the Neelankarai-Mahabalipuram shoreline. Kader's video-taped sightings, Hussain told DT Next, 'happened just 10 days after former DGP [Director General of Police] Prateep V. Philip took pictures of a UFO on [the] Muttukadu sea shore near Chennai.' Philip's rank of DGP is the highest position attainable in the Indian Police Service.\nFull story: https://www.dailymail.co.uk/sciencetech/article-13240565/UFO-nuke-mystery-India-nuclear-power-plants-days-Syed-Kader-police.html\nNo video was included with the story.", "media": null, "score": 125, "upvote_ratio": 0.94, "comment_count": 20, "over_18": false}, "5": {"id": "1bntu9u", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "appleman33145", "link_flair_text": null, "time": 1711775687.7192962, "created_utc": 1711412270.0, "url": "https://i.redd.it/2myl2ndcnkqc1.jpeg", "title": "Why Would P Diddy Flee When Facing Charges for Child Sex Trafficking?", "permalink": "/r/conspiracy/comments/1bntu9u/why_would_p_diddy_flee_when_facing_charges_for/", "selftext": "", "media": null, "score": 4463, "upvote_ratio": 0.95, "comment_count": 1290, "over_18": false}, "6": {"id": "1bqou13", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "myartspeace", "link_flair_text": null, "time": 1711775688.047925, "created_utc": 1711717590.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1bqou13/what_if_you_could_feel_natural_euphoria_on_demand/", "title": "What if you could feel natural euphoria on demand?", "permalink": "/r/conspiracyfact/comments/1bqou13/what_if_you_could_feel_natural_euphoria_on_demand/", "selftext": "Would you want to know how?\n​\nThis is possible through the conscious activation of your Life force.\n​\nUnfortunately the higher-ups have set up this society so that we completely lose our connection to it.\n​\nUntil we completely lose our connection to it.\n​\nWhether through the toxic/irradiated food we eat, the drinks we consume, the highly detrimental substances we put inside of our body and the innumerable number of adult content tempting us to reset this vital energy.\n​\nhttps://youtu.be/eUKDNB06iJ0\n​\nBecause the higher-ups know what we can do with our conscious activation of it if we ever develop a high/healthy source of it.", "media": null, "score": 5, "upvote_ratio": 0.78, "comment_count": 1, "over_18": false}, "7": {"id": "1bopi16", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Creepastaa", "link_flair_text": "semi-related", "time": 1711775688.9933274, "created_utc": 1711502714.0, "url": "https://v.redd.it/ts6wb3d94sqc1", "title": "Serious question, why can't we get footage like this on Bigfoot shows?", "permalink": "/r/bigfoot/comments/1bopi16/serious_question_why_cant_we_get_footage_like/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/ts6wb3d94sqc1/DASH_720.mp4?source=fallback", "has_audio": false, "height": 720, "width": 1040, "scrubber_media_url": "https://v.redd.it/ts6wb3d94sqc1/DASH_96.mp4", "dash_url": "https://v.redd.it/ts6wb3d94sqc1/DASHPlaylist.mpd?a=1714367688%2CNzdjNmI4Y2E5NTBhM2M5NmMwNDBiZTc4MjI5ZGExOGQwOGFjN2QzMTEzMzg3ZWRkNGRlNjg4YzhiZTI3OWI2OQ%3D%3D&v=1&f=sd", "duration": 10, "hls_url": "https://v.redd.it/ts6wb3d94sqc1/HLSPlaylist.m3u8?a=1714367688%2CZWQxYWQwY2RlNTRkZDljZTFkMzRlNDNjYThhOWNkYzNkNTZkZmZmMmQ0NDNlYTk5NjY5ZTBhNjM2YjQwNjU5Zg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1782, "upvote_ratio": 0.96, "comment_count": 1089, "over_18": false}, "8": {"id": "1boh68d", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "VampiricDemon", "link_flair_text": "Cryptozoologist", "time": 1711775689.5156221, "created_utc": 1711482577.0, "url": "https://i.redd.it/q2qqk5fbfqqc1.png", "title": "Dame Jane Morris Goodall is an English primatologist and anthropologist. She is considered the world's foremost expert on chimpanzees and she is known to support the possibility that undiscovered species of primates may still exist today, including some of the more famous cryptids.", "permalink": "/r/Cryptozoology/comments/1boh68d/dame_jane_morris_goodall_is_an_english/", "selftext": "", "media": null, "score": 391, "upvote_ratio": 0.96, "comment_count": 45, "over_18": false}, "9": {"id": "1bpodp6", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "MelodiousLuna", "link_flair_text": "Humanoid", "time": 1711775689.767552, "created_utc": 1711605836.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1bpodp6/black_tenchcoat_bowler_hat_and_red_eyes_on_route/", "title": "Black tenchcoat, bowler hat, and red eyes on route 66 NM", "permalink": "/r/Humanoidencounters/comments/1bpodp6/black_tenchcoat_bowler_hat_and_red_eyes_on_route/", "selftext": "Hi guys, So before I start this post, I will say that I was very young, but my mother recalls the experience quite clearly. I'm not really into cryptozoology at all, but I'm curious if this is a common sighting, or what exactly my mother, father, and I experienced. \nThis was along route 66 going from Texas into New Mexico. We were heading to my great grandfathers funeral back in 2005 in the middle of the summer and I was ten at the time. The sun was starting to set, and I remember us talking, I'm eating a happy meal they bought me at the time and we were just swapping stories and having a good time, they made me this little cubby like area in the trunk for me to lay down in, color, etc. But most of the trip was spent just looking out the window, watching things pass by. \nWhile my parents were talking and the radio was on, I was just watching the world pass by, but I remember very clearly seeing a man standing and staring at cars, he wore a black trench coat, bowler or perhaps a top hat, a black beard, but the part I remember the most vividly was bright, glowing red eyes, I pointed it out to my mom who was distracted at the time, having not seen it. Well, a couple hours go by and I'm still looking out my window. I made a little game for myself to see if I could count how many birds I could spot along the way, and the sun was starting to set. Next thing I know, I see the same dude just ahead of us, but because of the dark, the eyes were a lot more intense, My mom got a little concerned about it and told my dad to speed up. \nEventually fatigue set in, and we found a rest stop, it was pitch black there, like. The kind of dark you can't even see your own feet in without a light, and we were all trying to sleep. I had to go to the bathroom and my dad walked out with me as I was rather freaked out from the sighting earlier, worried the guy would come grab me. As we got out of the car I remember my father staring off into the distance, and told me to hurry up, though keeping his usual calm demeanor. When I finished and got back into the car, he started it and we took off again, driving to stay in a motel instead. \nI asked him and my mother about it recently as we were reminiscing together about trips we've taken. When i asked my dad why he had us go to a motel he claimed it was because he saw the same pair of eyes staring at us from a hill near where we were, above a rocky outcrop. \nDoes anyone have any ideas or stories as to what exactly this could have been?  I remember the eyes so vividly, it's burned into my mind, as well as him being out in desert heat with a heavy trench coat and I'm not sure. My dad swears it was the devil, My mom thinks it was a Chupacabra of some sorts. I myself am not sure. Any thoughts would be appreciated, as I said this was over 19 years ago and I haven't seen anything since as I live far away from route 66 now. ", "media": null, "score": 189, "upvote_ratio": 0.97, "comment_count": 50, "over_18": false}, "10": {"id": "1bm53c3", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "deadyorik", "link_flair_text": null, "time": 1711775690.3130095, "created_utc": 1711233458.0, "url": "https://i.redd.it/vusddrbnv5qc1.jpeg", "title": "Please stop putting quarters in the Mothman statue’s butt.", "permalink": "/r/cryptids/comments/1bm53c3/please_stop_putting_quarters_in_the_mothman/", "selftext": "", "media": null, "score": 1001, "upvote_ratio": 0.98, "comment_count": 152, "over_18": false}, "11": {"id": "1bmeq18", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "daveyjones86", "link_flair_text": "Aliens/UFOs", "time": 1711775690.6227489, "created_utc": 1711263981.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1bmeq18/reporting_on_ufo_i_saw_years_ago/", "title": "Reporting on UFO I saw years ago", "permalink": "/r/Thetruthishere/comments/1bmeq18/reporting_on_ufo_i_saw_years_ago/", "selftext": "When I lived in PA, I would drive home from work around 11pm and drive on a pretty quiet road since it was late.\nOne night I was driving with one person in front of me, and I look up to see a ship of some sort in the sky. I at first didn't think much of it, but as I studied it a bit more, the way it was flying was very peculiar.\nIf anyone has played Galaga, I swear the way it moved reminded me of that kind of. It was moving left, right, up, down. It felt very much like it had complete control of the sky.\nAs far as looks go, it wasn't like a perfect saucer kind of aircraft. What I could make out is the green oscillating (?) lights which swirled around it. The thing was obviously foreign from anything I had seen before.\nFinally, out of nowhere, it stops, then races downward (not up into the sky) and dissappears. I thought a bomb had went off or something crazy so I slammed on brakes, so did the person in front of me.\nIt was definitely a crazy experience and idk what I saw. What I know for sure though is that the person in front of me saw it too, and this thing did not go upward, it went down before dissappearing.", "media": null, "score": 37, "upvote_ratio": 0.92, "comment_count": 12, "over_18": false}, "12": {"id": "1bluny6", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Scienter18", "link_flair_text": null, "time": 1711775690.8212106, "created_utc": 1711207219.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1bluny6/i_used_to_follow_people_for_work/", "title": "I used to follow people for work", "permalink": "/r/LetsNotMeet/comments/1bluny6/i_used_to_follow_people_for_work/", "selftext": "I used to be a surveillance investigator for insurance claims, work injury stuff - to see if people who claimed to have been hurt at work and were collecting free money, were actually not injured. I did this full time for about 10 years. Doing a new case every few days for 10 years, you see a lot of weird shit. For example one time I saw drug dealers in a downtown city literally riding horseback. You see scary stuff too obviously if in bad neighborhoods etc  \nScariest encounter went down about 20 years ago.  This was a case in a somewhat rural area which were always the toughest.  You get there at 6am see what cars are in the vicinity and run plates to see if they match the person. Then mostly you watch for the registered vehicle to depart if you found one.  This place had one car in the driveway with no plates - which actually was quite unusual.  You are also provided an age/height/weight of the person and in rare cases a pic.  So I knew this was a guy in his mid 30s, average height and weight.\nFirst day it turned out he left before I got there. Protocol is if you can’t confirm they are home by 10 am (4 hours onsite), you literally need to knock on their door to confirm if they are home. You usually pretend to be a UPS delivery in a costume and a dollar store item in an envelope with a clipboard. Surprisingly that works.  Anyways, no one was home. \nSecond day, came back at 5am - and low and behind a second vehicle was there, a truck - also with no plates. The dude came out around 530am and left.  I followed him but he was immediately wise and knew he was being followed which usually means they are up to no good I.e. working while collecting insurance disability money aka insurance fraud. I let him go while trying to be discreet about it. \nI came back the third day in another car which you also sometimes had to do.  This time he left again early and I successfully followed him to a farm in the neighboring rural hills.  \nIn short, i busted his ass on video doing heavy duty farm work for several hours. He eventually caught on and realized he was being watched.  I took off from my parked position and thought there was no way he could suddenly get off his tractor, run to his truck and get to me as there were driveways etc between us and also a creek. \nSomehow he was then a uddenly on my ass in his truck in some scary ass rural mountain roads.  I was scared shitless and kept driving and somehow I made it to the freeway. I had literally been lost in the mountains.\nOn the freeway, he followed me for miles and I couldn’t shake him.  He would pull beside me at times and flex his arm and gesture pull over.  Dude was actually pretty scary looking and I had evidence on him that would cost him in more ways than one.\nI literally called 911 and reported a drunk driver endangering me, but was surprisingly told the officers were in between shifts and couldn’t help.  There was an easy pass bridge about 20 miles up if I got that far, and at first I thought I could lose him there if he didn’t have the easy pass, but then realized again he had no plates so wouldn’t matter.\nAnyways, after many miles i finally was able to shake him, but he remained pretty close behind.  I exited the freeway and found a gas station- a cop was there and I reported this guy and his truck. The cop made a call and I didn’t see this guy pull up. Shortly thereafter I gassed up my car and left and drove home and submitted my report. I’m sure his free insurance money ended at the very least.\nScariest part actually is that i was worried this guy had my license plate and could run it somehow (as I was able to do for work) and locate where I live.  I began to research him online.  Sometimes in that line of work you learn the potential insurance fraud of the person you are following is the least of their criminal endeavors.  Well i learned this guy was a hardcore convicted felon who had been in federal prisons and was a gang member and hard drug user and dealer.  I was scared but nothing happened over the next few years and i eventually forgot about it.\nBut about 5 years later or so, i had a case in the same rural area again and thought about this guy.  I wanted to google him to see what the police blotters revealed about him in the last few years.  I googled him again and discovered he was actually dead.  I learned that a couple years prior, he had taken his girlfriend hostage with a gun, killed someone who tried to help her, then was killed himself by another person who actually saved her.  Don’t need to worry about meeting him again.", "media": null, "score": 229, "upvote_ratio": 0.94, "comment_count": 19, "over_18": true}, "13": {"id": "1bou3ku", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "muneralhubic", "link_flair_text": null, "time": 1711775691.041, "created_utc": 1711516714.0, "url": "https://i.redd.it/4zrpw89my2671.jpg", "title": "Dweller.", "permalink": "/r/truecreepy/comments/1bou3ku/dweller/", "selftext": "", "media": null, "score": 41, "upvote_ratio": 0.86, "comment_count": 4, "over_18": false}, "14": {"id": "1bm6373", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Esoteric-Head", "link_flair_text": null, "time": 1711775691.241626, "created_utc": 1711236045.0, "url": "https://www.reddit.com/r/threekings/comments/1bm6373/what_are_the_most_dangerous_rituals_out_there/", "title": "What are the most dangerous rituals out there?", "permalink": "/r/threekings/comments/1bm6373/what_are_the_most_dangerous_rituals_out_there/", "selftext": "Just asking around, which one of them has the highest risk to it?", "media": null, "score": 10, "upvote_ratio": 1.0, "comment_count": 9, "over_18": false}, "15": {"id": "1blqbgc", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "JustKoiru", "link_flair_text": "Captured Apparition ", "time": 1711775691.9605548, "created_utc": 1711194496.0, "url": "https://www.reddit.com/gallery/1blqbgc", "title": "This is a photo taken from my school's security camera 7 years ago. The original footage showed the figure moving through the table and into the wall.", "permalink": "/r/Ghosts/comments/1blqbgc/this_is_a_photo_taken_from_my_schools_security/", "selftext": "Hello, I have always been interested in the paranormal, and every time I talk about my encounters I come back to this footage. This was taken directly from the security office at my old highschool, so the possibility of tampering is low. \nThe original video is lost to time, but I am trying my hardest to find out if any of my old classmates have it saved after all these years. \nThe video shows the figure in the middle of the frame phasing through the picnic table before vanishing into the wall of a classroom. It walks slowly, like an old woman. \nI have considered the possibility of it being students playing a prank, but the footage was caught at 2am, where the entire room is locked and guarded, and this was in 2017, where ai generation and video altering was too complicated for teenagers. \nI thought the figure looked a lot like the hanging cloth in the background, but that doesn't explain how it moved through the table and into the wall. \nAnyways, just thought I'd share because I find this really interesting and hope to catch more stuff like this. I will update if I find the video.", "media": null, "score": 143, "upvote_ratio": 0.9, "comment_count": 23, "over_18": false}, "16": {"id": "1bmb8yn", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "sunshineblair", "link_flair_text": "Glitch Pic", "time": 1711775692.9299014, "created_utc": 1711251158.0, "url": "https://www.reddit.com/gallery/1bmb8yn", "title": "My husband and I went to the Safari Park, I took tons of pictures. When I got home and checked them, I noticed this one in particular. What’s going on? Where’s the rest of his arm?", "permalink": "/r/GlitchInTheMatrix/comments/1bmb8yn/my_husband_and_i_went_to_the_safari_park_i_took/", "selftext": "", "media": null, "score": 567, "upvote_ratio": 0.92, "comment_count": 100, "over_18": false}, "17": {"id": "1bpe1lf", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Awstun_", "link_flair_text": null, "time": 1711775694.4641166, "created_utc": 1711576020.0, "url": "https://i.redd.it/x9pw8i396yqc1.jpeg", "title": "The propaganda has failed.", "permalink": "/r/ufo/comments/1bpe1lf/the_propaganda_has_failed/", "selftext": "The National Institutes of Health, or NIH, released a report last week claiming while symptoms of the Havana Syndrome are severe, there is no evidence of brain injury. Similarly, AARO’s recent report found that while UAP are real, there is no evidence of ET. For mindless hacks like Guardian “journalist” Danny Lavelle, who give softball interviews to bureaucratic thugs (SK), these reports represent only the truth, and nothing but the truth. Thankfully, the American people are smarter than that. This Easter Sunday, March 31, 60 Minutes will air explosive evidence from a five-year investigation that indicates a US adversary is behind the Havana Syndrome. It is believed to be caused by an unknown directed energy weapon. The segment will air at 7PM EST on CBS. ", "media": null, "score": 335, "upvote_ratio": 0.91, "comment_count": 110, "over_18": false}, "18": {"id": "1bocl0z", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "AltKeyblade", "link_flair_text": "Photo", "time": 1711775696.1205237, "created_utc": 1711471651.0, "url": "https://i.redd.it/6z7j1e8jjpqc1.png", "title": "Better quality images of UAP spotted in Sydney, Australia close up with rainbow flickering lights. Captured on a Nikon Coolpix P1000 with x125 ultra zoom, but couldn't focus on the object.", "permalink": "/r/UFOs/comments/1bocl0z/better_quality_images_of_uap_spotted_in_sydney/", "selftext": "", "media": null, "score": 1979, "upvote_ratio": 0.86, "comment_count": 419, "over_18": false}, "19": {"id": "1bmpm6v", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "crushedmoose", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1711775697.6606824, "created_utc": 1711299788.0, "url": "https://i.redd.it/0e0nyhmvcbqc1.jpeg", "title": "what do you do?", "permalink": "/r/aliens/comments/1bmpm6v/what_do_you_do/", "selftext": "", "media": null, "score": 1203, "upvote_ratio": 0.89, "comment_count": 649, "over_18": false}, "20": {"id": "1bojm2g", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Alarming_Breath_3110", "link_flair_text": null, "time": 1711775698.048078, "created_utc": 1711488333.0, "url": "https://www.reddit.com/r/UAP/comments/1bojm2g/dwight_eisenhower_in_the_councils_of_government/", "title": "Dwight Eisenhower: “In the councils of government, we must guard against acquisition of unwarranted influence, whether sought/unsought, by the military-industrial complex. The potential for the disastrous rise of misplaced power exists &will persist.” So clear today w UFO disclosure or lackthereof", "permalink": "/r/UAP/comments/1bojm2g/dwight_eisenhower_in_the_councils_of_government/", "selftext": "​\nSummary Statement", "media": null, "score": 55, "upvote_ratio": 0.91, "comment_count": 1, "over_18": false}, "21": {"id": "1bpyein", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "cubz_rock", "link_flair_text": null, "time": 1711775699.2734358, "created_utc": 1711639834.0, "url": "https://i.redd.it/13sy08a0g3rc1.jpeg", "title": "Thoughts", "permalink": "/r/conspiracy/comments/1bpyein/thoughts/", "selftext": "“These individuals were recorded without their knowledge and consent”", "media": null, "score": 3163, "upvote_ratio": 0.96, "comment_count": 595, "over_18": false}, "22": {"id": "1br1yno", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1711775699.5810146, "created_utc": 1711752643.0, "url": "https://youtube.com/live/dsDneae_wlE?feature=share", "title": "If you were in charge of  an Alien Invasion to Earth, what country would you start with?", "permalink": "/r/conspiracyfact/comments/1br1yno/if_you_were_in_charge_of_an_alien_invasion_to/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "23": {"id": "1bmru45", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "binkingsumpy", "link_flair_text": "PGF", "time": 1711775700.5015724, "created_utc": 1711305422.0, "url": "https://i.imgur.com/YyEqJsk.gifv", "title": "Patterson film stabilized. Not sure where I got this bookmark. Probably created by MK Davis", "permalink": "/r/bigfoot/comments/1bmru45/patterson_film_stabilized_not_sure_where_i_got/", "selftext": "", "media": null, "score": 458, "upvote_ratio": 0.95, "comment_count": 179, "over_18": false}, "24": {"id": "1bm4n59", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "BurnerStuff-64", "link_flair_text": "Discussion ", "time": 1711775701.1813235, "created_utc": 1711232277.0, "url": "https://i.redd.it/qmcukzr4s5qc1.jpeg", "title": "Ok Thylacine bros all the hope & dreams is over", "permalink": "/r/Cryptozoology/comments/1bm4n59/ok_thylacine_bros_all_the_hope_dreams_is_over/", "selftext": "", "media": null, "score": 337, "upvote_ratio": 0.93, "comment_count": 98, "over_18": false}, "25": {"id": "1bmbb90", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Bab-Zwayla", "link_flair_text": "Very Strange Encounter", "time": 1711775701.446045, "created_utc": 1711251363.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1bmbb90/please_help_me_locate_this_base_or_find_others/", "title": "Please help me locate this base or find others with similar experiences- trying to solve the mystery of the scariest thing that's happened to me!", "permalink": "/r/Humanoidencounters/comments/1bmbb90/please_help_me_locate_this_base_or_find_others/", "selftext": "The Story:\nI have a memory of being in the car late at night with my husband, driving cross country and looking for a spot to camp late at night. It was maybe 5 years ago.\nWe were somewhere between Missouri and California, coming from North Carolina and having gone thru Overland Park KS & Ogden, UT that afternoon- somewhere where there was a vast amount of flat, dry land with desert brush. Pulling off the highway and down an unmarked dirt road that seemed to go on for at least 2-3 miles, we came to a parking lot on our right, and some feet ahead there was a fence marked NO TRESSPASSING and a sign that said SPACE OBSERVATION and showed a military logo. I don't remember which part of the military it showed, but I remember thinking it was strange to see it partnered with space observation- perhaps the army or navy?\nThough I was scared of getting in trouble or worse, my husband pulled into the parking lot, which was relatively small and elongated. My husband pulled to the left far end of the parking lot and stopped the car. There was a fenced off entrance with a path that looked a bit like train tracks leading past another fence and up a small slop where a single story, small building was sitting next to a huge rocket. on the end of the parking lot directly opposite of us, a black car with shaded windows was sitting. When we pulled in,\nI didn't notice anyone, but after arguing about leaving with my husband for a second, I saw a man suddenly sitting in the back driver side of the vehicle. the front door on the same side was slightly ajar and the back door was wide open, and the guy was sitting and staring forward before he met eyes with me. he was only maybe 15-20 feet from us. His skin seemed a strange pink color in the streetlamp glow, his cheeks very angular and higher up than most people I've seen, and his eyes were darker and a lot larger than any humans, but not so large that you would notice if you quickly* glanced past them in a crowd. When he looked at me, my whole body felt like it was struck by lightning. my heartbeat sped, my eyes watered, I began hyperventilating and scrambling and ranting at my husband to GET THE F OUT OF HERE, NOW! My husband saw the car, but not the man right in front of us. He shrugged me off and proposed, seriously, that we explore. He liked to explore places that seem a little scary, as did I- but he was a conspiracy theorist with a deep distrust- a deep hate, even, of military and government. The fact he proposed this was maybe not so out of character if there wasn't a literal person right there, but this situation meant that proposal is WILDLY out of character for him. I have military family and pride myself on being a skeptic who likes to put facts where my mouth is- so you'd think my spouse would see my reaction as a huge reason to leave, as it was also out of character for me...My husband seemed to not see the man though he was sitting DIRECTLY across from us, and he tried to light heartedly argue his case for why we should check the facility out... He began to try and get out of the car, and I grabbed him hard and began to hysterically cry and beg to leave. He laughed at how ridiculous he thought I was being- aside from the other car and rocket, the place seemed like it was almost abandoned. Eventually he had no choice but to relent and began pulling out at what I painstakingly remember as incredibly slow speed. As we were turning onto the dirt road, the man got out of the vehicle and stood up, keeping his eyes locked with mine almost the entire event. I remember he was wearing a white tshirt and what looked like cargo shorts, but my memory could be slightly off by now.\nI've tried to forget about this and have tried to come up with reasons this was less than I thought it was, but recently a friend was spouting some conspiracy hogwash that reminded me of this story. Pushing it out of my head so long, I'm struggling to find the area we were at, turning up no good results searching bases belonging to the military tasked with space observation or research.\nI can't find the long road with the fence and the parking lot with the track-like-path and a rocket next to a small facility. I've considered it's a secret base, but I've run out of ideas to figure out where to find names of secret bases in the area. I want to find the area so I can see if anyone else had this or a similar experience in the same place. Scariest, most rationality-defying experience I've ever had- I still get chills and butterflies when I think about it.\nSome facts I remembered after posting:\n\n\nThe man had mid-length black hair and incredibly sharp browbone.  \n\n\nThe longer road may have been unpaved/ a well-traveled dirt road.  \n\n\nThere was a town close by, I remember seeing a 1st street and driving over a railroad track afterwards.  \n\n\nThe largest sign was the one at the beginning of the right-turn into the short paved way up to the fence and parking lot. It was brown (I am pretty sure) or another dark color. It specified \"Space\" and another word like \"observation\" or \"research\".   \n\n\nThe military branch named on the big sign was one I thought was uncommon to be a branch with duties regarding space (at the time- now I understand all major branches do). May have been navy or army.   \n\n\nThe gate directly ahead of the paved way was closed with a small sign on it that said NO TRESSPASSING.  \n\n\nThe entrance in the parking lot looked to be made of concrete with a roof above it and a space for a guard to mind the gate, and was more open on the other side- sort of like a light rail/caltrain platform.  \n\n\nThe path or tracks below/behind the platform led a very short distance and stopped many feet before the rocket area.  \n\n\nThe rocket was on a paved area directly to the right of the facility, possibly a little bit behind it.  \n\n\nWhen asking my late husband about it, he always shrugged it off and he claimed he didn't remember seeing anything and was forever disappointed I didn't let him explore.  If I said that he was right in front of the guy, he got a little upset and called my sanity in to question. \nFor this reason, I didn't talk about this for years.\n\n\nCrude map w\\/ obscure distancing showing the paved street after the long dirt road that led to the closed gate & parking lot. Building + Rocket were up a small hill and a bit further away from the gate than depicted. \nMy name is Zwayla Converse, I live in NC, USA. I traveled the Northern and Southern American Continents during my young adult years, living nomadically. Everything I wrote here is true and I will prove it in any way I can. I am a writer by trade and my style is always visually descriptive, so please do not think I'm trying to amuse myself or others with a fabricated story because of my verbiage! (This was an issue on my earlier post on another subreddit)", "media": null, "score": 81, "upvote_ratio": 0.87, "comment_count": 59, "over_18": false}, "26": {"id": "1bm7sdi", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "RaccoonComicsUSA", "link_flair_text": null, "time": 1711775702.0755048, "created_utc": 1711240663.0, "url": "https://v.redd.it/fke9g90xg6qc1", "title": "I've been seeing this float around on Twitter/X recently and I 100% believe in \"Little Guys\"", "permalink": "/r/cryptids/comments/1bm7sdi/ive_been_seeing_this_float_around_on_twitterx/", "selftext": "(I apologize if this has been posted already)", "media": {"reddit_video": {"bitrate_kbps": 450, "fallback_url": "https://v.redd.it/fke9g90xg6qc1/DASH_270.mp4?source=fallback", "has_audio": true, "height": 480, "width": 270, "scrubber_media_url": "https://v.redd.it/fke9g90xg6qc1/DASH_96.mp4", "dash_url": "https://v.redd.it/fke9g90xg6qc1/DASHPlaylist.mpd?a=1714367701%2CYjRmYzk2YjVmYTA5Zjg3NWQyOGRlMWQxZmZkZTc4YzE2ZTEzNTkzMjU2ZmJjNjU0M2U0MWU2MzEwODVkOGQxNw%3D%3D&v=1&f=sd", "duration": 60, "hls_url": "https://v.redd.it/fke9g90xg6qc1/HLSPlaylist.m3u8?a=1714367701%2CZWRjNWRmNzQwMzI2OWRkYjk5YWJkN2NjNjRkMzdhMDQwZDA3ODY4NjkzYjliMzRmNDg3NGIzYTg2YzZmNjk1Ng%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 525, "upvote_ratio": 0.9, "comment_count": 83, "over_18": false}, "27": {"id": "1blvxgu", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "ConsequenceBoring895", "link_flair_text": null, "time": 1711775702.2984123, "created_utc": 1711210421.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1blvxgu/reporting_incredible_experience_i_had/", "title": "Reporting incredible experience i had", "permalink": "/r/Thetruthishere/comments/1blvxgu/reporting_incredible_experience_i_had/", "selftext": "I am reposting here, from other forums \"Reporting incredible experience i had\" bcs it kept being deleted i hope this time it doesnt.\nThis post is to report an experiece i just had a few hours ago. There are no lies or alterations, i will describe what happened exactly. Im sharing this because i feel like the human brain, and maybe other areas of science need to be more advanced and explored. \nMy story begins when me, my father and my mother are watching a normal series on netflix between 9:30 and 10:00pm 11 feb 2024 GMT-3 if thats relevant. We were watching it, my mom got up and went to the bathroom, she could hear us fine, then there is a scene with people buckling up seatbelts on a helicopter, as my mom returns to sit in the sofa.\nMy father comments somethings like \"i dont get why they even bother to buckle up in this crap helicopter\" its not exactly what he said but its somewhat close in portuguese. The scene cuts to the front window of helicopter and i start to beguin to think of what model of the helicopter it is, i guess in my mind its a robinson. My mother is standing in the dark staring at me. \nNote i didnt say anything about any helicopter model at this point, only thought, she is not an aviation fan so she doesnt know anything about what a robinson is. So she says she had a \"dejavu\" (look it up, idk how to translate its sort of when you think you see the future in a present tense memory like moment) basically she says that she realized she entered a dejavu when my father talked about the buckling, and then expected me to say \"oh this is the robinson helicopter isnt it\" but i didnt say because my thought process was disrupted by her staring at me in the dark which is weird. \nEither way she basically read my mind, there is no possible way she could possibly ever guess i was about to confirm with my father about a specific model of helicopter. This PROVES we humans somehow can view the short term future.\nBasically she realizing what was about to happen altered the reality into she staring into me waiting for me to actually say what i was about to say, then disrupting my thought process because she was staring at me in the dark, i thought \"wtf why is she just stopped there staring at me\" instead of whatever thought i would have concluded THIS IS ABSRURDLY CRAZY.\nWhat i can possible associate this is with the double slit experiment with quantum physics. Where one observer observes, collapsing realty into one state vs another. \nMaybe thats the foundation into finding out what counciousness is, or simply understanding more quantum physics relation with the brain, or the network of brains... please dont hesitate to contact me for any clarification. \nMaybe we can somehow develop a natural (without neuralink) telepathy or time travel related stuff... i know it sounds cringe but only me and her truly know what happened. That is legit crazy. I hope someone important sees this. (Please share with someone researching brain and quantum physics or the quantum effects in biology idfk)", "media": null, "score": 36, "upvote_ratio": 0.91, "comment_count": 15, "over_18": false}, "28": {"id": "1bn5a37", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "hmubro", "link_flair_text": null, "time": 1711775702.5066645, "created_utc": 1711341648.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1bn5a37/man_claimed_he_was_from_the_police/", "title": "Man claimed he was from the police", "permalink": "/r/LetsNotMeet/comments/1bn5a37/man_claimed_he_was_from_the_police/", "selftext": "This is a story that pops back up in my mind from time to time. I’ve only told it to a few people, but I definitely feel like it deserves its place in here. It’s for sure one of the scariest moments I’ve ever had as a child.\nBack when I was around 10 years old my mom finally decided that it was time for her to start taking her drivers license. When she began taking lessons she was struggling a lot. For that reason my dad decided that he wanted to do some practice with her besides the official driving lessons with her instructor - just to make sure that she’d pass the upcoming test first try. \nMy little brother and I were attending swimming lessons at this nearby university at the time. Behind a forested area near the university lays this huge student parking area surrounded by trees which turned out to be basically empty every weekend. My dad saw the opportunity to take my mom here to drive around for a bit, and brought my little brother and I with them since we were too young to stay home alone. We brought a football with us.\nWhen we arrived to the parking lot later on in the evening my parents began their practice. My little brother and I quickly got bored though and asked if we could go over to this little grass field on the side of the parking lot to play some football. My parents let us since they’d always be able to keep their eyes on us whilst driving around. After playing for some time my parents ended up driving around in the other end of the parking lot. They were approximately 300-400 metres away from my brother and I. \nSuddenly this white Toyota pulls into the parking lot. We were playing almost right at the exit/entrance. The car turns around and stops on my right side with the vehicle facing the exit. The driver rolls down his windows and presents himself as Thomas. He looked friendly, was good looking and young (a guess would be around 30). This is where things started to get weird. On the passenger seat was a woman covering her face with a newspaper. All I could see was long blonde hair. And on the backseat was a baby sat in a baby chair. “Thomas” immediately states that he’s from the police, and that we have to get in the car immediately as he has to talk to us. My brother actually took two steps towards the vehicle but I stuck my arm in front of his chest as I was sensing something was off. The woman was still covering her face at this point not saying a word. “Thomas” then raised his voice and told us once again to get in the car or else he’d have to come out and get us. My brother and I froze out of fear. Suddenly the woman put down the newspaper, showed her face and told us in the most calm motherly voice to “just listen to the man”. The woman looked young, pretty and like a person who wouldn't hurt a fly. At this moment I began screaming as loud as I could. \nWhat we hadn’t seen at that point was that my dad was already running as fast as he could towards us.  He was coming from behind the vehicle so we didn’t see it. My parents didn’t have time to drive to us since the road down the parking lot was twisted all the way. When my dad heard my scream he started yelling as loud as he could “HEY WHO THE F ARE YOU GET THE F AWAY FROM MY CHILDREN”. As soon as Thomas heard my dad and realised my brother and I weren't alone he threw his car into gear and took off as fast as he could. He most definitely looked like a person who shat himself when he saw my dad. \nMy dad was furious and told my brother and I to hurry up back to the car. He didn't even think about calling the police at that point. He wanted to beat up the guy himself. That resulted in us driving around for the next hour trying to find him before my dad cooled down and decided that he should probably just call the police. \nWe never found out who these people were. But this episode taught me to never judge a book by its cover. People can be the most friendly looking people in the world and still wish evil upon you or the ones you love. Im not sure what these people would've done to us. I am sure about one thing though. They definitely weren't from the police.", "media": null, "score": 189, "upvote_ratio": 0.98, "comment_count": 12, "over_18": true}, "29": {"id": "1bmtzlq", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Realistic_Ice7252", "link_flair_text": null, "time": 1711775703.0093293, "created_utc": 1711310677.0, "url": "https://www.youtube.com/watch?v=6Kw25vNzJ_Q", "title": "Vicenza, Northeastern Italy. A distressing experience through the desolate ruins of the former climatic colony Bedin Aldighieri: The Institute founded in 1922, intended for children with lung diseases, has been completely abandoned since 1984.", "permalink": "/r/truecreepy/comments/1bmtzlq/vicenza_northeastern_italy_a_distressing/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "La Villa dei Bambini", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/6Kw25vNzJ_Q?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"La Villa dei Bambini\"></iframe>", "author_name": "Fuori Dal Sentiero", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/6Kw25vNzJ_Q/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@fuoridalsentiero"}}, "score": 5, "upvote_ratio": 0.73, "comment_count": 0, "over_18": false}, "30": {"id": "1bnnyoo", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "AbsoluteRookie", "link_flair_text": null, "time": 1711775703.228305, "created_utc": 1711398310.0, "url": "https://www.reddit.com/r/threekings/comments/1bnnyoo/is_this_a_game_or_are_you_having_legitimate/", "title": "Is this a game or are you having legitimate paranormal activity? ", "permalink": "/r/threekings/comments/1bnnyoo/is_this_a_game_or_are_you_having_legitimate/", "selftext": "Elevator game/hooded man inquiry\nI’ve been reading tons of stories about these strange rituals and I’m genuinely intrigued. Not enough to try them (or write one of my own, even), but I’m super curious—is this all a part of a massive online mmorpg? I find it incredibly hard to believe this many people have overlapping experiences without some kind of base storyline to adhere to. I’m skeptical and feel super silly for even wondering if they could have validity in some instances. I am impressed with the storytelling in most cases, but a portion of what I read definitely gives me pause. \nI’m aware of the Elisa Lam / Stanley hotel story and she was  NOT playing the elevator game, she was off meds in a crime ridden area of a foreign country and probably ran into an awful experience. Rip to that poor girl. Just wanted to reference this in advance in case someone tried to use it as “proof”\nI’ve had my own chunk of unexplainable experiences after toying with supernatural tools and I would never do it again. It took years and several “energy worker” type folks for things to chill out. Because of this, I do pay a certain degree of attention to these stories, but alas. It is unprovable as I’m not willing to venture myself. I even look at my own past experiences with skepticism, as that aids in staying sane. Thoughts? ", "media": null, "score": 5, "upvote_ratio": 0.86, "comment_count": 6, "over_18": false}, "31": {"id": "1br7oaj", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "MaximusKiller", "link_flair_text": "Captured Apparition ", "time": 1711775703.976856, "created_utc": 1711768349.0, "url": "https://v.redd.it/htvu6tj52erc1", "title": "After looking at the camera footage for our backyard we saw this…", "permalink": "/r/Ghosts/comments/1br7oaj/after_looking_at_the_camera_footage_for_our/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/htvu6tj52erc1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/htvu6tj52erc1/DASH_96.mp4", "dash_url": "https://v.redd.it/htvu6tj52erc1/DASHPlaylist.mpd?a=1714367703%2CMTVhN2Q2N2MyYjdkYjE1YTZjODgxNTgzZWQ0NzgyODk5ZmQzNmIxZTYxZmYxNTJjMTA1YzY5NDQ3NDU0OThlNw%3D%3D&v=1&f=sd", "duration": 5, "hls_url": "https://v.redd.it/htvu6tj52erc1/HLSPlaylist.m3u8?a=1714367703%2CMThmYTNkZTE5YjFjNWE4ZmM3OGQ4NjYyMTE3ZjQ5YTM4YmExNDcyNzc3OGQwZWM1MzY3MDk0YWI5MTQzNmZmZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 107, "upvote_ratio": 0.87, "comment_count": 22, "over_18": false}, "32": {"id": "1bnt96v", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "skootershooter324", "link_flair_text": "Glitch Vid", "time": 1711775704.9550104, "created_utc": 1711410813.0, "url": "https://v.redd.it/uei2jlc0jkqc1", "title": "Unknown metal object in the sky teleports", "permalink": "/r/GlitchInTheMatrix/comments/1bnt96v/unknown_metal_object_in_the_sky_teleports/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/uei2jlc0jkqc1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/uei2jlc0jkqc1/DASH_96.mp4", "dash_url": "https://v.redd.it/uei2jlc0jkqc1/DASHPlaylist.mpd?a=1714367704%2CN2UxMWJiODQyYTA5ZDU1MTljZGZhYzFjY2I3ZjE2MzdhODQ1YTM4OTc5N2RiYmNjNmE2ZjY2MGRlZGYxMDU3Mw%3D%3D&v=1&f=sd", "duration": 29, "hls_url": "https://v.redd.it/uei2jlc0jkqc1/HLSPlaylist.m3u8?a=1714367704%2CMzVkNTQwM2JlZmQzNDU0Yzg4NTgyMjgwYTI4ZDc0ZjQwOTAyMzQzZDdiNmFmNTgzNThkMzMzMzgyMjFiOGNjZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 141, "upvote_ratio": 0.8, "comment_count": 30, "over_18": false}, "33": {"id": "1bor1qu", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "2_Large_Regulahs", "link_flair_text": "Article", "time": 1711775706.4052854, "created_utc": 1711507010.0, "url": "https://www.nbcnews.com/news/weird-news/former-israeli-space-security-chief-says-extraterrestrials-exist-trump-knows-n1250333", "title": "Haim Eshed famously said that NHI won't make contact with humans until we 'understand what space and spaceships are.\" What is he talking about? ", "permalink": "/r/ufo/comments/1bor1qu/haim_eshed_famously_said_that_nhi_wont_make/", "selftext": "The implication is that space and spaceships aren't what we think they are. So, what are they? ", "media": null, "score": 256, "upvote_ratio": 0.9, "comment_count": 191, "over_18": false}, "34": {"id": "1bnwdh5", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TasteeBeverage", "link_flair_text": "Sighting Report", "time": 1711775707.9172864, "created_utc": 1711419149.0, "url": "https://v.redd.it/fixeqz537lqc1", "title": "1080p + Slowmo UPDATE - UAP Observed from Cruise Ship in Gulf of Mexico", "permalink": "/r/UFOs/comments/1bnwdh5/1080p_slowmo_update_uap_observed_from_cruise_ship/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/fixeqz537lqc1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/fixeqz537lqc1/DASH_96.mp4", "dash_url": "https://v.redd.it/fixeqz537lqc1/DASHPlaylist.mpd?a=1714367706%2CNDU5YTI3Y2ZhNThiOWI5MTA4ZjEyZTBlMTEzYjcwOWYwZWUyMzlkYmE2NjI5ZjlmNzQyNGVlNzZjYTFmM2FhNQ%3D%3D&v=1&f=sd", "duration": 122, "hls_url": "https://v.redd.it/fixeqz537lqc1/HLSPlaylist.m3u8?a=1714367706%2CMDVlM2VlM2EwN2VmNjkxZTBkODBmYTdiY2VmZmI0MjI1OTc1MjMxNjhjZGZhOGIyNzBiNjNlYjlkNDAxYWNlNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1686, "upvote_ratio": 0.92, "comment_count": 360, "over_18": false}, "35": {"id": "1bmlcp8", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "the_rainmaker__", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1711775709.4426434, "created_utc": 1711288594.0, "url": "https://i.redd.it/sty3kygkfaqc1.gif", "title": "we've all been fooled", "permalink": "/r/aliens/comments/1bmlcp8/weve_all_been_fooled/", "selftext": "", "media": null, "score": 839, "upvote_ratio": 0.92, "comment_count": 171, "over_18": false}, "36": {"id": "1bqaotq", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "News", "time": 1711775709.799004, "created_utc": 1711669950.0, "url": "https://www.askapol.com/p/is-uap-investigation-heating-up-we", "title": "[AskaPol] Rep. Anna Paulina Luna: “That’s exactly why we need more oversight, I think that there is absolutely, without a doubt, something there, and, I think, from the level of pushback that we get, it’s pretty obvious. I look forward to (attempting to establish a committee to investigate UAP).\"", "permalink": "/r/UAP/comments/1bqaotq/askapol_rep_anna_paulina_luna_thats_exactly_why/", "selftext": "", "media": null, "score": 47, "upvote_ratio": 0.93, "comment_count": 2, "over_18": false}, "37": {"id": "1bpikqx", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "AvailableChoice3130", "link_flair_text": "See Sticky Comment", "time": 1711775711.2743168, "created_utc": 1711587501.0, "url": "https://i.redd.it/mpfufdb44zqc1.png", "title": "Prominent Ivy League LGBTQ activist, 53, is arrested on child porn charges at his home near Princeton University", "permalink": "/r/conspiracy/comments/1bpikqx/prominent_ivy_league_lgbtq_activist_53_is/", "selftext": "", "media": null, "score": 2294, "upvote_ratio": 0.83, "comment_count": 437, "over_18": false}, "38": {"id": "1br1m5g", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "SODTAOEbroskiTALLP", "link_flair_text": null, "time": 1711775711.5587907, "created_utc": 1711751804.0, "url": "https://youtu.be/G8pinp5937A", "title": "Augmented Reality Sim Technology (HBC, Implantable Nanotech, Electroceuticals, Remote Manipulation)", "permalink": "/r/conspiracyfact/comments/1br1m5g/augmented_reality_sim_technology_hbc_implantable/", "selftext": "This is a collection of peer reviewed studies of technologies that likely have a lot to do with the common sensation of feeling watched or monitored. Human Body Communication technology, nano drive. Remote body monitoring and manipulation, and innovations to induction of medicinal biochemical processes in the body.", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Augmented Reality Sim Technology (HBC, Implantable Nanotech, Electroceuticals, Remote Manipulation)", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/G8pinp5937A?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Augmented Reality Sim Technology (HBC, Implantable Nanotech, Electroceuticals, Remote Manipulation)\"></iframe>", "author_name": "Gamma Au Obsidian", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/G8pinp5937A/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@GammaAuObsidian"}}, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "39": {"id": "1bmvyx4", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "FewTrifle6938", "link_flair_text": "shitpost", "time": 1711775712.39106, "created_utc": 1711315578.0, "url": "https://i.redd.it/z4wjziytncqc1.jpeg", "title": "This may have already been posted but dang is it funny 😭", "permalink": "/r/bigfoot/comments/1bmvyx4/this_may_have_already_been_posted_but_dang_is_it/", "selftext": "", "media": null, "score": 250, "upvote_ratio": 0.87, "comment_count": 36, "over_18": false}, "40": {"id": "1bnkhul", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "bear559", "link_flair_text": null, "time": 1711775712.991316, "created_utc": 1711390207.0, "url": "https://i.redd.it/j3f7u3sqtiqc1.jpeg", "title": "I hate that it came to this. He wasn’t even being toxic imo", "permalink": "/r/Cryptozoology/comments/1bnkhul/i_hate_that_it_came_to_this_he_wasnt_even_being/", "selftext": "", "media": null, "score": 330, "upvote_ratio": 0.94, "comment_count": 103, "over_18": false}, "41": {"id": "1bodisw", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "WarthogPatient", "link_flair_text": "Personal", "time": 1711775713.2151809, "created_utc": 1711473912.0, "url": "https://i.redd.it/brsse52nqpqc1.jpeg", "title": "Tall black figure with green eyes", "permalink": "/r/Humanoidencounters/comments/1bodisw/tall_black_figure_with_green_eyes/", "selftext": "2023 Saw this one night in the fall. In USA, Virginia, near the George Washington National Forest. It started off as a normal night driving around backroads blasting music just hanging out catching up with a friend when we pulled up to a sharp turn and as soon as we started slowing down i noticed something standing behind a tree at the turn. Its eyes were green and glowing but when the lights from the car illuminated the tree, the figure stayed black its eyes being the only thing glowing. Almost like way light hits an object and is supposed to bounce off didnt workon its body. It was just like the light gets pulled into just darkness not skin. Like vanta black but alive. At first i thought it was a deer but this is a gravel road where the treeline starts almost at the edge of the gravel and when we got closer i noticed this thing was tall. Im not sure if it had antlers or it was just the branches without leaves but Im 6 foot 2 and this thing was as tall as me or maybe even taller. I didnt say a damn thing bc i thought i was just still high asf or something. Well my friend took the turn slow, bc it was basically a right angle, and then stopped. When she stopped in the middle of the road she turned the music off n asked “did you see that?” I said “yeah i thought it was a deer but it looked way to big to be one” she said she was thinking the same thing. So she started looking for her flashlight while i grabbed the baseball bat from her back seat. We got out n it had to have been at most 2 minutes that passed since we stopped n got out. We walked to the same tree we thought we saw this thing and didnt see anyone or anything. We looked around n nothing. The tree it was hiding behind was small. I mean if your a big guy it would barely cover your shoulders if you were trying to hide behind it and for sure not cover your belly, nose, or butt if u were standing alongside it. Well we got freaked out we didnt hear leaves rustling or sticks breaking from someone running so we got back in the car n left to the smoke spot for the night. Its just a pull off down the side of the same gravel road but a little ways down. We got out of the car and i started drinking again. When we heard what sounded like coyote howls and leaves rustling around us. So being dumb 20yr olds we just opened the doors from the car and turned the music on full blast to try n scare them away. I took a piss at the front of the car n when the music started blasting we started dancing together in front of the headlights, in my piss. We laughed about it n  had a good time. The whole time it felt like we were being watched, that feeling you get when someones staring at you was always there, but we didnt really care. I drew the picture at work the next day n sent it to her n she said it kinda does look like it but she doesnt wanna talk about it anymore. I still dont know what it was but im glad she was sober bc i thought i was just high n seeing shit. -2024, January She lives near there and says she hasnt seen it again but later on in the winter we went sledding at night (we work night shift so we usually do random shit in the dead of night) near her house and when we were walking down a trail to get to a bigger hill we heard loud bangs like a door being slammed open and shut. There was a full moon with snow on the floor so you could still see really well at night n there was a house on top of the hill I noticed when i looked up. So i asked her if she thinks her neighbors are mad. Well then she told me that her neighbor had died recently and that no one lives in that house now. So we walked back to her place and just kept sledding there instead. No feelings of being watched that time.", "media": null, "score": 23, "upvote_ratio": 0.8, "comment_count": 2, "over_18": false}, "42": {"id": "1bm0ccd", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "tavernofterrors", "link_flair_text": null, "time": 1711775713.825978, "created_utc": 1711221519.0, "url": "https://i.redd.it/se3zyk75w4qc1.jpeg", "title": "Does the Bible mention any cryptids?", "permalink": "/r/cryptids/comments/1bm0ccd/does_the_bible_mention_any_cryptids/", "selftext": "", "media": null, "score": 365, "upvote_ratio": 0.95, "comment_count": 190, "over_18": false}, "43": {"id": "1bo1vc5", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "pieceofbluecheese", "link_flair_text": "Theory/Debunking", "time": 1711775714.0569546, "created_utc": 1711437929.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1bo1vc5/one_off_loss_of_time/", "title": "One off loss of time", "permalink": "/r/Thetruthishere/comments/1bo1vc5/one_off_loss_of_time/", "selftext": "I posted this on another subreddit and it got some attention and brought up a lot of discussion. So I was sent here! I found this subreddit and figured I’d post it here as well in case anyone else had anything similar happen?  This took place about a year ago. (At the time I wrote this)\nI’ve had a weird one that stuck with me for a while I don’t really know how to make sense of it but I honestly have accepted I’m not going to be able to figure it out.\nNormal day at home on my day off. I just bought my house like 3 months ago and was still getting used to it. I sat down on my sectional in the living room watching tv, (I just made some clam chowder literally my favorite) and set it in front of me while I put on South Park since it’s my comfort show and this was probably around Noon. It was bright out and the house was lit up through the blinds. This is where I get goosebumps. I can’t for the life of me remember what happened next. It was 7:42 pm. It was like a snap of someone’s fingers and the world moved on without me. South Park was still on, definitely not near the episode I started on which was the episode about yelpers, and my food was still untouched where I left it. I just wasn’t sitting up anymore I was laying on the couch in front of my fireplace. I NEVER lay there I usually use it to sit and tie my shoes before I head out. I can’t really explain the feeling but I’d say there was an immense raw sense of fear that came over me because I couldn’t figure out where the time went or what happened. There were no pieces to put together. Besides that I just felt kind of sick, and out of body which I kind of attributed to how worked up I got.  Never happened to me before, has not  happened since. No history of anything like that in the family. Truly at a loss for that one. To make myself feel better I reheated the clam chowder and ate it though.\nSome answers to things that were asked:\nI installed a carbon monoxide detector shortly after I bought the house, it wasn’t that.\nWhen I woke up, besides the general feeling I had, there were marks on my foot, like it was tied up in a wire thread, but the marks didn’t last last the next day\nThere is no history of any epilepsy or black outs in the family\nAfter this I experienced shivers in my spine. Not painful, but at random times is felt like the center of my spine would get cold and it would shoot up and down the length of my back and give my whole body goosebumps. This still happens to me now, but nowhere near as often as when this happened \nI had missed calls and texts, but I didn’t text or call anyone while I was “missing?” \nThat couch is super uncomfortable. I hate it it’s just to put things on. I have an awesome sectional that I can’t get enough of. No idea why I’d randomly wake up on the couch. I would never do it to begin with, I wouldn’t even let a puppy sleep on it. \nFeel free to ask anything else.", "media": null, "score": 27, "upvote_ratio": 0.94, "comment_count": 11, "over_18": false}, "44": {"id": "1bmu80n", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "fortunesoulx", "link_flair_text": "Mod Post", "time": 1711775714.2621927, "created_utc": 1711311249.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1bmu80n/quick_update_on_moderation/", "title": "Quick update on moderation", "permalink": "/r/LetsNotMeet/comments/1bmu80n/quick_update_on_moderation/", "selftext": "Hi guys,\nI am trying to keep up as usual with reports and checking the sub once or twice a day, but not only am I in the process of moving, I was involved in a car accident (just sitting at a red light waiting my damn turn, someone else got hit and spun out of control and into my car 🙃) on Friday that has resulted in a lot of unexpected pain for me. \nPlease continue reporting posts that you think break the rules, and I will get around to them. It may be a little slower than usual, but I wanted to pre-emptively let you guys know it wasn't for lack of trying/giving up on the sub or anything like that, I just have a lot going on. The volume of this sub isn't what it once was, so bringing on additional mods isn't necessary at this time. I usually get to things within a few hours of them being posted, and with things the way they are right now it might take me a day or so instead. \nI'm not going to make this an announcement as I think the two pinned posts are much more important and this is a temporary situation, but again, just wanted to keep everyone updated.", "media": null, "score": 85, "upvote_ratio": 0.95, "comment_count": 5, "over_18": true}, "45": {"id": "1bmot49", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Percaholic_1992", "link_flair_text": null, "time": 1711775714.6336546, "created_utc": 1711297731.0, "url": "https://www.reddit.com/r/threekings/comments/1bmot49/rituals_to_strengthen_connection_for_2_people_far/", "title": "Rituals to strengthen connection for 2 people far away", "permalink": "/r/threekings/comments/1bmot49/rituals_to_strengthen_connection_for_2_people_far/", "selftext": "Won't bore with the details too much. I'm a father of two, recently moved to get my life together and after a fair amount of progress I was allowed to stay with my daughter for the last 4 days at my grandmother's house. During that stay my daughter expressed an interest in magic. I let it slip that I make wands, Atmospheric generators, and dream catchers from copper wire and crystals. We preformed a silly nonsense ritual that consisted of me drawing made up symbols, lighting candles, and a simple closing. I stressed the importance of the closing. I was wondering if anyone was hip to a ritual her and I could do together over FaceTime that would strengthen this new found bond that we have? Any suggestions would be greatly appreciated. ", "media": null, "score": 5, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "46": {"id": "1bn1415", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "hhhhhhhhbhhh", "link_flair_text": "Personal Encounter ", "time": 1711775715.3728375, "created_utc": 1711328848.0, "url": "https://www.reddit.com/r/Ghosts/comments/1bn1415/passed_away_grandfather_and_left_20_note_behind/", "title": "Passed away grandfather and left £20 note behind ", "permalink": "/r/Ghosts/comments/1bn1415/passed_away_grandfather_and_left_20_note_behind/", "selftext": "My grandfather (grampy) recently passed away to sum up the type of man he was he raised me for my whole life pretty much my father wasn’t any good and he would say he would come and get me but he never would never turn up with no notice or anything but my grampy would say to me don’t worry son as long as you have me you’ll be okay \nAnyway back to the story me (15m) at his funeral I spoke and the speech I wrote out sits on my desk next to his ashes I opened them up and £20 fell out my grampy was very generous with his money every time I would go and see him he would pass me £20 even after I denied it I would be hit with the same thing don’t be silly son what’s mine is yours I can’t help but think he’s left this behind.", "media": null, "score": 98, "upvote_ratio": 0.93, "comment_count": 19, "over_18": false}, "47": {"id": "1bpbj0v", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Solid_College_9145", "link_flair_text": "Glitch Pic", "time": 1711775716.3882718, "created_utc": 1711569928.0, "url": "https://i.redd.it/m4npvuv3oxqc1.png", "title": "Identical twins holding the doors open for Trump in the court house", "permalink": "/r/GlitchInTheMatrix/comments/1bpbj0v/identical_twins_holding_the_doors_open_for_trump/", "selftext": "", "media": null, "score": 89, "upvote_ratio": 0.8, "comment_count": 11, "over_18": false}, "48": {"id": "1bm4umt", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "DrRBoylan", "link_flair_text": null, "time": 1711775717.5755835, "created_utc": 1711232819.0, "url": "https://www.reddit.com/r/ufo/comments/1bm4umt/vatican_proposes_a_new_theology_which_accepts/", "title": "Vatican proposes a New Theology: which accepts Non-Human Intelligences (ETs), reincarnation, life on other planets, that Nature is alive and sentient, including planets and galaxies.", "permalink": "/r/ufo/comments/1bm4umt/vatican_proposes_a_new_theology_which_accepts/", "selftext": "This New Theology story was carried in the Italian newspaper, Daily Journal of Italy, (Ilgiornaleditalia.it). \n\"The new theology will teach that we are not alone in the Universe, that God is not an abstract being, but that he is the Omni-creating Intelligence, the energy that spreads, and the Light that creates Galaxies and Solar Systems. \nTherefore, the Universe represents life, and terrestrial man is not the only interior [container] of Intelligence-Spirit.  Indeed, from the smallest atom to the largest Galaxy they are all living beings. Suns, Galaxies, Planets are alive and possess an Intelligence, which has, at times, incarnated in men, to speak to men, and help them in their evolution.\nThe new theology will eliminate rites and the exaltation of religious concepts: they will be replaced by teaching concepts that will have to be put into practice directly in every manifestation of daily life. \nFurthermore, it explains that the Universe is the paradise of Creation, and hell is everything negative that man chooses, by virtue of his free will, and that Purgatory is nothing other than the purification of the effects resulting from the causes generated by man.\nThe new theology will explain that man is intelligent, that his spirit is eternal, that there is an eternal spiritual realm [formerly: 'Heaven'], that death does not exist, that Life is eternal and that the Spirit evolves through the process of reincarnations. For this reason, the intelligences that live and develop in the Universe are all brothers and sisters of us who live on this Planet, because we all, us and them, possess the Spirit. \nThe new theology will not be divided between religions, but will unite all the races of this Planet in an agreement of brotherhood and for thus, it is essential that in the final phase of this century we become aware of the fundamental reality which shows us that we are not alone in Universe; that Divine Intelligence created human Life and spiritual Life in other Galaxies; that contact with other civilizations would reverse the crisis situation of this planet of ours and would project humanity towards the establishment of a super civilization, without catastrophes and without profound crises. The change will have to occur by law of evolution; other Beings descended from the stars or from evolved Worlds will be sent by cosmic intelligence to help human evolution; Christ is the top/peak of this pyramid of evolved Beings. \nReligion is one, the message is one and contains the absolute truth which is the original content of all the messages that have been given to man throughout the history of this Humanity. \nThe new theology will espouse science and they will be one; the scientist will develop technological processes for the benefit of the whole society, based on the \"Law of the spirit\", while the religious person will develop spiritual philosophy and its concepts that will merge with the development of technology. Thus the new theology will teach that we are one thing with the being that lives inside us (soul, energy), that imbues us with its creating and life-giving Light. This Light is God, Love and Justice, Omniscient and Omnipotent Light from which everything begins, and to which everything returns: God.  \nIt will therefore be taught that the Universes are the vital organs of this Cosmic Being, while Solar Systems and Planets are the cells of Its body and their Humanities (of Solar Systems and Planets) are its enzymes, which must elaborate and coordinate life on the cell. [cosmos=mystical body]\nIn the Cosmic being, or Macrocosm, there are, as in our body which is a microcosm, antibodies which are highly evolved Beings, which know and obey the Divine Law and for this reason can circulate freely in it and process what is necessary for it, and eliminate what is harmful. No “enzyme” foreign to the cell is allowed to enter it if the former constitutes danger to the latter. In fact, even the cells of the Cosmic Being are equipped with their self-defenses and these are the four primordial elements of Creation (fire, air, water, earth), but also with self destruction, if necessary, to admonish the man.\nIt has been said: “what is below is similar to what is above” and again: “know yourself and you will know God”.\nThis is the concept of the new theology.\"                                 [End of news article]", "media": null, "score": 152, "upvote_ratio": 0.87, "comment_count": 94, "over_18": false}, "49": {"id": "1bm39y9", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "News", "time": 1711775719.173304, "created_utc": 1711228807.0, "url": "https://i.redd.it/h0l7h5mbh5qc1.jpeg", "title": "Former Nimitz Chief Radar Officer Kevin Day goes off on AARO and Kirkpatrick: \"They will not contact me or any other radar watchstander. Why? They don't want to know the truth and/or are afraid to say they don't know jack shit\"", "permalink": "/r/UFOs/comments/1bm39y9/former_nimitz_chief_radar_officer_kevin_day_goes/", "selftext": "", "media": null, "score": 1682, "upvote_ratio": 0.93, "comment_count": 197, "over_18": false}, "50": {"id": "1bo29pk", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Loose-Alternative-77", "link_flair_text": "Discussion :table:", "time": 1711775721.186361, "created_utc": 1711439674.0, "url": "https://www.reddit.com/gallery/1bo29pk", "title": "Falcon Lake incident in Canada. A case with actual evidence to support it.", "permalink": "/r/aliens/comments/1bo29pk/falcon_lake_incident_in_canada_a_case_with_actual/", "selftext": "https://www.cbc.ca/amp/1.4121639\nI came across this incident in 1967.  I like what his son said about it. He said if Dad hoaxed this — remember we're talking about a blue-collar, industrial mechanic — if he hoaxed it then he was a freakin' genius.\nThere is physical evidence for this alleged incident. There is the radioactive metal. There are burns on the man’s body. There is the burned shirt. I just thought it was a interesting article. What do you think? It would have been difficult to hoax the radioactive metal in my opinion.", "media": null, "score": 778, "upvote_ratio": 0.95, "comment_count": 136, "over_18": false}, "51": {"id": "1bqocs4", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "LampCoolout", "link_flair_text": null, "time": 1711775721.47615, "created_utc": 1711716202.0, "url": "https://youtu.be/Qsbz8_G9WcU?si=ahDwXx_le9Hg3yz9", "title": "The disappearance of America's leading anti-gravity researcher", "permalink": "/r/UAP/comments/1bqocs4/the_disappearance_of_americas_leading_antigravity/", "selftext": "Finally solved", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The disappearance of America's leading anti-gravity researcher", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/Qsbz8_G9WcU?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"The disappearance of America&#39;s leading anti-gravity researcher\"></iframe>", "author_name": "Sandboxx", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/Qsbz8_G9WcU/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@SandboxxApp"}}, "score": 44, "upvote_ratio": 0.85, "comment_count": 6, "over_18": false}, "52": {"id": "1bobs24", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Stimul8ed", "link_flair_text": null, "time": 1711775722.7344053, "created_utc": 1711469688.0, "url": "https://i.redd.it/atc4eevydpqc1.jpeg", "title": "Ruh roh! 50 cent is now pointing fingers at Jay Z…", "permalink": "/r/conspiracy/comments/1bobs24/ruh_roh_50_cent_is_now_pointing_fingers_at_jay_z/", "selftext": "", "media": null, "score": 2210, "upvote_ratio": 0.95, "comment_count": 457, "over_18": false}, "53": {"id": "1bml2sw", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Numerous-Sherbert838", "link_flair_text": null, "time": 1711775723.039567, "created_utc": 1711287826.0, "url": "https://youtu.be/rgSxqyvHsuA", "title": "Rare footage of Titanic Departure & Captain E.J. Smith (April 1912)", "permalink": "/r/conspiracyfact/comments/1bml2sw/rare_footage_of_titanic_departure_captain_ej/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Rare footage of Titanic Departure & Captain E.J. Smith (April 1912) #history #titanic #amazingfacts", "type": "video", "thumbnail_width": 480, "height": 200, "width": 267, "html": "<iframe width=\"267\" height=\"200\" src=\"https://www.youtube.com/embed/rgSxqyvHsuA?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Rare footage of Titanic Departure &amp; Captain E.J. Smith (April 1912) #history #titanic #amazingfacts\"></iframe>", "author_name": "HistoryInTheMaking", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/rgSxqyvHsuA/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@HistoryInTheMaking-cw5ud"}}, "score": 2, "upvote_ratio": 0.75, "comment_count": 0, "over_18": false}, "54": {"id": "1bprejs", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "NeikeaX", "link_flair_text": null, "time": 1711775723.9661186, "created_utc": 1711618477.0, "url": "https://youtu.be/xb9YcIlkl_c?si=ZgAJjCOMJexIEQPi0", "title": "This decade old YouTube video I still find one of the most believeable", "permalink": "/r/bigfoot/comments/1bprejs/this_decade_old_youtube_video_i_still_find_one_of/", "selftext": "Of course the quality isn't good since it never is. But to be fair, even my modern cellphone wouldn't take very clear video if I got as close as I'd be willing to to one of these things. It helps to watch a couple times zoomed in with your own screen. Basically nothing happens until the very end when the thing stands up and it's definitely not a bear. \nThe way the video ends would be exactly my reaction too. Poop myself, forget the video, and run like hell. Anyway, sorry to share another blurry video and kind of an anticlimactic one at that, but it always comes to mind when I think about possibly a legit encounter that was captured. In fact, the fact that it's pretty boring makes it even more real to me. \nThe person never uploaded another video or even said much about this one so if he's in this sub, let us know lol.", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "I think i saw a skunk ape - please help", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/xb9YcIlkl_c?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"I think i saw a skunk ape - please help\"></iframe>", "author_name": "Josh Highcliff", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/xb9YcIlkl_c/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@joshhighcliff1338"}}, "score": 174, "upvote_ratio": 0.93, "comment_count": 82, "over_18": false}, "55": {"id": "1bowq7r", "locked": false, "subreddit": "cryptozoology", "stickied": true, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1711775724.4736052, "created_utc": 1711527425.0, "url": "https://i.redd.it/vxqp0m1r5uqc1.png", "title": "What is a Cryptid? The Guide to Cryptozoology", "permalink": "/r/Cryptozoology/comments/1bowq7r/what_is_a_cryptid_the_guide_to_cryptozoology/", "selftext": "", "media": null, "score": 296, "upvote_ratio": 0.85, "comment_count": 113, "over_18": false}, "56": {"id": "1bqp6oq", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "_0bese", "link_flair_text": "Flying Humanoid", "time": 1711775724.713381, "created_utc": 1711718586.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1bqp6oq/bad_aliens_in_peru_jungle_in_black_suits_and/", "title": "Bad Aliens In Peru Jungle? In Black Suits and Jetpacks? Locals call them Pishtaco. Children Draw The \"Facepeeler\", and Observations During and After an Attack near Pucallpa Peru with the Shipibo-Conibo People 2019-2020. Research Article By Thaís de Carvalho", "permalink": "/r/Humanoidencounters/comments/1bqp6oq/bad_aliens_in_peru_jungle_in_black_suits_and/", "selftext": "All credit goes to Thaís de Carvalho. link to article https://journals.sagepub.com/doi/10.1177/2043610621995837\nnote this is not the full article.\nTLDR: Pishtaco legend goes back decades possibly centuries and goes by different names, cortacabezas, sacamantecas, saca ojos, Nakaj, and most recently pelacaras(facepeeler). Theyre often described as a whiteman flying with some sort of appartatus and using high tech weaponry(Electric shock?) to subdue its victims. \nWhite men and electric guns: Analysing the Amazonian dystopia through Shipibo-Konibo children’s drawings\nIn    Andean countries, the pishtaco is understood as a White-looking man    that steals Indigenous people’s organs for money. In contemporary    Amazonia, the Shipibo-Konibo people describe the pishtaco as a high-tech    murderer, equipped with a sophisticated laser gun that injects    electricity inside a victim’s body. This paper looks at this dystopia    through Shipibo-Konibo children’s drawings, presenting composite    sketches of the pishtaco and maps of the village before and after an    attack. Children portrayed White men with syringes and electric guns as    weaponry, while discussing whether organ traffickers could also be    mestizos nowadays. Meanwhile, the comparison of children’s maps before    and after the attack reveals that lit lampposts are paradoxically    perceived as a protection at night. The paper examines changing features    of pishtacos and the dual capacity of electricity present in   children’s  drawings. It argues that children know about shifting racial   dynamics  in the village’s history and recognise development’s   oxymoron: the same  electricity that can be a weapon is also used as a   shield.\nIt    was the start of the rain season in Amazonia. A football match had   kept  the community lively after sunset, and people were slowly starting   to  return to their homes. Three gunshots echoed into the night – a   sign  that someone was in danger. The noise scared women and children   back  into their houses, while men armed themselves and headed to the   forest.  The victim was a 30-year-old Shipibo-Konibo man who worked as a   guard in  the community’s lodge for gringos (White tourists, mostly   from Europe  and the US).1 He was heading for his night shift when he   felt a sudden  shock in his back and fell to the ground. As he looked   up, he found  himself surrounded by White men and fired the alert to the   village. He  managed to run towards the lodge, where he passed out.\nThe    victim was carried back to the community with a convulsive body    movement and dripping sweat. He felt electricity inside his body and    experienced shocks whenever he tried to drink water. Women fed him    highly sweetened milk instead, but his agony persisted. The community    then resorted to the local medical post, provided by the government with    Western medicine. The two nurses available declared that the victim’s    vitals were normal and there were no signs of violence. Thus, they    treated the case as an anxiety crisis, applying a sedative that only    worked briefly. Distrusting the nurses’ diagnosis and anxious about the    victim’s condition, the community decided to transport the man to a    private clinic in Pucallpa, the nearest city. It was the only place with    sufficiently advanced technology to remove electricity from a  person’s   body. After a few days in the hospital, the man was  discharged with no   clear diagnosis, an expensive bill and fully  recovered.\nI    was living in the village to research children’s experiences of    development projects. Although I heard countless testimonies about    pishtacos, described by the Shipibo-Konibo as a White man who invaded    Indigenous villages at night to extract people’s organs with electric    weapons, I struggled to fathom how such an operation could take place in    the middle of the forest. Nonetheless, the recurrence of those  stories   indicated the pervasiveness of this threat. Concerned about a   potential  network of organ trafficking, as those described by   Scheper-Hughes  (2000), I collected informal interviews of former   victims and  eyewitnesses, along with children’s testimonies of the   above incident.  In this paper, I focus on the analysis of children’s   drawings.\nThe    nature of my research led me to spend most of my time interacting  with   groups of children. As in other child-centred ethnographies  (Morelli,   2017; Schwartzman, 1978), play was a powerful research tool.  The   pishtaco appeared in games (for instance, in a version of catch  played   in the river), in drawings and in jokes about foreign people  that came   to the community. While I was attentive to these  occurrences, I   underestimated the importance of these stories in daily  life. In the   aftermath of the attack, I looked at the pishtaco  through a different   lens. That vivid experience, together with  children’s illustrations,   made me grapple with the tangibility of this  rumour.\nIn    this paper, the images conjured by children’s drawing give substance   to  these raiders and the repercussions of their attack. Based on  theory   about fantasy and imagination, I approach Shipibo-Konibo  children’s   artwork as meaningful visual evidence. The analysis is  divided into two   sets of drawings: composite sketches of the pishtaco  and maps of the   village. Together, these sections offer perspectives,  respectively, from   before and after the attack. The ensuing  discussions incorporate   fieldnotes and other secondary data to  emphasise the history in the   stories (White, 2000) depicted in  children’s art.\nResearchers    have long documented pishtaco stories among different Indigenous    nations in Andean countries (Oliver-Smith, 1969; Roe, 1988). However,    changes in testimonies, particularly regarding the murderer’s    physiognomy and form of attack, impede his identification. The assassin    is mostly described as a tall, White doctor that eviscerates  Indigenous   people (Weismantel, 2001), although in Amazonia he has also  gained   mestizo features (Santos-Granero and Barclay, 2011). Older  reports of   his attack describe him as extracting the victim’s fat to  produce an   ointment, which resonate with European medical practices at  the time of   invasion (De Pribyl, 2010). But in Amazonia pishtaco  attacks are also   filled with technological elements.2\nMethodology\nI    lived in Peruvian Amazonia from August 2019 to March 2020, when the    pandemic abruptly disrupted my research plans. To understand children’s    experiences, my methodology consisted mostly of participant   observation,  which demanded an immersion in children’s context   (Bluebond-Langner and  Korbin, 2007). I looked for a village that would   be willing to host me  for an extended period and in proximity to   children. My identity as a  Brazilian mestiza significantly affected   this process. Because the  village was close to Brazil, people had   questions about the fires in  Brazilian Amazonia upon my arrival and   were pleased by my position  against agribusiness. I was never mistaken   by a tourist and I was  expected to share women’s responsibilities in   the household, which gave  me easy access to children of the kin. In a   communal assembly organised  by the chief to approve my stay, no one   opposed my interest in  children’s lives; on the contrary, parents   expressed dissatisfaction  with children’s education and asked me to   speak Spanish to the children,  for them ‘to learn with me as well’.3\nIn    my research, I was far from adopting the least-adult role (Mandell,    1988), but made efforts to learn from children (Mayall, 2000). An    important marker of this was attending the school as a student. From    Monday to Friday, I moved between classrooms of the primary school,    sitting among 53 students from ages 6 to 14 (although most of my time    was spent with students in the 9–12 age range, where my presence was    less disruptive). At school, children could mockingly assist me with    Shipibo lessons, and we drew and played together. I approached ludic    activities as strategies to develop rapport, but art also led my    research to unforeseen directions. After all, through drawings children    went beyond the visible or their lived experience to explore   fantastical  and future possibilities (Morelli, 2015).\nNoting    the importance of these encounters, I used the draw-and-tell  technique   (Driessnack, 2006; Van Leeuwen and Jewitt, 2011) to initiate  in-depth   conversations. Art served as a buffer to talk about  sensitive topics,   giving children freedom to direct, elaborate on and  limit conversations   (Marshall, 2013; Van Leeuwen and Jewitt, 2011). In  the ‘momentary   stillness’ that drawing requires, children left traces  of their   emotional and physical state, while juxtaposing present,  past and future   (Knight, 2013: 255). However, in the collaborative  drawings displayed   in this paper, the draw-and-tell method was  insightful because it   encompassed children’s debates. These  co-creative processes can   contribute to expand the idea that  enculturation affects children’s   artwork (Alland, 1983; Stokrocki,  1994), by paying special attention to   interactional processes in which  children’s voices emerge (Spyrou,  2016)  and the negotiation of ideas  among peers.\nIn    order to safeguard the community, I did not disclose the village    location nor people’s names. I only use a few pseudonyms to give    authorship to drawings when these were created by a small group of    children. Because composite sketches resulted from a lively debate    involving over 20 participants, I would not do justice to all    contributors if I restricted their authorship.\nComposite sketches of the pishtaco\nA    picture of the pishtaco appeared for the first time when I asked    children to draw scary things. Although this was an interesting    elicitation for my research purposes, at the time I proposed it as a    playful dare. This drawing session happened during a school break, when    children were organised by age group (9–12 years old) and gender (as    they chose to divide themselves). They drew three pishtacos, two    chullachakis and several jaguars, but ascribed them different    categories: pishtacos are humans, chullachakis are spirits and jaguars    are animals (although some argued that jaguars also had spiritual    powers). The pishtaco lacks any spiritual dimension. Differently from    other threats, they are not in the depths of the jungle, but invade the    community’s territory. In children’s representations of the raider,   some  features were ubiquitous: they were all outlandish flying men.\nThis    first drawing (Figure 1) was produced by a group of girls after a    heated debate about the pishtaco’s weapon, reported as a syringe    (although resembling a knife). The medical instrument alludes to his    allegiances with surgeons and indicate his covert tactics: children were    terrified of having their insides stolen by a needle in their sleep.    They claimed that this could be easily done through the holes between    floorboards, hence the importance of having beds or thick mattresses.    Hiding amid the stilts, the cunning murderer could crawl under  people’s   homes and extract organs through an imperceptible skin  perforation.\nPishtacos acted    with the consent of the Peruvian government.  According to the    community, the State knows about the attacks and  profits from this    international trade. It was argued that indigenous  peoples’ vital    organs helped pay off the country’s external debt, a  suspicion also    voiced by other Amazonian peoples (Santos-Granero and Barclay, 2011).     Peru’s growing interest in the extractives may underpin these   beliefs.   Apart from resulting in land disputes that favour the profit   of   foreigners, extractives trigger the widespread Amazonian   apprehension of   unregulated use of natural resources.\nThe    motorcycle in the above drawing is a flying vehicle. The children   chose  them over a speedy helicopter as the source of pishtacos’ soaring    skills, adding that gringos provide mestizos with all sorts of   machines.  Various other Amazonian nations have spotted the murderer   travelling in  agile aircrafts (Santos-Granero and Barclay, 2011). While   in the first  sketch (Figure 1), children drew the pishtaco as a  winged  man, the  majority believed that he flew using some apparatus.  In the  sketch  below, a large group of children portrayed the killer  wearing  motorised  steel wings, which are attached to a full-body black  suit. In   combination with wheeled boots, the tentative jetpack offers   incredible  mobility (Figure 3). Testimonies of attacks usually  started  with the  victim perceiving polychromatic sparkles in the night  sky or  on top of a  tree, which emerged from the raider’s night-vision  goggles.  Whatever  the pishtaco’s floating mechanism was, it made him  nearly  invincible,  concealing his presence until he jumped for the  attack. The  sight of  these multicoloured lights was nearly a death  sentence.\nThe    three portraits show some consensus about the pishtaco’s covert   tactics  of extraction, although with some variation. As described in   the  village’s attack, pishtacos inject electricity inside their   victim’s  body. This injection, previously drawn as a medical syringe   (Figure 1),  here gained a literal shape. It is a corriente, a Spanish   word that can  either mean metal chain (as in the drawing above) or   electric current.  The group of 12-year olds, who drew the mestizo   raider, mocked the chain  as a naïve misrepresentation of a powerful   cutting-edge weapon.  Nonetheless, they did not disavow the role of   electricity in the  murders, for their mestizo killer is also armed with   a tiny and silent  laser gun. When shooting a corriente into his   victim’s body, a pishtaco  leaves no trace.\nMapping electric light\nThe    white men with electric guns that invaded the community drastically    changed the daily dynamics in the village. In attempts to protect    itself, the community had frequent security assemblies, but those    meetings mainly expressed a ubiquitous feeling of vulnerability in face    of an invincible enemy. A few preventive strategies came into place.   The  street went quieter and people only walked in groups. Men organised    themselves into ceaseless patrols of the community’s borders. If they    already wore rifles when crossing through the forest, now they hiked    heavily armed. Darkness made the village particularly cautious, since    attacks happen at night. People returned to their houses as soon as  the   sun went down and children’s visits to my porch, that typically  took   place at sunset, became rarer.\nIn    these odd days, I flipped through my sketch notebook and reflected    about the pishtaco. Among the other common themes in children’s    drawings, one caught my attention. In the many depictions of the    village, I was intrigued by the size and frequency of lampposts (Figure    4).\nLampposts    were seldom lit in the community. The government did not  provide    electricity to the village and thus the availability of energy  depended    on people’s income. Petrol was costly and ended quickly,  lasting  only   for a couple of hours. Nobody knew exactly which night of  the  week   would be illuminated, as it depended on the import of gasoline   from   Pucallpa, but the arrival of petrol was communicated in a buzz.     Electricity was necessary for the phones and lanterns that people     depended on during the week. When lampposts suddenly lit, people ran to     charge their equipment.\nhttps://preview.redd.it/eft9nmavx9rc1.jpg?width=772&format=pjpg&auto=webp&s=12d73caf232e91b166993786140f8a696380b100\nhttps://preview.redd.it/yt9hwpavx9rc1.jpg?width=1342&format=pjpg&auto=webp&s=bef1de36fd62ad0c6cbe338dcfc97edb06c113b6\nhttps://preview.redd.it/5q0jmoavx9rc1.jpg?width=828&format=pjpg&auto=webp&s=dedc85abd197314bf0c052864c3124d7d3849786\nhttps://preview.redd.it/vxrppuxvx9rc1.jpg?width=818&format=pjpg&auto=webp&s=4e8c6a6bd76b18736d464c0ab2f35b7358958554\nhttps://preview.redd.it/pm8c7wxvx9rc1.jpg?width=1357&format=pjpg&auto=webp&s=94f7da83484023f9dc6517b4abb522d23476e45a\nhttps://preview.redd.it/fzdqxxxvx9rc1.jpg?width=1342&format=pjpg&auto=webp&s=aa9bcdce420d29263403268b3ca2a5cf011cad7e\n​", "media": null, "score": 20, "upvote_ratio": 0.83, "comment_count": 3, "over_18": false}, "57": {"id": "1bmfjsv", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "tavernofterrors", "link_flair_text": null, "time": 1711775725.3223407, "created_utc": 1711267359.0, "url": "https://i.redd.it/adlvjgcgo8qc1.jpeg", "title": "while we’re talking about mothman’s butt, don’t lick the it either", "permalink": "/r/cryptids/comments/1bmfjsv/while_were_talking_about_mothmans_butt_dont_lick/", "selftext": "", "media": null, "score": 224, "upvote_ratio": 0.93, "comment_count": 66, "over_18": false}, "58": {"id": "1bnmnyt", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "ArielandFlounder1983", "link_flair_text": null, "time": 1711775725.5608504, "created_utc": 1711395314.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1bnmnyt/beings/", "title": "Beings", "permalink": "/r/Thetruthishere/comments/1bnmnyt/beings/", "selftext": "In 2020 I was living in a half way house and out of my 7th rehab, I had lost everything I loved the previous year and was continually being emotionally abused by my exhusband. I was running regularly bc of Covid it was my only activity, and I ran in a bike path that had woods on both sides, and there appeared to be dark figures following me in the trees and I would stop and look and they would disappear.  I’d start running again and there they were still following me and they seemed like they were rustling the leaves as they went. This happened for a few weeks and it was terrifying. But really the least of my life problems at the time so I just dealt with it. In my room at this time I would see things like many almost colorless waving tentacles coming out of my closet from my peripheral as well for a few weeks. But these guys did not scare me as much. I tried to see them and that’s all I saw were waving arms or tentacle type things. This happened a few weeks before I accepted Jesus Christ as my personal Savior and I have not seen these guys since. Thank you Lord 🙏❤️", "media": null, "score": 19, "upvote_ratio": 0.69, "comment_count": 13, "over_18": false}, "59": {"id": "1br1xfj", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "LancasterRothshchild", "link_flair_text": null, "time": 1711775725.7573152, "created_utc": 1711752564.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1br1xfj/enraged_methhead_threatened_my_life_at_gas_pump/", "title": "Enraged methhead threatened my life at gas pump over delusional priority access.", "permalink": "/r/LetsNotMeet/comments/1br1xfj/enraged_methhead_threatened_my_life_at_gas_pump/", "selftext": "Today I casually went out to the gas station with the best price, and I luckily found a spot in the perfect time. Apparently though, another not-so-gentle man thought that he was entitled to that spot, starts absolutely flipping out on me and threatening to kill me and beat my ass, I smiled, continued pumping, trying to screen him out. He then raised a fit about how he had priority over me because of the type of fuel, diesel, got up in my face, threatened to beat my ass, so I pointed the gasoline nozzle at him and replied, naturally cursing like a sailor \"get the fuck away from me and my car, or I'll give you some free gas in your face\" \nHe tried following me home too, but I know the back roads too well, and have a turbo Subi, I was able to lose him. \nAll over gas. People need to just chill. ", "media": null, "score": 31, "upvote_ratio": 0.79, "comment_count": 8, "over_18": true}, "60": {"id": "1bnzd1u", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "3rroR039", "link_flair_text": null, "time": 1711775726.2666228, "created_utc": 1711428229.0, "url": "https://www.reddit.com/r/threekings/comments/1bnzd1u/the_very_last_step_ritual_any_one_try_this/", "title": "the very last step ritual any one try this", "permalink": "/r/threekings/comments/1bnzd1u/the_very_last_step_ritual_any_one_try_this/", "selftext": "Has anyone actuly tried this for the shits and giggles", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "61": {"id": "1br0g7g", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "BritishRedditTourist", "link_flair_text": "Personal Encounter ", "time": 1711775726.8579543, "created_utc": 1711748988.0, "url": "https://www.reddit.com/r/Ghosts/comments/1br0g7g/little_man_could_of_been_calling_to_let_me_know/", "title": "Little man could of been calling to let me know! ", "permalink": "/r/Ghosts/comments/1br0g7g/little_man_could_of_been_calling_to_let_me_know/", "selftext": "So to explain the back story of this my fiance (F38) lost her 9 year old son to an extremely rare cancer. Now Little man passed away in 2020 and lately we've had a few things go missing and doors shut around the house (Nothing nefarious). I never got the chance to know Little man as well as I hoped and always wondered to myself if he was happy with his mum being with me. Last night me (M32) and the other half were getting ready for bed after I went to the toilet and we both heard someone call my name. No idea where it came from but she believes it sounded like her son. I'd like to think this was a little message to say he's happy with me being with his Mum", "media": null, "score": 55, "upvote_ratio": 0.9, "comment_count": 3, "over_18": false}, "62": {"id": "1bontz5", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "-P-M-A-", "link_flair_text": "Glitch Vid", "time": 1711775727.9671905, "created_utc": 1711498368.0, "url": "https://v.redd.it/mvs30pkoteqc1", "title": "Double Your Money.", "permalink": "/r/GlitchInTheMatrix/comments/1bontz5/double_your_money/", "selftext": "", "media": null, "score": 70, "upvote_ratio": 0.85, "comment_count": 3, "over_18": false}, "63": {"id": "1blspp4", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Dmans99", "link_flair_text": "Twitter", "time": 1711775729.1874256, "created_utc": 1711202057.0, "url": "https://twitter.com/528vibes/status/1771385766075338798", "title": "Rep Eric Burlison says in a live discord chat that Matt Laslo he has been briefed that NHI phase into our existence — As opposed to travelling here from another planet.", "permalink": "/r/ufo/comments/1blspp4/rep_eric_burlison_says_in_a_live_discord_chat/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/528vibes/status/1771385766075338798", "author_name": "💭 think tank", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">💥💥🎯 Rep <a href=\"https://twitter.com/EricBurlison?ref_src=twsrc%5Etfw\">@EricBurlison</a> says he has been briefed that NHI phase into our existence — As opposed to travelling here from another planet. <br><br>Reporting by <a href=\"https://twitter.com/AskaPol_UAPs?ref_src=twsrc%5Etfw\">@AskaPol_UAPs</a> and <a href=\"https://twitter.com/MattLaslo?ref_src=twsrc%5Etfw\">@MattLaslo</a> <br><br>(<a href=\"https://twitter.com/hashtag/UFOTwitter?src=hash&amp;ref_src=twsrc%5Etfw\">#UFOTwitter</a> <a href=\"https://twitter.com/hashtag/UFO?src=hash&amp;ref_src=twsrc%5Etfw\">#UFO</a> <a href=\"https://twitter.com/hashtag/UFOs?src=hash&amp;ref_src=twsrc%5Etfw\">#UFOs</a> <a href=\"https://twitter.com/hashtag/UFOSightings?src=hash&amp;ref_src=twsrc%5Etfw\">#UFOSightings</a> <a href=\"https://twitter.com/hashtag/UAPTwitter?src=hash&amp;ref_src=twsrc%5Etfw\">#UAPTwitter</a>) <a href=\"https://t.co/V1x0g42dOd\">pic.twitter.com/V1x0g42dOd</a></p>&mdash; 💭 think tank (@528vibes) <a href=\"https://twitter.com/528vibes/status/1771385766075338798?ref_src=twsrc%5Etfw\">March 23, 2024</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n", "author_url": "https://twitter.com/528vibes", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 101, "upvote_ratio": 0.91, "comment_count": 48, "over_18": false}, "64": {"id": "1bqe8d3", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Top-Ad9905", "link_flair_text": "Discussion", "time": 1711775730.5979576, "created_utc": 1711679778.0, "url": "https://v.redd.it/cle8u81rq6rc1", "title": "F15 flying by a UFO at Scottsdale, AZ", "permalink": "/r/UFOs/comments/1bqe8d3/f15_flying_by_a_ufo_at_scottsdale_az/", "selftext": "Shot on my Iphone 13 Pro\nI was walking my dog back to my apartment that I saw this strange blue light. It looked like a string hanging in the sky and moved up and down.\nIt was higher than the planes flying by, we can an airport nearby so planes are very common. It hovered up and down for 30 mins then dropped down, I lost sight", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/cle8u81rq6rc1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/cle8u81rq6rc1/DASH_96.mp4", "dash_url": "https://v.redd.it/cle8u81rq6rc1/DASHPlaylist.mpd?a=1714367729%2CNDdhNzlmZTEzODlhMzQzN2FjZTk1MWI1MTVmOWNlYjk5YzBhNzNmZjUxNjdkYjQ0ODBmOGNkMWVkNDFlZDUyMQ%3D%3D&v=1&f=sd", "duration": 122, "hls_url": "https://v.redd.it/cle8u81rq6rc1/HLSPlaylist.m3u8?a=1714367729%2CMzRkMTA0NmQ5YzE0N2Q2NjllYWI2N2IyYzYwMDg3N2ZmYjVkMjg3NjA2M2E5OGFiYzQyYjFjMWFlNjU1Nzk4OQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1660, "upvote_ratio": 0.91, "comment_count": 308, "over_18": false}, "65": {"id": "1bnxrp9", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Loose-Alternative-77", "link_flair_text": "Analysis Required :snoo_thoughtful:", "time": 1711775732.3169703, "created_utc": 1711423151.0, "url": "https://m.jpost.com/omg/article-747282", "title": "This article claims that scientists are trying to decipher signals coming from a mysterious object 4000 light years away. ", "permalink": "/r/aliens/comments/1bnxrp9/this_article_claims_that_scientists_are_trying_to/", "selftext": "Well I found a article from the Jerusalem post claiming that a object 4000 light years away is likely to be from aliens! Read the article! It’s from June of 2023. \nDr. Natasha Hurley-Walker and Dr. Harley-Walker muses are the scientists mentioned in the article.\nhttps://m.jpost.com/omg/article-747282\nhttps://ntrs.nasa.gov/api/citations/19730010095/downloads/19730010095.pdf\nhttps://www.nhurleywalker.com/\nAstronomers have detected unusual space signals, possibly from an extraterrestrial source, transmitted to Earth at regular intervals. These signals, originating from a celestial body 4,000 light-years away, emit energy bursts every 18 minutes. Researchers, including Dr. Natasha Hurley-Walker, are analyzing these transmissions, which could signify attempts at communication by alien life forms. Initial skepticism about the signals being mere interference was dismissed when they repeated with consistent frequency from the same location. This discovery has sparked discussions on extraterrestrial contact and represents a significant moment in the search for life beyond Earth. They are trying to decipher these signals. I’m trying to find more articles and more on this. They mention a article from the mirror a British newspaper. I couldn’t find this article. The Jerusalem post usually doesn’t publish rubbish but this is some article. ", "media": null, "score": 676, "upvote_ratio": 0.92, "comment_count": 211, "over_18": false}, "66": {"id": "1bnj23c", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "disclosurediaries", "link_flair_text": null, "time": 1711775732.6332812, "created_utc": 1711386808.0, "url": "https://www.reddit.com/r/UAP/comments/1bnj23c/all_the_relevant_uap_updates_from_march_1824/", "title": "All the relevant UAP updates from March 18-24", "permalink": "/r/UAP/comments/1bnj23c/all_the_relevant_uap_updates_from_march_1824/", "selftext": "This past week in Disclosure:\nMar 19 – Retired Rear Admiral Tim Gallaudet: \"I am completely convinced because I know the people who were in the government legacy programs that oversaw both the crash retrieval and analysis of UAP data..\"\nIn a YouTube interview, retired US Rear Admiral Tim Gallaudet provided his perspective on the reality of the UAP situation. He also recently published a whitepaper that explores the oft-ignored USO (unidentified submerged object) aspect of the UAP issue.\nNotable quotes from the interview: \n\n\"I am completely convinced because I know the people who were in the government legacy programs that oversaw both the crash retrieval and analysis of UAP data... Former intelligence/DoD... We are working as a team behind the scenes to advance disclosure\"\n\n​\nMar 20 – UAP advocates hold a rally at Senator Schumer's New York office\nAs covered in the Debrief:\n\n\"Advocates for the disclosure of U.S. government records related to unidentified anomalous phenomena (UAP) will attend a sidewalk rally in New York this week in support of Senator Chuck Schumer and his efforts toward greater government transparency, and to urge for future Congressional hearings on the matter.\"\n\n​\nMar 20 – European Member of Parliament hosts a UAP-related even in the European Parliament (Brussels)\nOrganised by MEP Francisco Guerreiro, the event sought to facilitate a level-headed discussion around the UAP topic. The full session can be viewed here.\n​\nMar 22 – The Guardian publishes an article featuring an interview with Dr. Kirkpatrick: \"He quit heading the Pentagon’s UFO office. Now a report of his has shaken up ufology\"\nWhile the article was initially titled – \"UFOlogists tried to break into my home for telling truth, says ex-Pentagon investigator\" – it was quickly amended to correct the apparent misquote.\nIn line with Dr. Kirkpatrick's recent outings, this article paints the current push for UAP disclosure as the result of a small group of individuals embroiled in a farcical game of telephone – who have mistaken debris, conventional aircraft, and classified programs for non-human related technologies.\n​\nMar 22 – Rep. Burlison appears for an interview with Askapol to discuss the UAP topic\nIn an interview hosted by Askapol, Rep. Eric Burlison elaborated on some of the behind-the-scenes actions that have been undertaken by members of the UAP Caucus.\nIn particular, he reaffirmed that efforts to establish a Select (sub)committee on UAP are ongoing, and will not easily be swept under the rug.\nWith regards to the ICIG assessment of Grusch's claims, he revealed that while the ICIG has not been able to assess the validity of claims related to NHI – they have essentially confirmed the claims related to over-classification and compartmentalised programs being illegally concealed from Congress. The session Members of Congress recently had with the ICIG also provided 2 locations of interest.\n​\n---\nThings to look out for in the near future:\n​\nApril\n\nAccording to Senator Gillibrand – a public hearing in line with AARO's latest report can be expected soon, saying –\"I'll probably have another hearing aligned with that public report.”\n\n​\nBeyond/currently unknown\n\nFollowing the UAP hearing on the 26th of July, Members of Congress have called for a select committee with subpoena authority, to “go about the task of collecting information from the Pentagon and elsewhere” on unidentified flying objects. There have been conflicting messages from various Members of Congress on whether this is likely to happen anytime soon.\nNote – a select subcommittee was formally requested on March 13th.\nReps. Moskowitz, Luna, and Burchett have repeatedly stated their intent to hold field hearings to overcome stonewalling from the Pentagon and military establishment\"I think we [Congress] should try to get into one of these places [housing UAP evidence]...and if they won't let us in I think we should have a field hearing right outside the building...and the military will have to explain why that is.\" – Rep. Moskowitz (D)It is currently unknown when exactly we might expect that to occur, however as of Jan 12 – Rep. Luna confirmed:\"I feel confident that we have enough evidence to move forward with our first field hearing. u/mattgaetz u/JaredEMoskowitz u/timburchett . We will be announcing details soon.\"\nSeveral journalists have indicated that first-hand witnesses of the alleged UAP legacy programs are in the process of providing testimony/evidence to the relevant authorities (e.g. the IC IG) and/or are on the verge of making public statements in the near future (Example 1, example 2, example 3, example 4)\nDavid Grusch has received additional clearances through DOPSR to discuss some of his (alleged) first-hand knowledge of Legacy programs. He has mentioned he may be covering more of this information in an upcoming Op-Ed\nSome commentators have speculated that the architects of the UAPDA (e.g. Sens. Schumer/Rounds et al) are working diligently behind the scenes to continue furthering serious legislative UAP transparency efforts\n\n-------\nSkimmed through this post but need a quick refresher on how we got to this point? Check out this handy Disclosure Timeline to get up to speed.", "media": null, "score": 33, "upvote_ratio": 0.95, "comment_count": 4, "over_18": false}, "67": {"id": "1boju4g", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Exciting_Ad_281", "link_flair_text": null, "time": 1711775733.9202898, "created_utc": 1711488849.0, "url": "https://www.reddit.com/gallery/1boju4g", "title": "check this out! found during spring cleanup on curb", "permalink": "/r/conspiracy/comments/1boju4g/check_this_out_found_during_spring_cleanup_on_curb/", "selftext": "", "media": null, "score": 2115, "upvote_ratio": 0.96, "comment_count": 487, "over_18": false}, "68": {"id": "1bqwtzs", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnthonyofBoston", "link_flair_text": null, "time": 1711775734.2294366, "created_utc": 1711737887.0, "url": "https://www.academia.edu/114391924/How_Amazon_inc_can_restore_the_US_economy_through_issuing_the_Mars_Redback_currency_in_the_event_of_a_stock_market_crash_occurring_at_the_right_time", "title": "This document lays out a plan that can pressure the Federal Reserve to dismantle itself and allow the Mars Redback currency system to replace the US Dollar and the US constitution", "permalink": "/r/conspiracyfact/comments/1bqwtzs/this_document_lays_out_a_plan_that_can_pressure/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 0.67, "comment_count": 0, "over_18": false}, "69": {"id": "1bm4kfp", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Tenn_Tux", "link_flair_text": "humor", "time": 1711775735.0243933, "created_utc": 1711232086.0, "url": "https://i.redd.it/4apqg2ekr5qc1.jpeg", "title": "What’s the question? Go!", "permalink": "/r/bigfoot/comments/1bm4kfp/whats_the_question_go/", "selftext": "", "media": null, "score": 152, "upvote_ratio": 0.94, "comment_count": 41, "over_18": false}, "70": {"id": "1bq7p76", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "ChattyBird4Eva", "link_flair_text": "Discussion ", "time": 1711775735.5678601, "created_utc": 1711662388.0, "url": "https://i.redd.it/htqgi0s2b5rc1.jpeg", "title": "This feels so surreal.", "permalink": "/r/Cryptozoology/comments/1bq7p76/this_feels_so_surreal/", "selftext": "", "media": null, "score": 279, "upvote_ratio": 0.91, "comment_count": 19, "over_18": false}, "71": {"id": "1bmafby", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "TheOtherKinds", "link_flair_text": "Alien", "time": 1711775735.8423085, "created_utc": 1711248538.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1bmafby/the_wpafb_twin_humanoid_case_1959/", "title": "The WPAFB Twin Humanoid Case (1959)", "permalink": "/r/Humanoidencounters/comments/1bmafby/the_wpafb_twin_humanoid_case_1959/", "selftext": "Source: The WPAFB Twin Humanoid Case\nThe Wright-Patterson Air Force Base Humanoid Encounter of 1959 presents a fascinating chapter from U.S. military history with pioneering scientific exploration and the tantalizing possibility of otherworldly phenomena. In the heart of this narrative stands a French scientist, pseudonymously known as \"Mr. L,\" whose account blends the realms of advanced biology with the shadowy world of unidentified flying objects (UFOs) and potential extraterrestrial life forms.\n\"Mr. L,\" a distinguished figure in the scientific community, associated with the likes of Nobel laureates Lwoff, Monod, and Jacob, was reportedly summoned to Wright-Patterson Air Force Base (WPAFB) in Ohio. His mission was to conduct an analysis on two unusual beings, characterized by their towering stature and unique physiological traits, which hinted at origins beyond our common understanding. These beings, standing over 7 feet tall, exhibited features such as elongated blonde hair, high foreheads, and an unusual eye structure reminiscent of Asian descent, coupled with a lack of standard human skin and circulatory components.\nThis event is set against the backdrop of WPAFB's storied history as a hub for aerospace research and development, with a particular focus on foreign and potentially extraterrestrial technologies. The base, through its Foreign Technology Division (FTD) and possibly a division dedicated to extraterrestrial technology research (TDETR), has long been a focal point for discussions and theories related to UFOs and alien artifacts, notably including speculations surrounding the Roswell incident.", "media": null, "score": 16, "upvote_ratio": 0.94, "comment_count": 0, "over_18": false}, "72": {"id": "1borzsi", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Nytemare2366", "link_flair_text": null, "time": 1711775736.474735, "created_utc": 1711509746.0, "url": "https://i.redd.it/v92pl827psqc1.jpeg", "title": "chapstick", "permalink": "/r/cryptids/comments/1borzsi/chapstick/", "selftext": "", "media": null, "score": 123, "upvote_ratio": 0.78, "comment_count": 25, "over_18": false}, "73": {"id": "1bpq65g", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Spider--G", "link_flair_text": "Theory/Debunking", "time": 1711775736.7154846, "created_utc": 1711613201.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1bpq65g/i_had_a_possession_nightmare/", "title": "I had a possession nightmare.", "permalink": "/r/Thetruthishere/comments/1bpq65g/i_had_a_possession_nightmare/", "selftext": "Possession in a Dream:\nIn this dream, I was at the market near my girlfriend's house. We were walking through the parking lot when I heard something talking to me. This part wasn't clear in my mind after waking up, but I remember fragments. The voice told me that reality was more than this, and that we could perceive it through three means. The only one I remember was sound, and in the dream, it was as if I could see sound waves transferring from one space to another; unfortunately, I don't remember the others.\nAt one point, we went to the room where I was sleeping in real life. It's more common for my girlfriend to come to my house than vice versa, so dreaming that I'm in her room is significant. This part was simple; now the voice was my girlfriend's. She looked at me and said, \"Want to know another way? There's a spirit here in the room.\" At that moment, the spirit entered me, and I laughed in a terrifying way. However, I woke up laughing in the same manner. I experience sleep paralysis very frequently, and whenever I wake up from it, I can't move. But this time, I lifted my head a bit and laughed, almost screaming at the same time. My girlfriend grabbed my head and asked if I was okay, and I continued laughing for about 5 seconds—it was a loud, suffocating, restrained laughter. I'm a very calm person and never have reactions out of the ordinary, especially in dreams. I immediately reassured my girlfriend when I returned to myself, but I was very afraid and sweaty after the nightmare. I've never made noise because of a dream before; this is also the first time.\nI know it's nothing outerwordly but I just wanted some opinions.", "media": null, "score": 13, "upvote_ratio": 0.78, "comment_count": 6, "over_18": false}, "74": {"id": "1bnl4yt", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "3rroR039", "link_flair_text": null, "time": 1711775737.303578, "created_utc": 1711391735.0, "url": "https://www.reddit.com/r/threekings/comments/1bnl4yt/three_wish_ritual_questions/", "title": "Three wish ritual questions ", "permalink": "/r/threekings/comments/1bnl4yt/three_wish_ritual_questions/", "selftext": "Yeah hey I'm new to rituals and stuff and I'm on you the three wish ritual but there I got some questions first does it have to be like a livestock field or can it just be like any farm field in general like like cornfield livestock cow field horse field you yet or does it have to be like I want to make sure I'm doing the right field and I will make sure I'm not messing up because the old next to streams and rivers that feed into the Ohio River but you know I just want to make sure I'm not messing up yeah I also saw if this is is scuffed I'm using the mobile also any other tips for the ritual would be very much appreciated because heck I'm also planning to go stargazing tonight so hopefully I can find another field because I found one but it's New Yorker Vos near and has like a river in it but how big does the field need to be and all this other stuff like I got a lot of questions all right please and thank you for reading for this", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "75": {"id": "1bp9c2w", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "PulsingStars", "link_flair_text": "Personal Encounter ", "time": 1711775737.913755, "created_utc": 1711564672.0, "url": "https://www.reddit.com/r/Ghosts/comments/1bp9c2w/we_lived_in_a_haunted_house_quite_a_few_years_ago/", "title": "We lived in a haunted house quite a few years ago in Surrey, just outside London", "permalink": "/r/Ghosts/comments/1bp9c2w/we_lived_in_a_haunted_house_quite_a_few_years_ago/", "selftext": "We had numerous interactions with this being, but the one thing it did to three of us was play with the hair on the backs of our heads while sitting in reclining chairs. I think this being had to be a kid, because why would an adult play with our hair. it was an interesting four years.", "media": null, "score": 50, "upvote_ratio": 0.91, "comment_count": 29, "over_18": false}, "76": {"id": "1bnxg0r", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Zestyclose-Ocelot871", "link_flair_text": "Glitch Vid", "time": 1711775738.7607617, "created_utc": 1711422210.0, "url": "https://i.redd.it/qx4f8d4wglqc1.jpeg", "title": "Fighting is here", "permalink": "/r/GlitchInTheMatrix/comments/1bnxg0r/fighting_is_here/", "selftext": "", "media": null, "score": 66, "upvote_ratio": 0.85, "comment_count": 15, "over_18": false}}}