{"_default": {"1": {"id": "1ht5t37", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Accomplished-Put8442", "link_flair_text": null, "time": 1736564446.493356, "created_utc": 1735963072.0, "url": "https://www.reddit.com/gallery/1ht5t37", "title": "some info floating around ", "permalink": "/r/ufo/comments/1ht5t37/some_info_floating_around/", "selftext": "", "media": null, "score": 1294, "upvote_ratio": 0.96, "comment_count": 309, "over_18": false}, "2": {"id": "1hxsgdr", "locked": true, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "shogun2909", "link_flair_text": "Disclosure", "time": 1736564447.7666643, "created_utc": 1736470895.0, "url": "https://v.redd.it/xjhgqpdgf2ce1", "title": "\"I'm going to give you a report on drones about one day into the administration. Because I think that they're not telling you what's going on with the drones.\"", "permalink": "/r/UFOs/comments/1hxsgdr/im_going_to_give_you_a_report_on_drones_about_one/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/xjhgqpdgf2ce1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/xjhgqpdgf2ce1/DASH_96.mp4", "dash_url": "https://v.redd.it/xjhgqpdgf2ce1/DASHPlaylist.mpd?a=1739156446%2CMTg4N2FjY2ZmZWI5MDgzMDU1MDU3NDRiMzliZDQ3MjgxYWQ2ZWY5YTdjNTRhNTBiZGFjM2EyNzQxN2NjMzlmMQ%3D%3D&v=1&f=sd", "duration": 37, "hls_url": "https://v.redd.it/xjhgqpdgf2ce1/HLSPlaylist.m3u8?a=1739156446%2CNmVkMDVmNDYwNTljYjIyNmQyNzZmOGU4YTkzMTEzNjA4ZWRhZWYwNmNiYTk3NWY0NDUyN2E2NTY5ODYyODMxZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 10517, "upvote_ratio": 0.77, "comment_count": 2947, "over_18": false}, "3": {"id": "1hw7jjv", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "aliensinbermuda", "link_flair_text": "Video", "time": 1736564449.4670503, "created_utc": 1736298648.0, "url": "https://v.redd.it/lrrdcqos6obe1", "title": "Reissuing the 'Ring Camera' video for those who never got to see it.", "permalink": "/r/aliens/comments/1hw7jjv/reissuing_the_ring_camera_video_for_those_who/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/lrrdcqos6obe1/DASH_720.mp4?source=fallback", "has_audio": false, "height": 720, "width": 936, "scrubber_media_url": "https://v.redd.it/lrrdcqos6obe1/DASH_96.mp4", "dash_url": "https://v.redd.it/lrrdcqos6obe1/DASHPlaylist.mpd?a=1739156448%2COWM2YjVlMmVhYzY1YmI1ZjI2MWJlZjhiMGZiNjNjYTA3NzVkMTRmMzUwODE2YTFmNTgwOWYzNDhjODQ0ODIxOA%3D%3D&v=1&f=sd", "duration": 10, "hls_url": "https://v.redd.it/lrrdcqos6obe1/HLSPlaylist.m3u8?a=1739156448%2CNDIyODY1YzZiMTdjZGExNzljMmMwYWUyYzE0OWQxZjc5MGZiNTEzNWE1ZjM2NjdjNjJiNTQ4ODA3NDFjMGIzOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 8964, "upvote_ratio": 0.8, "comment_count": 1926, "over_18": false}, "4": {"id": "1htokcv", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Discussion", "time": 1736564449.8481328, "created_utc": 1736025166.0, "url": "https://www.reddit.com/gallery/1htokcv", "title": "[Ryan Graves] A whistleblower came to ASA regarding a mid air collision between a Gulfstream jet and an unidentified metallic object that occurred off the coast of Florida on December 11 at approximately 27,000 feet and resulted in engine failure and an emergency landing. ", "permalink": "/r/UAP/comments/1htokcv/ryan_graves_a_whistleblower_came_to_asa_regarding/", "selftext": "", "media": null, "score": 714, "upvote_ratio": 0.99, "comment_count": 64, "over_18": false}, "5": {"id": "1hwtfvt", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "bohemianmermaiden", "link_flair_text": null, "time": 1736564450.8324661, "created_utc": 1736366589.0, "url": "https://www.reddit.com/r/conspiracy/comments/1hwtfvt/the_real_reason_trump_wants_greenland/", "title": "The REAL Reason Trump Wants Greenland", "permalink": "/r/conspiracy/comments/1hwtfvt/the_real_reason_trump_wants_greenland/", "selftext": "Okay, so Trump keeps bringing up buying Greenland again—he’s calling it an “absolute necessity for national security and global freedom.” When he says stuff like that, it always feels like there’s something he knows that we don’t. So I started digging.\nFirst off, yeah, Greenland makes sense militarily. It’s basically a fortress in the Arctic. Whoever controls Greenland controls shipping routes, strategic airspace, and Arctic defense lines. Russia and China are both heavily invested in that region, and the U.S. doesn’t want to be caught slipping.\nThen there’s the rare earth minerals. Greenland is loaded with them—stuff like neodymium, dysprosium, terbium—all those sci-fi-sounding elements that go into high-tech military equipment, renewable energy systems, and advanced electronics. If oil stops being the backbone of the global economy tomorrow because some zero-point energy device shows up, those minerals instantly become the most valuable resources on the planet.\nBut this goes deeper.\nTrump’s a narcissist. I don’t mean that as an insult—I mean it as a fact. If alien contact is imminent (and let’s be honest, the conversations around that are starting to get louder, not quieter), Trump isn’t the type to sit back and let someone else—whether it’s the U.N., Russia, or China—take credit for humanity’s first handshake with aliens. He’d want to be the guy standing there, chest puffed out, making some speech about “humanity’s great leap into the stars” with his name stamped all over it.\nNow, remember that Israeli space security chief, Haim Eshed? The guy who straight-up said there’s a “Galactic Federation” and that humans have been in contact with extraterrestrials for years, but that we’re “not ready” for it yet? That guy wasn’t some random conspiracy theorist in a tin foil hat—he was a respected government official. If Trump has even an inkling that this is true (and let’s be honest, as a former president, he’s seen some classified stuff), Greenland makes perfect sense as a preparation site.\nThink about it:\n    1.  Remote and isolated. You could set up staging grounds, energy facilities, or experimental tech sites without prying eyes.\n    2.  Resource-rich. The minerals are there for whatever tech or infrastructure is needed.\n    3.  Strategically positioned. Arctic access, defense positioning—it’s the perfect stronghold.\nAnd if zero-point energy tech becomes real—if that’s what alien contact eventually brings into play—those minerals aren’t just important; they’re critical.\nTrump’s entire move here feels like a long-term power grab. If alien contact happens, or if a new energy system disrupts the global order, Greenland is the safest, most resource-rich chess piece on the board.\nNational security might be the headline reason he’s giving, but underneath it, this feels like legacy, power, and control of whatever comes next.\nHe doesn’t just want Greenland for defense. He wants it because if aliens are coming, if zero-point energy is coming, and if the global economy is about to flip upside down, Greenland is how he stays on top.\nAnyway, that’s my rabbit hole. Curious if anyone else is seeing these same patterns, or if I’m just losing it.", "media": null, "score": 3651, "upvote_ratio": 0.92, "comment_count": 617, "over_18": false}, "6": {"id": "1ht2ksh", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnthonyofBoston", "link_flair_text": null, "time": 1736564450.9823086, "created_utc": 1735953044.0, "url": "https://anthonymoore56.academia.edu/research#papers:~:text=A%202025%20Memorandum%20to%20the%20US%20State%20department%20concerning%20the%20imminent%20catastrophic%20implosion%20of%20the%20United%20States%20and%20collapse%20of%20its%20allies%20between%20June%20and%20September%20of%202025", "title": "A 2025 Memorandum to the US State department concerning the imminent catastrophic implosion of the United States and collapse of its allies between June and September of 2025.", "permalink": "/r/conspiracyfact/comments/1ht2ksh/a_2025_memorandum_to_the_us_state_department/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 0, "over_18": false}, "7": {"id": "1hts2p0", "locked": true, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Molech996", "link_flair_text": "⚠️ serious replies only ⚠️", "time": 1736564451.5643525, "created_utc": 1736034674.0, "url": "https://v.redd.it/qlqexg7ud2be1", "title": "Bigfoot (Almasty) caught on tape in Russia in 2015.What are your thoughts on this?", "permalink": "/r/bigfoot/comments/1hts2p0/bigfoot_almasty_caught_on_tape_in_russia_in/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/qlqexg7ud2be1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 712, "width": 1280, "scrubber_media_url": "https://v.redd.it/qlqexg7ud2be1/DASH_96.mp4", "dash_url": "https://v.redd.it/qlqexg7ud2be1/DASHPlaylist.mpd?a=1739156451%2CN2Q2NzRlYWNhZjdkMmFhZTE5ZDJhNjI5OGU5NzU4YjczYjk0NjhmMzU4NzIwODE0ZmQyODlkMzIxODU4Y2M0MA%3D%3D&v=1&f=sd", "duration": 78, "hls_url": "https://v.redd.it/qlqexg7ud2be1/HLSPlaylist.m3u8?a=1739156451%2CNzFkNzc1ZGUyMGEwNDVlOTYzYzgxNGRiN2U0MWZjNzc2NzFlZjI2NmJiNmMyMTkyZDU1MWI3ODlmNmVhZjc2Ng%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2776, "upvote_ratio": 0.88, "comment_count": 581, "over_18": false}, "8": {"id": "1htct8u", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Ordos_Agent", "link_flair_text": null, "time": 1736564452.2686589, "created_utc": 1735991376.0, "url": "https://v.redd.it/mfsv0mcu5wae1", "title": "This black bear I ran into, in the Canadian wild scratching an itch", "permalink": "/r/Cryptozoology/comments/1htct8u/this_black_bear_i_ran_into_in_the_canadian_wild/", "selftext": "", "media": null, "score": 440, "upvote_ratio": 0.95, "comment_count": 75, "over_18": false}, "9": {"id": "1hvwvne", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Official_CheemScream", "link_flair_text": "Strange", "time": 1736564452.4352348, "created_utc": 1736271269.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1hvwvne/i_saw_a_faceless_person_at_my_work_place_one_day/", "title": "I saw a faceless person at my work place one day that vanished without a trace", "permalink": "/r/Humanoidencounters/comments/1hvwvne/i_saw_a_faceless_person_at_my_work_place_one_day/", "selftext": "(Edit: Forgot to mention this was about a year ago (2024) at a small restaurant I used to work at in the South)\nFirst of all, I've never seen or heard anything that wasn't there, so I have a sound mind.\nI figured I share this here since there aren't many people in real life who'd believe me because of how strange this encounter is.\nFor context I was working at a restaurant when hardly anyone was there. Most of the staff at that time (skeleton crew) had gone to break and it was just me in the back kitchen. I went to put some frozen stuff back in the freezer and went towards the tables (I drew the general layout below with the freezer to the left) and out of the corner of my eye, clear as day, I saw a humanoid figure standing in the doorway, it's head peaking around the corner and as soon as it realized I saw it, it ducked away towards the front line/dining room area. I very quickly walked (more like ran) to the doorway and NO ONE was anywhere near the entire area. No one was even at the front-line getting food. Even though it was for less than a second I remember every detail about its face, or lack thereof.\nI know it sounds like a horror movie scene, but I promise to anyone reading this it just had deathly pale skin stretched over its face where eyes, a nose, or mouth would be\nI went over to the doorway after I couldn't find it and measured where I saw its head at compared to the top of the pizza ovens, and it was around 7 feet tall too. No one anywhere near that tall works there, at the time I was the tallest at 6ft\nhttps://preview.redd.it/l80eoidavlbe1.png?width=681&format=png&auto=webp&s=eb294052273653d31dac24cbd650623c030f6db6\nThanks for readin :)", "media": null, "score": 99, "upvote_ratio": 0.94, "comment_count": 50, "over_18": false}, "10": {"id": "1htiyx0", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "polishthotdog", "link_flair_text": null, "time": 1736564452.8811011, "created_utc": 1736010527.0, "url": "https://v.redd.it/ejqwrepwd0be1", "title": "Come see Saxsquatch IRL ", "permalink": "/r/cryptids/comments/1htiyx0/come_see_saxsquatch_irl/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/ejqwrepwd0be1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/ejqwrepwd0be1/DASH_96.mp4", "dash_url": "https://v.redd.it/ejqwrepwd0be1/DASHPlaylist.mpd?a=1739156452%2CNmYyZjY4ODE5MDMyZDUyMjgwZDQ5YmQyM2MwN2ZmNTUwMGFmYzYzM2Q3NzZlOTE2ZTZlZmZmZDc2YjQ2ZmQ2Zg%3D%3D&v=1&f=sd", "duration": 33, "hls_url": "https://v.redd.it/ejqwrepwd0be1/HLSPlaylist.m3u8?a=1739156452%2CMjJlOGUzMGUwMzMyNjU3MjEwNjQwYzk5MmFkM2Q2ZDc5OTAyMDVlNjJhYzAyM2ZkYTQxYjNjODQ3Y2ZlZjJiOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 438, "upvote_ratio": 0.98, "comment_count": 17, "over_18": false}, "11": {"id": "1htewth", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Flackowackoo", "link_flair_text": null, "time": 1736564453.1006348, "created_utc": 1735999125.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1htewth/me_and_family_have_encountered_fey_creatures/", "title": "Me and family have encountered fey creatures", "permalink": "/r/Thetruthishere/comments/1htewth/me_and_family_have_encountered_fey_creatures/", "selftext": "This sort of subject has always been in the back of my head even after years I always randomly get the memory in my head whether when I’m walking home or just taking a shower. I just wanted to make this post to see if anyone else has had similar situation and what should I make of it. So basically I saw a fairy or pixie about 6 years ago once on my way back from middle school. I remember this, I was walking home from school and the street I was walking on has a lot of shade due to the trees in front the houses. I was walking just looking at the ground cause it’s a habit of mines (I was always afraid of stepping in shit) and I heard this buzzing sound coming from up on a tree idk how to describe it but it was like the fluttering noise you would hear when a beetle was flying. I remember looking up at the tree and seeing it. At first I didn’t know where the noise was coming from it was on the tree branch but there wasn’t any bugs or birds up there. I looked closer and saw this bug like translucent wings flapping or fluttering then squinted a little bit and it looked liked a long green grassy stick with wings that was just laying there. Then just when I was about to keep walking it made more fluttering noise and flew down from the tree. It flew closer and closer to me until it was maybe a couple inches away from my face i then noticed it wasn’t a stick but a small woody person. I saw weirdly human looking wood body and head and it’s twig like arms but the thing stood out the most where its legs. Its legs were much more longer than their body. It was just flying in front of face like sort of curiously looking at me as I sort of was just shockingly staring then it quickly flew away. This all happened in maybe less than minute but it was enough to leave a standing impression on me since I still look back on it. I walked back home and never told anyone since i thought they wouldn’t believe me.\nUntil 2 years ago on new years my family all came over my house to celebrate and I finally mentioned it to my parents. Some background my mom and dad are from rural Mexico and they grew up in a small village. There is a huge chunk of Mexicans that believe in little gnome creatures called duendes. I knew of this but I never knew that parents and family also had encounters with them. When I brought up my experience with the far creature I thought they would just tease me but instead they believed me. They even made a guess that the fairy creature that I saw that day was an angel spirit (which I don’t know that I believe). I was little surprised that they didn’t make fun of me and I told them that and they said that they also have encounters with beings like that. They brought up that when they were kids they had experience with duendes and my dad has even lost a friend when he was little to them. They also told me that my aunt in Mexico as child was always picked on by the creatures. Cause they always liked to play in the river next to the woods where duendes lived and cause of that the little things got angry at her and put a spell on her that made a punch pimple balls to appear on her back? I put a question mark cause that’s the rough translation on what I think they said in Spanish I don’t speak it formally sorry lol. Anyways has anyone else family had experience with fae creatures? And what did the fairy encounter mean?", "media": null, "score": 51, "upvote_ratio": 0.86, "comment_count": 16, "over_18": false}, "12": {"id": "1hwfqg0", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Fit-Count9808", "link_flair_text": null, "time": 1736564453.218239, "created_utc": 1736326709.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hwfqg0/almost_got_kidnapped_going_to_an_adult_store/", "title": "Almost got kidnapped going to an adult store...", "permalink": "/r/LetsNotMeet/comments/1hwfqg0/almost_got_kidnapped_going_to_an_adult_store/", "selftext": "This happened approximately 10 years ago around 2015 to 2016. \nI was living with someone at the time who worked an opposite schedule as me. He worked graveyard, and I worked during the day.  So when I was getting up to get ready to leave for work, he was just coming home. On the nights during the week, I obviously would be at home by myself. One night during the week, I was feeling especially lonely and my favorite toy unfortunately broke and died. So I decided to drive downtown to the 24 hour adult store to buy another one. The town I live in is a mid-sized suburban town filled with mostly residential areas. The main \"downtown\" area was essentially one small area on the way to the freeway. My apartment was 10 minutes away. \nI pulled into the parking lot behind the adult store.  The parking lot was dark and had multiple entries all around that lead to the bars and restaurants as well as the store. After parking my car, I walked towards the entrance of the store which was on the street. To do so, I had to walk towards the driveway I came in to park. Upon walking to the entrance I noticed a man standing by himself smoking a cigarette. It was 1 a.m. and not normal just to see only one person standing by themselves. Though I figured he was one of the patrons from one of the bars on the block taking a cigarette break. As I walked passed him, he said \"hi\". To which I responded with a quiet \"hi\" back, but didn't make eye contact with the man. Upon passing him, I had a better look at his appearance. He had a shaved head, wore a long white T Shirt with shorts hanging past his knees. He had on a pair of sneakers accompanied with some tube socks that covered his shins. This is not unusual to see in my town, but I was more concerned that he was sitting by himself and instantly took an interest in me as I walked past him. \nAfter passing him and continuing to walk to the store, I saw out of the corner of my eye the man proceeded to follow behind me. When I say follow, I don't mean he coincidentally was walking behind me. He immediately followed right behind me as soon as I passed him making a point to maintain the same walking speed.  I did not know this mans' intentions, but a man by himself that late at night is a recipe for trouble. As I looked down the dark and empty street, I weighed out my options of where to go. Initially, I thought \"keep walking so he doesn't know you're going to the adult store.\" But since it was 1 a.m. and there was no one on the street, I thought that to be more dangerous. Then I thought \"just go in one of the bars.\" But then I thought that would give him an easier introduction to approach me. So then I realized my best bet was to continue into tlhe store where I know was well lit and people who could see me. \nI proceeded to shop for what I came there for. The man entered the store behind me,  but hung out at the front of the store so not to look like he was following me around. He wasn't even pretending to shop, he literally just sat at the front waiting. As I was shopping, I heard the man make a \"sssssst!\" sound to which I ignored. He wasn't getting the message. He continued making the \"ssssst\" sound as I continued to shop without noticing. Eventually I walked up to the cashier who was completely oblivious to what was going on. I tried to whisper to the cashier \"do you know that man or does he work here?\" The cashier asked me to repeat what I was saying. I asked again, but still spoke in a quiet voice. Not understanding my attempt to be discreet, the cashier responded \"I can't hear you, say it again?\" At this point I felt my cover was blown. So in a more normal tone I told the cashier the man in front followed me from outside and won't leave me alone. I explained my car was parked in the lot behind the store and I didn't feel comfortable going to my car. The cashier said \"ok.\" The cash wrap area was an enclosed square-shaped counter to maintain distance between the staff and the customers. The cashier walked to the front by where the man was and from behind the counter told the man to leave. He then came up and assured me he told the man to go away. Though the man did not, in fact, go away. He continued to stay there. Given that I didn't want him to follow me to my car, I stayed in the store and pretended like I was still shopping even though I already found what I came there for. I would occasionally glance to the front to see if the man was still there...he was. I kept going up to the cashier explaining the man hasn't left. So he went back up to the front to talk to him. I heard the cashier say, \"enough already, leave the store!\" While he was doing this, I went to the far back end of the store to remain out of sight. By the time I circled back to the cashier, I noticed the man was no longer in the store. The cashier said that he repeatedly and more assertively told the man to leave. He said the man claimed he didn't understand English. The cashier then said he pulled a baton he kept under the counter for protection, held it over his head and asked the man \"do you understand this?\" To which the man finally left the store. I made my purchase, but was still worried about walking to my car even though I was parked in one of the first spaces when you come through the driveway. The cashier pointed at a small TV behind him that had 4 angles of CCTV footage. He assured me the man was gone and if I saw him to come back in the store. He also said he will see me when I walk to the car. Even though I would've felt more comfortable with him walking me to the car, I understood he was by himself and couldn't leave the store unattended with customers. \nAfter making my purchase, I sped walked to my car. I always have my keys at the ready when walking to my car, so I promptly pressed unlock on my car remote, got in the car, placed my bag of purchases on the passenger seat and proceeded to start the car. Once my car turned on, I took off the E break, put the car in reverse and while putting on my seat belt, I looked in my side view mirror to back out. It was at this point that I saw that same man in the side view mirror full on speed walking right to my driver side door. I was driving an Accord at the time and that model automatically locks all the doors when you take the car out of park. As soon as I saw him, I hit the gas and violently pulled out of my parking space. I pulled out so fast, it startled him and stopped him dead in his tracks. He was now standing right next to my driver side door as I continued to pull out. I gave him the most serious dead stare I could because I know most predators play off the fear of their victims. The stare must've worked. As soon as he saw me pull out while staring at him, he turned his head back to the driveway entrance and proceeded to walk back to where he was standing. He had a look of defeat on his face. My face, however, was overcome with relief. I pulled out of the parking lot and took myself back home. \nI felt a bit of shame being by myself going out so late. I did tell my boyfriend about the incident when he came home at 6 a.m. He also concurred me going out that late by myself wasn't the smartest thing. I'm no longer with that person, but still live in the same town. Though I never leave my home for anything past 9 o'clock anymore. While the town I live in isn't t the most dangerous, there still is enough crimes that occur here it's also not considered the safest. So to the man who decided to follow me at 1 in the morning with sinister intentions, LET US NOT MEET.", "media": null, "score": 91, "upvote_ratio": 0.89, "comment_count": 3, "over_18": true}, "13": {"id": "1hwp4ev", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "HamletX95", "link_flair_text": null, "time": 1736564453.3409915, "created_utc": 1736355961.0, "url": "https://i.redd.it/hyo2gaplxsbe1.png", "title": "Lead Masks Case - the unsolved death of two men found on a hilltop wearing lead eye masks with no apparent injuries. A nearby notebook was found to contain the message '16:30 be at the specified location. 18:30 ingest capsules, after the effect protect metals await signal'", "permalink": "/r/truecreepy/comments/1hwp4ev/lead_masks_case_the_unsolved_death_of_two_men/", "selftext": "", "media": null, "score": 96, "upvote_ratio": 0.97, "comment_count": 1, "over_18": false}, "14": {"id": "1htu1gy", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Technical-Horse-5989", "link_flair_text": null, "time": 1736564453.5102062, "created_utc": 1736040247.0, "url": "https://www.reddit.com/r/threekings/comments/1htu1gy/how_to_go_to_another_world_yellow_pen_and_white/", "title": "How to go to Another World (Yellow Pen and White Paper method)", "permalink": "/r/threekings/comments/1htu1gy/how_to_go_to_another_world_yellow_pen_and_white/", "selftext": "I would like to know if anyone already knew about this ritual, if it is real or if they tried it and did it work?\nhttps://theghostinmymachine.com/2024/10/28/the-most-dangerous-games-the-yellow-pen-and-white-paper-game/", "media": null, "score": 8, "upvote_ratio": 0.91, "comment_count": 6, "over_18": false}, "15": {"id": "1hvjs6p", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "yummydiaper", "link_flair_text": "Personal Encounter ", "time": 1736564454.0327296, "created_utc": 1736225548.0, "url": "https://www.reddit.com/gallery/1hvjs6p", "title": "Pictures taken in 2012 at fort sanatorium in Saskatchewan Canada", "permalink": "/r/Ghosts/comments/1hvjs6p/pictures_taken_in_2012_at_fort_sanatorium_in/", "selftext": "I was 7 when this photo was taken on Halloween night with my auntie and my mom along with my cousin. We went to take pictures as it was said to be haunted, it was an abandoned sanatorium for TB for Native Americans back around the 1920s. \nMy auntie took these pictures on her digital camera and only realized the apparition when she looked at the camera roll, she immediately sprinted back screaming and we took off as soon as we could and me and my little cousin were crying in the backseats", "media": null, "score": 767, "upvote_ratio": 0.96, "comment_count": 74, "over_18": false}, "16": {"id": "1hwjhcc", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "hettuklaeddi", "link_flair_text": "Glitch Vid", "time": 1736564454.2748523, "created_utc": 1736340572.0, "url": "https://v.redd.it/bj5tfabznrbe1", "title": "Matrix Reset @ :15", "permalink": "/r/GlitchInTheMatrix/comments/1hwjhcc/matrix_reset_15/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/bj5tfabznrbe1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/bj5tfabznrbe1/DASH_96.mp4", "dash_url": "https://v.redd.it/bj5tfabznrbe1/DASHPlaylist.mpd?a=1739156454%2CNjZiY2I1OTA3OWQ2NjVhZDFkMDNjYTYxNGI0YzExN2UyMzNmM2NiM2JiZWUzNjQwNzlmYzM5OTExYWQ4YjYwZQ%3D%3D&v=1&f=sd", "duration": 24, "hls_url": "https://v.redd.it/bj5tfabznrbe1/HLSPlaylist.m3u8?a=1739156454%2CMjA5N2I4OWEyNjkzMGRmOTY2MGVkYzNhMTBjOGU5ODQzMDBjMGRmMjg2YTFiNmRlNjM1ZTA1NDcxOTNkZjEwMA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2628, "upvote_ratio": 0.97, "comment_count": 318, "over_18": false}, "17": {"id": "1htroo9", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": null, "time": 1736564455.5337338, "created_utc": 1736033605.0, "url": "https://ovniologia.com.br/2025/01/o-governo-americano-esta-censurando-evidencias-da-atuacao-ufos-sobre-locais-criticos.html", "title": "The U.S. Government is censoring evidence of UFO activity over \"critical sites\":\nA YouTuber claims to have received a Striker in a video showing a UFO over the Picatinny Arsenal military facility in New Jersey. The footage was filmed by a witness whose social media accounts were also censored.", "permalink": "/r/ufo/comments/1htroo9/the_us_government_is_censoring_evidence_of_ufo/", "selftext": "", "media": null, "score": 1028, "upvote_ratio": 0.95, "comment_count": 83, "over_18": false}, "18": {"id": "1htnb1l", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "NextEducator5726", "link_flair_text": "News", "time": 1736564456.8349197, "created_utc": 1736021841.0, "url": "https://i.redd.it/nqh0bdg8c1be1.jpeg", "title": "Mid air collision between a Gulfstream jet and an unidentified metallic object", "permalink": "/r/UFOs/comments/1htnb1l/mid_air_collision_between_a_gulfstream_jet_and_an/", "selftext": "From Ryan Graves\nA whistleblower came to ASA regarding a mid air collision between a Gulfstream jet and an unidentified metallic object that occurred off the coast of Florida on December 11 at approximately 27,000 feet and resulted in engine failure and an emergency landing.\nThere are indications that the unidentified object may have been a drone operating off the east coast with atypical characteristics.\nThe whistleblower is concerned because this altitude is highly regulated Class A airspace that requires flight plans and transponders, but in this instance, there were no flight plans for the object and the object was not transponding.\nWe can largely eliminate the possibility of common objects because:\n\na weather balloon would have been transponding\nthis altitude is too high for hobby drones and illegal for any drone \nthere is no biological indicator of a bird strike\nvideo of the engine shows metal damage \n\nI am concerned the incident is being downplayed by FAA. The report is being classified it as an “incident” and not an “accident,” which would require public announcement, investigation by NTSB, and an explanation.", "media": null, "score": 5730, "upvote_ratio": 0.92, "comment_count": 617, "over_18": false}, "19": {"id": "1htvlnu", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "coachlife", "link_flair_text": "Video", "time": 1736564458.9780798, "created_utc": 1736044971.0, "url": "https://v.redd.it/qkb8h51093be1", "title": "UAP Blasts Out of Ocean in NJ (Wait for it - Left side)", "permalink": "/r/aliens/comments/1htvlnu/uap_blasts_out_of_ocean_in_nj_wait_for_it_left/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/qkb8h51093be1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/qkb8h51093be1/DASH_96.mp4", "dash_url": "https://v.redd.it/qkb8h51093be1/DASHPlaylist.mpd?a=1739156457%2CZmUwZTEwZGVhNDRiMmNjMzQzZWJhNzM2NmFkODc2MzNiZDVhZTMwZjA1ZTkyZGEyZmEyNjdkZjQxNTliNmZlYQ%3D%3D&v=1&f=sd", "duration": 21, "hls_url": "https://v.redd.it/qkb8h51093be1/HLSPlaylist.m3u8?a=1739156457%2CNzU2Y2FjYzk3MzYxN2MwNzBlNjQwMmQ1ZTIxNjA5YmViY2Y1M2FjMjQ2NTRiMzc3OTdmMTNlOGVkMjhmYjY4MA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3744, "upvote_ratio": 0.87, "comment_count": 620, "over_18": false}, "20": {"id": "1hx8kvo", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Username_merp", "link_flair_text": "Documentary", "time": 1736564459.3534205, "created_utc": 1736412327.0, "url": "https://i.redd.it/7ym2dbmclxbe1.png", "title": "Beyond: UFOs and the Unknown (very well done documentary series, no x files or otherwise overly dramatic music)", "permalink": "/r/UAP/comments/1hx8kvo/beyond_ufos_and_the_unknown_very_well_done/", "selftext": "I haven't seen any posts about this but it is a fantastic docuseries. I feel like I could watch it with people that are skeptics and they would find it interesting. \nWe got Dr. Gary Nolan, retired Rear Admiral Timothy Gallaudet, Jacques Vallee, Leslie Kean, Christopher Melon. Hal Puthoff. \nI'm just on episode 2.\nDates, times, interviews, documents, legislation, photos and video. \nNo dramatization, no x files music. It's not a TV show, it's a documentary. And, in my humble opinion, it is extremely well done.\nI'm finding it interesting, entirely pleasant, and compelling, as does my buddy who's always been skeptical but interested and is just now scratching the surface of this phenomenon. \nI hope you all enjoy ❤️👽", "media": null, "score": 126, "upvote_ratio": 0.97, "comment_count": 11, "over_18": false}, "21": {"id": "1hxhef9", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "deandre451234567890", "link_flair_text": "Rule 10", "time": 1736564460.457394, "created_utc": 1736441962.0, "url": "https://www.reddit.com/gallery/1hxhef9", "title": "I just don’t trust any of these people", "permalink": "/r/conspiracy/comments/1hxhef9/i_just_dont_trust_any_of_these_people/", "selftext": "It’s one big club and you DONT wanna be apart of it. ", "media": null, "score": 3476, "upvote_ratio": 0.94, "comment_count": 581, "over_18": false}, "22": {"id": "1httjw1", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Faroutman1234", "link_flair_text": "analysis", "time": 1736564461.1989214, "created_utc": 1736038851.0, "url": "https://v.redd.it/j5jvfabrq2be1", "title": "Russian video sharpened", "permalink": "/r/bigfoot/comments/1httjw1/russian_video_sharpened/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/j5jvfabrq2be1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/j5jvfabrq2be1/DASH_96.mp4", "dash_url": "https://v.redd.it/j5jvfabrq2be1/DASHPlaylist.mpd?a=1739156460%2CM2E2ZDc4NWUyMGE3OTQyYWIyMTQ5NDM0NzFmN2JhNTdhYTM4Yzg3NDM3OTU3ZjA3YTAwOGU0ZDM3Zjg4N2FhZA%3D%3D&v=1&f=sd", "duration": 7, "hls_url": "https://v.redd.it/j5jvfabrq2be1/HLSPlaylist.m3u8?a=1739156460%2CNDg0NjhhYzQyYjgyMWU0OGM5YTAzMTY1YzM0Zjg3ZTFkZGE5NmRjZTAwNTM1NjgxZTY0N2Q2NWUyNTA4ZDkyMA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1092, "upvote_ratio": 0.97, "comment_count": 150, "over_18": false}, "23": {"id": "1hwi92e", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1736564461.8609014, "created_utc": 1736336435.0, "url": "https://i.redd.it/hepp8y4obrbe1.jpeg", "title": "Divers around the world, particularly in Australia and the Gulf of Mexico, report encounters with extraordinarily large groupers. Some of them are said to be large enough to easily swallow a diver whole- and some stories claim they already have", "permalink": "/r/Cryptozoology/comments/1hwi92e/divers_around_the_world_particularly_in_australia/", "selftext": "", "media": null, "score": 381, "upvote_ratio": 0.98, "comment_count": 82, "over_18": false}, "24": {"id": "1hxngyp", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Johanharry74", "link_flair_text": "U.F.O. Humanoid", "time": 1736564462.0289376, "created_utc": 1736457294.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1hxngyp/otherworldly_close_encounters_along_the_roads_in/", "title": "Otherworldly close encounters along the roads in Finland. Part 1", "permalink": "/r/Humanoidencounters/comments/1hxngyp/otherworldly_close_encounters_along_the_roads_in/", "selftext": "During my research of close encounter reports from the Nordic countries, I noticed that Finland really stood out in the number of cases I found. So many stories to be told. So therefor came the idea of doing a mini-series of eerie encounters along the finish roads. So here is the first part of two:\nBears, penguins or eskimoes?\nKotka, south-east Finland, summer of 1955.\nThe time was around 9:30 – 10:00 and it was dusk on this summer evening. On a road between Karhula and Huruksela near Kotka, a young man was driving his first car, an older Russian Moskvich 400, when in a straightaway in the middle of the forest, he noticed how three creatures resembling bears or penguins ran from the woods to the road some 100 meters (110 yards) away in front of him. When he drove closer, the creatures began to gesture for him to stop, which he almost did. The creatures then at once ran to his car and tried to open the doors, which luckily were locked. They were dressed in a fur like coverall, their hands were covered by dark mittens and only their faces were visible. The young man was terrified when he saw that their faces resembled that of Chinese or Eskimoes. Scared, he gestured to the humanoids that he would drive to the side of the road a little bit farther on and stop. When the beings let go of his car so that he could drive to the side of the road, he accelerated all his Moskvich was worth. The beings seemed angry, and gesturing with their hands and then ran some tens of meters (30 – 40 feet) after his car in a clumsy fashion.\nStrange creatures or beings in fur attacked the young man's Moskvich.\nSoon the driver came back to the spot with some friends and other youngsters, but then there was nothing to see. No beings or creatures were left there. Later though he heard that others in that area had found that there was a place where the ground vegetation was all burnt, close to where he had encountered the humanoids. It was a round spot some 7 - 8 meters (23 – 26 feet) in diameter.\nThis is a wierd case. Who were these beings the witness met in the middle of the forest? Were they humans? In that case, why would there be eskimoes this far south near the Baltic and why would they have fur coats in the middle of the summer? And why would eskimoes attack his car? Or did he see some other kind of Bigfoot-like creatures? Was the burnt vegitation a landingspot for a UFO? Or was it all just a prank? Questions that we will never get any answer too.\nSource: Mervi Virtanen\nThe beings ran out of the woods and tried to stop the car at first.\nThe Flying Man.\nBetween Tornio & Kemi, Finnish Lappland, May 1964.\nIt was an afternoon in the early summer of 1964 and a 50-year old christian woman, who was very religious, was sitting on the passenger side in a car driven by her husband. When they were about half way to Kemi, she observed a flying “man” on the right side of the car. The man was flying in a standing position with hands out in front of him some 200 meters (220 yards) from the road and 300 - 400 meters (985 – 1312 feet) over the forest in the same direction of the vehicle. He was flying a little slower than the car was driving (80 - 90 km/ hour or 50 – 55 miles/ hour) so he was slowly left behind.\nThe man was clad in a silvery or metallic suit and had a silvery helmet. When she later saw astronauts on TV, she said that they were similar to what she saw that day. She observed the man for 2 - 4 minutes and could see him clearly, but she could not see any planes or other vehicles in the air. Nor could she understand how he could be flying all by him self without the help of any vehicle. Her husband did not want to look at the flying man in silver, though she insisted that he should. Since the husband never saw the strange man himself, he never believed her story.\nSource: Heikki Virtanen\nA man in a silvery \\\"space suit\\\" was flying above the tree tops alongside the road.\nThe black car and the man in silver.\nNear Turku (Åbo), western Finland, November 8 1971.\nA 37-year old female teacher was on her way home after work. It was cold and rainy and she arrived at the bus stop at 8:45 pm. She had waited for the bus for some minutes, when a dark “car” pulled up and stopped in front of her. The passenger door opened and the man in the car asked her where she was going. When she answered that she would be going some 20 km (12.5 miles) in the direction of Turku, the driver offered her a lift to the bus stop in her hometown. Strangely she accepted and stepped in.\nThe woman was standing alone at the bus stop when a black car pulled up next to her.\nAt once she noticed something unusual. There was some kind of transparent magnetic or electrical field between her and the driver. The driver, whom she could see only in profile, was in an odd way elegant and of slender built. She was astonished to see that he wore an outfit silvery-gray in color. However, it was quite dark inside, so she was not able to see many additional details. The driver asked her questions about her work, about the pupils and so on, displaying an unfamiliarity with school life. She also noticed that the “car” was driving soundlessly and some 1 - 2 meters (3 - 6 feet) above the surface of the road. One other strange thing, no other traffic met them, nor passed by, although the road was usually very transited even at this time of the hour. As they drove along, she could see the familiar landmarks outside.\nWhen they came to the bus stop in near her home, she asked to be let off, but the driver said he wanted to continue the conversation. She refused since she had small children waiting for her at home. The driver then asked if he could continue the conversation some other time, but she refused again, saying that her husband would not understand and might be upset. The driver then asked where her husband was, to which she replied that he was in Sweden on a business trip, so she had to hurry and tend to the children who was together with a babysitter. She said Good Night and then the driver also bade goodbye, after which the car door opened by itself and she stepped out.\nThe mysterious driver was dressed in silvery clothes and he never turned his face towards her while talking. The woman only saw him in profile.\nAs she watched, the car just disappeared into thin air in front of her, although there were more than 1 km (0.6 miles) of straight road visible. She suffered from hot flashes immediately after the encounter and later from a severe headache, a reddened face and static electricity.\nThis is one of those strange cases that involves a car or should we say ”car”. Because sometimes they are not of this world. Wierd ”Cosmic cars” has been seen all over Earth in our modern times. Why do aliens drive around in cars? Or something that looks like cars? To masquerade, to blend in so they can study us? We can only speculate what the reason is. We also again see a case where a visitor asks wierd questions about the ordinary life of humans.\nSource: Mervi Virtanen, Finland\nA glowing craft was blocking the road.\nKemijärvi, northen Finland, early January 1976.\nIt was around 3 o´clock in the afternoon, when a traveling salesman was driving his car on the Saukkoaava Road towards Vuostimo. When he was near the outskirts of Kemijarvi close to the Niskala farm, he spotted a large disc-shaped bright object descend gently towards the ground and flying over his car. As this happened his vehicle engine ceased to run and he had no choice but to stop the car. The bright object landed on the road some 100 meters (328 feet) away. The witness estimated the object to be about 4 meters (13 feet) in diameter and 1,5 meter in height (5 feet). It was shining brightly.\nA few minutes’ later two small humanoids appeared beside the object. In the dusk light the witness could see that they wore strange looking dark green suits and were about 80-90 cm (3 feet) in height. The two humanoids began to walk towards the witness car, but when they were about 40 meters (130 feet) away they suddenly turned around and hurried back to the object. The witness did not see how they entered the object, but the object ascended almost at once straight up and vanished behind some thin clouds without a sound.\nA glowing craft landed in the road and two short humanoids started walking towards the salesman's car.\nWhen the object disappeared he was able to re-start his car again. He drove to scene where the object had landed and he found three landing marks, 5 cm (2 inches) wide and 2,5 meters (8 feet) apart.\nThis is not the first time a strange alien craft is blocking a road. There are many such cases. Glowing craft has been seen many times as well. So you might ask yourself, why are some craft glowing and some not? Different types with different propulsion? Some suggest so. Also, unfortunately we do not know either if there are other witnesses to this event or if the landing marks were documented in some way.\nSource: Mervi Virtanen\nGhost car or space car?\nVihteljärvi, western Finland, December 8 1993.\nA 45-year old house repair worker, had finished his daily work and was heading home to Nokia. The time was around 6:15 pm this December evening and while driving in his car on the country road near Vihteljärvi, he first noticed that the surroundings became brightly illuminated. His first thought was that an airplane was descending and he tried to look up, but could not observe anything unusual.\nAfter a while bright lights were seen in his back mirror. On the next straight part of the road, the lights came very quickly towards him from the rear and stayed just behind his car. Then the lights put some distance to his car again, but on the next straight part of the road, again they raced towards his car in a second and passed it without a sound. The object behind the lights somewhat resembled a red car. The red colour was glowing and was in some way transparent too. In the ”car” there were 3 beautiful women with completely white skin, aged 20-30. As the ”car” passed, they smiled and waved at the observer. Except for black eyes and mouth, they were completely white. Even the hair, which reached to the shoulders, was white. After the ”car” had passed, it accelerated and vanished to the end of the straight part of the road (some 500 meters away/ 550 yards) in a second.\nA red car with three ivory white and creepy looking women were overtaking the witness car along the highway. Passing his car they waved and smiled at him. \nWhen the observer had driven a couple of kilometers (\\~1.5 miles) he noticed the ”car” again. It had stopped in a downward slope after a curve. He began to brake cautiously, but then the object started to move towards the observer and a crash seemed inevitable, so he braked all he could. Yet the object closed fast and the observer was sure it would hit his car. Then, suddenly, when it was only about a meter (3 feet) from his car it stopped and vanished completely. Astonished, the observer got out of his car to see if there was some trace of the object, but there was none, not even warm air.\nYet again we have a case with a strange, mysterious car, and this one is a little creepy. Who were the three ivory white ghostly females? Did the man see dead people from the other side? Or were they ”just” aliens? Or perhaps three young women dressed up for a masquerade? But if so, it can not explain how they and the red car could just vanish in front of the man. Or maybe the whole thing didn’t really happen at all?\nSource: Albert Rosales", "media": null, "score": 38, "upvote_ratio": 0.95, "comment_count": 6, "over_18": false}, "25": {"id": "1hv99d1", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "BarkyPanYT", "link_flair_text": null, "time": 1736564462.5758958, "created_utc": 1736196103.0, "url": "https://i.redd.it/mvmeqjoeqfbe1.jpeg", "title": "I saw this while taking pictures with my vintage camera in the forest today. Looks cute ", "permalink": "/r/cryptids/comments/1hv99d1/i_saw_this_while_taking_pictures_with_my_vintage/", "selftext": "", "media": null, "score": 324, "upvote_ratio": 0.96, "comment_count": 25, "over_18": false}, "26": {"id": "1hw8rbp", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "aubman02", "link_flair_text": null, "time": 1736564462.7595325, "created_utc": 1736302124.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1hw8rbp/have_you_seen_the_notdrones_in_your_area_yet/", "title": "Have you seen the 'not-drones' in your area yet?", "permalink": "/r/Thetruthishere/comments/1hw8rbp/have_you_seen_the_notdrones_in_your_area_yet/", "selftext": "They've started to pop up in Southeast Georgia and Northeast Florida. I'd like to study them but I don't have any good night time cameras so I'm left with interviewing other people who have seen them. One person said it was as big as a mini car and another said it was leaving a jet trail. What have yall heard? If you've seen one, what was your experience?", "media": null, "score": 44, "upvote_ratio": 0.88, "comment_count": 31, "over_18": false}, "27": {"id": "1huqnkt", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Doesntmatter1237", "link_flair_text": null, "time": 1736564462.891798, "created_utc": 1736137274.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1huqnkt/stranger_in_the_woods_when_my_friends_and_i_were/", "title": "Stranger in the woods when my friends and I were all about 15", "permalink": "/r/LetsNotMeet/comments/1huqnkt/stranger_in_the_woods_when_my_friends_and_i_were/", "selftext": "I've never told this story fully, but I remember it clearly. There were some woods next to my one friend's house that we used to walk through at the time when we were teenagers. \nBack in the woods a bit there was the remains of some old structure, like a small house or something. There were concrete walls about chest high, no ceiling or roof left, and a lot of it was overgrown. We had a group of 4 friends back in the woods during the day, and we decided to try to clear out this structure a little bit. We had a hatchet, machete, some pocket knives etc. We thought we were some real boy scouts out there I guess, and we cleared out some of the overgrowth. Adjacent to the structure there was also a circular hole in the ground filled with some bricks, maybe it used to be a silo? Idk. But we dug a small hole inside the walls, put some bricks up around it and even used some mud to hold it together. We gathered some sticks and branches and by the time it turned dusk we had a fire going. \nWe were hanging out for a while until I had to go #2, which would mean walking back to 1 friend's house. It was maybe a 10 minute walk or less that I'd made tons of times, so even at I wasn't too worried. I brought a flashlight and walked into the woods. I started to hear what sounded like a second set of foot steps and I stopped. It didn't sound like an animal and it seemed to stop when I did. I got spooked and walked back towards the firelight where my friends were. \nI didn't want them to say anything but they saw me and asked what are you doing coming back so soon? I was inside the walls again and told them I think there's someone else in the woods. They thought I was messing with them and I said no really, and then we heard a noise from close by. It was too dark to see, but sounded like it came from right outside the walls. To describe the sound, it was sorta like someone dropping an empty metal water bottle onto the concrete. We got up startled, dumped a lotta water on the fire and got out of the structure. The walls were crumbled enough to slip through the side, and we took the shorter, more difficult route through some thick brush to get to the road quicker. \nWe got outta the woods as quick as we could and got to the road, and looking back someone DID come out of the woods behind us, all we really saw was a man in a hoodie who followed us out of the woods and stopped by the road. \nSo that guy, let's not meet ", "media": null, "score": 76, "upvote_ratio": 0.9, "comment_count": 14, "over_18": true}, "28": {"id": "1htmsyz", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "happypants69", "link_flair_text": null, "time": 1736564463.0189402, "created_utc": 1736020550.0, "url": "https://i.redd.it/xwxbcgbe81be1.jpeg", "title": "Missing Jetpack - in the 1990's three guys built a functioning jetpack. Then one of the guys was brutally murdered, the second guy was kidnapped and just barely escaped with his life, and the third guy went to jail for kidnapping the second. The jetpack has never been found.", "permalink": "/r/truecreepy/comments/1htmsyz/missing_jetpack_in_the_1990s_three_guys_built_a/", "selftext": "", "media": null, "score": 67, "upvote_ratio": 0.98, "comment_count": 2, "over_18": false}, "29": {"id": "1hxallb", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "LeifNisaan", "link_flair_text": null, "time": 1736564463.1825163, "created_utc": 1736421382.0, "url": "https://www.reddit.com/r/threekings/comments/1hxallb/full_moon_in_cancer_implications_and_ritual/", "title": "Full Moon in Cancer: Implications and Ritual", "permalink": "/r/threekings/comments/1hxallb/full_moon_in_cancer_implications_and_ritual/", "selftext": "||\n||\n|A ritual doesn't have to be complicated to be meaningful. Here is a powerful practice you can do to take advantage of the energy of this Full Moon. A ritual doesn't have to be complicated to be meaningful. Here is a powerful practice you can do to take advantage of the energy of this Full Moon.|", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "30": {"id": "1hx4shr", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Odd-Plantain-318", "link_flair_text": "Captured Apparition ", "time": 1736564463.7419431, "created_utc": 1736397066.0, "url": "https://i.redd.it/t9ao7wxybwbe1.jpeg", "title": "Looks like a person sitting and someone standing in kitchen not sure if it’s just my eyes playing tricks on me or what ", "permalink": "/r/Ghosts/comments/1hx4shr/looks_like_a_person_sitting_and_someone_standing/", "selftext": "", "media": null, "score": 169, "upvote_ratio": 0.87, "comment_count": 46, "over_18": false}, "31": {"id": "1hy8br1", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Puzzleheaded-Ear9242", "link_flair_text": "Glitch Pic", "time": 1736564463.8932219, "created_utc": 1736526584.0, "url": "https://i.redd.it/itqynwa317ce1.jpeg", "title": "Weird morphed landscape enroute to Anchorage, AK (not edited)", "permalink": "/r/GlitchInTheMatrix/comments/1hy8br1/weird_morphed_landscape_enroute_to_anchorage_ak/", "selftext": "", "media": null, "score": 56, "upvote_ratio": 0.9, "comment_count": 5, "over_18": false}, "32": {"id": "1hvqrsb", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Censuredman", "link_flair_text": "Discussion", "time": 1736564465.2113886, "created_utc": 1736254410.0, "url": "https://www.reddit.com/gallery/1hvqrsb", "title": "Ancient Egypt: Elongated heads", "permalink": "/r/ufo/comments/1hvqrsb/ancient_egypt_elongated_heads/", "selftext": "The pharaoh of Egypt, Akhenaten and his wife Nefertiti, are represented as well as their children with elongated heads. In this attached image you can see Akhenaten and Nefertiti with three of their daughters on Nefertiti's lap and one on Nefertiti's shoulders. and all of them have clearly elongated heads. Girls especially draw my attention because it seems to be a hereditary genetic and physical characteristic and what everyone in that family particularly shares and it does not seem like a trait that was common in that civilization, not even artificially or culturally.\nWhat do you think of this? Could they have extraterrestrial origin? Hybrids between humans and aliens? ", "media": null, "score": 843, "upvote_ratio": 0.89, "comment_count": 287, "over_18": false}, "33": {"id": "1huswhi", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "IntroductionGreen796", "link_flair_text": "Sighting", "time": 1736564466.436727, "created_utc": 1736145284.0, "url": "https://www.reddit.com/r/UFOs/comments/1huswhi/unseen_us_military_uap_footage/", "title": "UNSEEN U.S. MILITARY UAP FOOTAGE", "permalink": "/r/UFOs/comments/1huswhi/unseen_us_military_uap_footage/", "selftext": "https://reddit.com/link/1huswhi/video/g9tir6wkmbbe1/player\nOk, Reddit. This is the first time anybody other than myself and a few other Marines that I know of have seen this footage. Before I elaborate about this clip, how I found it, my connection to it, etc., I would like to share some personal background and history with this subject. I am in my late twenties and I'm a Marine, that's about all I want to offer up about myself due to fear of character or career assassination. Here's the story: When I was about 9 or 10 years old, my grandfather, then in his late 70s and in poor health, was sitting alone at home watching the history channel with me. A show about the Betty and Barney Hill abduction came on and a few minutes into it he lowered the volume and stared at the floor then told me a story that really shook me. He told me that decades before, he and his friend we will call \"J\" were driving home one night from a day in Houston. As they were driving, a blinding light encompassed their vehicle fully and the radio went haywire. They thought a helicopter was spotlighting them but could not hear the propeller. My grandfather stuck his head out the window to look up and described an object directly above them with a sort of flame coming out of the bottom. They were scared shitless and attempted to speed away to no avail. After a few minutes, the object disappeared and they continued home panicking. One of the two (I am not sure which) suggested calling the police or local newspaper but they quickly agreed that they should not say anything, as both were well established in the local community and my grandfather was an ordained minister with 5 children and a wife to lose. He never again told me that story, and I'm not sure I believed him as he loved to tease me by telling odd stories and seeing what I would believe. Years later when my grandfather was on death's doorstep, I had an opportunity to speak with \"J\" and I asked him about the story. He confirmed it and seemed quite upset. I asked if he ever thought about telling somebody and this 80 something year old man yelled \"hell no!\" at me. I never again pressed the matter. They are now both deceased. The reason I felt compelled to ask \"J\" all those years later was because I had an experience of my own. I do not wish to elaborate on that experience because I anonymously spoke about it on a well known podcast and the extra information in that episode could blow my cover. After my experience at age 16, I had an existential crisis and became obsessive and quite honestly, bothered. I stumbled upon the Cash Landrum incident (I think thats what its called) and learned that it not only took place in the same area and timeframe as my grandfather's story, but also somewhat matched the description of the object. Since that revelation, I study UAP for maybe an hour or two a week. I keep up with things but I'm no scholar as I found it could totally consume me if I let it.\nSo.........How did I get the posted footage? Due to my status in the Marine Corps, I am able to work civilian jobs. I was offered a security gig at a well known music festival and was paired up with a Marine who I instantly hit it off with. We will call him \"T\". He and I shared similar interests. Naturally, our hours-long conversation turned to geopolitics which then turned to the subject of UAP disclosure. I relayed to him my grandfather's story, my findings, and then my personal experience. I told him the whole story without skipping a beat. When I finished, he looked me in the eye and said \"you're f@#$ing with me, right?\" I presented the goose bumps on my arms as my answer and assured him that I was serious. His jaw dropped and his eyes got big. He stuttered for a moment and then said \"I need to show you something\". That \"something\" was this footage.\nContents of said footage: \"T\" was conducting a high altitude jump over an eastern U.S. state. When he jumped, he noticed a white orb zipping by below him. He was instantly thrown into a state of panic, believing that he had dropped his reserve or that the plane had lost a part. He realized that he still had his reserve and it made no sense to have lost it because it would have been falling with him, not zipping by in a horizontal plane below him. He was thoroughly spooked and had no idea what had buzzed him. After he made a safe landing, the next man to jump ran to him to ask if he had seen the \"white thing\" flying below him. \"T\" assured him that he had in fact seen it and was well spooked. That man then told him that he had been recording with his go-pro and that they needed to watch the footage.\n\"T\" and his buddy never got an answer. There should not have been ANY aircraft nearby while they were conducting a high altitude jump. Nothing fell from their plane, there were no weather balloons up there, and certainly no birds due to the altitude. I'm told that the plane was travelling at high automobile speeds, like if you and I realized that the interstate was clear and there were no cops nearby type of speed (for sake of reference and further analysis). \"T\" gave me this footage and told me to do what I wanted with it within reason. I have attempted to contact several trusted people in the media, none reply. I would like answers. That's it. I'm never 100 percent sold on anything being aliens but honestly wtf is this? Hopefully this conversation gets more steam behind it. I know what I saw, I believe my grandfather, I believe \"T\". People are seeing things that are utterly unexplainable and our government pisses on us when we ask for answers.\nI am willing to answer questions within reason, I won't do anything to give myself or \"T\" away. I AM open to speaking with credentialed researchers and journalists but we will have to set terms to protect identities before doing so. This account will remain active for the next week or so and then I will probably delete it. If you care about this info then screenshot it and download the footage. God Bless, I hope you guys can figure out what we're seeing in the skies.\nvideo", "media": null, "score": 5319, "upvote_ratio": 0.92, "comment_count": 958, "over_18": false}, "34": {"id": "1hww685", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "aliensinbermuda", "link_flair_text": "Video", "time": 1736564467.802163, "created_utc": 1736373458.0, "url": "https://v.redd.it/x55az5o4dube1", "title": "Did the Jellyfish Video Show an Alien?", "permalink": "/r/aliens/comments/1hww685/did_the_jellyfish_video_show_an_alien/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/x55az5o4dube1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 356, "width": 640, "scrubber_media_url": "https://v.redd.it/x55az5o4dube1/DASH_96.mp4", "dash_url": "https://v.redd.it/x55az5o4dube1/DASHPlaylist.mpd?a=1739156466%2CZDgxOTU1ZDQxMzgwMWM2ZGY0MTY5NzM2NmQ1Y2RiOTIyOTAyZGY3OWE5NTY4YTdiMWNjNmQ3MTdiMjVhMTQ0MQ%3D%3D&v=1&f=sd", "duration": 148, "hls_url": "https://v.redd.it/x55az5o4dube1/HLSPlaylist.m3u8?a=1739156466%2CZDZmYzQ0OTJmNGJlNjM2NGIxM2RmZmQ2MjI0YzBiZmI0MjRlODZiMzQ4OGZkYjQ0YWYwYTgwMDNiNTI4YWM5OQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3204, "upvote_ratio": 0.89, "comment_count": 733, "over_18": false}, "35": {"id": "1hwp14v", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "buster105e", "link_flair_text": "Discussion", "time": 1736564468.1909254, "created_utc": 1736355747.0, "url": "https://www.reddit.com/r/UAP/comments/1hwp14v/frustration/", "title": "Frustration ", "permalink": "/r/UAP/comments/1hwp14v/frustration/", "selftext": "I know im going to be down voted into oblivion for saying this but im really getting tired/frustrated with the amount of people that just will point blank not accept any mundane explanation for anything described as anomalous. They are exactly what they accuse the debunkers of. I love the subject as much as anyone and honestly find some of the debunking attempts laughable, but to be honest i can say the same about some of the other side of the coin. Some of the recent stuff round the drone flap took the biscuit. Now im not saying nothing anomalous was happening there, in fact there probably was but there is no doubt there were many instances of people photographing commercial aircraft and to see comments like “thats UAP mimicking aircraft” are honestly embarrassing. Its no wonder so many people mock the subject. Obviously not everyone is like that but a good number are.     ", "media": null, "score": 113, "upvote_ratio": 0.78, "comment_count": 71, "over_18": false}, "36": {"id": "1hufaje", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "CowboyBebopBang", "link_flair_text": null, "time": 1736564469.345169, "created_utc": 1736106147.0, "url": "https://i.redd.it/42ac4e0xa8be1.jpeg", "title": "Uhhh?", "permalink": "/r/conspiracy/comments/1hufaje/uhhh/", "selftext": "", "media": null, "score": 3366, "upvote_ratio": 0.8, "comment_count": 714, "over_18": false}, "37": {"id": "1hwrnip", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Slight_Outside5684", "link_flair_text": "New Brunswick Roar", "time": 1736564470.3833096, "created_utc": 1736362146.0, "url": "https://v.redd.it/qnki7b6y1tbe1", "title": "Wtf is this… I’d be nopin’ the f**k out of there real quick. ", "permalink": "/r/bigfoot/comments/1hwrnip/wtf_is_this_id_be_nopin_the_fk_out_of_there_real/", "selftext": "", "media": null, "score": 748, "upvote_ratio": 0.94, "comment_count": 222, "over_18": false}, "38": {"id": "1hvcq2o", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Familiar_Ad_4885", "link_flair_text": "Question", "time": 1736564470.99701, "created_utc": 1736204777.0, "url": "https://i.redd.it/pw8ha6w6ggbe1.jpeg", "title": "Any hope of discovering a bigger sea creature than the giant squid? ", "permalink": "/r/Cryptozoology/comments/1hvcq2o/any_hope_of_discovering_a_bigger_sea_creature/", "selftext": "", "media": null, "score": 311, "upvote_ratio": 0.94, "comment_count": 104, "over_18": false}, "39": {"id": "1hwimng", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": null, "time": 1736564471.6620324, "created_utc": 1736337761.0, "url": "https://i.redd.it/jkwf1cdmfrbe1.jpeg", "title": "Divers around the world, particularly in Australia and the Gulf of Mexico, report encounters with extraordinarily large groupers. Some of them are said to be large enough to easily swallow a diver whole- and some stories claim they already have", "permalink": "/r/cryptids/comments/1hwimng/divers_around_the_world_particularly_in_australia/", "selftext": "", "media": null, "score": 280, "upvote_ratio": 0.97, "comment_count": 36, "over_18": false}, "40": {"id": "1ht9qdm", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Queasy_Regret2526", "link_flair_text": null, "time": 1736564471.8992372, "created_utc": 1735977822.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1ht9qdm/i_think_i_saw_a_fairy/", "title": "i think I saw a fairy??", "permalink": "/r/Thetruthishere/comments/1ht9qdm/i_think_i_saw_a_fairy/", "selftext": "I’m not sure exactly how old I was, but I was probably around 6-7. my whole childhood is kind of a blur but I have a very distinct memory of seeing a fairy at this wilderness camp I went to. for awhile I questioned if it was a dream, but Idk. Anyways to the point, we were going for a hike and I was like walking behind the whole group cs I’m lwk lazy and i was tired😭, I saw a bench and I sat down for a sec and let the group get ahead a bit. I started hearing howls so I got off the bench and was gonna catch up with the group, when I got the the edge of the bench, right besides it was this glowing this covered in moths, I was so confused so I just starred at it for a sec and then I noticed the thing being swarmed by moths seemed to be like a mini person that that had wings and limbs but really big scary upturned eyes. I just walked away and never talked ab it, thought ab it everyday tho. Curious to know if anyone has seems anything similar because ive never heard a description like that. It could’ve just been a dream, or a hallucination ( my mental health isn’t the best😰) but idk lmk👍", "media": null, "score": 28, "upvote_ratio": 0.83, "comment_count": 7, "over_18": false}, "41": {"id": "1htpakf", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "None", "link_flair_text": null, "time": 1736564472.3014987, "created_utc": 1736027105.0, "url": "https://www.reddit.com/r/threekings/comments/1htpakf/panicking_over_what_i_read_on_this_sub/", "title": "Panicking over what I read on this sub", "permalink": "/r/threekings/comments/1htpakf/panicking_over_what_i_read_on_this_sub/", "selftext": "So basically this is the matter \nHi, help. I read all the indexed games on the r/ThreeKings subreddit, and now I feel in danger and under threat from literally all sorts of household objects around us, like mirrors, doors, etc. I don't have time to deal with this, considering I have a lot of other issues to manage, and I'm feeling like my life is literally in danger.\nThe subreddit says it's for real experiences and mentions a lot of these game things. I just want someone who tried them to reassure me that they aren't real. Most include summoning a demon/spirit. I struggle with overthinking and over-focusing, so I went to the index part and basically read ¾ of it out of curiosity.\nI knew about these things a few years ago a little but forgot and rediscovered them recently. Ever since then, I'm having mood swings—going from \"no, they aren't real\" since some can be explained as mirror hallucinations or visual effects in the dark, to others I can't explain.\nI don’t know whether they’re just creepy stories. Some are unique, while others are more popular and creep me out—like The Hooded Man, Middle of the Night, Shoebox Telepathy, One Man Hide and Seek, Dry Bones, 10 Dreams, White Kimono, Queen of Spades, Boogieman, Closet Game, Shoulder Tap, Shower Man, Man in the Fields, and the one where you start on the 5th floor and escape a demon hiding and seeking you in the apartment.\nThese are the ones that scare me the most. Either they’re stories or real. I know some people believe in the existence of demons or know about them. Can you confirm whether these are real or not? Other games seem more interesting yet still creepy if they’re real—for example, the Yellow Pen & White Paper game ritual and the Starry Nights or Starry World one (which seems nice but obviously scary if real).\nPlease help. I struggle with anxiety, overthinking, and just want an honest opinion from people who know or have tried the ones I mentioned. Most of these games don't seem like simple hallucinations in the dark or psychological effects. I struggle with low faith, extreme loneliness, and sadness in my daily life. I don’t want or need further stress worrying that demons can be spawned using the most simple of household objects around us—because you can’t avoid mirrors, candles, lights, doors, or whatever most of these games use in daily life.\nPlease help. I don’t feel scared like before anymore since I know the possibility of some being fake, but I’m definitely stressed that I can be harmed from anything, anywhere. Also, is that teleportation one real? It seems cool in the index, but I guess it’s not. Please help.\nAnd I want someone who's normal (not myself nor clickbaity youtuber) to try aome of them and record them to disprove them all for me \nPlease help I've been panicking over it & just want genuine reassurance I have anxiety overthinking and 3 other issues to worry about don't want this to be the 4th haha I just want reassurance I've been panickingnall day I want to know that most things here that I read are fake or soemthing I'm geneuinly start to see things out of stress please help", "media": null, "score": 1, "upvote_ratio": 0.55, "comment_count": 23, "over_18": false}, "42": {"id": "1htjq8w", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Zestyclose-Field-212", "link_flair_text": null, "time": 1736564473.0329473, "created_utc": 1736012529.0, "url": "https://www.reddit.com/r/Ghosts/comments/1htjq8w/my_two_year_old_freaks_me_out_at_night/", "title": "My two year old freaks me out at night 🙃", "permalink": "/r/Ghosts/comments/1htjq8w/my_two_year_old_freaks_me_out_at_night/", "selftext": "So I’ll just use last night as an example, she woke up crying around 1ish am so I went and grabbed her and brought her into my bed. She kept staring at seemingly nothing but she would gently nod and shake her head, at one point she was looking towards the front left of the bed nodding and such. She then looked at me then looks past me at the wall behind me, looks back where she was originally looking and nodded her head again. I’ve seen “stranglers” (doesn’t allow the word) and stuff on her cameras, but I apparently deleted the screen recordings which I don’t remember doing but oh well. I just don’t know what to do, it freaked me out so much last night my heart felt like it was beating a million miles a minute. When she was laying down (still staring) and would wiggle and get upset like something was touching her. I just don’t know what I should do about this or if there is anything I can do. ", "media": null, "score": 126, "upvote_ratio": 0.88, "comment_count": 43, "over_18": false}, "43": {"id": "1hx0v44", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "New_Canoe", "link_flair_text": "Glitch Pic", "time": 1736564473.1815743, "created_utc": 1736385670.0, "url": "https://i.redd.it/h371iv23evbe1.jpeg", "title": "For those who can’t see the roof rack in the previous video.  Look right in this spot as the car is turning.", "permalink": "/r/GlitchInTheMatrix/comments/1hx0v44/for_those_who_cant_see_the_roof_rack_in_the/", "selftext": "", "media": null, "score": 40, "upvote_ratio": 0.66, "comment_count": 67, "over_18": false}, "44": {"id": "1htnl3d", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "None", "link_flair_text": "Discussion", "time": 1736564474.3227365, "created_utc": 1736022579.0, "url": "https://www.reddit.com/r/ufo/comments/1htnl3d/im_surprised_the_ufo_disclosure_community_isnt/", "title": "I'm surprised the UFO disclosure community isn't upset that government has been keeping Free Energy from us", "permalink": "/r/ufo/comments/1htnl3d/im_surprised_the_ufo_disclosure_community_isnt/", "selftext": "The government has access to Zero Point Energy manipulation and Cold Fusion. Every day they keep this from the public is a war crime and a crime against humanity. Please frens, give Ashton Forbes a chance. His case is very compelling. https://www.youtube.com/@JustXAshton/videos", "media": null, "score": 734, "upvote_ratio": 0.86, "comment_count": 461, "over_18": false}, "45": {"id": "1htxlhm", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "EllensActualStuntDbl", "link_flair_text": "Sighting", "time": 1736564475.8815086, "created_utc": 1736051439.0, "url": "https://www.reddit.com/r/UFOs/comments/1htxlhm/26_year_pilot_just_witnessed_something_i_cannot/", "title": "26 year pilot, just witnessed something I cannot explain.", "permalink": "/r/UFOs/comments/1htxlhm/26_year_pilot_just_witnessed_something_i_cannot/", "selftext": "Time: 01/04/2025 2318Z\nLocation: 20 miles NE of Williamsport Airport(KIPT) @ 30,000ft\nI've been flying corporate aviation the better part of 16 years.  Flown all over the world and many of my hours have been at night, I'm accustomed to seeing how things are supposed to look.  Never seen anything unexplained in all my career, the wildest would be a newly launched Starlink chain and some rocket launches..\nLast year I invested in a very high spec pair of NVG goggles, mainly to look at the stars from home and to hike around in the woods with at night.  I like bringing them on flights at night to look at the stars.\nThis particular trip we were heading to Newark NJ (KEWR) from the Western US.  Having been following the \"drone\" situation out there and this being a night flight I was looking forward to bringing my NVGs on this particular flight.  We were cruising at 45,000 ft Eastbound and the sun began to set.   We started our descent around 300 miles from our destination.  It was dark enough around 250 miles out that I could start using my goggles.  At 250 miles away the entire area around NY, NJ & PA looked like the cameras on the red carpet at the Oscars from all the strobe lights on aircraft over the East Coast.  You could see plenty of stars, satellites & even watched the ISS overhead.  Upon descending through around 33,000 ft, and with my naked eye and that of my co-pilot, we saw an incredibly bright bluish  light, approximately our altitude, and roughly 10 miles away at my 11 0'clock.(I was in the left seat flying).  Distances can be deceiving at night and I came up with that distance based on the size of the light, it was rather large.  I should also point out we had nothing on our TCAS(a traffic collision avoidance system using transponders of aircraft), nor anything on Foreflight using ADS-B.\nThe light was getting larger and heading directly at us at approximately our altitude(at this point we were reaching 28,000 ft).  I looked through my goggles to get a different view and zero strobe lights or a beacon flashing were showing.  Just a round single point of light.  The point of light shifted from heading directly towards us to moving past our left wing.  It passed within I would approximate 3 miles, staying incredibly bright past my 10'o'clock, 9 o'clock, & upon reaching my 8 o'clock position the light shut off, and a single flashing red light appeared.\nThroughout this event I switched between looking at it with my naked eye and back to the goggles.  I got a very clear view of it directly off my left side through the goggles.  It was an oblong sort of circle with a single point of very bright light shining straight at us, like a car in headlights.  Its speed was not anything unusual and was about the speed of a normal aircraft passing by.\nI tried running through a series things to disprove what I saw.  Normally climbing through 18,000ft you turn off your landing lights and are left with just your strobes and a beacon lights.  Okay so maybe they forgot to turn them off all the way up to 28,000ft and also forgot to turn their strobe and beacon on, which is highly unlikely but possible.  The really weird thing is that as it passed my and went to my 8 o'clock position the landing lights face forward, these would not have looked like a spotlight shining at me.  My next thought was maybe they had the wing light on(this illuminates the leading edge of the wing to look for ice).  If this were the case it was slightly above my altitude and still would not have looked as bright or direct as this did(even with the naked eye it was incredibly bright.  The the fact the light simply turned off and a blinking red light appeared(which I saw through the goggles and my naked eye), was very strange.  Also, had we been down at a much lower altitude I would have chocked it up to a helicopter with a rotating spotlight mounted on it, but I've never seen a helicopter up at 33,000ft.  Also ATC would have informed us of aircraft at that location and altitude, and our TCAS would have shown an aircraft.\nMy one regret was not calling ATC to ask if an aircraft was at that location, even though it did not look like one.  Also I did not bother with a video because they never show up correctly at night and I didn't want my attention diverted away from simply observing what I was seeing.\nNo clue what that was but it was strange.  I've included a screenshot of us on ADS-B, no aircraft meeting that location, altitude or description.  The one 737 to the almost 6 o'clock position in the screengrab was at 38,000 feet and not in the correct location or direction of travel from what I observed. My aircraft is the blue one lowest in the image.\nAnyway, that was strange.\nhttps://preview.redd.it/9st529cvr3be1.png?width=1844&format=png&auto=webp&s=7842f5b54c91951e578fe10add42a47e073d2ef0", "media": null, "score": 5097, "upvote_ratio": 0.88, "comment_count": 712, "over_18": false}, "46": {"id": "1hy05au", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Internet--Traveller", "link_flair_text": "Video", "time": 1736564477.2608318, "created_utc": 1736498734.0, "url": "https://v.redd.it/1l4cjii6q4ce1", "title": "Full disclosure this year was planned decades ago - this is a video from 1999", "permalink": "/r/aliens/comments/1hy05au/full_disclosure_this_year_was_planned_decades_ago/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/1l4cjii6q4ce1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 622, "scrubber_media_url": "https://v.redd.it/1l4cjii6q4ce1/DASH_96.mp4", "dash_url": "https://v.redd.it/1l4cjii6q4ce1/DASHPlaylist.mpd?a=1739156476%2COGVkNDQzNGFjNGEyZDAwZWY3MjNkZDcxNjk1Mzk0ZjQ2ZGRhYjU0OWUzZTBlNTk2NDNmZTQyOWMwMzNlYjRjYw%3D%3D&v=1&f=sd", "duration": 101, "hls_url": "https://v.redd.it/1l4cjii6q4ce1/HLSPlaylist.m3u8?a=1739156476%2CZTQyNmNmZmUzMzhkZmE1NTJmNmMyOWIwNTgxZWUzZDA1MjM3ZjI2MTZhNDZhMmJkMThmYmVlYWZkYTMwMTFiZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2940, "upvote_ratio": 0.9, "comment_count": 538, "over_18": false}, "47": {"id": "1hx6a11", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "paulreicht", "link_flair_text": "Discussion", "time": 1736564477.6111877, "created_utc": 1736402358.0, "url": "https://www.reddit.com/r/UAP/comments/1hx6a11/eric_davis_of_the_daviswilson_notes_admits/", "title": "Eric Davis of the \"Davis-Wilson Notes\" Admits, \"Admiral Wilson Gave Me Information.\"", "permalink": "/r/UAP/comments/1hx6a11/eric_davis_of_the_daviswilson_notes_admits/", "selftext": "Here is a profile of Admiral Thomas Wilson, who supposedly told physicist Eric Davis about secret UFO retrievals:\nVADM Thomas Wilson, USN July 1999-July 2002. When Vice Adm. Thomas Wilson became DIA director in summer 1999, DIA supported joint task forces that had more than 100 DIA personnel deployed and had an additional 600 taking part in intelligence task forces... Wilson set his sights on making DIA and the Intelligence Community more efficient and effective through four thrusts: attacking the database problem, creating an interoperable technical environment, preparing for the asymmetrical threat, and revitalizing the workforce. He later added a fifth thrust focusing on recruitment, career development, and retention.\nBut after allegedly telling Eric Davis that the U.S. had a super secret UFO program holding at least one vehicle, he stated that if word got out, he would deny everything. Davis, too, refused to confirm that the Davis-Wilson Notes of that meeting are his record of the briefing. That is, until now.\nDr. Davis has now admitted that Adm. Wilson gave him information. He mentioned it during an interview for Jesse Michel's podcast, adding that he has gone on to brief many groups on what he has learned of the Legacy UFO Program. \"I just have to have a lawyer ... look at the situation, look at the circumstances under which Admiral Wilson gave me information, and then find out if that's something I should do at the level of congressional [briefings].\"\nHe went on: \"I briefed the Senate Select Committee of Intelligence staff and the Senate Armed Services Committee staff in classified settings. What happened is, I briefed the first group in 2019, then later, now we're in 2022, and another group comes out to Huntsville instead of me going to DC; they're coming out to see me in Huntsville, and I'm briefing them. So it's a new group of people.\" He also had a phone call \"with Representative Mike Gallagher, a Republican representative of his district in Wyoming. So I had a short phone call with him, maybe about 20-25 minutes. Then I had an interview just last month with the two senior staff on the subcommittee that just recently held the house hearings that Lou Elizondo [attended]. So they asked me a lot of questions. They were short on time, so we had a half-hour conversation.\"\nIt may sound like Davis has been on a tear with all the briefings, but several informed individuals (including scientist Hal Puthoff) have been making the rounds as conversations and conferences fuel the pressure for the government to release its decades-old trove of UAP secrets.\nThe full interview can be heard on youtube.", "media": null, "score": 109, "upvote_ratio": 0.93, "comment_count": 12, "over_18": false}, "48": {"id": "1hv8bps", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "GodOfWar2077", "link_flair_text": null, "time": 1736564478.7863386, "created_utc": 1736193874.0, "url": "https://www.reddit.com/gallery/1hv8bps", "title": "The CIA murdered Anne Heche", "permalink": "/r/conspiracy/comments/1hv8bps/the_cia_murdered_anne_heche/", "selftext": "The CIA in action\nThis girl, ex-partner of Ellen Degeneres, was working on a movie that was going to expose pedophilia in Hollywood\nThey sabotaged her brakes and she entered the house\nShe survived, the \"firemen\" wrapped her in a body bag, contrary to all common sense for burn victims\nthat she managed to get out of the sack\nThey grabbed her tightly and put her in the ambulance\nWhile the right \"fireman\" observes and watches who is watching this happen\nAlso look at is new clean coat \nShe died afterwards", "media": null, "score": 3283, "upvote_ratio": 0.93, "comment_count": 556, "over_18": false}, "49": {"id": "1htp9yn", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Lucifers_Princess5", "link_flair_text": "merchandise", "time": 1736564479.5487604, "created_utc": 1736027059.0, "url": "https://i.redd.it/tpuszfzqr1be1.jpeg", "title": "One of my favorite Christmas gifts. ", "permalink": "/r/bigfoot/comments/1htp9yn/one_of_my_favorite_christmas_gifts/", "selftext": "", "media": null, "score": 696, "upvote_ratio": 0.99, "comment_count": 21, "over_18": false}, "50": {"id": "1hu4iou", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Realistic-mammoth-91", "link_flair_text": "Discussion ", "time": 1736564480.114342, "created_utc": 1736074543.0, "url": "https://www.reddit.com/gallery/1hu4iou", "title": "What is the Bergman Bear supposed to be?", "permalink": "/r/Cryptozoology/comments/1hu4iou/what_is_the_bergman_bear_supposed_to_be/", "selftext": "I tried to find information on it and a explanation but most of the results are on normal bears and Kemono friends, I am thinking it is a very large sized population of brown bears in Russia ", "media": null, "score": 221, "upvote_ratio": 0.98, "comment_count": 41, "over_18": false}, "51": {"id": "1hu3a9q", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Farriah_the_foot", "link_flair_text": null, "time": 1736564480.7531338, "created_utc": 1736070436.0, "url": "https://i.redd.it/d2supffec5be1.jpeg", "title": "Should I be concerned that my mate and I started seeing these running about on his property? Located on the base of the great dividing range, we've both seen them once and I had a few unusual encounters with something large in the dark that made a high pitched whooping-sound. Not a pig or cassowary", "permalink": "/r/cryptids/comments/1hu3a9q/should_i_be_concerned_that_my_mate_and_i_started/", "selftext": "", "media": null, "score": 221, "upvote_ratio": 0.87, "comment_count": 98, "over_18": false}, "52": {"id": "1hxn1te", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "_Dragon_enthusiast", "link_flair_text": "Discussion/Advice", "time": 1736564480.9234664, "created_utc": 1736456220.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1hxn1te/i_saw_fairies_and_an_angel_when_i_was_young/", "title": "I saw fairies and an angel when I was young", "permalink": "/r/Thetruthishere/comments/1hxn1te/i_saw_fairies_and_an_angel_when_i_was_young/", "selftext": "After many years I've decided to share these stories bc why not.\nSo first, when I was around 4/5 years old I was with my mom and godmother in a big park (forest/park) and it was spring, we weren't in a crowded path but it was near the main paths i was around 10 meters in front of them, crouched down and admiring the wild spring flowers. Then there was a gust of wind and i looked up only to see an angel (i assume?) sitting on a branch, slightly transparent. He/it had a long robe and wings and was smiling slightly while looking at the flowers and i think it looked at me before another gust of wind sort of made it fade away. I dont remember the facial features but i did draw the angel that same day when i got home and i remember it lookig cartoonish bc of that.\nNow, when i was a bit older, 5/6 i went with my parents on a trip to a smaller mountain, and we were on the main path through the forest, which leads up to some ruins, and i was walking just admiring the scenery \nwhen suddenly i noticed smth around some lilac/purple colored flowers, and when i got closer I saw a few fairies, their bodies also looked kinda lilac, they had transparent delicate wings and i remember clothes made of lilac flower petals as well as buns, they also carried small tiny wands, but what amazed me were the 2 bumblebees carrying tiny baskets of pollen or smth on their backs,  i greeted them but they acted as though i wasnt even there. \nI was telling my parents and pointing right at them but they said they cant see anything.\nAnother weird thing i saw was a tiny pegasus or unicorn not sure, floating near them which also had baskets on its back (tbh i may have imagined this, not the fairies tho).\nAnyway i told the fairies bye and left with my parents, but when we came back later they were gone ofc and the flowers seemed more \"dull\" as if before there was a special light around the whole scene. For a long time afterwards i was very curious abt fairies and wanted books on them but no matter where and how hard i looked ive never seen anything like that since, ive been wondering whether it was real or not, and im sure not many will believe this but I know what I saw.", "media": null, "score": 27, "upvote_ratio": 0.83, "comment_count": 9, "over_18": false}, "53": {"id": "1hu6job", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "None", "link_flair_text": null, "time": 1736564481.3032289, "created_utc": 1736081921.0, "url": "https://www.reddit.com/r/threekings/comments/1hu6job/so_all_of_these_r_fake_right/", "title": "So all of these r fake right?", "permalink": "/r/threekings/comments/1hu6job/so_all_of_these_r_fake_right/", "selftext": "Im less stressed than before than yesterday So the doll one, Man in fields, cool stary one, kinda creepy queen in mirror one, hooded man one where u cover ur face at crossroads, boogieman one, one where u have to escape a creepy woman on a 5th apartment floor & the hooded one all r fake?Satorukun, Burns, Last meal with deseased, bath game, Last meal with deseased , Mr eyes, The sleepiver, Sever the cord, Cigarrates, , find the thumb game, Happy bfay Hannah & Charlotte's web, The mirror rotual about going thru the mirror and double one, Bottomelsspit, Water portal in a bowl, Merchant of dead, Whimsical wish, The creature in your mind, Eye in the shadows, Finnish ritual, Space these out separated by commas: Don't look beijd u Collection of 4 little games Whimsical wish grantee Talk to all Darkman Desire of knowledge ritual Trading ritual Devil hide and seek NANTANG MAYAT That one hand Old lady Contacting nature Do your pet a favour & Doorways they are all fake right?", "media": null, "score": 0, "upvote_ratio": 0.22, "comment_count": 2, "over_18": false}, "54": {"id": "1hvecpk", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "kstrick021", "link_flair_text": "Caught on Camera 🎥 ", "time": 1736564481.925053, "created_utc": 1736209137.0, "url": "https://i.redd.it/o0aa50x5tgbe1.jpeg", "title": "What do you guys think? Do you see what I see? ", "permalink": "/r/Ghosts/comments/1hvecpk/what_do_you_guys_think_do_you_see_what_i_see/", "selftext": "My best friend sent me this in 2023. This was caught on the trail cam. Her husband was going out disposing of the deer carcass. ", "media": null, "score": 114, "upvote_ratio": 0.81, "comment_count": 79, "over_18": false}, "55": {"id": "1hudymo", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "StephenMcGannon", "link_flair_text": null, "time": 1736564483.2050586, "created_utc": 1736102771.0, "url": "https://i.redd.it/evzda94v08be1.jpeg", "title": "UFO types", "permalink": "/r/ufo/comments/1hudymo/ufo_types/", "selftext": "", "media": null, "score": 695, "upvote_ratio": 0.96, "comment_count": 93, "over_18": false}, "56": {"id": "1htjhz2", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "MoarGhosts", "link_flair_text": "Discussion", "time": 1736564484.3625097, "created_utc": 1736011917.0, "url": "https://www.reddit.com/r/UFOs/comments/1htjhz2/as_an_engineer_the_chinese_drones_theory_is_not/", "title": "As an engineer, the \"Chinese drones\" theory is NOT plausible. Here's why.", "permalink": "/r/UFOs/comments/1htjhz2/as_an_engineer_the_chinese_drones_theory_is_not/", "selftext": "The only people buying this theory are those with no physics background. The explanation itself is implausible, by my estimate.\nThe orange \"orb\" UFO's have exhibited NO heat signature (as confirmed through imaging and testimony from military/police) - no exhaust, no friction with the environment - and that *alone* is evidence of technology that isn't just \"a hundred years ahead,\" but actually changes how we view thermodynamics and the laws of physics. A craft capable of flying with zero heat signature would mean such a society could do pure sci-fi things, like produce infinite energy or perfect conversion with no lost energy (heat/friction). It would upend physics and science as we know it. Hiding the technology to literally save our planet from extinction would be criminal, at a scale never seen before.\nAnd we're supposed to believe China has this tech, and is secretly launching it all over the goddamn world just to show off? If even one of those drones had a 0.0001% of malfunctioning or being shot down, we would recover it and China would lose this historically significant advantage. Not a risk ANY government would take, including China. And where are the subs that launch these bus-sized drones and orbs? Any sub like that off our shores would have been tracked LONG ago.\nWhy would you take the most advanced technology the world has EVER seen, and fly it over homes in New Jersey? and Denmark, Germany, the UK, Australia? It makes zero fucking sense. \"They're just showing off,\" some people say. By doing something irresponsibly stupid and then not taking credit publicly? No logic is used in that argument lol\nThe only people buying this shit are people with no physics knowledge and bots who are spreading misinfo, plain and simple.\nDon't believe this Chinese drone stuff, it's not even remotely plausible. And the morons who downvote the actual science and who claim this explains everything, it's the same accounts who \"debunk\" everything and all are usually just a few weeks or months old. Don't believe it.\nSincerely, an engineer and computer science researcher.\nedit - as someone pointed out, the orbs and \"drones\" are not necessarily the same thing, but the anomalous \"no heat signature\" property is tied to the orbs mainly, from what I've seen. Even if the \"drones\" really are Chinese, wtf are the orbs then?? it doesn't add up to me at all\nand if we do find out this was China all along, well we'd have a bigger problem than global conflict even. We'd have to rewrite our entire understanding of thermodynamics and reconsider what we've always thought were laws of the Universe. I'm game to do that if we can - but it seems unlikely that this has been well-hidden for so long\nlast edit - China definitely *could* have reverse engineered some NHI shit just as well as we could, I would buy that idea. It's unlikely, but possible. But the point here is that we're supposed to go, \"oh man, China is just so advanced, that's too bad! They worked so hard they got 100,000 years ahead of us in tech!\" - and then ignore the NHI implications. That's not plausible.", "media": null, "score": 5003, "upvote_ratio": 0.77, "comment_count": 1820, "over_18": false}, "57": {"id": "1hv0sir", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "DragonfruitOdd1989", "link_flair_text": "Evidence :upvote:", "time": 1736564486.1573644, "created_utc": 1736175242.0, "url": "https://v.redd.it/82ng1ixa0ebe1", "title": "A first look at the flesh of the humanlike tridactyls.", "permalink": "/r/aliens/comments/1hv0sir/a_first_look_at_the_flesh_of_the_humanlike/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/82ng1ixa0ebe1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 640, "scrubber_media_url": "https://v.redd.it/82ng1ixa0ebe1/DASH_96.mp4", "dash_url": "https://v.redd.it/82ng1ixa0ebe1/DASHPlaylist.mpd?a=1739156484%2CZjNlOTc3MjRkZTE2YTY0NmExYTFkYTM3NzQ1NmExNjdlNDhmZmFjMjhjYWQxY2MwNWQwNTg2ODEzM2RlNWYxMg%3D%3D&v=1&f=sd", "duration": 41, "hls_url": "https://v.redd.it/82ng1ixa0ebe1/HLSPlaylist.m3u8?a=1739156484%2CNWEwZjg1OWQ4MDk1YzA5NTc2ZWYwYWFhNTk3OTY0ZDc5MWVmOTU0MjYyYTAxOGEzODM3YzU3NmEzY2RmYmIyYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2669, "upvote_ratio": 0.78, "comment_count": 1150, "over_18": false}, "58": {"id": "1hv96o0", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Practical-Pick1466", "link_flair_text": null, "time": 1736564486.7030942, "created_utc": 1736195924.0, "url": "https://www.reddit.com/r/UAP/comments/1hv96o0/check_in_and_tell_us_what_state_or_towns_that_you/", "title": "Check in and tell us what state or towns that you have personally viewed a UAP in.", "permalink": "/r/UAP/comments/1hv96o0/check_in_and_tell_us_what_state_or_towns_that_you/", "selftext": "I'm  interested in all the different states and towns that people have viewed definite uap/UFO's in. I'll go first...Winter Park, Florida , winter 2000", "media": null, "score": 95, "upvote_ratio": 0.96, "comment_count": 182, "over_18": false}, "59": {"id": "1htk9la", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Outrageous_Sector544", "link_flair_text": null, "time": 1736564488.1822164, "created_utc": 1736013933.0, "url": "https://i.redd.it/1dv0k22qo0be1.jpeg", "title": "This is crazy", "permalink": "/r/conspiracy/comments/1htk9la/this_is_crazy/", "selftext": "", "media": null, "score": 2600, "upvote_ratio": 0.89, "comment_count": 711, "over_18": false}, "60": {"id": "1htg02a", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "craigcraig420", "link_flair_text": "humor", "time": 1736564488.834397, "created_utc": 1736002459.0, "url": "https://v.redd.it/auk0na0djuae1", "title": "Hilarious!", "permalink": "/r/bigfoot/comments/1htg02a/hilarious/", "selftext": "", "media": null, "score": 558, "upvote_ratio": 0.96, "comment_count": 18, "over_18": false}, "61": {"id": "1ht59nn", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Astral_Zeta", "link_flair_text": "Discussion ", "time": 1736564489.4561327, "created_utc": 1735961319.0, "url": "https://www.reddit.com/gallery/1ht59nn", "title": "Thoughts on Beebe’s untouchable fish?", "permalink": "/r/Cryptozoology/comments/1ht59nn/thoughts_on_beebes_untouchable_fish/", "selftext": "Perhaps the most realistic cryptids in the world, the untouchable fish incident was when William Beebe, a Marine Biologist, Entomologist, and Naturalist along with another colleague viewed yet to be identified fish specimens, such as the Giant Dragonfish, Pallid Sailfin, Three Starred Anglerfish, Five Five Lined Constellation Fish, and Abyssal Rainbow Gar. What makes these cryptids so realistic is that we haven’t explored deeper parts of the ocean, and unlike say, the Megalodon, they still might be out there!", "media": null, "score": 202, "upvote_ratio": 0.99, "comment_count": 26, "over_18": false}, "62": {"id": "1hu7rmo", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Realistic-mammoth-91", "link_flair_text": null, "time": 1736564490.3868964, "created_utc": 1736086022.0, "url": "https://v.redd.it/roun165zm6be1", "title": "It’s a yeti", "permalink": "/r/cryptids/comments/1hu7rmo/its_a_yeti/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/roun165zm6be1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/roun165zm6be1/DASH_96.mp4", "dash_url": "https://v.redd.it/roun165zm6be1/DASHPlaylist.mpd?a=1739156489%2CNzY2YTE0OGYxOGM2MTg1ZGZmYTc1M2E0OTFlZmJhNTRkY2NiY2FmNzdkZTcxOTRlODUwODEzOTAxY2NlNTI3MA%3D%3D&v=1&f=sd", "duration": 60, "hls_url": "https://v.redd.it/roun165zm6be1/HLSPlaylist.m3u8?a=1739156489%2CZGJmYzM5ZWY0ODg4YTA1NDQ0ZDAxMmUxNWIyYzIwMjZhYmY3YTBmNWY5ODczZjg1ZWJmODU5OGQxZGQ4M2UzYQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 179, "upvote_ratio": 0.9, "comment_count": 14, "over_18": false}, "63": {"id": "1hubcqv", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "ChampionFlimsy6439", "link_flair_text": null, "time": 1736564490.5723445, "created_utc": 1736096089.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1hubcqv/recent_fairy_sighting/", "title": "Recent Fairy Sighting", "permalink": "/r/Thetruthishere/comments/1hubcqv/recent_fairy_sighting/", "selftext": "Hi everyone! I have posted here before describing the time I saw a fairy when I was a kid. Maybe 3 months ago I saw another, and it's hard for me to believe it. I am not an adult and I find it difficult to still believe in these creatures. But what happened is I was walking alone in my neighborhood towards my house at around 9 or 10 o clock. As I was walking I was thinking about fairies and kind of calling out to them to show themselves to me. Suddenly, near the ground by this big bush, I saw this translucent almost glowing white figure. I have a poor eyesight, but even with my glasses on it was hard to make out. It had wings and the reason why it perplexed me so much is that it was flying, but the wings seemed to be moving in slow motion. It was like it was underwater kind of. I just stared in awe till it flew a bit behind the bush and disappeared. I still can't wrap my head around this, but that's what I saw. Let me know your thoughts and opinions thank you 💗", "media": null, "score": 24, "upvote_ratio": 0.81, "comment_count": 6, "over_18": false}, "64": {"id": "1hunlnn", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Willing_Ad_375", "link_flair_text": null, "time": 1736564491.659691, "created_utc": 1736127952.0, "url": "https://i.redd.it/jfs1bh1r3abe1.jpeg", "title": "Weird things happening 2 of the last 3 nights", "permalink": "/r/Ghosts/comments/1hunlnn/weird_things_happening_2_of_the_last_3_nights/", "selftext": "Had a really odd thing happen these last few days. \nI normally live with my wife & our 4 year old daughter but they’re both currently in Poland. On the nights this happened, I was alone. \nTwo nights ago I was up late watching TV around 11.30pm and I felt a cool breeze blowing around me. I had a jumper on and the room was heated to a comfortable 18.5 degrees. I can best describe it as a breeze swirling around me. No windows were open and I had no fans on. I thoroughly believed it was a spirit / ghost. I talked to it gently but I ended feeling uncomfortable. The breeze stopped swirling around me and the coldness just seemed to settle on my right hand side. The sofa cushion to the right of me was freezing cold to the touch, I compared it with the one on the left which was a normal temperature to the touch. I thought that was super odd.\nAfter freaking myself out I decided to go to bed. The coldness didn’t follow me, not initially. I undressed and got into bed and I was laid on my back. Maybe 5 minutes later my entire left side felt like a breeze was blowing on me and there was air blowing around me. I asked whatever this was to leave quite firmly and it stopped on command. The room felt lighter and the feeling of fear just lifted as quickly as it had appeared. \nNothing happened yesterday at all, day or night. \nThen tonight I was up late again watching TV and about 11.30pm I felt that cold breeze swirling around me but it felt less intense, I didn’t feel fear and it was briefly accompanied by a citrusy smell, perhaps oranges but the smell went after 5-10 seconds. The closes thing I could relate it to was the smell of a baked fruit cake?? This time I didn’t talk to it , it didn’t feel threatening and as soon as I felt this again I just decided to leave the room. it didn’t follow me to the bedroom. I am lying in bed writing this and I feel perfectly fine. \nWe have lived in this apartment for a year and this is the first odd thing that has ever happened here. for context the apartment is in a former industrial building built 1787 but it’s not draughty and we have recently had the wooden windows changed to triple glazing. It’s tight as a gnat’s chuff and they don’t leak air. I also do not believe the apartment is haunted. \nSomething very very similar happened to me in 2009 when I was at university on the day a family member died (great uncle) but nothing paranormal ever seems to happen to me in my day to day life. \nI’m sure there’s going to be lots of non paranormal explanations like draughts, fans, old building etc etc but for those of you that believe in ghosts, what do you think it is and have any of you had similar experiences? \nLast minute edit : I was just about to press post and my work phone which was charging has just slid off the table on the other side of the room. I’m feeling a bit freaked and uneasy. \nFor context I’ve added a photo of our lounge, I was sat on the middle cushion. ", "media": null, "score": 101, "upvote_ratio": 0.81, "comment_count": 69, "over_18": false}}}