{"_default": {"1": {"id": "1e5ohe0", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Ad1714", "link_flair_text": null, "time": 1721443378.1077433, "created_utc": 1721238392.0, "url": "https://www.supercluster.com/editorial/will-religion-survive-alien-contact", "title": "Will Religion Survive Alien Contact?", "permalink": "/r/ufo/comments/1e5ohe0/will_religion_survive_alien_contact/", "selftext": "", "media": null, "score": 129, "upvote_ratio": 0.82, "comment_count": 280, "over_18": false}, "2": {"id": "1e5n7e2", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "showmeufos", "link_flair_text": "Clipping", "time": 1721443379.5786657, "created_utc": 1721235334.0, "url": "https://www.reddit.com/r/UFOs/comments/1e5n7e2/the_white_house_acknowledged_classifying_whole/", "title": "The White House acknowledged classifying \"whole entire areas of physics\" in the nuclear era. White House allegedly said they classified \"theoretical physics... science physics. We totally classified them and made them state secrets. And that research vanished.\"", "permalink": "/r/UFOs/comments/1e5n7e2/the_white_house_acknowledged_classifying_whole/", "selftext": "Marc Andreesen, one of the most prominent venture capitalists in the world, made some notable statements yesterday in a podcast about a meeting with the White House relating to artificial intelligence and in particular AI regulation.\nLink to video at relevant timestamp\nAn excerpt of those statements from Marc describing the context of the meeting with the White House is below:\n\n\"Well... Ben basically said, look, it doesn't make sense because to regulate AI at the technology level, you're regulating math. And of course, we're not going to do that. Like that doesn't make any sense. And you'll recall that what they said was, 'no, actually, we can classify math. We can classify math.'\"\n\nMarc then goes on to reference a statement made from the White House, which Marc says \"is verbatim\":\n\n\"And literally, this was, this is, this is verbatim. This is, this is, we did, we... we classified whole entire areas of physics in the nuclear era and made, made them state secrets. Like of the... the theoretical science of physics. We totally classified them and made them state secrets. And that research vanished. And we are absolutely capable of doing that again for AI. We will classify any area of math that we think is leading in a bad direction. And it will, it will end.\"\n\nSo, according to Marc, the White House acknowledges they:\n\nClassified \"entire areas of physics\" in the nuclear era.\n\"Made them state secrets.\"\nThat \"research vanished.\"\nWhite House says \"we are absolutely capable of doing that again.\"\nThe White House allegedly even goes on to note \"We will classify any area of math that we think is leading in a bad direction. And it will... end.\"\n\nPretty notable statements. Admittedly, these statements were made about physics from the \"nuclear era.\" I want to note that the context of this interview had nothing to do with UAP or NHI, and Marc is not making any statements about theoretical physics being classified relating to UAP or NHI. All of this was in the context of nuclear or AI. However, as many members of /r/UFOs know, UAP allegedly have a history of being in and around nuclear events or issues, with some people going so far as to speculate that some of our nuclear technology was learned from UAP and/or crash retrievals.\nFrom the context of the conversation between Ben and Marc, it appears both of them may have been in that meeting, so even though it's Marc recounting the quotation, Ben not denying it may count as a \"second source\" tacitly acknowledging the quotation's validity. The flow of the conversation seems to suggest this too. So, it's probably real statements made by someone in a meeting with \"the White House.\"\nThe statement \"we are absolutely capable of doing that again\" relating to AI also means that if they wanted to for something else, for example... for physics or technology learned from UAP, they probably would also be able to do so. So if there was physics learned from UAP, the White House feels they could easily classify it. Such a posture from the White House is also notable in my opinion. \nThe last part, \"and it will end\" is also interesting, because it shows huge confidence that they believe their plan to classify \"any area of math that we think is leading in a bad direction\" will be effective. Why would they have such confidence? Perhaps because they have successfully done it before, perhaps even multiple times, so they know their plan works and can be done. What math/physics has currently been classified and has abruptly reached its \"end\" in public academia due to classification?\nThe topic of \"classifying physics\" has come up previously in the effort to figure out what's going on with UAP. None other than David Grusch has made the claim (timestamp \\~18:30) that the government is \"basically classifying basic physics, basic astrobiology, that kind of stuff.\" Grusch thinks the weapons technology should remain classified, but the rest of the basic science of NHI should be declassified.\nGrusch even referenced suppressing basic science (interview linked at relevant timestamp) in his initial interview with Ross Coulthart on News Nation.\n\nRoss Coulthart (00:40:32): What kind of change does David Grush want? As he said here tonight, he wants the NHI technology to be shared so the rest of the world can benefit from it.  \nDavid Grusch (00:40:43): And I use nuclear weapons or nuclear physics as an example. It's an acknowledged program. We have nuclear weapons. You don't get to know the designs, but nuclear physics holistically is unclassified. Academia studies it. And why would you suppress basic astrophysics, astrobiology other hard and soft sciences broadly? It's totally nuts.\n\nMembers of Congress may want to question potential future witnesses about what, if any, basic science and theoretical physics the government has classified and \"vanished.\" Apparently the White House is admitting to doing such things a private setting already. I wonder if anyone can get these guys to answer \"Who, specifically, from the White House told you that areas of physics had been classified?\"\nTL;DR: The White House apparently admits they suppressed theoretical physics in the nuclear era, \"vanished\" associated research, and claims they can do it again for other areas of science if they so desired. If that is true, what other areas of science of science have been suppressed? Have any areas that may relate to UAP or NHI, as David Grusch has previously claimed? These are questions worth asking.", "media": null, "score": 2157, "upvote_ratio": 0.88, "comment_count": 359, "over_18": false}, "3": {"id": "1e6hhrn", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "BuletinTerlambat", "link_flair_text": "Discussion :table:", "time": 1721443381.3821445, "created_utc": 1721324847.0, "url": "https://v.redd.it/dckoi3uiebdd1", "title": "This makes me questions other UFO videos now..", "permalink": "/r/aliens/comments/1e6hhrn/this_makes_me_questions_other_ufo_videos_now/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/dckoi3uiebdd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/dckoi3uiebdd1/DASH_96.mp4", "dash_url": "https://v.redd.it/dckoi3uiebdd1/DASHPlaylist.mpd?a=1724035379%2CYjk2NzIxNTlmM2Q0ZmM3NDI0MjkzMTM1YWQ2ZTUyMTVkMjBhYTU3YzBmZjNjNzlmYTFhYTU5NDU0OWJlNDU0ZQ%3D%3D&v=1&f=sd", "duration": 11, "hls_url": "https://v.redd.it/dckoi3uiebdd1/HLSPlaylist.m3u8?a=1724035379%2CMzdiOGQxODM4ZjZiNDBiYmUxODQ2Zjg5MThiZGMyYzRkN2Y3Mjk1N2U2ZGYxMGFjOWFhMTIzODJmN2QyMjJjYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 25718, "upvote_ratio": 0.93, "comment_count": 842, "over_18": false}, "4": {"id": "1e5p3zv", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "StillChillTrill", "link_flair_text": "Discussion", "time": 1721443381.7406015, "created_utc": 1721239909.0, "url": "/r/UFOs/comments/1e5o9x4/lockheed_martin_has_successfully_executed_a/", "title": "Lockheed Martin has successfully executed a multi-decade portfolio consolidation of tech derived from NHI/UFO R&D. Since the mid 90's, Lockheed, SAIC, and Leidos have executed an aggressive monopolistic M&A strategy related to cybersecurity, medical, artificial intelligence, and govt IT.", "permalink": "/r/UAP/comments/1e5p3zv/lockheed_martin_has_successfully_executed_a/", "selftext": "", "media": null, "score": 87, "upvote_ratio": 0.91, "comment_count": 20, "over_18": false}, "5": {"id": "1e32wvu", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Zealousideal_Buy7659", "link_flair_text": null, "time": 1721443382.827426, "created_utc": 1720965405.0, "url": "https://www.reddit.com/gallery/1e32wvu", "title": "Shooter allegedly in Blackrock video, Video scrubbed.", "permalink": "/r/conspiracy/comments/1e32wvu/shooter_allegedly_in_blackrock_video_video/", "selftext": "", "media": null, "score": 7955, "upvote_ratio": 0.93, "comment_count": 1119, "over_18": false}, "6": {"id": "1e2rz9h", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "dorktendo", "link_flair_text": null, "time": 1721443383.1781337, "created_utc": 1720925894.0, "url": "https://v.redd.it/6yyvuz18gecd1", "title": "Inside Job", "permalink": "/r/conspiracyfact/comments/1e2rz9h/inside_job/", "selftext": "Just like JFK ...the secret service stood down ..and the gunman was killed ", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/6yyvuz18gecd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/6yyvuz18gecd1/DASH_96.mp4", "dash_url": "https://v.redd.it/6yyvuz18gecd1/DASHPlaylist.mpd?a=1724035382%2CMjJmMDRhMDUxZTYyNmM0Y2M3YzQ0YjNhMDk2ODJiNjJhM2E3NjY4YzhkMDNjYzVlMTdmMjlmOGZkMDdhNDkzOA%3D%3D&v=1&f=sd", "duration": 160, "hls_url": "https://v.redd.it/6yyvuz18gecd1/HLSPlaylist.m3u8?a=1724035382%2COTRmMmE4Zjk2MTNmNmU1ZGM5ZTg5MWQ3OGM0MDljNzY5OTBkZDU2ZWYxYjU4Zjg4Y2ZmYzk2NGQwODAwYTQ1Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 12, "upvote_ratio": 0.93, "comment_count": 0, "over_18": false}, "7": {"id": "1e2c7q6", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "NoDirection9400", "link_flair_text": "PGF", "time": 1721443383.8178575, "created_utc": 1720882275.0, "url": "https://v.redd.it/pza88ljiuacd1", "title": "Skeptics - how did they fake the toe flexion in the Patterson-Gimlin creature costume?", "permalink": "/r/bigfoot/comments/1e2c7q6/skeptics_how_did_they_fake_the_toe_flexion_in_the/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/pza88ljiuacd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/pza88ljiuacd1/DASH_96.mp4", "dash_url": "https://v.redd.it/pza88ljiuacd1/DASHPlaylist.mpd?a=1724035383%2CZGYwY2U0ZTFkYzZhMDI3ZWM4ODkwYzg0MmM2MzMzZmQxMjc2NzY2ODUwY2JmYzZjMzg4ZTkzNmY2OTdkOGJlNQ%3D%3D&v=1&f=sd", "duration": 22, "hls_url": "https://v.redd.it/pza88ljiuacd1/HLSPlaylist.m3u8?a=1724035383%2CZmUyNmMxNWQyYjQ3YTg1NDJiOGE1MDkzNjJjMGIxZjE4MjRlYjEyZjBjNWM1YmM2ZDMzZjY4N2ZkNjI2ZTNjOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 893, "upvote_ratio": 0.91, "comment_count": 376, "over_18": false}, "8": {"id": "1e5ul0q", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Meme", "time": 1721443384.3834856, "created_utc": 1721253374.0, "url": "https://i.redd.it/5atd79rxh5dd1.png", "title": "Lake cryptids in America", "permalink": "/r/Cryptozoology/comments/1e5ul0q/lake_cryptids_in_america/", "selftext": "", "media": null, "score": 599, "upvote_ratio": 0.95, "comment_count": 47, "over_18": false}, "9": {"id": "1e6vzxj", "locked": true, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Wonderful_Unknown", "link_flair_text": "Questionable", "time": 1721443384.5885851, "created_utc": 1721366447.0, "url": "https://i.redd.it/1vzwnv58uedd1.png", "title": "Alien?!", "permalink": "/r/Humanoidencounters/comments/1e6vzxj/alien/", "selftext": "Went hiking with my sister in the Canyon Creek ice cave in Kananaskis (2024). We started hearing noises that echoed throughout the cave, but that's what I'd expect since caves are never quiet. It sounded like footsteps were coming closer, but I thought it was my sister in front. I was able to capture a picture before it disappeared from the rock. There was no one else on the trail behind us???", "media": null, "score": 117, "upvote_ratio": 0.58, "comment_count": 55, "over_18": false}, "10": {"id": "1e3afpi", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Frosty_Ad8698", "link_flair_text": null, "time": 1721443384.8970332, "created_utc": 1720984529.0, "url": "https://i.redd.it/1rzac71lajcd1.jpeg", "title": "What creature has antlers if not wendigo?", "permalink": "/r/cryptids/comments/1e3afpi/what_creature_has_antlers_if_not_wendigo/", "selftext": "I know there is a misconception that wendigo have antlers, which I only learned of recently. But I coulda sworn there was another cryptid who does. I know there’s NotDeer but I thought there was something else. I have a tattoo which I originally was saying was a wendigo but I don’t wanna be spreading false information. I take an interest in cryptids, especially creatures with antlers. I have a lot of stuff in my room resembling this creature, whatever it is. ", "media": null, "score": 405, "upvote_ratio": 0.94, "comment_count": 191, "over_18": false}, "11": {"id": "1e38g5o", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "MortgageAlarmed9735", "link_flair_text": null, "time": 1721443385.0652785, "created_utc": 1720979480.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1e38g5o/strange_woman_appeared_next_to_us/", "title": "Strange woman appeared next to us", "permalink": "/r/Thetruthishere/comments/1e38g5o/strange_woman_appeared_next_to_us/", "selftext": "Long time reader here, never posted, but decided now to share after watching a bunch of unexplained experience TikTok’s lol. \nI am 24f now, and this event happened in high school, maybe 10th grade so I was around 15 at the time. I still remember what happened vividly. My friends and I went to a party of one of our classmates in a not so good neighborhood, this is kind of relevant because it could explain what we saw. This takes place in a rural-ish part of Pennsylvania. This area is known is very low income, and drug infested. Immediately when we pulled into the neighborhood we all felt that the vibe was “off”. Now this area isn’t necessarily unsafe, just rural, dark, and unsettling. So anyways we attended this party. I feel the need to state that we were drinking but no one was necessarily intoxicated, maybe a little tipsy. We decided after a little while to leave and packed into my friends car. I remember how freaked out we were just driving through the neighborhood to leave but no one could necessarily explain why. \nWe thought we were just freaked out by the dark. We pulled up to a stop sign, and suddenly out of literally nowhere, a woman seemingly materialized out of nowhere on the sidewalk to the right of us walking her dog. Now this is about 2 in the morning. We look over to see if she is going to cross the street in front of us since she was facing us as if she was going to do so, and her face was expressionless. Then suddenly she lifts her right foot about 90 degrees in the air as if to take a large step off the sidewalk towards our car, and opens her mouth and fully unhinged her jaw. Before she could even take the step toward the car, my friend floored the gas. We didn’t even turn around to see if she was still there. We all slept on the basement couch together that night because we were terrified. Either she was on hard drugs or we saw something supernatural. Either option is equally as creepy.", "media": null, "score": 126, "upvote_ratio": 0.96, "comment_count": 39, "over_18": false}, "12": {"id": "1e6lu13", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Marandajo93", "link_flair_text": null, "time": 1721443385.209637, "created_utc": 1721335899.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1e6lu13/my_best_friends_boyfriend_turned_out_to_be_a/", "title": "My best friend‘s boyfriend turned out to be a murderer…", "permalink": "/r/LetsNotMeet/comments/1e6lu13/my_best_friends_boyfriend_turned_out_to_be_a/", "selftext": "When I was about 19 or 20, my very best friend in the world was dating this guy. He was really cute, funny, and sweet. I stayed with her at her apartment a lot and he used to always come over and hang out. He lived with his great grandmother, who was really super strict. Even though he was 18, she gave him a curfew and if he was late, she would lock him out or call the law on him. So he always had to be home by at least like 10 PM. Anyways, one night I was at her house and we were drinking and playing cards and stuff. He came running through the door at like 9 PM saying he had gotten into a fight. We didn’t think anything of it really because he wasn’t exactly a golden boy and, it wasn’t all that surprising. But after about 12 AM rolled around we were all like “damn, your grandma is letting you stay out this late? “He ended up telling us that she was asleep and had locked him out. Again, we didn’t think much of it. Happened all the time.later on the next day, I ended up going home. My friend called me that night, crying her fucking eyes out telling me to look on jail tracker. I got on there and looked and underneath his mug shot it said, “murder’’. I was literally shocked like WTF? Who the fuck did he murder? I was just there! Turns out, when he came and busted through the door, he had just mangled his great grandmother to death with a hammer. He sat there and drank with us, played cards with us, and acted like nothing had ever happened. After everyone had left, he ended up telling my friend what he had done. She acted like she was going to run off with him. She went in her room and acted like she was packing her bags up. Snuck in the bathroom and called the police. It was really scary and traumatizing for all of us, for real. But especially her. Ended up getting sentenced to like 50 years or something like that. He tried to escape about four years after his sentencing, and they added a even more time. So I doubt I will ever be seeing him again. anyways, that’s been years ago. But I randomly stumbled across this sub and it made me think of that.", "media": null, "score": 907, "upvote_ratio": 0.99, "comment_count": 21, "over_18": true}, "13": {"id": "1e3ukkd", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "verystrangeshit", "link_flair_text": null, "time": 1721443385.3086607, "created_utc": 1721049481.0, "url": "https://i.redd.it/owe8nmunnocd1.png", "title": "'Dental Phantom' (for dental students to practice on) from the 1930s", "permalink": "/r/truecreepy/comments/1e3ukkd/dental_phantom_for_dental_students_to_practice_on/", "selftext": "", "media": null, "score": 53, "upvote_ratio": 0.97, "comment_count": 3, "over_18": false}, "14": {"id": "1e2kmuu", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "OutlandishnessRound7", "link_flair_text": null, "time": 1721443385.4233305, "created_utc": 1720904322.0, "url": "https://www.reddit.com/r/threekings/comments/1e2kmuu/i_cant_find_this_campingforesthunter_ritual/", "title": "I can't find this camping/forest/hunter? ritual", "permalink": "/r/threekings/comments/1e2kmuu/i_cant_find_this_campingforesthunter_ritual/", "selftext": "I have bad memory, sorry if I can't provide too much info on what I'm searching for but i'll try to say as much as I can, some years ago I remember reading some history about a person doing this ritual where they went camping and basically they did something to invoke an entity and it was like a \"challenge\" where you were being hunted by this mysterious man/entity, and if you managed to survive it this man around the morning as you were leaving the forest I believe, would hand you a  paper that contained a secret of this world of some sorts, I think it was a ready post but not completely sure, I remember alo reading comments asking what was the secret about and the poster replying \"You don't really want to know\" or something among those lines, but yeah. Does anyone knows which ritual it is?", "media": null, "score": 4, "upvote_ratio": 0.84, "comment_count": 1, "over_18": false}, "15": {"id": "1e2r11q", "locked": true, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Forever_Banned_Pt5", "link_flair_text": null, "time": 1721443385.8216877, "created_utc": 1720922830.0, "url": "https://v.redd.it/hzpan9347ecd1", "title": "My 1st capture of something paranormal happening in my home. ", "permalink": "/r/Ghosts/comments/1e2r11q/my_1st_capture_of_something_paranormal_happening/", "selftext": "Welp I have to throw away my newborn twins now, today I had my first experience with anything in the spectrum of paranormal.\nBack story my this is my in laws home and they’ve been living here since ‘92, they said they’d always seen silhouettes, have had things knocked over, have heard noises. \nMe (29M) and my wife (28F), have been married for 7 years and recently had twins in April, which is why we moved in with her parents to help us with being new parents to twins, in the month we’ve been here, I’ve heard creaks in the night (my suspension was the house just settling) or we would have our bedroom closet open just slightly in the morning or in the middle of the night checking on the kids,(but could never remember if we closed the door or not), \nEveryone in the house were all in the back living room when when our ring camera caught this video.\nSummary of the video:\nKeep your eyes on the Gray car seat.\nYou’ll see in the in the first couple of seconds the car seat move and the toys on the handles move.\nAfter 10 secs or so you’ll hear a noise \nAfter 20 secs you’ll see the car seat and diaper bag fall the the ground \nAfter 30 secs you’ll hear my wife said “I think something fell”", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/hzpan9347ecd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/hzpan9347ecd1/DASH_96.mp4", "dash_url": "https://v.redd.it/hzpan9347ecd1/DASHPlaylist.mpd?a=1724035385%2CNDA3NWZjNzM5ZDgxMWIzMWU5NTRiZTNlZTY1YTI0NDk4YTk0OTVkM2I2YzAwODY0M2VjYzY1NjJkYjAzOWY3Yg%3D%3D&v=1&f=sd", "duration": 42, "hls_url": "https://v.redd.it/hzpan9347ecd1/HLSPlaylist.m3u8?a=1724035385%2CYzkwY2U2Y2NiNzViYjAyYzA5ZWZmMTJiY2ZhZWJhY2QwMWEwYjUwMjc2ZjA4ZjFjYmY0MjM2YjBlMjM5NzhmYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 529, "upvote_ratio": 0.73, "comment_count": 219, "over_18": false}, "16": {"id": "1e5ealm", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Upstairs_Cash8400", "link_flair_text": "Glitch Vid", "time": 1721443386.176995, "created_utc": 1721210069.0, "url": "https://v.redd.it/3hshxqk4x1dd1", "title": "Bird", "permalink": "/r/GlitchInTheMatrix/comments/1e5ealm/bird/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/3hshxqk4x1dd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/3hshxqk4x1dd1/DASH_96.mp4", "dash_url": "https://v.redd.it/3hshxqk4x1dd1/DASHPlaylist.mpd?a=1724035385%2CZTUwNWU0OGI0MDgzZjMxMWU4N2UxYzA0N2I2NTliNDI4YTg3OTYxMDc5YWFjZDJjYmY5OWRmOWQxYmZkOTczNg%3D%3D&v=1&f=sd", "duration": 17, "hls_url": "https://v.redd.it/3hshxqk4x1dd1/HLSPlaylist.m3u8?a=1724035385%2CNjJjODg0N2E5NTg0YTgzODkzNGMwNjdiZWY1ZjNkYzE0NjU2YjAzYTk3Mjk4ZTUwMGEyOTg1NmRkNzJhNDExOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1065, "upvote_ratio": 0.97, "comment_count": 149, "over_18": false}, "17": {"id": "1e42poz", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "PaulFromVienna", "link_flair_text": null, "time": 1721443387.3301167, "created_utc": 1721069329.0, "url": "https://i.redd.it/b4l38ggqaqcd1.jpeg", "title": "My cousin just saw an UFO", "permalink": "/r/ufo/comments/1e42poz/my_cousin_just_saw_an_ufo/", "selftext": "I was on the phone with my cousin. Out of nowhere he ended the call. 3 minutes later he called me again and send me this photo + 1 minute video material. \nWhat do you think? Is it worth posting the video on here or do you have a simple explanation? ", "media": null, "score": 125, "upvote_ratio": 0.68, "comment_count": 154, "over_18": false}, "18": {"id": "1e2jt76", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "NHI", "time": 1721443388.7094538, "created_utc": 1720902092.0, "url": "https://www.congress.gov/amendment/118th-congress/senate-amendment/2610/text", "title": "Rounds/Schumer UAP Disclosure Act 2.0 text is officially out! Non-Human Intelligence mentioned 22 times! Biological evidence of NHI mentioned 6 times. Eminent Domain and Review Board intact! Disclosure is back on the menu!", "permalink": "/r/UFOs/comments/1e2jt76/roundsschumer_uap_disclosure_act_20_text_is/", "selftext": "", "media": null, "score": 1604, "upvote_ratio": 0.96, "comment_count": 121, "over_18": false}, "19": {"id": "1e3ctwo", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "lilmayo", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1721443390.1118078, "created_utc": 1720991172.0, "url": "https://www.reddit.com/gallery/1e3ctwo", "title": "Live, Laugh, Probe 👽", "permalink": "/r/aliens/comments/1e3ctwo/live_laugh_probe/", "selftext": "", "media": null, "score": 3878, "upvote_ratio": 0.88, "comment_count": 439, "over_18": false}, "20": {"id": "1e1z5zm", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "paulreicht", "link_flair_text": "Discussion", "time": 1721443390.4657624, "created_utc": 1720836711.0, "url": "https://www.reddit.com/r/UAP/comments/1e1z5zm/senator_richard_blumenthal_proposes_whistleblower/", "title": "Senator Richard Blumenthal proposes Whistleblower Protection Bill, stating: “Whistleblowers must be protected against retaliation.\" ", "permalink": "/r/UAP/comments/1e1z5zm/senator_richard_blumenthal_proposes_whistleblower/", "selftext": "UAP witnesses include more than people who see UFOs--they include those who allegedly retrieved downed alien craft, or worked on NHI technology.  People making such claims frequently say they can't come forward because they fear government reprisal.  But now, that may no longer be a credible excuse.\nIn proposing his bill on July 10, 2024, Blumenthal wrote: “Whistleblowers must be protected against retaliation when they bravely reveal waste, fraud, and abuse. This measure will strengthen safeguards for anyone reporting government misconduct and empower them to seek relief if they face retaliation. Congressional whistleblowers are essential to our democracy, and they deserve vigorous protection.”\nProtected will be current and former employees of Federal agencies such as NASA and NRO plus employees of contractors like Lockheed and Boeing. Anyone who goes to Congress with evidence of wrongdoing, and is consequently fired by any of these organizations may seek aid including 1) reinstatement; 2) compensatory damages; and 3) \"the sum of 200 percent of the amount of lost wages and 100 percent of the amount of lost benefits, with interest.\"\nBlumenthal is serving his third term as a United States Senator from the State of Connecticut. Who else is supporting the ‘‘Congressional Whistle blower Protection Act of 2024’’? U.S. Senators Tammy Baldwin (D-WI), Catherine Cortez Masto (D-NV), Mazie Hirono (D-HI), Amy Klobuchar (D-MN), Ed Markey (D-MA), Alex Padilla (D-CA), Bernie Sanders (I-VT), Chris Van Hollen (D-MD), Sheldon Whitehouse (D-RI), and Ron Wyden (D-OR).  So are the organizations Whistleblowers of America and the Government Accountability Project.\nThe exact content of the Act may be viewed here. As anyone knows who follows UAP, defense or intelligence news, there are highly sensitive issues arising these days on Capitol Hill. If the blockbuster bill passes into law, it opens a path to far greater disclosure. It remains to be seen who will seize the opportunity, and what kind of claims they are prepared to bring to the U.S. Congress.", "media": null, "score": 77, "upvote_ratio": 0.96, "comment_count": 9, "over_18": false}, "21": {"id": "1e2mw0i", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "saintmcqueen", "link_flair_text": "Rule 10 Reminder", "time": 1721443391.3640323, "created_utc": 1720910329.0, "url": "https://i.redd.it/y5re8mcy5dcd1.jpeg", "title": "This is the photo of the fucking year! ", "permalink": "/r/conspiracy/comments/1e2mw0i/this_is_the_photo_of_the_fucking_year/", "selftext": "", "media": null, "score": 6743, "upvote_ratio": 0.66, "comment_count": 2801, "over_18": false}, "22": {"id": "1e3dtpp", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1721443391.6497426, "created_utc": 1720993667.0, "url": "https://www.youtube.com/watch?v=YsvLrrZ0iEU", "title": "Clear video footage of a UFO, a large pyramid with a smaller one orbiting around it, in China.", "permalink": "/r/conspiracyfact/comments/1e3dtpp/clear_video_footage_of_a_ufo_a_large_pyramid_with/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Clear video footage of a UFO, a large pyramid with a smaller one orbiting around it, in China.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/YsvLrrZ0iEU?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Clear video footage of a UFO, a large pyramid with a smaller one orbiting around it, in China.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/YsvLrrZ0iEU/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 5, "upvote_ratio": 0.86, "comment_count": 0, "over_18": false}, "23": {"id": "1e4kjc5", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Streetspirit861", "link_flair_text": "hoax!", "time": 1721443392.268337, "created_utc": 1721122995.0, "url": "https://i.redd.it/on2mh5hbqucd1.jpeg", "title": "Thoughts on this “baby Bigfoot”?", "permalink": "/r/bigfoot/comments/1e4kjc5/thoughts_on_this_baby_bigfoot/", "selftext": "I’ve just seen this on LadBible of all places. Is this a bald faced bear? A kid in a costume? Thoughts?\nOriginal post:\nhttps://www.instagram.com/p/C9ejmBIgPMB/?igsh=b3djZngzOXR3aGdk", "media": null, "score": 734, "upvote_ratio": 0.87, "comment_count": 394, "over_18": false}, "24": {"id": "1e6hetw", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "alJSKO", "link_flair_text": null, "time": 1721443392.799467, "created_utc": 1721324642.0, "url": "https://i.redd.it/er7psy1xdbdd1.jpeg", "title": "What is the story behind this \"pterodactyl\" photo? ", "permalink": "/r/Cryptozoology/comments/1e6hetw/what_is_the_story_behind_this_pterodactyl_photo/", "selftext": "", "media": null, "score": 413, "upvote_ratio": 0.87, "comment_count": 99, "over_18": false}, "25": {"id": "1e4jlt0", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Small-Salamander-656", "link_flair_text": "Humanoid", "time": 1721443392.9376636, "created_utc": 1721119172.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1e4jlt0/entities_in_churches_chicken/", "title": "Entities in Churches Chicken", "permalink": "/r/Humanoidencounters/comments/1e4jlt0/entities_in_churches_chicken/", "selftext": "I still don’t believe this myself and I hate that I’m even putting this out there but I’m coming to terms that this did actually happen and honestly this encounter changed me forever. \nSometime in the early 2010’s or close to that time my ex girlfriend of 10 years and I saw two beings in a very unlikely and odd place.\nThe time was about 1am and we were driving through Petersburg Virginia (USA). \nAs we are coming to a stop at a red light we turn and look to our right and about 100 feet away is the restaurant. Now mind you this place is closed for the night and all the lights inside are off except for 1 and it’s right above the two beings. They honestly must have had some kind of way to make me and my ex unable to remember what the faces looked like but neither of us had ever seen anything like them. They definitely were not people. They sat across from each other at the window seat with the single light illuminating them from above. This light was part of the restaurant not anything from like a ship or portal or anything. Now not only were they sitting down across from each other but they seemed to be eating!!! The one thing we do remember is the fact that they each had bluish reddish purple and gold robes that almost shimmered. We must have sat at the light for what seemed like forever as it cycled from red to green and back while we were essentially dumbstruck.\nCell phone cameras were not the same as today and honestly we were both in so much shock that all we could manage to do was stare at the beings looking back at each other in disbelief saying what the fuck over and over again. We did pull off and away from the light but it was out of fear honestly. After realizing that we may be seeing something we shouldn’t we drove off very fast. If anyone had any therapists that specialize in people that have experienced odd things with witnesses please let me know because it honestly is still very disturbing when I stop and rethink about that evening.", "media": null, "score": 112, "upvote_ratio": 0.91, "comment_count": 40, "over_18": false}, "26": {"id": "1e4ej06", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "LegallyAFish", "link_flair_text": null, "time": 1721443393.2974544, "created_utc": 1721100248.0, "url": "https://i.redd.it/sjmg2k7luscd1.png", "title": "Making a cryptid \"hunting\" Video game, any suggestions or cryptids you'd want to see?", "permalink": "/r/cryptids/comments/1e4ej06/making_a_cryptid_hunting_video_game_any/", "selftext": "", "media": null, "score": 222, "upvote_ratio": 0.97, "comment_count": 148, "over_18": false}, "27": {"id": "1e2obif", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "samuraiSatan", "link_flair_text": null, "time": 1721443393.4620357, "created_utc": 1720914352.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1e2obif/scream_next_to_cemetery/", "title": "Scream next to cemetery", "permalink": "/r/Thetruthishere/comments/1e2obif/scream_next_to_cemetery/", "selftext": "So me and my good friend (let’s call him David) were messaging each other on messenger that it would be fun to go somewhere this night. \nI don’t remember the exact hours but I think it was after 11pm.\nWe live in Poland in a rather medium size city (200k people). \nHe came to me with his car and we went to a small village next to our city. Target: cemetery where his family is buried. \nOnce there in complete darkness we found a grave of his relative and we stayed there and paid respects. It was complete darkness, only source of light was my phone flashlight.\nAfter paying respect we went back to the car and started talking. He started smoking and I was just standing there checking out neighbourhood. \nTHEN we hear very loud scream. No words, no emotions, just a scream. Didn’t sound like a human and it was very loud and lasted 1 or 2 seconds. The scream came from street 30 meters from us, the dark alley. We froze for a second and David tells me to open the boot and take out metal rod (used to remove bolts while changing a tire. I did it and we stood there for few seconds and decided to GTFO of there. \nBoth of us still don’t know what was it. ", "media": null, "score": 15, "upvote_ratio": 0.9, "comment_count": 9, "over_18": false}, "28": {"id": "1e4s1k1", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "_baby_blue_", "link_flair_text": null, "time": 1721443393.6283522, "created_utc": 1721144941.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1e4s1k1/i_found_out_my_neighbor_used_to_watch_me_shower/", "title": "I found out my neighbor used to watch me shower when I was a kid", "permalink": "/r/LetsNotMeet/comments/1e4s1k1/i_found_out_my_neighbor_used_to_watch_me_shower/", "selftext": "I am 22 years old now. \nWe used to have a neighbor who was around 60-70 years old. He died a few years ago. \nWhen he was still alive, he would cause us so much trouble. Scratched our car, poisoned our apple trees and grass, blew up a firework near me to cause me to temporarily go deaf on one ear when I was 4, all kinds of things. His son was a judge in our city so pretty much everything we took to court was against us. I remember dad often called us from work to tell us not to be alone at home and we would have to stay at grandma's.\nWhen I was little, I think around 6-7, I would frequently have nightmares about seeing a face outside of the bathroom window. The window is above our bathtub. It's high enough that no one can actually see in unless they climbed the roof of our shed which is underneath the bathroom window in our garden. Coincidentally the shed is directly next to a fence that separates our garden from the neighbor's one. \nI still remember the dreams, I remember having them pretty much every other night. I never told my parents when I was little because we never really talked about anything. So I didn't really share anything that was happening to me. \nWell I grew up thinking they were just dreams and that was it. I did mention them to my therapist last year because we were discussing some personal problems and I felt like this was kinda connected. After coming home, mom asked me what I talked about with my therapist so I finally shared I used to have such dreams. \nI never really thought about them being real. But she told me I actually did tell her I saw our neighbor on our shed's roof. I don't remember telling her that, but she said I did mention it several times and even my friends told her they saw him there when they came over to our house and it creeped them out. \nApparently I never mentioned him watching me shower. But after she told me that it really clicked for me and it was as if I suddenly remembered that yeah. I do think it was him. It would make sense. And the fact that it happened still creeps me out. \nThere was another incident that creeped me out. It happened when I was around 9-10. I went to the balcony in the evening, the balcony door was in my room and I often went there to call my cat home in the evening. But this time I saw a person standing in the middle of our garden. It was already dark out and I couldn't really tell who it was.\nI waited for a little bit to see what the person does, but I didn't really see him move. It was as if he was just standing and staring in front of him. I called out \"dad\" because obviously I excepted it to be him, even though I found it odd. But the person looked up at me and even though it was dark I could tell it was someone else (I think it was partly because my eyes just adjusted to the dark and I could make out the silhouette of the person better). I went to tell my dad who was downstairs but when he looked, there was no one there. \nWhen I went back upstairs to my room and went to the balcony again, I noticed my neighbor's back door closing just when I looked there. I don't remember if it was directly the next day or a few days later but our grass turned brown and we found out it was poisoned, most of the grass being out of reach from his property.", "media": null, "score": 625, "upvote_ratio": 0.98, "comment_count": 36, "over_18": true}, "29": {"id": "1e5ihyo", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "verystrangeshit", "link_flair_text": null, "time": 1721443393.74164, "created_utc": 1721223711.0, "url": "https://i.redd.it/nw8hn0ds13dd1.jpeg", "title": "Thousands of people around the world have reported seeing a shadowy figure in a hat standing in their room while they're sleeping. Recreational Benadryl users report being able to consistently summon the entity/hallucination if they take enough of the drug.", "permalink": "/r/truecreepy/comments/1e5ihyo/thousands_of_people_around_the_world_have/", "selftext": "", "media": null, "score": 34, "upvote_ratio": 0.84, "comment_count": 11, "over_18": false}, "30": {"id": "1e6j1ds", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "jeniorfarmer-", "link_flair_text": null, "time": 1721443393.8610914, "created_utc": 1721328954.0, "url": "https://www.reddit.com/r/threekings/comments/1e6j1ds/any_legit_rituals_that_tell_you_the_date_of_your/", "title": "Any legit rituals that tell you the date of your Death?", "permalink": "/r/threekings/comments/1e6j1ds/any_legit_rituals_that_tell_you_the_date_of_your/", "selftext": "I am looking for any rituals that show the player of the ritual the date of their Death, that being the exact Day, Month, and Year. Maybe with how they die being extra information but not required.\nAre there any entities that know this information truly, and that won’t lie if there is a way to know?", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "31": {"id": "1e3xoyb", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Mostopha", "link_flair_text": "Paranormal Investigation [Field Discussion]", "time": 1721443394.2504318, "created_utc": 1721057468.0, "url": "https://www.reddit.com/r/Ghosts/comments/1e3xoyb/people_who_have_researched_hauntings_whats_the/", "title": "People who have researched hauntings, what's the creepiest bit of information you found?", "permalink": "/r/Ghosts/comments/1e3xoyb/people_who_have_researched_hauntings_whats_the/", "selftext": "After a sighting, did you find out someone died there who looked eerily similar? ", "media": null, "score": 469, "upvote_ratio": 0.97, "comment_count": 230, "over_18": false}, "32": {"id": "1e40q1f", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "untilsleep", "link_flair_text": "Glitch Vid", "time": 1721443394.5607936, "created_utc": 1721064611.0, "url": "https://v.redd.it/8ve9656smocd1", "title": "When they say 50% chance of rain", "permalink": "/r/GlitchInTheMatrix/comments/1e40q1f/when_they_say_50_chance_of_rain/", "selftext": "", "media": null, "score": 788, "upvote_ratio": 0.99, "comment_count": 18, "over_18": false}, "33": {"id": "1e4zc1i", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "tacosteve100", "link_flair_text": null, "time": 1721443395.5566308, "created_utc": 1721162600.0, "url": "https://www.reddit.com/r/ufo/comments/1e4zc1i/who_is_the_most_credible_person_in_the_ufo/", "title": "Who is the most credible person in the UFO community? ", "permalink": "/r/ufo/comments/1e4zc1i/who_is_the_most_credible_person_in_the_ufo/", "selftext": "Additionally, who is the least credible? (Who is a known person) ", "media": null, "score": 119, "upvote_ratio": 0.88, "comment_count": 461, "over_18": false}, "34": {"id": "1e3t2fk", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Miffsterius", "link_flair_text": "Likely Identified", "time": 1721443396.9878724, "created_utc": 1721044990.0, "url": "https://v.redd.it/trup137daocd1", "title": "My wife just filmed this", "permalink": "/r/UFOs/comments/1e3t2fk/my_wife_just_filmed_this/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/trup137daocd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 848, "width": 480, "scrubber_media_url": "https://v.redd.it/trup137daocd1/DASH_96.mp4", "dash_url": "https://v.redd.it/trup137daocd1/DASHPlaylist.mpd?a=1724035396%2COGNlZDNiN2Y1YmRmYTk5YTA5N2E4YzQ1NWM4OGZjOWRjZGE0Yjc1ZTBiNjNhODhkODg4YzhhM2ExMDY5ZTNlOQ%3D%3D&v=1&f=sd", "duration": 39, "hls_url": "https://v.redd.it/trup137daocd1/HLSPlaylist.m3u8?a=1724035396%2CYTExNTk3MWQwMDY1OGUwMWY5YTI2NjkyMDA0NDQ0YWFhNmY3YzlhODlmNDZlOTY0ZDI0MGM4ZGFhNDkzOTA3NQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1243, "upvote_ratio": 0.8, "comment_count": 301, "over_18": false}, "35": {"id": "1e4zxug", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "JosephBrown2000", "link_flair_text": "Discussion :table:", "time": 1721443398.5463061, "created_utc": 1721164081.0, "url": "https://v.redd.it/kbgpmf7kw93b1", "title": "Former NASA Employee: \"We have a lot of high-resolution photos of UFOs or Alien Spaceships and I can testify before Congress.\" - Disclosure Project 2001", "permalink": "/r/aliens/comments/1e4zxug/former_nasa_employee_we_have_a_lot_of/", "selftext": "", "media": null, "score": 1843, "upvote_ratio": 0.91, "comment_count": 239, "over_18": false}, "36": {"id": "1e412dy", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "Video", "time": 1721443398.9056685, "created_utc": 1721065405.0, "url": "https://v.redd.it/78say5klupcd1", "title": "Why UFO Secrecy Matters to You", "permalink": "/r/UAP/comments/1e412dy/why_ufo_secrecy_matters_to_you/", "selftext": "", "media": null, "score": 72, "upvote_ratio": 0.91, "comment_count": 5, "over_18": false}, "37": {"id": "1e2z2y1", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "bill_loney538", "link_flair_text": null, "time": 1721443400.055917, "created_utc": 1720952881.0, "url": "https://i.redd.it/f71hwd6hogcd1.png", "title": "It was all a setup, let's hear your take ", "permalink": "/r/conspiracy/comments/1e2z2y1/it_was_all_a_setup_lets_hear_your_take/", "selftext": "", "media": null, "score": 4538, "upvote_ratio": 0.88, "comment_count": 2155, "over_18": false}, "38": {"id": "1e4szxy", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1721443400.3453453, "created_utc": 1721147230.0, "url": "/r/CapitolConsequences22/comments/1e4sygw/i_know_quite_a_few_people_in_dc_area_they_all_act/", "title": "I know quite a few people in DC area. They all act and sound as incoherent as Biden now. Is Washington under \"sonic attack\" like happened in Havana? Symptoms include wide range of cognitive, visual, auditory, behavioral, emotional issues. Biden literally snarled at Lester Holt in NBC interview.", "permalink": "/r/conspiracyfact/comments/1e4szxy/i_know_quite_a_few_people_in_dc_area_they_all_act/", "selftext": "", "media": null, "score": 5, "upvote_ratio": 0.74, "comment_count": 0, "over_18": false}, "39": {"id": "1e4xa2s", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Infamous-Garbage-420", "link_flair_text": "hoax!", "time": 1721443401.0167649, "created_utc": 1721157573.0, "url": "https://i.redd.it/4cwpy0x4lxcd1.jpeg", "title": "That baby bigfoot is the exact same as this......so fake", "permalink": "/r/bigfoot/comments/1e4xa2s/that_baby_bigfoot_is_the_exact_same_as_thisso_fake/", "selftext": "", "media": null, "score": 437, "upvote_ratio": 0.96, "comment_count": 70, "over_18": false}, "40": {"id": "1e4mkhl", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Evidence", "time": 1721443401.507913, "created_utc": 1721130402.0, "url": "https://i.redd.it/a1m5jfkbcvcd1.jpeg", "title": "In 2003 this photograph of a humped sea serpent was taken near Pembroke Dock in Wales. After a number of sea serpent sightings in the area, it was anonymously left in a bar. Richard Freeman estimated it's length as 60 feet or 18 meters based on the rocks.", "permalink": "/r/Cryptozoology/comments/1e4mkhl/in_2003_this_photograph_of_a_humped_sea_serpent/", "selftext": "", "media": null, "score": 273, "upvote_ratio": 0.93, "comment_count": 13, "over_18": false}, "41": {"id": "1e2cn27", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "KOPHER_", "link_flair_text": "U.F.O. Humanoid", "time": 1721443401.6549335, "created_utc": 1720883406.0, "url": "https://www.reddit.com/gallery/1e2cn27", "title": "Daft Space punk in Torre de Picenardi, Lombardy, Italy on June 15, 1954.", "permalink": "/r/Humanoidencounters/comments/1e2cn27/daft_space_punk_in_torre_de_picenardi_lombardy/", "selftext": "Mr. Franco Premi, in June 1954, was in the open countryside, in the Torre de Picenardi, in Lombardy. It was about 14:30, and Mr. Premi was waiting for one of his clients for work reasons. The man was quietly reading when he noticed signs of anxiety in his dog; he tried in vain to calm him down. Suddenly, Premi heard a loud hiss and saw, 200 meters above the ground, a descending UFO that landed in a cornfield.\nThe plane, gray but transparent in front, had the shape of a tear with a sketch of the tail. It was slightly curved at the bottom and very rounded at the top; Franco Premi estimated the size of the object to be about 10 meters in length, 7 in width and 3 in height.\nThe hissing stopped and the dog calmed down. Then Mr. Premi got out of the car and carefully hid in the bushes: from his vantage point, he clearly saw two strange creatures coming out from under the ship.The aliens were humanoids in uniform, about 2 meters tall; they wore a hard blue jumpsuit, and their faces were covered with large dark glasses that enveloped the entire head stretching to the back of the Creature, seemed to have difficulty moving, almost as if they had not walked for a long time.\nTwo aliens collected vegetation samples from the surrounding area and placed them in containers taken from UFOs, after which they briefly checked the UFO and re-entered. Immediately after the mysterious UFO took off quickly. The object again began to produce a deafening hiss and leaving a strong smell of ozone around.\nSources: http://www.inspiegabile.com/ufologia/archivio-casi-ufologici/3-tipo-1954-premi.html\nSources 2: \n\"Alieni in Italia. 50 years of incontri ravvicinati: 1945-1995\" by Moreno Tambellini.", "media": null, "score": 39, "upvote_ratio": 0.96, "comment_count": 2, "over_18": false}, "42": {"id": "1e7ey4z", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "GeneMachine16", "link_flair_text": null, "time": 1721443402.0815377, "created_utc": 1721424394.0, "url": "https://i.redd.it/9e2niemimjdd1.jpeg", "title": "I made my Mothman pilgrimage today ", "permalink": "/r/cryptids/comments/1e7ey4z/i_made_my_mothman_pilgrimage_today/", "selftext": "", "media": null, "score": 176, "upvote_ratio": 1.0, "comment_count": 6, "over_18": false}, "43": {"id": "1e7bm0n", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Thorn_Princess22", "link_flair_text": "Discussion/Advice", "time": 1721443402.2481833, "created_utc": 1721415829.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1e7bm0n/questions_about_the_fae_folk/", "title": "Questions about the Fae Folk", "permalink": "/r/Thetruthishere/comments/1e7bm0n/questions_about_the_fae_folk/", "selftext": "I know some folklore talks about elves and fae that are as large as humans. Could they take a human form? Has anyone run into such fae? How would you know? Do they hide among us or are they usually secluded?\nAnother question that has been on my mind: Is there a hierarchy to the fae? How is it structured? Does it vary in each country?\nEdit: I just want to add that I’m new here. My knowledge is pretty much at a zero currently, but I’m hoping to change that. If anyone has good book recommendations, let me know.", "media": null, "score": 11, "upvote_ratio": 0.87, "comment_count": 1, "over_18": false}, "44": {"id": "1e37wc4", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "roehlup", "link_flair_text": null, "time": 1721443402.3896453, "created_utc": 1720978109.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1e37wc4/man_living_among_us_in_our_summer_camp_house_for/", "title": "Man living among us in our summer camp house for …a while", "permalink": "/r/LetsNotMeet/comments/1e37wc4/man_living_among_us_in_our_summer_camp_house_for/", "selftext": "Admittedly, I’ve been a lurker on this sub for a few years now. I’ve tried to type out my story numerous times but always struggled to wade through the pieces as they’ve gotten more and more jumbled and foggy with time. I can’t say I was traumatized by what happened. I’m not sure if it makes me a fucked up person but I typically tell this story at parties to manipulate drunk acquaintances into thinking I’ve survived something cool. Okay, let’s get into it.\nIn 2015, I was 19 and working for the summer at a bible camp for inner city kids. I’m going to leave out the city name but just know that obviously crime occurs frequently in big cities and this one was no different. I had been assured that this neighborhood however was in the process of being “gentrified” and they had even just opened up a hipster coffee shop/dog park right down the street. Just to give you a really clear visual…this neighborhood had dilapidated houses with trash out in the front right next to houses with immaculate yards and square modern architecture. \nThe Bible camp where I was working was essentially just a huge two story house with a large fenced in yard. Again, we were assured that we were safe though because we had bars on the windows and the outer doors locked automatically when they shut. The camp was conducted downstairs and the summer counselors (there were 4 of us) lived in the small upstairs that was off-limits during the day to the kids. Our camp ran 5 days a week 8am to 4pm and then time was ours to explore the city or rest or whatever. Probably enough to get to the story now. I love a good setting and it could be important later. \nOne weekend night in July we were all just hanging in the house making a spaghetti dinner. We each got our own stipend for food so we divided it accordingly for meals then bought our own snacks and shit. We were also in charge of preparing lunch and snacks for the kids on camp days so we had two fridges and two pantries. As you can probably guess, we labeled them Camp Fridge/Pantry and one is labeled Staff Fridge/Pantry. We also were super fucking petty and wrote our names all over our snacks in the fridge. My best friend worked at the camp with me, we will call her Kris, and it was our turn to cook that night so I went into the staff fridge to grab the ground beef. I immediately notice that my case of go-gurts is gone. They were my go-to snack and I bought like three cases a week. I had just opened my last box like an hour before to have one and left it in front of the ground beef. It sounds crazy but I knew I did. I close the fridge door and head to the dining room, Kris closely behind me, and yell at everyone else, “Who stole all my go-gurt?” That night, in addition to Kris and myself there were the two other summer counselors, two permanent counselors that lived in the area and then the cousin of one of the permanent counselors. Everyone looked at me wide-eyed then looked around blankly. I figured it was the cousin because I had never met her before so I sucked it up, said “Whatever, just if it has a name on it please don’t eat it.” then pull Kris back in the kitchen to finish up the spaghetti. \nWe all eat dinner and then the two permanent counselors volunteer to do the dishes because we let them eat with us. The rest of us head back upstairs to get comfy in the sitting room on the couches and turn on Family Guy. We’re only like 2 mins in when the cousin, we’ll call her Sara, says “Wait, I can’t find my phone or wallet.” I pause the show and roll my eyes still annoyed about the go-gurt. Kris says, “Where did you last have them?” And Sara says she left them on the couch before we went downstairs to dinner. Naturally we all start looking around the small room turning over couch cushions, looking under the couches, behind them, under blankets, really wherever. Finally, we’re like, “Are you sure you didn’t leave them downstairs?” She agrees to head downstairs to look with the other two and Kris and I go into our room which is connected to the sitting room. \nWe flop down on the bottom of our bunk bed and I proceed to talk shit about Sara who I feel like is ruining our chill night. Our door is open and I’m shocked when I see a hand kind of sneak into view like it’s going to grab the doorframe. I say, “Hey, did you find them?” thinking that Sara or the other two have somehow made it back upstairs without me hearing them and have heard me talk shit for the past 5 mins. But the hand immediately disappears out of the doorframe and there’s no response. I look at Kris like wtf and she’s looking back at me confused because she never saw the hand. I quickly explain what happened and then we both jump up and head to the top of the stairs. We yell down for the others and they yell back that they haven’t found them yet. By this point I’m freaked the fuck out because who is up here with us. Of course we’re those people though and we start looking around upstairs in our bedroom, the other bedroom and in the sitting room. We find nothing and no one. We decide not to say anything yet because I might sound insane and also how could someone have gotten downstairs so fast without us hearing them?\nWhen we get downstairs Sara is super upset and crying. Her cousin says “C’mon guys, did someone take her stuff?” But Kris and I both know we didn’t and we say so. Sara screams that obviously someone took them and we should just be honest and then things get heated. I finally decide then to tell them about the hand because I feel like it will maybe reduce the tension between us. It does but then everyone panics. We run around the house like maniacs looking in every closet or “hiding place” the kids use and find nothing and no one. We end up calling our camp director to come over because the situation has just devolved into chaos. When he gets there we’re all sitting huddled in the foyer freaked out and we explain what we can. He just doesn’t seem convinced that someone was in the house and threatens to call the cops if “one of us” doesn’t give Sara back her things. Well none of us fess up so he calls the cops and they come over and search the property and take our statements. It seems so dumb as we repeat our stories but we didn’t have much to go off of but a feeling. They do write a report for stolen property and that makes Sara feel better at least. With the house secure, everyone leaves except us four summer counselors who live there. We spend the night in the same room with the door barricaded reassuring ourselves that we’re being stupid and the phone and wallet will actually turn up somewhere random and we will laugh about it.\nFast forward a few days. We’ve relaxed a bit. We haven’t found Sara’s things like we expected but nothing else weird has happened and we’ve been occupied with the kids and the job in general. The kids have all gone home at this point and it’s just the four of us again at the house. We finish cleaning up the outside, lock the gate, and head in the dining room door. We’re all hungry and want snacks. Kris gets to the kitchen first and says “Someone left the kitchen door open again.” I mean it’s kinda weird but kids go in and out that door all day so of all the doors to be open this is the least weird. She shuts it and then I notice that the staff fridge door is also cracked open. Then who knows what possessed me but I go “Oh no y’all he’s back.” We all laugh because we think this is ridiculous. Kris grabs a broom, holds it as a weapon and says, “Let’s get him girls.” She starts to throw open the pantry doors screaming “Where the fuck are you motherfucker??” and “We know you’re in here, show yourself.” I’m following behind her laughing but I start to inexplicably feel uneasy and nervous. She continues her charade into the next room throwing open two more closet doors. Then moves into the front room and opens that closet door. She starts another confident “We know you’re -“ when she stops mid-sentence and screams so loudly skin on my neck prickles. Then she throws the broom in the closet and sprints out the front door leaving it open. My heart is pounding so fucking hard at this point but I’m thinking she’s messing with us so I turn around and go the other way into the foyer and out the front door. I see her booking it down the street towards the coffee shop and I’m like okayyyyy what is she doing. As soon as I turn back around to find the others, he’s just there. Older man, looks really dirty, has hardly any teeth. He’s just grinning at me. He has his hands up and says “I didn’t mean no harm” while slowly backing away down the street in the other direction. It’s so creepy because even though he says this it’s like he doesn’t mean it. It’s like his tone and the grin are mocking me. I’m frozen for a second then I sputter out “You can’t just um leave” and he just says again with that goddamn grin “I didn’t mean no harm” then turns and runs. I fumble in my pocket for my phone and dial 911 then go to follow him but as soon as I reach the edge of the house he’s gone. \nNext events are kind of a blur. Sounds wild but we really all thought we just freaked ourselves out. No way in hell did we actually think someone was in the house. The cops took our statements and reminded us that we needed to keep the doors shut at all times no matter what. Our director apologized profusely for not initially believing us. My parents wanted me to come back home for the remainder of the summer but I was like eh what else could happen? Kris was the one who had it the worst. She was terrified to stay in that house. She told me later that when she opened the door he was just grinning at her with dead eyes. Like he was waiting for her to finally find him. She said she will never forget his face. We’re still best friends at almost 30 and I can’t bring up that summer to her if she hasn’t been drinking. \nThat’s basically it. I think what kept me up at night after that were just unanswered questions. Like how long had he been in the house? Why did he randomly decide to take the phone and wallet of the one person who didn’t work there? Had he listened to our private conversations? Watched us get dressed and shower? How much food had he stolen that we didn’t notice? Where the fuck had he gone when we were looking for him on spaghetti night? What hiding places did we miss? Was he under my bed at night or at any point during my stay? Idk all these answers and I know I’ll never have them but I’m thankful our interaction wasn’t worse I guess. \nSo, creepy grinning squatter who lived among us for god knows how long, let’s not meet.", "media": null, "score": 142, "upvote_ratio": 0.97, "comment_count": 15, "over_18": true}, "45": {"id": "1e73ezj", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "happypants69", "link_flair_text": null, "time": 1721443402.4953225, "created_utc": 1721394740.0, "url": "https://i.redd.it/0ttuf2hc6hdd1.jpeg", "title": "Gas station using a tarp to conceal customers using the pumps during the 2002 D.C. sniper shootings", "permalink": "/r/truecreepy/comments/1e73ezj/gas_station_using_a_tarp_to_conceal_customers/", "selftext": "", "media": null, "score": 30, "upvote_ratio": 0.97, "comment_count": 1, "over_18": false}, "46": {"id": "1e6nnu3", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "TheFuckinGOATOG", "link_flair_text": null, "time": 1721443402.6101584, "created_utc": 1721340596.0, "url": "https://www.reddit.com/r/threekings/comments/1e6nnu3/true_story/", "title": "True Story", "permalink": "/r/threekings/comments/1e6nnu3/true_story/", "selftext": "I always walk down the road back and fourth around my house for hours per day everything was always the same, that was until a day that changed my life. I kept walking and it was 4 hours into my 5 hour walk, I found a USB that wasn't there until now. I was confused and picked it up ending my walk an hour early and walked back home and entered my house. I took the USB and plugged it into my computer and it was the Original Smile.jpeg (the Smile dog file) I ignored it and threw it out and I woke up and it was back on my desk, I kept it and now I don't know what to do with it.", "media": null, "score": 1, "upvote_ratio": 0.56, "comment_count": 0, "over_18": false}, "47": {"id": "1e25hpf", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "FederalEntertainer21", "link_flair_text": null, "time": 1721443403.058024, "created_utc": 1720859399.0, "url": "https://v.redd.it/9sqmy7fiy8cd1", "title": "We bought an 1850s house in North Wales, UK in 2018. Landscaping the garden a few years later we found a sealed freshwater well and cracked it open (listen to audio).", "permalink": "/r/Ghosts/comments/1e25hpf/we_bought_an_1850s_house_in_north_wales_uk_in/", "selftext": "Found a well in the garden of an old property we were renovating, concreted over and brick and block paving over the top. Assumed sealed for over 70 years. Video is of me cracking it open for the first time ", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/9sqmy7fiy8cd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 848, "width": 480, "scrubber_media_url": "https://v.redd.it/9sqmy7fiy8cd1/DASH_96.mp4", "dash_url": "https://v.redd.it/9sqmy7fiy8cd1/DASHPlaylist.mpd?a=1724035402%2CMTllOTQwM2RlNjMxYzQ1NmU3NTFmNjNlZTg1MjcxY2Q4YTQ5YzBjODhhNGY2ZDE3ZDZkMDU2NWZiYzRkZjI2Mw%3D%3D&v=1&f=sd", "duration": 11, "hls_url": "https://v.redd.it/9sqmy7fiy8cd1/HLSPlaylist.m3u8?a=1724035402%2CN2JhZjhkMzdmYWNlZmFmNGI4NDdmNjQzNjM2ZTUxN2JkNzExODhjZDQ0NzRiMDE1MTIxZmM0OTExOGQ4MTFlMw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 453, "upvote_ratio": 0.9, "comment_count": 62, "over_18": false}, "48": {"id": "1e6vmte", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "oviattben", "link_flair_text": "Glitch Vid", "time": 1721443403.4135668, "created_utc": 1721365098.0, "url": "https://v.redd.it/omxozkctledd1", "title": "This video freaked me out and I don't know if it's real, but I can't explain it if it is", "permalink": "/r/GlitchInTheMatrix/comments/1e6vmte/this_video_freaked_me_out_and_i_dont_know_if_its/", "selftext": "", "media": null, "score": 764, "upvote_ratio": 0.95, "comment_count": 41, "over_18": true}, "49": {"id": "1e73wd9", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": "Discussion", "time": 1721443404.5719175, "created_utc": 1721396130.0, "url": "https://ovniologia.com.br/2024/07/mufon-apresenta-fragmento-de-ovni-acidentado-mais-leve-do-que-uma-flor.html", "title": "MUFON presents fragment of crashed UFO ‘lighter than a flower’\nThe small piece of the fragment was presented during the MUFON International Symposium late last week. According to the organization, 90% of the material's composition could not be identified.", "permalink": "/r/ufo/comments/1e73wd9/mufon_presents_fragment_of_crashed_ufo_lighter/", "selftext": "", "media": null, "score": 105, "upvote_ratio": 0.89, "comment_count": 18, "over_18": false}, "50": {"id": "1e40vws", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "Video", "time": 1721443405.9786987, "created_utc": 1721064988.0, "url": "https://v.redd.it/78say5klupcd1", "title": "Why UFO Secrecy Matters to You", "permalink": "/r/UFOs/comments/1e40vws/why_ufo_secrecy_matters_to_you/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/78say5klupcd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 536, "width": 1280, "scrubber_media_url": "https://v.redd.it/78say5klupcd1/DASH_96.mp4", "dash_url": "https://v.redd.it/78say5klupcd1/DASHPlaylist.mpd?a=1724035404%2CNjA3MDE5NTE5YjgyZmZlNWM1MDkxYjhlYjQ0NmUxMGJmYTU3ZTM5ZDFiNGNkNzRkZDUwNTY0MjgxMTk2MDY2ZQ%3D%3D&v=1&f=sd", "duration": 216, "hls_url": "https://v.redd.it/78say5klupcd1/HLSPlaylist.m3u8?a=1724035404%2CNTg5YTFmMzU3ZTdiZjA4M2RiZjI5OTlmMjI1NTJmODQ0ZGVmMWIzNmYyNDg4YzBhZTMyMTkxODFlYTExZTE4MA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1236, "upvote_ratio": 0.94, "comment_count": 200, "over_18": false}, "51": {"id": "1e3x2w6", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "DragonfruitOdd1989", "link_flair_text": "Video", "time": 1721443407.300748, "created_utc": 1721055972.0, "url": "https://v.redd.it/d4fxygb07pcd1", "title": "Recreating the llama skull debunk for the Nazca Mummies using a real llama skull and not a computer.", "permalink": "/r/aliens/comments/1e3x2w6/recreating_the_llama_skull_debunk_for_the_nazca/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/d4fxygb07pcd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 640, "width": 480, "scrubber_media_url": "https://v.redd.it/d4fxygb07pcd1/DASH_96.mp4", "dash_url": "https://v.redd.it/d4fxygb07pcd1/DASHPlaylist.mpd?a=1724035406%2CMmM4YjAzY2IyNGRlMzk1N2JiM2E0Yzg2ODhiYTM1NmNjMzU0YmUwMTE0MDdlOTViY2Y2MDVhZTYzMWE1NTY1OQ%3D%3D&v=1&f=sd", "duration": 14, "hls_url": "https://v.redd.it/d4fxygb07pcd1/HLSPlaylist.m3u8?a=1724035406%2CN2ZhYzE3YTk2NGFlYWMyOGQ0YmIyNTllOGFmZjBmNDU0YzhhMzQ1NGMwNmVjOTM0MjQ1NGU0OTNmZGYxNjFhOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1813, "upvote_ratio": 0.9, "comment_count": 259, "over_18": false}, "52": {"id": "1e2iv4y", "locked": false, "subreddit": "uap", "stickied": true, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "News", "time": 1721443407.6507168, "created_utc": 1720899565.0, "url": "https://douglasjohnson.ghost.io/senators-rounds-and-schumer-uapda/", "title": "[D. Dean Johnson] Senators Rounds and Schumer submit \"UAP Disclosure Act of 2024\" as a possible amendment to FY25 NDAA.", "permalink": "/r/UAP/comments/1e2iv4y/d_dean_johnson_senators_rounds_and_schumer_submit/", "selftext": "", "media": null, "score": 69, "upvote_ratio": 0.94, "comment_count": 3, "over_18": false}, "53": {"id": "1e2mnbb", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Longjumping_Star7856", "link_flair_text": "Rule 10 Reminder", "time": 1721443408.6778402, "created_utc": 1720909702.0, "url": "https://i.redd.it/r0msjo234dcd1.jpeg", "title": "Trump has officially been shot at. ", "permalink": "/r/conspiracy/comments/1e2mnbb/trump_has_officially_been_shot_at/", "selftext": "Holy fuck boys election season is ramping up, what’s next? A bomb, poisoning? I really can’t believe i watched it live on tv.", "media": null, "score": 3260, "upvote_ratio": 0.86, "comment_count": 2746, "over_18": false}, "54": {"id": "1e6ky7n", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1721443408.9400625, "created_utc": 1721333700.0, "url": "https://www.youtube.com/watch?v=X4Q580DTDak", "title": "Clear video footage of a UFO, filmed by a military helicopter over Sakhalin Island, Russia.", "permalink": "/r/conspiracyfact/comments/1e6ky7n/clear_video_footage_of_a_ufo_filmed_by_a_military/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Clear video footage of a UFO, filmed by a military helicopter over Sakhalin Island, Russia.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/X4Q580DTDak?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Clear video footage of a UFO, filmed by a military helicopter over Sakhalin Island, Russia.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/X4Q580DTDak/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 2, "upvote_ratio": 0.67, "comment_count": 0, "over_18": false}, "55": {"id": "1e42did", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "AtomicHero", "link_flair_text": "question", "time": 1721443409.501874, "created_utc": 1721068525.0, "url": "https://i.redd.it/a43lsbnc8qcd1.jpeg", "title": "Legit question, albeit from a skeptic", "permalink": "/r/bigfoot/comments/1e42did/legit_question_albeit_from_a_skeptic/", "selftext": "For better or worse, I am admittedly a natural skeptic about a lot of things. I don't know where it came from, but it's who I am. \nThis is a picture of a Vaquita. It is considered one of the rarest creatures in the world with an estimated 10 left in existence. Yet despite that we still have high quality pictures and video evidence of its existence (alive and dead). \nSo why do you think there isn't any better evidence than an old grainy video of Big Foot (and frankly most cryptids) when nearly everyone is walking around with a camera in their pocket and probably more people looking for them than for the humble Vaquita?", "media": null, "score": 343, "upvote_ratio": 0.94, "comment_count": 222, "over_18": false}, "56": {"id": "1e61l15", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Hayden371", "link_flair_text": null, "time": 1721443410.044905, "created_utc": 1721273076.0, "url": "https://www.reddit.com/gallery/1e61l15", "title": "Cryptid photos of unknown origin", "permalink": "/r/Cryptozoology/comments/1e61l15/cryptid_photos_of_unknown_origin/", "selftext": "", "media": null, "score": 276, "upvote_ratio": 0.83, "comment_count": 93, "over_18": false}, "57": {"id": "1e5zc8j", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": null, "time": 1721443410.5497155, "created_utc": 1721266240.0, "url": "https://i.redd.it/vj9u46d9k6dd1.jpeg", "title": "Something that's been on my mind recently ", "permalink": "/r/cryptids/comments/1e5zc8j/something_thats_been_on_my_mind_recently/", "selftext": "", "media": null, "score": 129, "upvote_ratio": 0.99, "comment_count": 12, "over_18": false}, "58": {"id": "1e77f1g", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "seekerofthesublime", "link_flair_text": null, "time": 1721443410.7641287, "created_utc": 1721405186.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1e77f1g/the_shadow_people_and_the_djinn_correlations_and/", "title": "The Shadow People and the Djinn: Correlations and Personal Experiences", "permalink": "/r/Thetruthishere/comments/1e77f1g/the_shadow_people_and_the_djinn_correlations_and/", "selftext": "Being of Middle Eastern descent, and growing up later in Western Canada, I remember faintly when we lived for a time in Saudi Arabia where my dad was a contracted architectural engineer for a large American weapons company, where he designed and built foreign employee offices, living quarters, and buildings for the testing compounds in the harsh Saudi desert with other engineers from across the Middle East and Europe. The company he worked for was none other than Raytheon, a well known Merchant of Death, that had dealings with the Emirs of the land, who were swimming in black oil and luxury, and were the defacto government. I remember meeting some of these Emirs, who were rather pleasant and came with toys and candies for me and my siblings whenever they would come to our house to socialize and make their plans with my father. Little did I know. My father would tell me years later, in the comfort of our Vancouver apartment, that these nice men in their immaculate one-piece \"thobe\" were quite ruthless businessmen with killers and spies in their employ. We had hosted men who were cousins, uncles, and brothers to the Saudi Royals. They had toppled governments and raised up armies and militias and even terrorist groups, all across the Middle East and Africa My dad had one colleague that could build a bomb from common items in your fridge and under your sink that could level a building, and that he learned this from intelligence agencies that will remain unnamed. \nI was about 6 years old when we left for Canada in the early '90s, but remember our time there, and an old brick bungalow house we had lived in, a large accommodation with a sandy yard. It was a sparse neighborhood. There were other houses but not close enough to be in each other's business or hear your neighbor's noises. Most of the people living in this area were in the employ of the Royal Family in some capacity. They were well off, educated, and well connected. There were several empty houses around as well that I would sometimes roam around and explore if I found the opportunity to escape the confines of our home.\nI had heard of the Djinn early on from my mother as warnings against bad behavior or when she wanted to scare me with images of beastly ghouls. She would say they appeared in many forms, as shadows, as humanoid chimera like beings with hooved feet and tails, as transparent ghosts, or as invisible unseen forces. She said they could also appear as humans and that they were great mimics. They could lure you into places with the voices of people you knew. She would also say that they liked waiting until you slept as they could enter your dreams for unknown reasons.\nMany times she would also ascribe any possibly paranormal or odd goings on to the Djinn, for example if one heard unexplained noises from an empty room, or if objects were lost, thoroughly looked for, then later found in areas searched several times, that was them, playing their tricks, she would often say a prayer against them and or curse them either in the singular \"Shaitan\", or in the plural \"Shayatin\". My mother would alert me against going to the abandoned or empty homes, for she warned me that these are the places that the Djinn would occupy, waiting for wayward souls to attach to and torture. My father, being a rather pragmatic man, told me to never mind her stories, to go and explore, but to be careful of strangers and to not be gone for too long.\nShe told me that once, when I was 3 years old, I was sleeping in my room at night and she had cause to check up on me after being washed over with a foreboding feeling, a creepy sensation that she needed to see that I was ok. Upon entering my room she said there was a black shadow in the corner near my bed, that she saw it clearly for split second, but not only saw but also felt, and she flipped the light switch and it just dematerialized instantly. Being scared for her child, she spent several nights in my room with me before she brought a holy man to cleanse the space and say some prayers. After which she said that there were not any more occurrences of shadows looming over her children, and she seemed satisfied.\nI don't recall ever seeing any moving shadows or ghouls in that part of my life, but there was sometime later, in my late teens, several occurrences of what I can term as shadow people appearing We had moved to British Columbia by this time, were awarded citizenship after some years, I was finishing high school, well adjusted, lots of friends at school and even in the building we lived in we (my 2 brothers and sister) were friends with all the other kids and teens whom also lived in our building and the neighboring apartments. This was in the early 2000s before kids had cellphones or even spent time on computers, we were always doing something outside in groups, having fun, causing ruckus. Not a day was spent inside if we could help it. We didn't need money or a reason to justvroam about, at the very least. More often than not, we had our regular haunts and meet-up spots.\nI remember one particular night, I was 17 or 18, where I had an experience that was quite jarring and was shared with my brother. I had been sleeping and woke up, paralyzed, unable to move or speak. But to my horror, there was sitting in the chair beside my bed was a shadow man, with red eyes, his energy was malevolent and  contemptuous.  He didn't speak, just sat there, even though I couldn't see a mouth I knew he was grinning. I could see his outline. He was a man, just made of shadow that my eyes couldn't see through. He was watching me struggle to break my paralysis for what felt like 5 or 6 minutes, I was terrified and could not keep a straight thought in my head but to try and somehow run away, even though it was impossible. I remember making mewling noises and moaning, trying to scream, but everything was paralyzed, even though my mouth was agape and I couldn't shut it. I couldn't do anything but try to scream, and it was coming out as muffled noises. \nI could feel that this shadow being was deriving pleasure from my anguish, he was just sitting there, 4 ft away from me as clear as anything else in the dark room, just staring at me with those red eyes. Then, all of a sudden, he stood up, belched out an evil chuckle, and zipped away in the direction of my brothers room down the hall. He flew at an alarming speed, I could see two trails of red light as his eyes left along with his shadow body, at which point I snapped out of my paralysis. As soon as he left my room, the paralysis broke. All I could focus on was his laugh before he left. I thought it was over that this thing zipped away out of the apartment back to whatever hell it escaped to torment me.\nI got up out of bed and went to the kitchen to get a drink of water, I was shaken up and was trying to convince myself that this was just a weird, vivid dream. But it felt as real as normal life, as real as talking to another person. I was definitely awake, I wasn't sleeping. While I stood there slowly drinking my cold water, I heard the same muffled screams that I was making coming from somewhere diwn the hall. It was coming from the last room down, my middle brothers room. I walked over there and listened by his door, and yes he was making noises so I opened his door and I froze as I saw a portion of the air on top of him was dark, darker than the already dark room, it was like a cloud was hanging over him, and he was looking paralyzed like I was and he was moaning, I can only describe it as silent screaming. \nI ran over and shook him awake. It took a few seconds, but I shook him hard, and he came to. He looked at me with eyes wide in fear and said that there was a shadow man with red eyes laughing at him while he made him frozen, he said he woke up paralyzed as this shadiw man cane into the room, and this thing was standing above him the whole time laughing, and watching him struggle.\nI couldn't believe it. I told him it just happened to me too, I heard him from the kitchen. I told him how it left my room and went in the direction of his room after it let me go. Both of us had trouble sleeping that night. It was the most surreal experience I've ever had. This was the first time any paralysis happened to him as well, and the first time, anything like this event. He wasn't into any paranormal stuff. It was a shock to him things like this could even happen. He never took my mother's stories seriously. He was always just as level-headed and grounded as my father. Unlike me, I did have an interest in things like this, and ufos, ghosts, and such. But I also remember this as a shocking first time. It was an assault on my reality, even if I was open-minded to the paranormal. \nWe told our mom about it the next day, and she immediately blamed a Djinn. She was reminded of the time she saw a shadowy presence in my room back in Saudi Arabia. We couldn't stop her from praying in our rooms and lighting her incenses to \"clear the bad air.\" It must have worked as I never felt that presence return, but it wasn't the last time I saw a shadow being. It was never as blatant and in your face as the first time, but it happened many times more.\nI've told this story to many people and shared it online and have never heard of a case where the shadow being attacked two people consecutively. Was this just a case of sleep paralysis hallucinations? How did me and my brother share this delusion if that's truly what it was?\nTo this day, we still talk about that. I had many other sleep paralysis encounters with shadow beings but never like that first time, never as malevolent, and never again shared with another person. In fact, I get sleep paralysis quite often, even had it last night, but I haven't had a shadow being around during this paralysis in twenty years or more. I've become used to it, waking up unable to move, and have learned to keep calm until it passes, which it does in a minute or so.\nThere were many other times I've seen the shadow people during waking hours, fleetingly, in the peripherals of my vision, darting by. As have others, I know. Other times, I've seen them when entering a dark room before turning a light on, after which they dissappear. I got used to them. They seemed fairly harmless, and eventually, I stopped noticing them. I figured after some time and study that they, most likely being Djinn, were just living their lives, and that the veil that separates our lives from theirs can become thin, rendering them somewhat visible, or lets their presence be felt.\nReading about Djinn as much as I could, I learned they have lives like we do, have children, duties, can be good and tolerant, or downright bastards. Some are interested in pranks, some can grant boons, and some can possess you even. But I've read that possessions are exceedingly rare. I've even read they have religions, they can believe in God. Being shapeshifters, their most common form is a shadow in the shape of a human. Perhaps that's the most common way our minds can grasp them. Maybe our eyes can only cath them in a certain visual frequency. They have their favorite dwellings, but they can appear anywhere. They are not locked to a location in ways that ghosts or spirits can be.", "media": null, "score": 5, "upvote_ratio": 0.78, "comment_count": 3, "over_18": false}, "59": {"id": "1e59ydw", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Vegetable-Box-3586", "link_flair_text": null, "time": 1721443410.9350579, "created_utc": 1721192882.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1e59ydw/creepy_guy_in_the_park_tries_massaging_me/", "title": "Creepy guy in the park tries massaging me???", "permalink": "/r/LetsNotMeet/comments/1e59ydw/creepy_guy_in_the_park_tries_massaging_me/", "selftext": "Hello everyone, ive been thinking alot of posting on reddit since ive watched r/ for a really long time but i never had anythinf actually interesing to talk about.\nSo some backstory, i am a 17 year old male but i dont look my age at all (ive been compared to 28 year olds sadly), one day me and my friends were bored and we went to farrockaway beach in ny, it was almost night so it was just getting dark but thats not really important to this story, we decided we should return around 3 or 4 am another day so that we can see the sunrise and enjoy the somewhat cool morning air next to the water.\nNow the real story begins, i decided to do an all nighter because i just started talking to this girl so i seemed like a good excuse to ask her to stay on call for long, anyways i needed to leave around 3 am to get to the beach early enough to see the sunrise. Before i left my house i already felt some sort of bad presence, something felt like i would go wrong.\nSkating through a park next to my house to get to the bus, i see this man from afar, he walked closer twards me slowly and eventually asks me to stop and my dumb self wanted to be nice (i know its not good at 3 am) i stopped. He was speaking with an accent but saying weird things i didnt understand it well. What i did understand tho was his constand praise on me fo some weird reason and his weird desire to want to \"massage me\". \nEven tho its weird, i live in new york and it didnt set off any real bells in my mind to think he was dangerous, the thing that messed me up slightly was he fact that he kept slowly inching twards me, and when i was walking away finally, I felt eyes on my back like dagers, i had turned around out of fear and low and beholdddd he was walking backwards away from me but keeping eye contact with the back of my head, utterly terrified i ran as fast as possible and then skated down another hill to try and go as far away as fast as possible, sadly it happened while i was on call  so she heard this man trying to possibly kidnap me or molest me in the park or something???\nWhatever that man wanted, whatever was really going on... lets please not meet again.", "media": null, "score": 27, "upvote_ratio": 0.81, "comment_count": 4, "over_18": true}, "60": {"id": "1e635hq", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "May21-", "link_flair_text": "Is this paranormal?", "time": 1721443411.6451597, "created_utc": 1721278350.0, "url": "https://www.reddit.com/gallery/1e635hq", "title": "Weird shadow thing keeps appearing for 3 days now", "permalink": "/r/Ghosts/comments/1e635hq/weird_shadow_thing_keeps_appearing_for_3_days_now/", "selftext": "So this shadow thing has been appearing for 3 days at around 10 at night the dogs don't seem bothered by it it only shows in the security camera ", "media": null, "score": 330, "upvote_ratio": 0.89, "comment_count": 93, "over_18": false}, "61": {"id": "1e2oicb", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "TheHandler1", "link_flair_text": "Glitch Pic", "time": 1721443412.009974, "created_utc": 1720914906.0, "url": "https://www.reddit.com/gallery/1e2oicb", "title": "One banana will not ripen. Banana for scale. ", "permalink": "/r/GlitchInTheMatrix/comments/1e2oicb/one_banana_will_not_ripen_banana_for_scale/", "selftext": "", "media": null, "score": 173, "upvote_ratio": 0.98, "comment_count": 27, "over_18": false}, "62": {"id": "1e4tspr", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "ufoarchivist", "link_flair_text": "peer review", "time": 1721443413.541543, "created_utc": 1721149123.0, "url": "https://youtu.be/voAQ_qXxnRs", "title": "Prof Simon Holland talks about findings in a peer review on the detection of alien radio signals", "permalink": "/r/ufo/comments/1e4tspr/prof_simon_holland_talks_about_findings_in_a_peer/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Prof Simon Holland talks about findings in a peer review on the detection of alien radio signals", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/voAQ_qXxnRs?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Prof Simon Holland talks about findings in a peer review on the detection of alien radio signals\"></iframe>", "author_name": "UFO Archives", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/voAQ_qXxnRs/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@UFOArchivist"}}, "score": 101, "upvote_ratio": 0.81, "comment_count": 57, "over_18": false}, "63": {"id": "1e2ldmh", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Lopsided_Task1213", "link_flair_text": "Clipping", "time": 1721443414.8829231, "created_utc": 1720906336.0, "url": "https://www.reddit.com/gallery/1e2ldmh", "title": "Greatest Hits of the 2024 UAP Disclosure Act", "permalink": "/r/UFOs/comments/1e2ldmh/greatest_hits_of_the_2024_uap_disclosure_act/", "selftext": "", "media": null, "score": 1059, "upvote_ratio": 0.98, "comment_count": 130, "over_18": false}, "64": {"id": "1e3hage", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "pokezillaking", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1721443416.2235944, "created_utc": 1721002945.0, "url": "https://v.redd.it/m00uhp35tkcd1", "title": "Final scene of MIB is super cool", "permalink": "/r/aliens/comments/1e3hage/final_scene_of_mib_is_super_cool/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 450, "fallback_url": "https://v.redd.it/m00uhp35tkcd1/DASH_270.mp4?source=fallback", "has_audio": true, "height": 268, "width": 480, "scrubber_media_url": "https://v.redd.it/m00uhp35tkcd1/DASH_96.mp4", "dash_url": "https://v.redd.it/m00uhp35tkcd1/DASHPlaylist.mpd?a=1724035415%2COWU4YjAzYzM0NzZlNWY3MzUxOTExNTY3MWE2YjVmNDk2YzA3MzlhYzUwYTIyMzA5Zjk3NjIyMjc0OWNlOTUzNw%3D%3D&v=1&f=sd", "duration": 37, "hls_url": "https://v.redd.it/m00uhp35tkcd1/HLSPlaylist.m3u8?a=1724035415%2CNDQ5N2ZlYTRjMTZjZjAyYTIyYzU2OWJmYWZmOTEyNGNhMWI0Yzk1Y2NlYTMxZTA1MjIwYzcwN2I1ZDU3ZTRlMA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1450, "upvote_ratio": 0.98, "comment_count": 78, "over_18": false}, "65": {"id": "1e5z881", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Video", "time": 1721443416.5514474, "created_utc": 1721265928.0, "url": "https://v.redd.it/zd71mdl6j6dd1", "title": "[Marik Von Rennenkampff] I spoke with ex-AARO director Dr. Kirkpatrick for over an hour. The full discussion, including Kirkpatrick's thoughts on the UAPDA, will post tomorrow. Kirkpatrick: \"I haven't looked at NASA's [GoFast] analysis.\" Also didn't know the \"Gimbal\" video was shot at night.", "permalink": "/r/UAP/comments/1e5z881/marik_von_rennenkampff_i_spoke_with_exaaro/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/zd71mdl6j6dd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/zd71mdl6j6dd1/DASH_96.mp4", "dash_url": "https://v.redd.it/zd71mdl6j6dd1/DASHPlaylist.mpd?a=1724035416%2CZTUwOTI3NDMxYzBiMzk4NDhiNGViNTdmODVlODA0ZmNmYzY5MzgyM2JjMWFlYThjNzFiYzlmYTM4YjA5MzdiMA%3D%3D&v=1&f=sd", "duration": 106, "hls_url": "https://v.redd.it/zd71mdl6j6dd1/HLSPlaylist.m3u8?a=1724035416%2CYjgyNzE1MmI0NmM3YTJjNmYzOWQzMzNmMjNhMmI3MTUwZmEyNjlmNDljYzkyZGI2OTdlYjVjZDg4NjcxZDg5OA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 40, "upvote_ratio": 0.93, "comment_count": 4, "over_18": false}, "66": {"id": "1e4cn9w", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Florzee", "link_flair_text": "Rule 6 Reminder", "time": 1721443417.594042, "created_utc": 1721094653.0, "url": "https://i.redd.it/gqqjlwi1escd1.jpeg", "title": "Finally more people are waking up ", "permalink": "/r/conspiracy/comments/1e4cn9w/finally_more_people_are_waking_up/", "selftext": "", "media": null, "score": 3245, "upvote_ratio": 0.88, "comment_count": 592, "over_18": false}, "67": {"id": "1e6aefq", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1721443417.8907022, "created_utc": 1721306337.0, "url": "/r/wallstreetSHITS/comments/1e6acm3/ran_on_change_kept_bush_economic_team_economy/", "title": "Ran on \"Change\" kept Bush economic team\nEconomy most important issue\nObama too busy w BofA sponsorship of \"Hamilton\" blatant homage to father of largest bank in US.. No wonder BofA 10yrs going to trial\nComic legend Conan O'Brien interview w \"Flash Boys\" author better than Bloomberg CNBC CNN MSNBC...", "permalink": "/r/conspiracyfact/comments/1e6aefq/ran_on_change_kept_bush_economic_team_economy/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.6, "comment_count": 0, "over_18": false}, "68": {"id": "1e3alzy", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "be-gay-find-cryptids", "link_flair_text": "humor", "time": 1721443418.4192865, "created_utc": 1720984990.0, "url": "https://i.redd.it/aujv0ulybjcd1.jpeg", "title": "Patterson and Gimlin meet Patty, 1967 (Colorized)", "permalink": "/r/bigfoot/comments/1e3alzy/patterson_and_gimlin_meet_patty_1967_colorized/", "selftext": "Shitpost made by me :)", "media": null, "score": 181, "upvote_ratio": 0.9, "comment_count": 6, "over_18": false}, "69": {"id": "1e547s7", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "aesthel", "link_flair_text": "Evidence", "time": 1721443418.9698205, "created_utc": 1721175256.0, "url": "https://www.reddit.com/gallery/1e547s7", "title": "Some pictures from the cryptozoology museum I went to this weekend", "permalink": "/r/Cryptozoology/comments/1e547s7/some_pictures_from_the_cryptozoology_museum_i/", "selftext": "", "media": null, "score": 227, "upvote_ratio": 0.98, "comment_count": 18, "over_18": false}, "70": {"id": "1e23y2k", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "clark3000mkp", "link_flair_text": null, "time": 1721443419.43957, "created_utc": 1720853212.0, "url": "https://i.redd.it/sap6ikvcx7cd1.jpeg", "title": "know the difference", "permalink": "/r/cryptids/comments/1e23y2k/know_the_difference/", "selftext": "", "media": null, "score": 110, "upvote_ratio": 0.95, "comment_count": 3, "over_18": false}, "71": {"id": "1e7hykh", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "acmpnsfal", "link_flair_text": "Dead Relative(s)", "time": 1721443419.5945237, "created_utc": 1721432559.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1e7hykh/ghosted/", "title": "Ghosted", "permalink": "/r/Thetruthishere/comments/1e7hykh/ghosted/", "selftext": "Someone died recently who I hadn't spoken to in a few years. Meant to catch up at some point but never did. So I'm at home watching some reality TV show when the screen went black. Tried  to fix the stream but the internet won't stop disconnecting. Finally got The guide to work a second before it stops loading and shows the last show I was watching \"Ghosted: A lost love\" header on a completely black screen. TV wouldn't react to the remote. Turned it off for a bit. \nGuess they wanted me to know, I ghosted them....or did they just spooky ghost me?!", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "72": {"id": "1e6vemh", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "sudsnbubble", "link_flair_text": null, "time": 1721443419.7327564, "created_utc": 1721364264.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1e6vemh/study_abroad_impersonator/", "title": "Study Abroad Impersonator", "permalink": "/r/LetsNotMeet/comments/1e6vemh/study_abroad_impersonator/", "selftext": "Long time lurker, first time poster. \nThis was about 15 years ago.  I was 19 and studying abroad in a country in SE asia.  The study abroad program was very small (think like 6-7 students) and loosely structured and we had a ton of freedom.  I had been traveling the summer before the program started and arrived a week earlier than the other students.  They had us staying in a small house near the program's center in a busy neighborhood.  The house was also rented to locals during the summer but typically only to students from this program during the school year. \nAgain, I had moved into the house early and it was empty aside from myself.  The owners of the house were pretty traditional/strict and it was made clear that we were not allowed to have any visitors, especially men.  At one point during my first day there I heard knocking at the door.  I looked out from an upstairs window and it was a bald local man that didn't look like anyone from my school program.  They knocked for about ten minutes but I decided to pretend I wasn't there and he eventually left. \nThe day this happened was also during Ramadan.  There's typically a curfew in this city, but because of Ramadan many people were out late eating.  I met up with a local couch surfing group and ended up hitting it off with a cute german tourist.  Eventually we made a plan for him to sneak into my house with me which we thought would be easy because it was so late.  When we arrived I saw a couple of cars outside of the house so I had him wait at the far end of the block so I could make sure the coast was clear.  What I walked up to was extremely confusing.\nThere was a big white jeep in front of the house and men with large guns were standing around it.  There was also a small gray sedan with the doors open and a man sitting in the driver's seat.  He looked just like the man that had been knocking at the door earlier.  The housekeeper (a sweet middle aged man) was also outside with the men and seemed very upset.\nI can't remember exactly what was said, but I remember the man in the car repeatedly saying my full name  which I do not go by (changing it here for privacy).  He said something like \"C'mon Cassandra, everything is okay, just get in the car.\"  I only go by Cassie and never introduce myself as Cassandra.  I had no idea who this person was, but he did feel extremely friendly and weirdly charming, like he was there to help me, but I knew he wasn't.  The men with the guns then started asking me if I knew him.  I said no repeatedly but I got the weird feeling that they all wanted me to say yes, like it would be solving some sort of problem for them.  They were not pointing the guns at me but it was still extremely frightening, especially because I felt like I had nowhere to go and also that I was already hiding my German visitor.  \nThe man in the sedan got out and approached me and tried to kind of herd me into the car.  At this point the men with the guns had grabbed the housekeeper and were being really rough with him.  Some neighbors were watching nearby now and I was confused why no one was helping.  Finally a neighbor approached and yelled something in the local language to the group.  He told me then in English to get inside immediately.  Everyone left and the men with the guns took the housekeeper with them.  I got inside and locked the door. At this point I started crying but still felt a little bit in shock.  Everything felt quiet very suddenly in comparison to all the commotion.\nA few minutes later I heard a light knocking at the door and someone calling \"Cassie\".  I realized it was the German tourist.  I ended up leaving with him and going back to his hotel instead.  He turned out to be a great guy and really helped me calm down.\nWhen I got back to the house the next day, everything seemed to be mostly normal.  The housekeeper was there and though we didn't speak the same language, he seemed very despondent.  What I learned later was that the white jeep was an unmarked police car and the men with guns were local police.  The man in the sedan had been trying to get into the house and someone had called the police.  I still have no idea what the man in the sedan wanted or how he knew my full name, but somehow the housekeeper ended up getting blamed for the confusion and was apparently beaten at the police station before the same neighbor that helped me got a group from the neighborhood together to go get him.  \nBy far the most troubling part was when I called my advisor from the school that day to let her know what happened.  She was a really nice person but as soon as we got on the phone she had a really strict tone with me and said something along the lines of \"Cassie, we already told you that you may absolutely not have male visitors.  Even if you ask permission, it's not okay.\"  I was confused but apparently a female had called and left a message on her phone yesterday saying that a man would be coming to the house later and the housekeeper should let him in.  The female had called herself Cassandra.  That part still gives me a stomach ache when I think about it.  My advisor believed me when I told her it wasn't me, but there didn't seem to be much recourse aside from asking the neighborhood to look out for the man in the sedan and not to let him into the house.\nI'm still not sure how this happened or what would have happened had the man gotten into the house or had I gotten into his car.  My best guess is that a student that used to live in that house saw from our school's private facebook group that I would be arriving early and for some reason gave that information to the man and called my advisor posing as me.  Facebook is one of the few places where I have my account under \"Cassandra\" instead of Cassie and I don't know how else they would know how to contact my advisor.  Either way, I still have no idea what they would have done with me and I'm extremely grateful to have not been alone with the man.", "media": null, "score": 22, "upvote_ratio": 1.0, "comment_count": 2, "over_18": true}, "73": {"id": "1e3mvg3", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "SweetPeter41", "link_flair_text": "Captured Apparition ", "time": 1721443420.312596, "created_utc": 1721021011.0, "url": "https://www.reddit.com/gallery/1e3mvg3", "title": "Picture taken of our old home days after hurricane Harvey. Ingleside texas", "permalink": "/r/Ghosts/comments/1e3mvg3/picture_taken_of_our_old_home_days_after/", "selftext": "Picture taken of the house that my family and I lived in for 13 yrs. It was vacant when this was taken", "media": null, "score": 274, "upvote_ratio": 0.77, "comment_count": 98, "over_18": false}, "74": {"id": "1e2pnxz", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Prince100001", "link_flair_text": "Glitch Vid", "time": 1721443420.6916099, "created_utc": 1720918417.0, "url": "https://v.redd.it/lfdg8z6v0dcd1", "title": "🔥strange cloud formation", "permalink": "/r/GlitchInTheMatrix/comments/1e2pnxz/strange_cloud_formation/", "selftext": "", "media": null, "score": 109, "upvote_ratio": 0.98, "comment_count": 6, "over_18": false}}}