{"_default": {"1": {"id": "1csm0qt", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "UFOLOGY_SHORTS", "link_flair_text": null, "time": 1716165493.3469481, "created_utc": 1715782905.0, "url": "https://www.reddit.com/r/ufo/comments/1csm0qt/reddit_user_newdig1386s_yesterday_post_was_a_hoax/", "title": "Reddit user New-Dig1386's yesterday post was a hoax. the claim that he was trying to get a photo of the northern lights in Glasgow, Scotland a few days back and came across the UFOs on his camera roll is a complete lie", "permalink": "/r/ufo/comments/1csm0qt/reddit_user_newdig1386s_yesterday_post_was_a_hoax/", "selftext": "here's the exact same photo shown in an article by KXAN, over two years ago. the lights in question were allegedly seen in Brushy Creek, Texas and the incident received a lot of media coverage back then. However, the sightings, eyewitnesses and the videos of the lights all turned out to be an elaborate prank made by a British youtuber named EllieMarieTV\nhttps://preview.redd.it/oxlyr564fl0d1.png?width=770&format=png&auto=webp&s=c607b4951ddf1918b947caed8d3a0a0f52b7c1a3\nhttps://preview.redd.it/30eqfqe5fl0d1.png?width=1223&format=png&auto=webp&s=d93c0690245c2188d6238adce9375dfa5a79d6bb", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "I Tricked the World with a Fake UFO", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/MEqZYWGYQrc?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"I Tricked the World with a Fake UFO\"></iframe>", "author_name": "EllieMarieTV", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/MEqZYWGYQrc/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@EllieMarieTV"}}, "score": 215, "upvote_ratio": 0.94, "comment_count": 53, "over_18": false}, "2": {"id": "1ctfn24", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "silv3rbull8", "link_flair_text": "Article", "time": 1716165495.393624, "created_utc": 1715873340.0, "url": "https://www.dailystar.co.uk/news/world-news/pope-aliens-supernatural-phenomena-everyones-32822897.amp", "title": "Pope to hold press conference on aliens and supernatural and people are confused", "permalink": "/r/UFOs/comments/1ctfn24/pope_to_hold_press_conference_on_aliens_and/", "selftext": "", "media": null, "score": 4464, "upvote_ratio": 0.89, "comment_count": 851, "over_18": false}, "3": {"id": "1cu7sqz", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "BoredGeek1996", "link_flair_text": "Video", "time": 1716165496.95136, "created_utc": 1715958927.0, "url": "https://v.redd.it/h8fmos9v601d1", "title": "Sighting in Honolulu, Hawaii in October 2020", "permalink": "/r/aliens/comments/1cu7sqz/sighting_in_honolulu_hawaii_in_october_2020/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/h8fmos9v601d1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 902, "width": 720, "scrubber_media_url": "https://v.redd.it/h8fmos9v601d1/DASH_96.mp4", "dash_url": "https://v.redd.it/h8fmos9v601d1/DASHPlaylist.mpd?a=1718757495%2CMTdkMWM2NGZkMWNmNDAwYjhlMzMzNjk0M2VkYWJjMTRhZGY3NzczZTM3ZmE1MDM1ZTA1ZTYyZmRiOTIyYzZmYg%3D%3D&v=1&f=sd", "duration": 123, "hls_url": "https://v.redd.it/h8fmos9v601d1/HLSPlaylist.m3u8?a=1718757495%2CMTM4NmJiMjYzMzcyMTg0NmNjMTZiYTFmYzA0ZWZhZjdlYzE3NDA2Y2IwODg5ZjE0ZjhiNzRlNjAwZGFlMDg2Zg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1527, "upvote_ratio": 0.96, "comment_count": 212, "over_18": false}, "4": {"id": "1ctkq8t", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "devoid0101", "link_flair_text": null, "time": 1716165497.4521835, "created_utc": 1715886088.0, "url": "https://www.reddit.com/gallery/1ct05y0", "title": "Pentagon tried and failed to discredit Lue Elizondo: statement from the Good Trouble Show", "permalink": "/r/UAP/comments/1ctkq8t/pentagon_tried_and_failed_to_discredit_lue/", "selftext": "", "media": null, "score": 89, "upvote_ratio": 0.89, "comment_count": 6, "over_18": false}, "5": {"id": "1cs4x7f", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "LonesomeHebrew", "link_flair_text": null, "time": 1716165498.579595, "created_utc": 1715725171.0, "url": "https://i.redd.it/jznck5etvg0d1.jpeg", "title": "That painting of Charlie is creepy, huh. I wonder what would happen if you mirrored it.", "permalink": "/r/conspiracy/comments/1cs4x7f/that_painting_of_charlie_is_creepy_huh_i_wonder/", "selftext": "", "media": null, "score": 2866, "upvote_ratio": 0.87, "comment_count": 603, "over_18": false}, "6": {"id": "1csupzm", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "None", "link_flair_text": null, "time": 1716165498.7899702, "created_utc": 1715804413.0, "url": "https://i.redd.it/k0ayet2ffn0d1.jpeg", "title": "Who runs the Deep State", "permalink": "/r/conspiracyfact/comments/1csupzm/who_runs_the_deep_state/", "selftext": "", "media": null, "score": 16, "upvote_ratio": 0.67, "comment_count": 9, "over_18": false}, "7": {"id": "1cuwov1", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "BerkshireMtnSculptor", "link_flair_text": "art", "time": 1716165499.6060076, "created_utc": 1716036837.0, "url": "https://i.redd.it/i1m3ay3km61d1.jpeg", "title": "My Bigfoot (10 hour carve) From The Smokey Mountain Bigfoot Festival", "permalink": "/r/bigfoot/comments/1cuwov1/my_bigfoot_10_hour_carve_from_the_smokey_mountain/", "selftext": "", "media": null, "score": 449, "upvote_ratio": 0.99, "comment_count": 38, "over_18": false}, "8": {"id": "1cs2gze", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Evidence", "time": 1716165500.6449845, "created_utc": 1715718951.0, "url": "https://www.reddit.com/gallery/1cs2gze", "title": "Forrest Galante recently shared these photos allegedly showing a living thylacine (with some skepticism). Thoughts?", "permalink": "/r/Cryptozoology/comments/1cs2gze/forrest_galante_recently_shared_these_photos/", "selftext": "", "media": null, "score": 780, "upvote_ratio": 0.94, "comment_count": 292, "over_18": false}, "9": {"id": "1cqxtli", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Ufonauter", "link_flair_text": "Humanoid", "time": 1716165501.00462, "created_utc": 1715602499.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1cqxtli/in_1986_an_italian_professor_working_for_the/", "title": "In 1986 an Italian professor working for the University of Pavia in Italy would have a face to face encounter with an unknown entity. But unlike so many other encounters, this professor was able to take 5 photos. ", "permalink": "/r/Humanoidencounters/comments/1cqxtli/in_1986_an_italian_professor_working_for_the/", "selftext": "To begin with, I will state that this post was months in the making (mostly waiting and chasing false leads) and carries with it perhaps some answers, plenty of questions, and perhaps for some, a similarity to their own experiences. Special thanks to u/Neo-Rex as well as u/ebycon for their assistance in helping me find and rule out some areas of research. \nDisclaimer: The following images and text are provided without photo manipulation on my end (besides simple cropping and scanning). There are going to be many references in this post to Italian media, magazines, as well as individual writers. This is by no means an endorsement, advertisement, or other form of ARG intended to sell, market, or persuade anyone to buy, rent, or procure any of the described materials. Because I know this is a new area of topic, and because the images provided are of an unusual nature, I will provide various sources to prove that these images are not enhanced, manipulated by hand or by a contemporary photo manipulation program or AI generation.\nBefore we get into the nitty gritty of the images I will provide background as to how I came upon these images, and the flow of information. \nI was first made aware of these images after researching separate alien encounters for a post of mine (see that post here for further details regarding that) one of the sources used was \"alieni in italia 1945-1995 50 anni di incontri ravvicinati\". On page VIII towards the back of the book these images (or rather image as three were compressed into one section) as well as the following text appears \nhttps://preview.redd.it/le5wrt3rm60d1.jpg?width=806&format=pjpg&auto=webp&s=39919dfcd089925de049eb66794003a5dab20573\n\"Vero alieno o scoop giornalistico? Ho evitato di inserire nel presente catalogo questo caso avvero singolare. Si tratte infatti di alcune foto )5_ scattate da un non meglio indentificato \"professore universitario di pavia\" nell'estate del 1986 e pubblicate da sette. il settimanale del Corriere della Sera. Si referiscono ad una presunta entita aliena che si sarebbe manifestata al professore in una situazione del tutto casuale. Non sono mancati pareri sfavorevoli expressi da parecchi ufologi. ( Foto tratte da: Sette n. 9/10 sette giorni illustrati dal Corriere della Sera, 5 marzo, 1988. \nTranslated: \"Real alien or journalistic scoop? I have avoided including in the present catalog this singular case. These are in fact some photos(5) taken by an unidentified \"university professor from Pavia\" in the summer of 1986 and published by seven. The weekly newspaper Corriere della Sera. They refer to an alleged alien entity that allegedly manifested itself to the professor in a completely random situation. There was no shortage of unfavorable opinions expressed by several ufologists. ( Photo taken from: Seven No. 9/10 seven days illustrated by Corriere della Sera, March 5, 1988. \nThat was all the information provided within. (it should be noted that although this description mentions 5 photos, there are only these 3 provided within Moreno Tambellinis book.) These images captured my attention fairly quickly as I am fairly familiar with purported alien/supernatural photographs, so to find one I have never seen, and in such a quality which is general not present within other such photos as these, was more than enough to tip my curiosity in the direction of delving deeper. \nFirst attempt at finding further information regarding these photos, and this particular magazine issue ended in little success, though I was able to find what I, at the time, believed to be a correctly colorized image of this entity. See below. \nhttps://preview.redd.it/tc06rvxum60d1.png?width=341&format=png&auto=webp&s=141ee2128cdcd0894f57f999876ff380a4def235\nUnassuming on some random blog that attributed a name to this entity while providing no further information regarding the image itself (as certain ufological circles are want to do). Not finding further information I attempted to find further information based off of this colorized image, but to no avail. Save for one source that used this image ( in a different colorized manner, slightly less yellow and oozing with potential, that being this image by Argentinian Ufologist Dante Franch. See below. \nhttps://preview.redd.it/39i2rdvxm60d1.png?width=280&format=png&auto=webp&s=14bf476ca33164db334bc4b835a52b349d66990d\nFinally, someone who might have a lead on this information! But no, once again this image is deceptively alluring as the contents of this book have absolutely nothing to do with the Sette report, but simply use its image to describe unsourced and unverified tales of the City of Erks (a wild dive on its own and may be deserving of its own post) and other entities that supposedly have a resemblance to this cover image. \nUpon further searches I came across this archived link with additional images some with closer to truth color, including the aforementioned first colorized image here https://web.archive.org/web/20080312200229/https://www.anomalia.org/perspectivas/fotosets/campo_cielo.htm as well as the additional references. The author of this blog post is Mexican Ufologist Luis Ruiz Noguez, notable for his skepticism and thorough investigation relating to this material, so it was a no-brainier to look into his research regarding this seeing as he had previously mentioned it here on his blogpost. So where better to look than his book \"Extraterrestres ante las camaras\" Volume X dealing specifically with italian encounters and purported alien photographs. But again, despite his previous notation in this blog, the contents of these images specifically are nowhere to be seen or mentioned within this book. \nResearch stagnated for some time during the search process for the original source cited in Moreno Tambellinis book. I was able after five months (you have no idea how hard it was to find a copy) able to acquire a copy of this magazine and finally was able to determine that the previously assumed white coverall of this entities outfit has been a false notion.\nThe following text is a translation of the pages within this issue of march 7th 1988 Sette: Corriere della Cera . 9/10, the original scans, as well as a translated text document of these pages can be found in the sources listed below. Important note: although these images are primary focus of this article, it does meander into thoughts on Whitley Striebers book \"Communion\" (which will be a source of contention that will be covered later in this post). But the translated post here is the relevant text to these images.   \n\"Just as we were editing a report on the UFO phenomenon that was supposed to appear on 7 at the same time as the television passage of Spielberg's film Close Encounters of the third kind, we came across a resounding surprise: the images published in these pages and on the cover of this issue. They were taken completely by chance, one summer evening in 1986, by a professor at the University of Pavia, above all suspicion and known for his balance, his intelligence and rationality, completely alien to the somewhat emphatic and vaguely bizarre world of the so-called \"contactees\": those people who say they have entered into a relationship with unknown entities from the cosmos.\"\n\"He is a completely normal person who has always been skeptical of the reports of unidentified flying objects and is now also a testimony, erroneous to the idea that his name is related to the disturbing figure captured by his camera. The university lecturer has agreed to give us what he considers to be evidence of his shocking experience in exchange for absolute confidentiality\"\n\"What to make of these images? We can make a few assumptions. \nA) The author of the photos is a mystrifier. It is unlikely: too much resistance has opposed the publication of his document (which he has yielded for free to 7). In addition, he wishes to remain anonymous. A behavior that is certainly not that of those who want to speculate on a scooop, true or presumed.\nB) The author is the victim of a game. Someone made him take \"fireflies for lanterns\". A well-thought-out game, by true professionals. It is not unlikely, even if the professor is not a \"contactee\", one obsessed with extraterrestrials, that is, a man who could arouse \"temptations\" among those who know him.\nC) The photos really document something alien. A mysterious otherness has been captured by the professor's camera, who was the first to be surprised by this tangible presence, imprinted on the film that is absolutely different from a hallucination. What to say? What are we to think of images that forcefully re-propose the problem (or the dream, or the myth, or the nightmare) of the existence of other beings, of other civilizations that populate galaxies or dimensions unknown to us? Science continues to question these facts, but an answer is still a long way off. All experiences at the \"edge of reality\" are embarrassing. The line that divides science and mystery is still vague. Prudence, in these cases, is a must. And the desire not to appear is widespread among the witnesses. The professor from Pavia, who chose restriction, has an illustrious precedent.\"\n\"These images, taken on a summer evening in 1986 by a professor at the University of Pavia, who asked to remain anonymous, are the subject of various hypotheses of interpretation in the text of the article. The reader is free to draw his own conclusions.\"\nHere are the direct scans of this entity as they appear in the magazine, scanned directly out of a physical copy of this magazine.  (do note although these images are uploaded in different order I believe they may be sorted as such, I make no claim to the accuracy of this in terms of chronological order, but which is most aesthetically appeasing.)\nhttps://preview.redd.it/tp2rqzw9n60d1.png?width=520&format=png&auto=webp&s=5bef77464608273cc1e6cc1f5b30665c5040a5c2\nhttps://preview.redd.it/vekj9dman60d1.png?width=385&format=png&auto=webp&s=ba133aa62862f89a1e361e21a93de19e9d549496\nhttps://preview.redd.it/sve90i9bn60d1.png?width=388&format=png&auto=webp&s=36e737a33624530c85e48f99d9ffd2d7db04d9f5\nhttps://preview.redd.it/03pcokzbn60d1.png?width=380&format=png&auto=webp&s=b8503bec04896be177ce5420daf0ee71482318a6\nhttps://preview.redd.it/yeehoehcn60d1.png?width=379&format=png&auto=webp&s=d33d814521c2581d2cb3b5c830fa62c5bae5782e\nNow, while the article was very keen to post certain aspects of this, it was rather lacking, and it must be stated although the title of this issue, as well as the description in the article infer this is related to UFO's. There is no mention of an actual UFO or craft present within this encounter, or at the very least, this information was omitted from the article, and was potentially removed at the request of the professor in question, though that is speculation on my part. \nThe following sections will deal with the author of this previous issue, as well as the two follow-up articles and their individual authors. \nThere is more information present as the above text states, not from the previous issue, but from two separate follow-up articles that were saved and printed in the Italian Ufo magazine \"UFO express no. 043.\" Link to the full untranslated issue here. These separate addendums fully cover the images in question and are critical but not overly-so. The most important aspect to this is that the professor provided further information to Sette, primarily about what they were doing prior to this entities appearance, but also their means of photographic capture. \n{Page 1}\nUFO: Is this being from another world? read the scroll on the cover of 7 (No. 9/10) that we republish on this page. Hundreds of phone calls and letters arrived at the editorial office, and they continue to arrive after Mino Damato in his TV program Alla ricerca dell'arca (Sunday, March 27, Rai 3 8:30 p.m.) dealt with the same images, depicting a hypothetical alien photographed by a professor at the University of Pavia one summer evening in 1986.\nThere are those who believe in this hypothetical alien and those who do not, but all of the readers who have phoned or written are bound to each other by the rejection of that question mark printed on the cover: each of them is persuaded to erase the hypothesis, to tear away the veil of the enigma. And they split into two equally intolerant parties, leaving no room for doubt. We have chosen two exemplary letters. The first letter comes from Brixen and is signed by Mr. Nicola De Paola (2 Clesia Street). He says “the alien is a tobogganist: typical are the tight suit the aerodynamic helmet, the face crushed by the transparent visor, the blurred colors and contours of the photos are due to the fact that they were taken from television, with the obj vo blurred or too close up and strange an alien with limbs, head, face and body identical to those of man; I too will be able to take photographs quite similar to those published; as a reader I feel mocked.”\nOthers have certainly seen in the hypothetical alien: a surgeon, a nurse, an ice skater, an Icelandic firefighter, a Norwegian cryologist (sic), a KGB spy, a hockey player with his head bandaged; in short, some man in overalls or uniforms. No one has identified in the figures, despite the width of the pelvis, a woman or an androgynous. The second letter comes from Ferrara and is signed by Mr. Giovanni Mantovani (via Luigi Borsari 51). Says; When I saw the photographs I immediately thought: but look, it looks like the E.T. seen by R.M on September 2, 1987 while he was fishing on the bank of the Canal Bianco (RO). He felt an intense tingling, turned around and saw a strange individual: dark complexion, 2 meters tall, hair that looked like plastic, wearing a luminescent blue jumpsuit. The apparition lasted a few seconds.R.M. felt a chill, a feeling that was renewed at the sight of your photos... Only one remark can be made to the professor of Pavia: that of not having given the readers further clarifications about the close approach of the third type...\nHere are the further clarifications that the professor from Pavia has allowed us to give, although he is consumed by the fear of being uncovered and covered with ridicule. The photos were taken by a Nikon camera, with motor-drive, 55 mm lens. Micro, 3.5 aperture, shutter speed: 1/4 second Polachrome film, 40 Asa sensitivity. Shortly after the sun went down, the professor was completing some experiments on the optical perception of dogs (how does a dog see things in the world? Black and white? With what depth, in what perspective?). That alone is almost ridiculous. We were missing the hypothetical alien. A dog joke? Maybe. But the professor never solved the riddle. And dogs don't talk. \\~ Paolo Pietroni\n{page caption}\nThe hypothetical alien out of 7 has caused conflicting reactions. The photo was taken from a Nikon by a university lecturer while carrying out experiments on the visual perception of dogs\nhttps://it.wikipedia.org/wiki/Paolo_Pietroni (information about this addendums author)\n{Page 2}\nYour E.T. seems to me to be a feminine being...\nDear editor, I am writing to you in relation to the series of 5 photographs taken by a better identified professor of Pavia one summer evening in 1986 and which appeared in the supplement of the Corriere della Sera n. 9/10 Since I am not familiar with photographic technique, I have written down the shooting parameters communicated by you personally during Mino D'Amato's television program In Search of the Ark on March 27.\nCorrect me if I'm wrong: Nikon camera body with motor, 5.5 mm focal length lens, aperture dia 3.5, exposure time 1/15 of a second. Certainly, with this adjustment, every little movement of the camera or of the photographed subject causes a blurred or rather blurred photograph. Probably, this whole story of the photos arose from the need of the Rizzoli Group to launch on the market the Italian version of the best American seller Communion by Ted Jacob, which deals, coincidentally, with the subject of extraterrestrials. This colossal business is also sponsored by the production of the film, which has been \"posted\" while waiting for the possible buyers of such a profitable product to be sufficiently sensitized...\nHaving said this, I wish, through his kindness, to convey to the professor of Pavia my modest comments on his photos. Feminism aside, I confess that the first spontaneous observation I made on these photographs was to recognize without a shadow of a doubt a woman, or rather a female being; The conformation of the hips, the breasts, combined with the grace of the bowed pose with folded arms, unequivocally belonged to a woman. But let's get to the details.\nThe suit - It appears so tight that it shows every little part of the body so as to give the impression of a \"second skin\"; It has light blue-green bands (as shown in the photo on the right on page 74) that are more evident around the neck, on the shoulders and on the arms.\nThe hands - They appear covered by the sleeves and more elongated than ours (cover figure), dare I say w(bed.\nThe head - Although it is more mobile, it clearly shows these elements: oval face with a slightly flattened nose, microphone with a light-colored support arm placed at the height of the left ear (photo on the right, page 74)\nThe headset - It is completely different from any type currently built because it contains a transceiver module at the top for contact with some support organ (e.g. an operations center, or a cosmoplane, or another operator), similar to what happens in Italy when astronauts go out of their vehicle and maintain constant radio contact with the control center.\nThe transceiver part can be seen both in the cover photo and on page 74, left and right, and is indicated by the protuberance on the top of the skull.\nThis study was born well out of any venal or other interest, in fact I am not a ufologist, but a pilot in full flight activity and with command responsibilities; I have been a first-hand witness to the phenomenon commonly associated with the improper name of UFO\nSure of the need to deal with the subject with more compatible methodologies than those promulgated by scientists and ufologists, I dedicate myself to the enhancement of aeronautical contactism, intending with this new term to redefine the sightings of military and civil pilots, aeronautical technicians, engineers, etc. who through direct experience with the phenomenon have acquired the conviction that we are not alone Only those who have had a direct impact with the phenomenon (the contactee) can provide a plausible image of themselves... everything else... They are only lucubrations born from mindsets that are not up-to-date with the present sotric moment on the one hand, and with the characteristics of the phenomenon on the other.\n{end of article caption}\nI forwarded his observations to the professor in Pavia, author of the photos depicting the hypothetical alien. Thank you for your interesting analysis. You are free to believe it or not, but the Rizzoli Communion book had an absolutely random presence in our service: we liked the design of the cover; the portrait of that E.T. and we thought of enriching the illustrations of the service.\nRoberto Doz (a fairly interesting individual on his own, air force colonel with his own UFO sighting) read more on that here \nAs for the author of the original article. Their name is Nullo Cantaroni, and may be more well known by his wife Bice Cairati( Sveva Casati Modigiani), Nullo Cantaroni had a fairly successful journalistic career, dealing primarily in medicine as co-authorized by fellow science journalist Severina Cantaroni. He eventually succumbed to Parkinson's disease. I make mention of these authors, Roberto Doz (who has a very good reason to be interested in the topic as he had his own experience). As well as the other two as these are not the ramblings of some crazy pumping out their own versions of weekly world news, but were and still are highly credible and respected peoples, whom by their own association are taking the flak for posting this material to begin with. \nFrom here on out, this is going to be a further dive into the already presented material, some comparisons with other cases which have direct correlation with these images, as well as other information during my research that has not been touched on up until this point. \nIn the first follow-up article there is mention of a show \"Alla Ricera dell'arca (In search of the ARK)\". With he show discussing the images posted here. I was able to confirm that this episode does exist, with the covered material, and is within the RAI archives (Italian TV network/station). However, they would not lend the episode out to a non-Italian citizen, or someone associated with a University, or media conglomeration. I mention this as there may be more material covered in this episode that was not provided in the main article and its follow-ups. If there are any Italian citizens, or peoples reading this who have the appropriate accreditation to acquire a copy of this episode I would ask for your cooperation in attempting to do so. If someone has a copy of this simply recorded off of an old VHS I implore you to make that available to all. \nGoing back to the main article, the meandering to Communion is certainly off-putting, though I disagree with the previous mention that this was a hoax on the part of the publication to push Communion. Extraordinary claims require extraordinary evidence after all (even though Carl Sagan never bothered with the evidence, side tangent: listen to J Allen Hynek talk about that here) But I believe these images were published in good faith on part of Nullo Cantaroni, his background and thorough career would make this unlikely. \nSo as it figures there are three scenarios here that describe this scenario (in no particular order of likelihood) \n1) these images are hoaxed by the publication to push communion\n2) these images are hoaxed by the supposed professor\n3) these images are legitimate and provide evidence of a non-earth based entity. \nBefore I move on I'd like to mention that I did attempt to reach out to Corriere della Sera multiple times regarding this material but was never given a response. \nTo round this off the images themselves. Humanoid obviously, female-appearing, now I say appearing because assuming this really is some unexpected entity, there is no guarantee that the physiology of this figure accurately represents its determination, and although this entity appears to have what we'd consider to be skin, that may only be a covering to another form or may be some type of robotic synthetic life-form designed specifically to mimic human appearances. What may be most interesting or most alarming depending on your perspective is this entities face appears to change between shots, and yet seemingly keeps the same body proportions. If you are of the opinion this is some type of hoax you could state this is an obvious inconsistency between shots. On the other hand, that is an obvious conclusion to make and showing differentiating faces would be a rather odd choice on the part of a hoaxer. This again could be part of the photographing process, as there is motion blur between some of these photos and it simply gives an appearance that things are changing. \nThere are other features which must be touched upon, namely the clothing, but in one such photo, what appears to be some type of headgear wrapped around this entities face. To anyone with a passing knowledge of ufology and its associated lore would know, the favorite of any interstellar interloper is the tight formfitting bodysuit. Primarily described as blue, although other colors are often reported. But unlike most humanoid encounters described in the west, this entity seems to have a darker complexion about them. Now does that mean this does not fit in with established prior encounters? Not at all, for whatever reason the blonde-hair nordic is the most popular discussion topic when it comes to human-adjacent lifeforms, but in other places, and Italy especially, some of their most well know or most covered, feature entities with darker complexions. Case in point\nhttps://preview.redd.it/0s611i7hn60d1.jpg?width=884&format=pjpg&auto=webp&s=cbc1472a0e49504d71a975ebaccb91639e592ed1\nThis encounter in 1978 Italy with a dark-skinned entity in a shimmering scaled suit.\nOr this description of a dark skinned entity with a similar described blue suit reported in 1987 \nLocation. Villamarzana, Rome, Italy Date: September 2 1987 Time: 1700\nRenzo Munari was fishing on the Bianco Canal when he noticed a strange object flying at a moderated speed over the river, as the object disappeared from sight he felt a strange prickling sensation in his body, resembling electrical static. Turning around he saw a very tall human-like figure staring intently at him. The figure was at least 2 meters in height, with orange hair and dark skin. He wore a luminous blue colored tight fitting coverall. On the left side of his chest there was a square orange colored “tag.” During the encounter the witness felt a cool wave of air and light headed. The figure apparently disappeared into the brush.\nSource: Archivio SUF, USOCAT by The Italian Center forUFO Studies (CISU)\nThere is also this report from 1989 Russia\nLocation. Salsk, Rostov region, Russia Date: August 13 1989 Time: 2300\nWorking at a cotton irrigation plant Vasiliy Ivanovich suddenly experienced total equipment failure without any apparent cause. While searching for the cause of the breakdown, the witness heard a loud voice, “He is searching for the cause”. Looking around he saw four humanoids standing close to him. One stood in the front, while the other three stood in the back. He described the humanoids as tall, with long dangling arms, with a large head, flattened on the top and wide at the temples. The humanoids are dark red or brown in color with large egg-shaped eyes and two holes instead of a nose. They have no lips, and thin strip instead of a mouth. They were wearing truncated shiny blue coveralls and footwear. The humanoid standing at the front of the others held a box in his hand and a soft pleasant voice seemed to emanate from the box. He held the box at stomach level. Ivanovich approached the humanoids and asked who they were; the reply was a question asking him if he wanted to go with them. At this point the witness saw a light at the edge of the nearby woods and a hovering object. The humanoids then floated slowly towards the craft and disappeared. Terrified the witness ran to the village to notify other witnesses but upon returning to the site the humanoids had already left. \nSource:UFOZONE Russia\nAs for the headgear, there is a report from 1995 Italy of an entity not resembling this one in this post, but wearing a similarly described headpiece. \nLocation: Ancona, Italy Date: February 3 1994, Time: 9:00am\nSix witnesses, including a Mr. Giulo observed a strange humanoid wandering around some nearby rocks. The humanoid was described as about 1 meter and a half in height, wearing a tight fitting black coverall that covered his whole body including a pair of very long feet. The face was elongated with two huge round eyes, with round black pupils. It appeared to be wearing earphones with a small thin protruding antenna. It seemed to stagger slowly and after about 10 minutes it rose up slowly and vertically into the air, quickly disappearing from sight \nSource: CISU Italy.\nThere is also this case from Barisciano Italy 1978 in which an entity bearing a striking similar blue color to the outfit was seen, with an adorning white \"cap\" or hairpiece that resembled that of a cap. read the untranslated version of that encounter here\nhttps://preview.redd.it/gkgzwmvyp60d1.png?width=310&format=png&auto=webp&s=65238cf5324c0acfcc076966d141d0114eb89be5\nFinally, lets get back to the person allegedly behind this whole spiel, the Professor. A claim such as this, where an entity appears in ones presence without any known means is a stark claim all on its own, to provide photos of such an encounter is another thing all together, but being as its an anonymous person, how can we gleam any credibility out of this? To put it in other words, is there enough information provided within the original article as well as the follow-up articles to speculate on a potential identity to who this man could have been? \nEmphatically yes, infact there is only one such individual who fits the criteria with the information provided, granted this information was given after the fact of the original articles publication. In the first article within UFO express that discusses this, we are told this person is running experiments relating to dogs (canine) eyesight, but the author was unsure whether or not this is a jest of some sort. I do not believe it is, in the secondary article it is again mentioned that this professor is working with canine eyesight, but in a caption on the second page it is emphasized this was \"non-academic research\". Now does that mean it was unrelated to their professional focus? No, it simply means this research was carried outside of official means. This leads me to who I believe the primary suspect is in terms of a potential identity, could there be other more accurate people? Perhaps. But this persons tenure and level of research within this subject and the timeframe of when they were working at the University of Pavia lines up perfectly with who this person could be. However, because of doxxing concerns, and that they initially requested complete anonymity from the publication I will not be directly naming their identity here. But I will heavily state that this person worked in the university of Pavia from 1985 in the zoology department and specifically with foxes and wolves. With this person having worked and published (into the present) works related to both of these fields. I have attempted to personally reach out to this professor both via email & telephone (their academic numbers, not personal) but have \nreceived no response. I would ask that if you do look into who this person is that you do not attempt to directly contact them as their lack of a response is response enough.\nWhat was the encounter like? How long did it go on for? Was there a conversation or was this a quick in and out? These questions and more are not answered here, and perhaps never will be unless someone; the professor, an associate, or anyone else, comes forward with more details we are left wondering and wanting more. There is of course much to be said about these images and the potential for further investigations, including the peculiar hands this entity seems to posses that does have a passing resemblance to other cases, but lest this drag on to long I will leave it here and attempt to answer any questions that I may be capable of giving insight on. \nSources and resources used\nArchive link for translations and scans of original Corriere della Sera article https://archive.org/details/Paviaentity\nMagazine and other ufological material sources: https://files.afu.se/Downloads/?dir=./\nDocument scanner for afu and other documents/sites https://updb.app/\nalieni in italia by Moreno Tambelini\nImgOps for reverse image searching\nhttps://ufologie.patrickgross.org/sys/text.htm & Albert Rosales for their compilations of humanoid encounters. \nIf you have had an encounter or know someone who has had an encounter similar to this or identical to this, do not hesitate to DM or message me with the details. ", "media": null, "score": 182, "upvote_ratio": 0.94, "comment_count": 26, "over_18": false}, "10": {"id": "1cuz69c", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "LunaPrism95", "link_flair_text": null, "time": 1716165501.661866, "created_utc": 1716044361.0, "url": "https://i.redd.it/udvz6uxu871d1.png", "title": "This art I found on my local Facebook marketplace needs to be a cryptid. ", "permalink": "/r/cryptids/comments/1cuz69c/this_art_i_found_on_my_local_facebook_marketplace/", "selftext": "", "media": null, "score": 214, "upvote_ratio": 0.89, "comment_count": 37, "over_18": false}, "11": {"id": "1crgs1x", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "No_Drummer941", "link_flair_text": null, "time": 1716165501.9001718, "created_utc": 1715651780.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1crgs1x/my_fking_dog/", "title": "My f**king dog", "permalink": "/r/Thetruthishere/comments/1crgs1x/my_fking_dog/", "selftext": "Two days ago I was sick so I stayed home from school, I was in my bed upstairs watching videos on my phone and my door opened on its own just enough for my dogs head to fit through, I have a bunk bed so I could not see the bottom two feet of my door and so I said “no, Milo” ….. no response so I said “Milo, absolutely not”….. no response, just to tell you guys but so far I have told you 5 seconds of this interaction, then I leaned up to look at what I thought was my dog and you guessed it!  🔔🔔🔔  no dog!  I then jump out of my bed and slam the door shut. Later my mother came home to a smashed window, no dog and the attic door open", "media": null, "score": 110, "upvote_ratio": 0.86, "comment_count": 36, "over_18": false}, "12": {"id": "1cr7nj0", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Dangerous_Party_7554", "link_flair_text": null, "time": 1716165502.163472, "created_utc": 1715627607.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1cr7nj0/i_dodged_being_murdered_by_my_psychotic_roommate/", "title": "I dodged being murdered by my psychotic roommate just by a hair, with real news articles", "permalink": "/r/LetsNotMeet/comments/1cr7nj0/i_dodged_being_murdered_by_my_psychotic_roommate/", "selftext": "I'm a 36 year old female in Sweden.\nI have worked in mental health care for the last 18 years, mainly with people with psychotic illnesses like schizophrenia. I was working at a group home for 9 years and were very close with my coworkers there, especially two females. The last few years I worked there, another female started working there, Lets call her M, and the four of us grew very close. She was very timid, shy, friendly and we got along well. She was however often on long term sick leave because of her own mental health issues so we didn't meet much at work, but she always showed up at our after work dinners so we continued to stay in touch even when she wasn't well enough to work full time. She told us that she had a history of schizophrenia herself, just like the patiens we were treating, but that she was medicated and hadn't had any psychotic episodes for years.\nSince I have an education in psychiatry and a long experience with schizophrenia, I have no judgment towards people suffering from the illness, and it didn't bother me being friends with someone who had a diagnosis like that. (And even after what I will tell you, I still feel the same way).\nIn the summer of 2023 I had moved on to work at a new place, also within mental health but this time forensic psychiatry, like a halfway house for mentally ill murderers etc.  The four of us stayed in touch and still met every now and then for dinner parties. M told us that she had been evicted from her apartment because of an incident where she had accidently entered her neighbors apartment in the middle of the night. She told us that in the huge apartment complex the doors all look exactly the same, and that she simply walked in the wrong door by accident, and that the neighbors had created a scene out of pure drama and reported her to the police.\nI somehow felt that while that sounded out of proportion to evict someone just from that, perhaps the landlord took that kind of action because he judged her based on her medical history and I felt bad for her. I questioned her if something else happened and she claimed that it didn't and that this was the full story.\nIn Sweden, it's very difficult to get a contract for an apartment when you have gotten evicted. You pretty much get blacklisted.\nM asked me if she could move in with me. Since she was literally on the street, literally homeless, I said \"of course you can\". I've always gotten myself into uncomfortable situations by saying yes instead of thinking about myself, and I had no idea how severe this situation would get when I said yes to M.\nI live in a pretty small apartment. It's one bedroom that pretty much only fits a bed and a desk, a livingroom that fits a couch and a tv (no room for an extra bed), a small kitchen and a small bathroom. I have two cats.\nWe decided that M was going to live in the living room and I offered her to throw my couch out so she could have a bed there, but she said that she was fine with sleeping on the couch since it's comfortable enough. I insisted on giving her a bed but she declined.\nThere's a door between the livingroom and bedroom, but between the livingroom and hallway there's just an open arch so she wouldn't have total privacy. I hung up a thick velvet curtain covering the arch  so it at least gave her the sense of a door and more privacy than nothing.\nThere's another door from my bedroom to my kitchen. So I have two doors to my bedroom. I have to have one of them open at night since my cats wants to go in and out, and they also have their litter boxes in the bathroom, and food & water in the kitchen. I naturally kept the kitchen door open and not the livingroom door, since that's where M lived and we wanted to keep our privacy somehow.\nShe wasn't working at this time because she was on one of her long term sick leaves, while I was working shifts, so sometimes I had to get up at 6 am, and sometimes I didnt get home til like 11 pm. I have really severe insomnia and need to combine Zolpidem (Ambien/Stilnoct) with Lergigan (Prometazin), and even with this I still wake up easily. I told her that I would appreciate if she could try to stay quiet those nights when I have to get up at 6 am, but that it's fine if she's loud when I'm off work or when I do the evening shifts.\nShe was a heavy smoker and a coffee drinker so I bought her a coffee machine (yeah I know, I'm a weirdo who don't drink coffee very often so I didn't have one) to make her enjoy her living situation more.\nThe coffee machine and the sink is placed right outside my bedroom door, the kitchen is very small.\nSo the first night together, I had to get up at 6 for my shift. As usual I had a hard time falling asleep. M had been up several times that night to go out to smoke and I woke up every time. At 5 am she started making coffee and since it's literally outside my bedroom door I got wide awake from the sounds of it.\nI asked her in the nicest way possible why she was up this early, asking if she had any plans today (I mean she's on sick leave, why not sleep at 5 am if you can) and she just said that she couldnt sleep. I said aww Im sorry, I would just appreciate if you could wait with making the coffee til 6 am since I really need this last hour of sleep cause of work.\nAdding to why I need my sleep is that I have epilepsy that gets really bad when I don't get enough sleep. I usually get a LOT of seizures when I don't get at least 4 hours of sleep. I knew  that I would probably get seizures at work now, meaning that this day would be both stressful and potentially dangerous for me since there's a huge risk that I fall and hurt myself (and it's not a good thing to get cramps and seizures among mentally unstable criminal clients who you are supposed to care for). (I know that it's not an ideal situation to work in that field with my condition and I can inform you all that I did quit after only 6 months)\nShe said that she really wanted coffee with her cigarettes but that she would try to wait the next time I have to work.\nI accepted it and went on with my day, but things didn't get better. She continued to wake me up early in the morning and through the nights, and continued to promise to stop but insisted that she really wanted coffee with her cigarettes. I suggested making the coffee the night before, or drinking iced coffee or Coke instead, but she didn't want that.\nI may add that she demanded for me to be silent at 10 pm cause that's when she wanted to sleep, and I respected that.\nShe used to get these moments of binge eating where she would empty my fridge and pantry from everything I had. I remember this one time when I had bought a big loaf of bread, and she texted me 30 minutes after I left the apartment saying \"Hey Im sorry I ate your loaf of bread, I will buy it back once I get money\". Like an entire loaf of bread in 30 minutes. I had told her when she moved in to feel at home and whats mine is yours, so I couldn't really get mad but it started to annoy me for two reasons; it was getting kind of expensive since it was such huge amounts, and it was always in inconvenient times of the day (like after an evening shift when the store was closed, and I came home hungry and she had emptied the kitchen from everything I had bought the same day).\nM had long, black hair that was EVERYWHERE. All over the sink, the floor, the bath tub. I'm no cleanfreak but I think anyone could understand that this isn't the nicest thing to step in or see everywhere in your house, She also left her fingernails and toe nails on the bathroom floor. It was also pee drops on the toilet seat every time she had been to the toilet.\nI saw a silverfish on my bathroom floor (never ever seen one before), and they eat hair and skin and nails, so I figured this fella probably enjoyed life because of the new dirty condition my bahtroom was in.\nAt first I didn't wanna say it straigh out cause I thought it would hurt her and I didn't wanna make her uncomfortable,, so I just put a broom and shovel in the bathroom to imply that we needed to sweep the floor more often. This didn't seem to work so after a while I told her in the nicest way possible with a smile on my face \"do you think we could try to clean the floor in the bathroom more often? We tend to lose some hair when we brush it and I'm afraid we may get pests, I saw a silverfish the other day and I don't want it to get worse\". I always made sure to say \"we\" instead of \"you\" so she wouldn't feel attacked.\nShe promised to think about it but nothing changed.\nI started dating a guy and was head over heels for him. He was also in a roommate situation so we had a tough time getting any alone time. I asked M if there's any chance that we could get ONE night to ourselves every now and then in the apartment, and that she of course would get the apartment to herself aswell. She didn't like the idea and claimed that she had nowhere to go, no friends or family. Now I wasn't asking her to leave for 24 hours, just a few hours so we could just get some quality time together. She could just go to the library or take a walk or whatever. I was at work for 8-10 hours 5 days a week so she got a lot herself.\nOne of our old coworkers realized that this was really tearing at my mood, to never get any time for myself, and I started feeling really suffocated. She offered that M could stay the night at her place. After all they were friends too. M said she didn't want to \"bother her\" but we told her that she didn't, they're friends, she's more than welcome, and I really just want one night to myself and my guy. I didn't understand why she made such a big deal over leaving me and the apartment for just one night. She eventually accepted and spent the night there, and I spent the night away the next week so she could get more alone time too.\nWhen I came home the next morning from my night away I saw that my cats water bowl was completely dried out. There was no spill on the floor, and it looked like it had been whiped out with a towel or paper. I had filled it to the brim just the night before. I asked her how this was possible and she said that the cats must have tipped it out, but there was nothing on the floor like I said.\nMy cats are overly social and usually cuddle up with strangers after just a few minutes. I noticed that the cats withdrew from her more and more over time, and the last couple of weeks they never left my bedroom except from when they ate or used the litterbox. It seemed like they were scared of her which I couldn't figure out since she was so timid.\nI had this old saucepan from the 60s that meant a lot to me. You probably wonder how a saucepan can mean a lot to someone, but it was my grandmothers and it's the only thing I have that belongs to her. My mother used to cook for me with it when I was little so it has a great nostalgic value to me.\nShe burnt it one day and made no attempt to clean it, she just left it on the stove and went out to smoke. I found it ruined and cried. She didn't even say I'm sorry. She also broke dishes several times and didn't bother to replace them or apologize. This added to my frustration with her naturally.\nIt had been probably gone 2 months now and she kept waking me up at night, kept binge eating my food, never cleaned, never left the house, scared my cats and ruined my things.\nI realized she stole my prescripted sleeping pills. Lots of them aswell. And I only get 1 per night, not more or less. And as you already know I really need them.  I had 20 of them in nightstand when I left for work, and when I came home they were gone. She denied which is pretty hilarious since no one else could have been there.\nMy frustration was getting heavy. The summer heat was strong and I felt locked up in my tiny bedroom with my two cats, never getting any time to myself, never any alone time with the guy I was dating except for once every 14th day, my apartment was messy and she was stealing from me etc.\nOut of nowhere my old elementary school classmate texted me on Facebook asking me how i know M. He had seen that I had posted on facebook that we were roommates now.  I told him that we were old coworkers and that she needed a place to stay cause she got a evicted.\nHe said \"I know. Do you know why she was evicted?\"\n\"Yeah she accidently went into her neighbors apartment\"\nHe said\n\"That's not the full story. She broke in, and snuck up to their sleeping baby with a knife in her hand, but luckily the father woke up and wrestled her down and managed to save the  baby\".\nI felt sick to my stomach. Could this be true? It would certainly explaind why she was evicted, but it just sounded so horrible and she is such a timid, nice girl, I had so many questions. But my friend had the full police report, apparently the couple that M had broken into was his ex girlfriend and her family. It seemed that M had a psychosis during the break-in, but those parts weren't public. It was however clear to me that she had been lying to me about what had happened, and about how long she had been mentally stable.\nI started getting quite paranoid now, and I was already frustrated with everything, and really wanted her to move out. We did however have a contract that she had 30 days notice.\nI knew that if I asked her in a harsh way it would mean 30 days of chaos until she moves out, so I wanted to handle this as nicely as I could. I started looking for cheap hostels for her that I could suggest to her so she wouldn't be on the streets. I sat down with her and told her that I loved living with her and I feel really horrible for this, but I just miss my alone time and that the apartment is too small for two people. I said it wasn't personal, and that I wouldn't wanna live with anyone right now and that I wished it would have worked out and that I am really sorry and hope we will remain friends.\nShe looked crushed and said that it wasn't possible. I showed her the hostel I found and said that I understood that it wasn't the ultimate situation but I really needed her to move out cause I felt suffocated and also the summer heat was making it tough to always have the door to the bedroom closed, and that it was tough for me to not get my sleep etc.\nShe said okay, she was gonna try to move out but not until 30 days had passed and I said of course.\nThe first night after our talk she got up and made her coffee at 2:30 am. I nearly had a mental breakdown. I was gonna get up at 6 and couldnt go back to sleep.\nI asked her in the morning for probably the 10th time to not make coffee til I get up, but she didn't even answer me. She just sat in the sofa and stared out the window. I said \"M?\" and she kept staring. I was freaked out but left for work.\nShe kept being weird, kept making a mess, kept waking me up, kept eating my food. And all I could think about was the incident with her and the baby and the knife.\nI eventually got so pissed off about being woken up by the coffee maker, so I plugged it out and stored it in my attic which she had no access to. It may be childish but I was getting so tired at this moment. My sleeping pills were stolen and I was starting to feel like Edward Norton in the beginning of Fight Club.\nWell the next night I woke up at 4 am by her making coffee in a saucepan (not my grandmothers saucepan, that one was ruined). I tried talking to her again, explaining the situation, but she just stared and didn't reply. Me being frustrated and on the tipping point took the saucepan and stored it in the attic aswell. I know I know, but I was going crazy and just wanted her to stop with these nightly coffee-routines and get the hint!\nThe third night, I had the guy I was dating sleeping at our place cause I was getting really paranoid now over her weird behaviour (not speaking with me, just staring into space). I woke up from my very light snooze by him poking me. He whispered \"look\". In the doorway, M was just standing silently, staring at us. This was like a scene from a horror movie with her long black hair over her face, I kid you not. I didn't say anything at first cause I wanted to know if she just stood there for a second doing something by the door, but I realized after a while that she was actually just standing still staring at us. It reminded me of the ending of Paranormal Activity when Katie just stares at Micah in the final scene.\nSo I sat up and said \"What are you doing?!\", but before I could finished the sentence she just slammed the door shut and I heard the sound of something metal falling on the floor and her running into the living room.\nI yelled out \"You need to LEAVE!\" and started crying hysterically because this was turning into a fucking nightmare.\nOf course I didn't go back to sleep, and I was really happy that I had company that night. I just kept asking myself: Had she done this before? Stared at me in my sleep?\nThe next day when I got out of bed, I opened the door that she had slammed shut and saw a kitchen knife on the floor. So that was the metal sound I had heard before she ran off. I took all my knives and locked in the attic aswell.\nI then asked a friend of mine to come to my house and be here when I tell her that she has to move out immediately, that I can't wait 30 days (27 days).\nDuring the conversation I really tried to stay calm. I know she has a mental illness, I know she means no harm, even though I was so frustrated I couldn't hate her, I was mostly scared and tired. She however didn't even answer when I talked to her, she just kept staring out the window. She left the apartment and sent me a text instead saying that I was disrespectful for bringing a friend over to HER place.\nNight time came and I thought this would be a quiet night finally, no coffee maker or saucepans. But at 3 am I woke up by her burning dry coffee powder in a frying pan. At this moment I just felt terrified of her. Her face was dead, her eyes were black. I suspected that she had gone into a psychosis. I stopped the fire and she just ran off to the living room in silence.\nI knew she had an appointment with her psychiatrist the next day and while she was away I packed all her things. I then sent her a text telling her that she needs to pick them up and give me my keys back, and that I will give her money for a hostel the upcoming 26 days.\nShe didn't reply.\nThe guy I was seeing came to keep me company in case she would fight about it. She didn't. She left the keys without looking at us, and left.\nOur coworkers who were friends with us both told me that she moved in with a guy that she was dating, and she stayed there for a few weeks til she somehow amazingly got an apartment of her own.\nShe started working again and I was really happy to hear this. She seemed to do well. Then in January of this year, one of our old coworkers told me that M had called her and told her that everything must burn, that she has a baby that she must save, and other dellusional stuff. She had called 112 (Swedish emergency number, like 911) about this but they hadn't taken it seriously.\nM had then proceeded to burn her entire apartment down cause the voices in her head was telling her that she has to burn everything to save her friends and family.\nHer neighbors had tried to rescue her from the fire but she had fought them off and ran back in and poured liquor on the fire to make it burn more.\nShe was arrested and sentenced last week for aggravated arson.\nhttps://lokalpressen.eu/lerum/grov-mordbrand-i-floda\nShe will serve her time in a mental institution/prison for a long time, possibly forever. What's ironic is that she will probably be in the facility where I used to work, and end up where she used to work herself.\nMy old coworker was a witness at the trial and apparently she had stopped taken her medication (Abilify) because she thought that it made her feel numb, and she thought she was stable enough to function without it. Apparently not.\nShe had also stopped taking her medication the last few weeks when she stayed at my house. So when she stared blankly into space, she was going into psychosis. When she stared at me with the knife in her hand. When she burnet the frying pan that last night.\nIt's disturbing to think about what would have happened to me and my cats if she would have stayed, or if I would have been a heavy sleeper. I also think about what would have happened to that baby that she snuck into before she was evicted.\nAnd yeah, I know it's crazy that I didn't just throw her out by then. It was complicated.\nThe reason why I haven't been able to talk about it with my friends is cause they sympathize with her and have minimized my experience, and they think that I make a bigger deal out if it than I believe it has been. I sort of understand it since they have never seen that darkness in her eyes that I saw those last couple of days.\nUpdate May 16th:\nI just remembered some other things that I wanted to add to the post.\nThere were several times when I was going to work early in the morning, that she occupied the bathroom by taking long baths. I patiently tried to wait til last minute before knocking and asking her if she could get up and get back in after I had gotten ready and left for work. Just another thing that added to my frustration.\nI fell really ill one time when she was staying here. I didn’t know at the time what it was, but I woke up early in the morning one day feeling very nauseated. On my way to the bathroom I literally sht myself and threw up at the same time. It takes like 10 seconds to get to the bathroom so you can imagine how bad it was when I didn’t even make it lmao.\nI had a really high fever and kept throwing up and shtting myself all morning and anyone who has been this ill would understand that you want the bathroom to yourself! Actually, I think it’s pretty understandable that you’d want to be completely alone when you are this ill. My head was spinning and I was nearly hallucinating from the high fevers.\n(One random thing I laugh about today is that it was Eurovision week and for some reason the flute solo from Moldovas song was stuck on repeat in my head while I was in and out of fever dreams, I have a hard time listening to it today haha)\nAnyway working in health care I also have a natural instinct of not wanting to spread infections so my first thought was that besides wanting to be alone, I didn’t want to risk giving whatever this was to M. So I begged her the moment I noticed I was ill to please leave for her own sake. I could barely speak because it made me throw up that easily. Our friend in common had asked her to water her plants that week so she had the keys to her place and could have been alone there!\nM REFUSED to leave and I swear if I had the energy to slip out of the window and fall to my death I would have, but I couldn’t.\nI was halfsitting/halflaying on the toilet with a bucket in my lap, my head sort of resting in the bucket of puke cause I couldnt hold it up of the high fever, and I just begged through whispers for her to leave so she wouldn’t be ill too. \nI told her ”what if you get sick soon too, we can’t share the toilet, I will be here all day, you should go to her place before it’s too late, please”.\nEventually she left. PISSED at me.\nIt turned out I had a severe case of food poisoning and I was well again after 2 days but my god the fact that she refused to leave is something I felt I had to add to the story cause it made me so frustrates too.\nI also whent through our conversations and saw me asking her how long the door had been closed. That reminded the that she used to shut my cats inside my bedroom while I was away at work or wherever. So they couldn’t eat, drink or use the litterboxes. She claimed she just recently closed it cause she was trying to sleep but I remember she did it in the middle of the day one time the last few days too.", "media": null, "score": 1563, "upvote_ratio": 0.98, "comment_count": 120, "over_18": true}, "13": {"id": "1cnxx0u", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "antoni_coin", "link_flair_text": null, "time": 1716165502.4973319, "created_utc": 1715263010.0, "url": "https://www.reddit.com/r/threekings/comments/1cnxx0u/pool_game/", "title": "Pool Game", "permalink": "/r/threekings/comments/1cnxx0u/pool_game/", "selftext": "This game was played by me and it is not that funny and laughing so after all. As always, Play at your own risk\nRequirements\nA living room.\nA Mirror.\nA Plush. ( The one that was left out and you didnt want it)\nA small kiddy pool, so it can fit in the room.\nA TV.\nA blanket.\nA red bath bomb, or a red sauce.\nPhone in your hiding place\nNow let's begin.\nEmpty the living room before 12:00 AM. Clean the sofa, put the tv on static mode, and make sure theres no pets or partners in the house. Now, bring the pool in the living room, and fill it with water. After doing that, put the mirror underwater and place the plush on it. Cover the pool with the blanket.\nIf it's 11:50 AM, wait 10 minutes.\nIf any other, wait longer. \nIf 12:00 AM hits, halfly open the blanket and fill the pool with red water using the sauce or the bath bomb. After it's fully red, place the blanket back and chant: \" The two, the two. I have prepared your requirements, come for a visit. \" 16 times. If you hear a slight step noise, they're here. If you dont hear anything move a bit away from the pool and do the chanting again. Now, when you hear the noise, close your eyes tightly, put your head a bit, but make sure not to make the blanket fall, on the blanket and think of your wish ( must not break laws of physics like flying, transforming and smth like that ) Do not stand up. Do not turn around. If you hear anything, stand up very slowly and quietly and hide under a table, bed, or anything safe. The two is now going to the pool to hear your words from the plush. They will see if you're worthy from the mirror's expections. And the water will grant you the wish. If they do think your worthy, take your prepared phone and watch the hour. After 02:00 AM, they will search for you. do not come out. Sleep like you normally do, but in your hiding place. Do not think about them. That will allow the two into the gate of your dreams or nightmares. When waking up, it shall be daylight. Take off the blanket, burn the plush to ashes, and break the mirror. Any weapons allowed. The water shall be gone and your wish shall be there. \nGood luck.", "media": null, "score": 6, "upvote_ratio": 0.88, "comment_count": 8, "over_18": false}, "14": {"id": "1cu0gr9", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Key-Suspect6647", "link_flair_text": "Captured Apparition ", "time": 1716165503.1795857, "created_utc": 1715935687.0, "url": "https://i.redd.it/z999ckbs9y0d1.jpeg", "title": "A ghost was caught on camera at my boss's house where her son passed away.", "permalink": "/r/Ghosts/comments/1cu0gr9/a_ghost_was_caught_on_camera_at_my_bosss_house/", "selftext": "She said he would lay back on her bed with his feet hanging off the front of the bed.", "media": null, "score": 579, "upvote_ratio": 0.73, "comment_count": 172, "over_18": false}, "15": {"id": "1cvct6t", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "throwaway8642557", "link_flair_text": "Glitch Pic", "time": 1716165503.5019994, "created_utc": 1716082444.0, "url": "https://i.redd.it/3cf35bg4ea1d1.jpeg", "title": "New here. Alarmed. This just fell out of my ice maker at 9pm. I do not play golf, nobody I know plays golf, and I’ve had this fridge for 12 years. Sorry if this isn’t allowed.", "permalink": "/r/GlitchInTheMatrix/comments/1cvct6t/new_here_alarmed_this_just_fell_out_of_my_ice/", "selftext": "", "media": null, "score": 1602, "upvote_ratio": 0.95, "comment_count": 305, "over_18": false}, "16": {"id": "1ct6ur4", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "thehumanbean_", "link_flair_text": null, "time": 1716165505.136909, "created_utc": 1715842349.0, "url": "https://x.com/rogueuaptf/status/1790956307647693173?s=46", "title": "RougeUAPTF tweets out that the threat against Lue is real and that there is an active plan to KILL whistleblowers  ", "permalink": "/r/ufo/comments/1ct6ur4/rougeuaptf_tweets_out_that_the_threat_against_lue/", "selftext": "", "media": null, "score": 174, "upvote_ratio": 0.87, "comment_count": 77, "over_18": false}, "17": {"id": "1ctno43", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "News", "time": 1716165506.724184, "created_utc": 1715892975.0, "url": "https://www.foxnews.com/us/congressman-moves-declassify-ufo-docs-you-got-nothing-hide-release-files", "title": "New UFO bill introduced by Tim Burchett: The U.S. government would have 270 days to release all UFO-related documents to the public if passed. \"If you got nothing to hide, release the files\". \"It's simple. They spend all this time telling us they don't exist, then release the files, dagnabbit\"", "permalink": "/r/UFOs/comments/1ctno43/new_ufo_bill_introduced_by_tim_burchett_the_us/", "selftext": "", "media": null, "score": 3034, "upvote_ratio": 0.91, "comment_count": 248, "over_18": false}, "18": {"id": "1csd2j9", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "JosephBrown2000", "link_flair_text": "Discussion :table:", "time": 1716165508.4765298, "created_utc": 1715749868.0, "url": "https://v.redd.it/kbgpmf7kw93b1", "title": "Former NASA Employee: \"We have a lot of high-resolution photos of UFOs or Alien Spaceships and I can testify before Congress.\" - Disclosure Project 2001", "permalink": "/r/aliens/comments/1csd2j9/former_nasa_employee_we_have_a_lot_of/", "selftext": "", "media": null, "score": 915, "upvote_ratio": 0.95, "comment_count": 164, "over_18": false}, "19": {"id": "1cu9e19", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "stoppmingyourtits", "link_flair_text": null, "time": 1716165508.8986123, "created_utc": 1715962768.0, "url": "https://i.redd.it/f62jcxxkmt0d1.png", "title": "Do UFO Sightings Happen Near Airports? Best Locations and Times to Spot a UFO. [OC]", "permalink": "/r/UAP/comments/1cu9e19/do_ufo_sightings_happen_near_airports_best/", "selftext": "", "media": null, "score": 39, "upvote_ratio": 0.9, "comment_count": 11, "over_18": false}, "20": {"id": "1cr593p", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "2201992", "link_flair_text": null, "time": 1716165510.2420244, "created_utc": 1715621841.0, "url": "https://i.redd.it/k5wfh98kc80d1.jpeg", "title": "Hunters Laptop is real to. ", "permalink": "/r/conspiracy/comments/1cr593p/hunters_laptop_is_real_to/", "selftext": "", "media": null, "score": 2305, "upvote_ratio": 0.73, "comment_count": 557, "over_18": false}, "21": {"id": "1cvwnu9", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1716165510.4449437, "created_utc": 1716148191.0, "url": "https://www.youtube.com/watch?v=9wByM6uQUA4", "title": "Clear UFO video footage, Huge object photographed by passengers on a commercial airliner.", "permalink": "/r/conspiracyfact/comments/1cvwnu9/clear_ufo_video_footage_huge_object_photographed/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Clear UFO video footage, Huge object photographed by passengers on a commercial airliner.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/9wByM6uQUA4?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Clear UFO video footage, Huge object photographed by passengers on a commercial airliner.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/9wByM6uQUA4/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 1, "upvote_ratio": 0.67, "comment_count": 0, "over_18": false}, "22": {"id": "1cv6jn7", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Billythemeiduim1956", "link_flair_text": "humor", "time": 1716165511.2165058, "created_utc": 1716064280.0, "url": "https://i.redd.it/0j21cwp5w81d1.jpeg", "title": "Xoxo to all of the beautiful big foot believers. ", "permalink": "/r/bigfoot/comments/1cv6jn7/xoxo_to_all_of_the_beautiful_big_foot_believers/", "selftext": "How old does big foot live till?\nHow tall are they? \nAre they loyal? \nAll the things that go through my brain. ", "media": null, "score": 435, "upvote_ratio": 0.97, "comment_count": 16, "over_18": false}, "23": {"id": "1csrr5n", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Shwinty", "link_flair_text": "Hoax", "time": 1716165512.6242387, "created_utc": 1715797174.0, "url": "https://i.redd.it/is6oinywtm0d1.png", "title": "Thylacine photos likely faked, jaw photo matches this known artist's newly made doll ", "permalink": "/r/Cryptozoology/comments/1csrr5n/thylacine_photos_likely_faked_jaw_photo_matches/", "selftext": "Sorry to be a part pooper but it's just too much of a coincidence for me ", "media": null, "score": 602, "upvote_ratio": 0.93, "comment_count": 124, "over_18": false}, "24": {"id": "1crqxod", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Vivid_Plastic_741", "link_flair_text": "Humanoid", "time": 1716165513.0295405, "created_utc": 1715689758.0, "url": "https://www.reddit.com/gallery/1crqxod", "title": "Strange Humanoid Encounter, Udine, Italy, 1978.", "permalink": "/r/Humanoidencounters/comments/1crqxod/strange_humanoid_encounter_udine_italy_1978/", "selftext": "Location: Cesariis di Lusevera, Udine, Italy.\nDate: End of March/Beginning of April, 1978.\nTime: 22:30-23:00 P.M.\nOn a clear evening between the end of March and the first days of April around 1030pm – 11pm, the witness, Mr. Gianfranco Marocchi, at the time a civil servant in a large company, was driving on the road that goes from Tarcento to Mount Bernadi. He was accompanied by his fourteen year old son and he intent was in going to a location with a certain altitude in order to perform a DX (communication between CB radios) easily. That evening as they passed through the locality of Cesariis di Lusevera they had just been talking about the recent appearances of strange lights in the area, which had occurred a few days earlier when approaching a sharp bend, they saw something bright in the sky. It was a globular type light that was initially intense white in color. Then it gradually became orange, then reddish and brighter. As it got closer it grew in size and descended until it disappeared behind a nearby hill – it seemed ot have landed about four hundred meters from them.\nAmazed, and no doubt curious, Mr. Marocchi stopped his car on the side of the road and went out with his son. Alone, he then prepared to climb the slope which led to the top of the hill where a plateau stretched. As he walked, he saw in front of him something luminous which apparently appeared to be a formless light, advancing towards it, he noticed that it was in fact a very tall being, about two meters in height, with imposing wide shoulders, and wearing a luminous suit. This suit was made of a shiny silver combination comparable to ‘medieval armor’ but lighter and more sparkling in appearance. The witness said that it looked like a wide-mesh grid, like intertwined wire. His impression was that the fabric transmitted light by itself instead of reflecting it (as the only light source in the surroundings was far away, behind the entity and not in front of it). The shit had no folds and appeared to be assembled in pieces and it was connected to a helmet by a sort ring. The helmet was also luminous but not transparent so that he could not see either the head or its facial features. The shoes, which the witness had difficulty in remembering, seemed to be nothing special, perhaps they were part of the suit. He took a better look at the hands, which were covered in silver-white gloves, and as we shall see, they will play an important role in the story.\nThe being advanced in a rather upright position, with an automaton like gait, with a slow and heavy step and it did not bend its knees much as humans do. As they approached each other, Mr. Marocchi instinctively raised his arm (much smaller than the being’s) and held out his hand to greet the being. It was at this moment that something particularly bizarre happened to him. He thought someone was sending images of visions into his brain because he could see some sort of classic spaceship in the shape of a hat with a very bright section on the top that varied from orange to blue, and blue around the edges. From the lower section of the object came out solid beams of light which apparently served to transport its occupants in and out. He thought  that the object used light as a form of ‘energy.’ All of this lasted a short time. Now facing each other, their right hands almost came to touch and it was then that the event occurred which had serious consequences for the witness.\nFrom the gloved hand of the being (covered in a smooth fabric) escaped white color sparks blue around the edges. These sparks were numerous and seemed to attract the hand of Gianfranco who became frightened. Noticing that his right hand seemed to light up in turn, he grabbed the alien’s left hand in order to detach himself from it. The being took a few steps back, turned and walked away. At the same time, Marocchi quickly went back to the car where his son had been waiting for him and from where he had witnessed a large part of the events. Once back in his vehicle, Mr. Marocchi was about to start the engine when he noticed beyond the hill that the luminosity had increased, illuminating the whole area. The UFO then rose rapidly, paused for a moment, and set off again, in the direction from which it had come, or northeast. \nAt this moment, the witness looked at his hands and was horrified. Both of the palms looked mottled. The skin was peeling off and the flesh was an ‘impressive’ purplish red color. Until then he hadn’t felt any pain, but later awoke in the middle of the night feeling extreme pain. Despite the creams and remedies, these pains persisted and the wounds did not heal. He didn’t tell anyone what had happened to him. Not even his doctor, for fear that he would not be believed, or worse that they would make fun of him. \nAfter about a week a postman rang at his house, it was a much taller man, not the usual postman. He made him sign a receipt and delivered a small anonymous package. The latter was provided with the normal strings and seals but there was no stamp or sender’s address. Inside he found a small box containing an ointment and a handwritten note detailing the dosage. There was even advice on how to destroy any excess cream. The medicine proved to be very effective, and after two or three days the wounds began to heal and the skin to grow back. The unused ointment the witness said, he threw away. At the time it seemed like the best thing to do. During that time he also received a visit from two strange characters who arrived on board a black Jeep, they were dressed in black, tall and very similar to each other. In fact Marocchi said that they were almost ‘photocopies’ of each other. After ringing the bell, they told his wife that they wanted to talk to him about what had happened. Marocchi refused, but was surprised that someone could have been made aware of the episode. Who? And How?. Later at other times he noticed that he was being followed by mysterious tall men dressed in black. He frequently suffered from nightmares at night, and in his half-sleep he believed he was receiving messages directly in his mind which told him that the extraterrestrials would come again to give him proof that what he had experienced was real and not the fruit of his imagination.\nSource: Richard Hall, Mufon Journal # 153, Professor Antonio Chiumiento, “Extraterrestrials: 60 witnesses” pp. 76-79.\nThe Source of the Humanoid Sketch is from UFO e Alieni in Italia. (Moreno Tambellini).", "media": null, "score": 116, "upvote_ratio": 0.98, "comment_count": 7, "over_18": false}, "25": {"id": "1csm1g9", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Direct_Web_7582", "link_flair_text": null, "time": 1716165514.2326338, "created_utc": 1715782953.0, "url": "https://i.redd.it/fht3pimmnl0d1.jpeg", "title": "What’s this thing in the photo?", "permalink": "/r/cryptids/comments/1csm1g9/whats_this_thing_in_the_photo/", "selftext": "", "media": null, "score": 176, "upvote_ratio": 0.9, "comment_count": 61, "over_18": false}, "26": {"id": "1cvwzry", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "idontknowrn4", "link_flair_text": null, "time": 1716165514.4154167, "created_utc": 1716149051.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1cvwzry/weird_encounter_from_years_ago/", "title": "weird encounter from years ago", "permalink": "/r/Thetruthishere/comments/1cvwzry/weird_encounter_from_years_ago/", "selftext": "a couple years ago, my dad told me this strange story.\nfirst, let me explain my second flood layout. my room is right across from my parents. adjacent to my room is the guest room, which no one was stay at. in the middle of the hallway from my parents and my room is the bathroom.\none night, my dad started hearing creaking, as if someone was walking in the hallway (our floors are extremely creaky.) he heard the footsteps getting slowly to his door, thinking id knock on the door asking for something, he stayed up waiting for my knock. about 5 minutes passed, he didn't hear the footsteps leaving from outside of his door. wondering why i was standing outside his room, he woke up my mom and opened the door, checking up on who (or what) was standing outside the door. surprisingly, no one was there. thinking maybe i was sleepwalking (which has never happened before), he checked up on me. opening my bedroom door, i was dead asleep.\nthis has been stuck in my head for awhile. ever since my parents told me about this i couldn't get it off my mind. sure, maybe you can bring it down to the house being old. it was built in 1988, im not sure if that's extremely old for houses. thanks for letting me get this off my chest.", "media": null, "score": 10, "upvote_ratio": 0.92, "comment_count": 6, "over_18": false}, "27": {"id": "1cvh5b1", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "RagingCUNextTuesday", "link_flair_text": null, "time": 1716165514.8967693, "created_utc": 1716097343.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1cvh5b1/a_man_was_caught_on_my_sleep_recording_app_at_357/", "title": "A man was caught on my sleep recording app at 3:57 AM", "permalink": "/r/LetsNotMeet/comments/1cvh5b1/a_man_was_caught_on_my_sleep_recording_app_at_357/", "selftext": "I hope this belongs here. This happened about 5ish (actually 7ish, I'm stupid and realized the recording is time stamped lol) years ago. I can also provide the sleep recording if allowed.\nI was spending the night at my friend's house with another friend. It was summer so we slept with the window wide open, and she didn't have a screen on her window. We were in a safe area though, so we didn't think anything of it. I slept right next to the window, with my phone on the window sill. I used a sleep recording app on my phone because I was known to talk in my sleep, and it was amusing to hear what I'd say. Also important to note, we were completely home alone that night.\nThis time, however, my phone recording caught a man's voice. The first thing sounds like a grunt (her window was high up, but not second story high- her house was on kind of a slope). Then we heard a man say \"Up, hello!\" in a loud, almost cheery voice? And then at the end of the recording you could hear the man whisper \"oh God, something is wrong\". \nThank the heavens nothing happened that night. We weren't sure who the hell it could've been. It sounded like a full grown man, and as mentioned, no one was home. I never slept over at her house after that (which I felt bad for because she was absolutely petrified to sleep in her room again). She also never slept with her window open again. We don't know if he was trying to break in, if maybe he thought it was a buddies house but then saw 3 teenage girls all cuddling/sleeping together. I'm not sure but I still get goosebumps listening to that recording. I still don't sleep with my windows open, and I live nowhere near her now.\nMods, please let me know if I can link a video of the recording. I just remembered it recently, found the video, and god does it gives me chills. I'd also like validation that I'm not crazy and he is actually saying \"oh God something is wrong\" at the end. My friends (from that night) agree that's what he says at the end, but my boyfriend says he doesn't hear it. Please lmk!", "media": null, "score": 403, "upvote_ratio": 0.97, "comment_count": 57, "over_18": true}, "28": {"id": "1cs0mhv", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "TheNightPages", "link_flair_text": "Personal Encounter ", "time": 1716165515.747235, "created_utc": 1715714443.0, "url": "https://www.reddit.com/r/Ghosts/comments/1cs0mhv/atheists_what_have_you_seen_that_you_could_not/", "title": "Atheists, what have you seen that you could not rationally explain?", "permalink": "/r/Ghosts/comments/1cs0mhv/atheists_what_have_you_seen_that_you_could_not/", "selftext": "I was an atheist until my mother died. She died drunk and angry and it was terribly traumatic. A few weeks after she passed we began seeing things move on their own in the house and strange shadows lurking in places they didn't belong. \nI try to remain pretty scientific about what I observe, but I feel like I'd be close minded and foolish to dismiss these things.\nAny similar stories would be appreciated.", "media": null, "score": 193, "upvote_ratio": 0.88, "comment_count": 179, "over_18": false}, "29": {"id": "1ctlfrx", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "idontbiteoften", "link_flair_text": "Glitch Pic", "time": 1716165516.0418084, "created_utc": 1715887779.0, "url": "https://i.redd.it/r03bhxxbbu0d1.jpeg", "title": "The ice froze... Up and diagonally???", "permalink": "/r/GlitchInTheMatrix/comments/1ctlfrx/the_ice_froze_up_and_diagonally/", "selftext": "", "media": null, "score": 132, "upvote_ratio": 0.95, "comment_count": 16, "over_18": false}, "30": {"id": "1ctwvem", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "nuark12", "link_flair_text": null, "time": 1716165517.5749264, "created_utc": 1715920763.0, "url": "https://i.redd.it/0ndta07d1x0d1.png", "title": "Line of lights/trail seen over moon in 1975 image", "permalink": "/r/ufo/comments/1ctwvem/line_of_lightstrail_seen_over_moon_in_1975_image/", "selftext": "", "media": null, "score": 167, "upvote_ratio": 0.84, "comment_count": 82, "over_18": false}, "31": {"id": "1ct05y0", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "8ran60n", "link_flair_text": "Podcast", "time": 1716165518.9318197, "created_utc": 1715819123.0, "url": "https://www.reddit.com/gallery/1ct05y0", "title": "Lue Elizondo’s statement from the Good Trouble Show", "permalink": "/r/UFOs/comments/1ct05y0/lue_elizondos_statement_from_the_good_trouble_show/", "selftext": "Lue’s statement… \n\"WHEN PEOPLE FIRST INQUIRED ABOUT MY STORY, THE PENTAGON INITIALLY CONFIRMED MY ROLE IN AATIP AND THE FOCUS OF ITS EFFORTS. SHORTLY AFTER SECRETARY MATTIS LEFT THE DEPARTMENT, THE PENTAGON CHANGED ITS TUNE BY SAYING ALL MY EMAILS HAD BEEN DELETED- THE SAME\nEMAILS THAT WOULD SUBSTANTIATE NOT ONLY MY CLAIMS\nBUT MANY OF THOSE WHO WERE PART OF THE AATIP EFFORT, INCLUDING ONE OF ITS SPONSORS, THE LATE SENATOR HARRY REID.\"\n\"LATER, WHEN CONFRONTED WITH A FOIA REQUEST, THE PENTAGON DENIED AGAIN THE EXISTENCE OF ANY E-MAIL OR CORRESPONDENCE BETWEEN ME AND OTHER\nSENIORS WITHIN THE DEPARTMENT WHOM I WAS REGULARLY ENGAGED WITH UNTIL\nTHE DAY I LEFT THE PENTAGON IN 2017. RECENTLY, ONE OF MY E-MAILS WAS LEAKED BY AN UNKNOWN PERSON ON REDDIT. THIS TIME, WHEN THE PENTAGON WAS CHALLENGED WITH THE EXISTENCE OF THE E-MAIL, IN THIS CASE, ONE THAT DESCRIBED THE AUTHORIZED TRANSFER OF AATIP LEADERSHIP RESPONSIBILITIES\nTO ANOTHER SENIOR MEMBER OF THE DEPARTMENT AND ENDORSED BY THE\nSECRETARY OF DEFENSE FRONT OFFICE, THEY WERE FORCED TO ADMIT THIS E-MAIL EXISTED AND WAS NOT DELETED AS THEY PREVIOUSLY CLAIMED. BEGRUDGINGLY, WHEN THE PENTAGON FINALLY DID RELEASE THE E-MAIL, PROVING MY ROLE AND PARTICIPATION IN AATIP, THE PENTAGON DECIDED TO REDACT THE MENTION OF AATIP, CITING FOIA EXEMPTIONS! BY THIS LOGIC, THEY WOULD ALSO HAVE TO REDACT THE NAME AARO AND ANY OTHER OFFICE AT THE PENTAGON.\"\n\"IT SHOULD ALSO BE NOTED THAT THE PENTAGON'S MOUTHPIECE FOR THIS IS ONE\nINDIVIDUAL WITHIN THE PUBLIC AFFAIRS OFFICE WHO HAS BEEN GIVEN SOLE\nAUTHORITY TO HANDLE ALL FOIA REQUESTS INVOLVING UPS, AARO, AATIP, AND SPECIFICALLY, ME. ALL THIS INFORMATION IS IN THE PUBLIC SPHERE AND CAN BE EASILY VERIFIED THANKS TO THE WORKS OF CERTAIN PRIVATE CITIZENS FIGHTING FOR INCREASED GOVERNMENT TRANSPARENCY THROUGH THE FOIA PROCESS.\nSIMPLY PUT, YOU AND CONGRESS CONTINUED TO BE LIED TO BY A FEW AT THE PENTAGON WHO PREFER TO VIEW YOU AND THE AMERICAN PEOPLE AS \"SHEEPLE\".\nMAKE NO MISTAKE, THE PENTAGON PUBLIC AFFAIRS OFFICE HAS A LONG HISTORY OF FEEDING MISINFORMATION TO CERTAIN QUESTIONABLE JOURNALISTS TO\nMISLEAD THE AMERICAN PUBLIC, AND THAT RELATIONSHIP IS ALIVE AND WELL TODAY AND IS IN FACT NOW LEGAL THROUGH A NEW AND DISTURBING POLICY OF\n\"PERCEPTION MANAGEMENT\"\n\"TO ADD INSULT TO INJURY, I WAS NOTIFIED YESTERDAY THAT THERE MAY BE A PERSONAL THREAT AGAINST MYSELF, AND SEVERAL OTHER WHISTLEBLOWERS FORMERLY ASSOCIATED WITH THE UP EFFORT FOR\nTHE U.S. GOVERNMENT. AS SUCH, I WOULD LIKE TO MAKE THIS PERFECTLY CLEAR TO THE AMERICAN PEOPLE: I AM NOT PRONE TO\nACCIDENTS! I AM NOT SUICIDAL! I AM NOT ABUSING DRUGS! I AM NOT\nENGAGED IN ANY ILLICIT ACTIVITIES. IF SOMETHING HAPPENS TO ME OR MY FAMILY MEMBERS IN THE FUTURE, YOU WILL KNOW WHAT HAPPENED!\"\nLUE ELIZONDO\nFORMER DIRECTOR\nPENTAGON'S ADVANCED AEROSPACE THREAT IDENTIFICATION PROGRAM", "media": null, "score": 2416, "upvote_ratio": 0.9, "comment_count": 661, "over_18": false}, "32": {"id": "1cshfln", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "zubairlatifbhatti", "link_flair_text": "Discussion :table:", "time": 1716165520.6741939, "created_utc": 1715768602.0, "url": "https://www.shiningscience.com/2024/05/dozens-of-stars-show-signs-of-hosting.html", "title": "Dozens of stars show signs of hosting advanced alien civilisations", "permalink": "/r/aliens/comments/1cshfln/dozens_of_stars_show_signs_of_hosting_advanced/", "selftext": "", "media": null, "score": 785, "upvote_ratio": 0.93, "comment_count": 219, "over_18": false}, "33": {"id": "1cqz6h2", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "disclosurediaries", "link_flair_text": null, "time": 1716165521.1639507, "created_utc": 1715606530.0, "url": "https://www.reddit.com/r/UAP/comments/1cqz6h2/all_the_relevant_uap_updates_from_may_612/", "title": "All the relevant UAP updates from May 6-12", "permalink": "/r/UAP/comments/1cqz6h2/all_the_relevant_uap_updates_from_may_612/", "selftext": "This past week in Disclosure:\nMay 6 – Rep. Grothman reveals he hasn't been approached regarding plans for an upcoming hearing on UAP/USOs\nRep. Glenn Grothman – Chair, House Oversight National Security, the Border, & Foreign Affairs Subcommittee – seemed to be unaware of Rep. Luna/Burchett's intention to host a public hearing on UAP (with a specific focus on USO, i.e. Unidentified Submerged Objects).\n\nMay 7 – HASC Chair Mike Rogers denies gutting the Schumer-Rounds UAP amendment\nSpeaking with Askapol, Rep. Rogers (who some commentators blamed for the watering down of the UAP amendment language in late 2023) denied these allegations.\n\nMay 9 – the Hill publishes an article covering Senatorial interest in the UAP topic\nAn opinion piece on the Hill covers the efforts various top Senators have made to investigate purported UAP crash retrieval/reverse engineering programs since 2011.\nThe Senators include former fighter pilot and famed astronaut John Glenn (D-Ohio); Ted Stevens (R-Alaska), who observed a UFO as a World War II pilot; Daniel Inouye (D-Hawaii), then-chairman of the Senate Appropriations Subcommittee on Defense; 2008 GOP presidential nominee Sen. John McCain (R-Ariz.); Senate Intelligence Vice Chairman Marco Rubio (R-Fla.); Kirsten Gillibrand (D-N.Y.) and Joe Lieberman (D-Conn.).\nMay 9 – Rep. Burchett indicates plenty of work on the UAP topic is still going on behind the scenes\nIn a post from James Fox, Rep. Burchett confirmed that \"we will be having some more [UAP-related] hearings, and we will be getting some more stuff out\".\nMay 10 – Ross Coulthart indicates the ICIG investigation into David Grusch is still ongoing\nIn his most recent podcast appearance, Ross Coulthart claims an active ICIG investigation into David Grusch's UAP-related allegations is still underway. Some of Grusch's \"informant base\" have allegedly recently been questioned by the IC Inspector General.\nMay 11 – AARO confirms it has yet to receive information on ‘Drone’ incursions over Langley Air Force Base\nAs covered in the latest article from the Liberation Times, a spokesman from AARO (the Pentagon's UFO office) stated that the office \"has not yet received a report or any information on this incident.\"\nThe incident in question involved mysterious 'drone' swarms that harangued Langley Air Force Base throughout December 2023.\n\nNone of the incursions appeared to exhibit hostile intent but anything flying in our restricted airspace can pose a threat to flight safety. The FAA was made aware of the UAS incursions.\"\nThings to look out for in the near future:\nMay\n\nAccording to Senator Gillibrand – a public hearing in line with AARO's latest report can be expected soon, saying –\"I'll probably have another hearing aligned with that public report.”\n\nBeyond/currently unknown\n\nFollowing the UAP hearing on the 26th of July, Members of Congress have called for a select committee with subpoena authority, to “go about the task of collecting information from the Pentagon and elsewhere” on unidentified flying objects. There have been conflicting messages from various Members of Congress on whether this is likely to happen anytime soon. Note – a select subcommittee was formally requested on March 13th.\nReps. Moskowitz, Luna, and Burchett have repeatedly stated their intent to hold field hearings to overcome stonewalling from the Pentagon and military establishment\"I think we [Congress] should try to get into one of these places [housing UAP evidence]...and if they won't let us in I think we should have a field hearing right outside the building...and the military will have to explain why that is.\" – Rep. Moskowitz (D)It is currently unknown when exactly we might expect that to occur, however as of Jan 12 – Rep. Luna confirmed:\"I feel confident that we have enough evidence to move forward with our first field hearing.    . We will be announcing details soon.\"\nSeveral journalists have indicated that first-hand witnesses of the alleged UAP legacy programs are in the process of providing testimony/evidence to the relevant authorities (e.g. the IC IG) and/or are on the verge of making public statements in the near future (Example 1, example 2, example 3, example 4)\nDavid Grusch has received additional clearances through DOPSR to discuss some of his (alleged) first-hand knowledge of Legacy programs. He has mentioned he may be covering more of this information in an upcoming Op-Ed\nSome commentators have speculated that the architects of the UAPDA (e.g. Sens. Schumer/Rounds et al) are working diligently behind the scenes to continue furthering serious legislative UAP transparency efforts\n\nSkimmed through this post but need a quick refresher on how we got to this point? Check out this handy Disclosure Timeline to get up to speed.\nThis past week in Disclosure:\nMay 6 – Rep. Grothman reveals he hasn't been approached regarding plans for an upcoming hearing on UAP/USOs\nRep. Glenn Grothman – Chair, House Oversight National Security, the Border, & Foreign Affairs Subcommittee – seemed to be unaware of Rep. Luna/Burchett's intention to host a public hearing on UAP (with a specific focus on USO, i.e. Unidentified Submerged Objects).\n\nMay 7 – HASC Chair Mike Rogers denies gutting the Schumer-Rounds UAP amendment\nSpeaking with Askapol, Rep. Rogers (who some commentators blamed for the watering down of the UAP amendment language in late 2023) denied these allegations.\n\nMay 9 – the Hill publishes an article covering Senatorial interest in the UAP topic\nAn opinion piece on the Hill covers the efforts various top Senators have made to investigate purported UAP crash retrieval/reverse engineering programs since 2011.\nThe Senators include former fighter pilot and famed astronaut John Glenn (D-Ohio); Ted Stevens (R-Alaska), who observed a UFO as a World War II pilot; Daniel Inouye (D-Hawaii), then-chairman of the Senate Appropriations Subcommittee on Defense; 2008 GOP presidential nominee Sen. John McCain (R-Ariz.); Senate Intelligence Vice Chairman Marco Rubio (R-Fla.); Kirsten Gillibrand (D-N.Y.) and Joe Lieberman (D-Conn.).\nMay 9 – Rep. Burchett indicates plenty of work on the UAP topic is still going on behind the scenes\nIn a post from James Fox, Rep. Burchett confirmed that \"we will be having some more [UAP-related] hearings, and we will be getting some more stuff out\".\nMay 10 – Ross Coulthart indicates the ICIG investigation into David Grusch is still ongoing\nIn his most recent podcast appearance, Ross Coulthart claims an active ICIG investigation into David Grusch's UAP-related allegations is still underway. Some of Grusch's \"informant base\" have allegedly recently been questioned by the IC Inspector General.\nMay 11 – AARO confirms it has yet to receive information on ‘Drone’ incursions over Langley Air Force Base\nAs covered in the latest article from the Liberation Times, a spokesman from AARO (the Pentagon's UFO office) stated that the office \"has not yet received a report or any information on this incident.\"\nThe incident in question involved mysterious 'drone' swarms that harangued Langley Air Force Base throughout December 2023.\n\nNone of the incursions appeared to exhibit hostile intent but anything flying in our restricted airspace can pose a threat to flight safety. The FAA was made aware of the UAS incursions.\"\nThings to look out for in the near future:\nMay\n\nAccording to Senator Gillibrand – a public hearing in line with AARO's latest report can be expected soon, saying –\"I'll probably have another hearing aligned with that public report.”\n\nBeyond/currently unknown\n\nFollowing the UAP hearing on the 26th of July, Members of Congress have called for a select committee with subpoena authority, to “go about the task of collecting information from the Pentagon and elsewhere” on unidentified flying objects. There have been conflicting messages from various Members of Congress on whether this is likely to happen anytime soon. Note – a select subcommittee was formally requested on March 13th.\nReps. Moskowitz, Luna, and Burchett have repeatedly stated their intent to hold field hearings to overcome stonewalling from the Pentagon and military establishment\"I think we [Congress] should try to get into one of these places [housing UAP evidence]...and if they won't let us in I think we should have a field hearing right outside the building...and the military will have to explain why that is.\" – Rep. Moskowitz (D)It is currently unknown when exactly we might expect that to occur, however as of Jan 12 – Rep. Luna confirmed:\"I feel confident that we have enough evidence to move forward with our first field hearing.    . We will be announcing details soon.\"\nSeveral journalists have indicated that first-hand witnesses of the alleged UAP legacy programs are in the process of providing testimony/evidence to the relevant authorities (e.g. the IC IG) and/or are on the verge of making public statements in the near future (Example 1, example 2, example 3, example 4)\nDavid Grusch has received additional clearances through DOPSR to discuss some of his (alleged) first-hand knowledge of Legacy programs. He has mentioned he may be covering more of this information in an upcoming Op-Ed\nSome commentators have speculated that the architects of the UAPDA (e.g. Sens. Schumer/Rounds et al) are working diligently behind the scenes to continue furthering serious legislative UAP transparency efforts\n", "media": null, "score": 30, "upvote_ratio": 0.98, "comment_count": 1, "over_18": false}, "34": {"id": "1cryshq", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "NEWSONVSU", "link_flair_text": null, "time": 1716165522.5113971, "created_utc": 1715709961.0, "url": "https://i.redd.it/j9gt5f9lmf0d1.jpeg", "title": "King Charles’ Official Portrait. How Demonic can you get?", "permalink": "/r/conspiracy/comments/1cryshq/king_charles_official_portrait_how_demonic_can/", "selftext": "The messaging is clear as day. He walks through the flames, he is the antichrist.", "media": null, "score": 2267, "upvote_ratio": 0.88, "comment_count": 659, "over_18": false}, "35": {"id": "1csusge", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1716165522.7140458, "created_utc": 1715804585.0, "url": "https://www.youtube.com/watch?v=zj-02XBTZEo", "title": "Exciting video footage of military aircraft chasing three UFOs in the Nevada desert.", "permalink": "/r/conspiracyfact/comments/1csusge/exciting_video_footage_of_military_aircraft/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Exciting video footage of military aircraft chasing three UFOs in the Nevada desert.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/zj-02XBTZEo?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Exciting video footage of military aircraft chasing three UFOs in the Nevada desert.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/zj-02XBTZEo/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 1, "upvote_ratio": 0.66, "comment_count": 0, "over_18": false}, "36": {"id": "1cu4q9k", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Ok-Shake9556", "link_flair_text": "what is it?", "time": 1716165523.4844086, "created_utc": 1715951305.0, "url": "https://i.redd.it/jemie4a8kz0d1.png", "title": "Seen this on fb a trailcam pic. ", "permalink": "/r/bigfoot/comments/1cu4q9k/seen_this_on_fb_a_trailcam_pic/", "selftext": "I wouldn't want to find this in the woods looking for mushrooms or something like that. Do y'all think it's real, looks pretty convincing. ", "media": null, "score": 319, "upvote_ratio": 0.78, "comment_count": 160, "over_18": false}, "37": {"id": "1ctj0k2", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Aconite61", "link_flair_text": "Evidence", "time": 1716165524.571512, "created_utc": 1715881869.0, "url": "https://www.discoverwildlife.com/animal-facts/mammals/big-cat-british-countryside", "title": "DNA confirms there IS a big cat roaming the British countryside", "permalink": "/r/Cryptozoology/comments/1ctj0k2/dna_confirms_there_is_a_big_cat_roaming_the/", "selftext": "", "media": null, "score": 578, "upvote_ratio": 0.98, "comment_count": 99, "over_18": false}, "38": {"id": "1cs7ni2", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "oogerooger", "link_flair_text": "X-post", "time": 1716165524.9283772, "created_utc": 1715732612.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1cs7ni2/what_did_i_see_repeated_sightings_interacting/", "title": "What did I see? Repeated sightings, interacting with me more. What is going on!?", "permalink": "/r/Humanoidencounters/comments/1cs7ni2/what_did_i_see_repeated_sightings_interacting/", "selftext": "Location: Boone, IA, USA\nI had some more weird shit happen last night. \nI took my two dogs for walks, I normally walk Fin (large, all black German Shepherd) toward the park where I have had these experiences, and I walk Booger (chi terrier mix) the other direction toward downtown. \nOn my walk with Fin, about a block away in the direction I was headed, I saw 3 or 4 deer calmly walking toward the park.  Most nights where something \"weird\" happens to me start like this. The deer seemed completely unbothered by me as I approached. They kept walking toward the park but stopped every few steps to look back at me, as if they wanted me to follow them. Then, as Fin and I reached where the deer were, I notice about 10 or more other deer waiting as well. They all start walking together, calm, but still looking back at me every few feet.\nOn my way toward the park i smell the stench of rotting meat, I know the smell very well as I used to be a butcher. It was strong. Like someone plugged my nostrils with rotting ground meat or something. At the same time I smell this stench, I get the chills. Fin's hair stands up and he gets more nervous. I can feel the air around me get colder. \nAs we continue walking I look down an alleyway that cuts the block in half and, if you would walk down the dark alley, would spot you out where I eventually walk back home. I was two blocks away from the park, when you reach the park you can either turn around and walk down the same road, you can continue into the park, or you can continue on the road which turns left. Looking down that alleyway you are looking at the part of the road that continues left, which is the way I take every night on my way back home. \nWhat I saw I tried to convince myself wasn't real or maybe I just saw something else and my brain tried to convince me it was this. \nA large, muscular, pale, hairless, creature (?) that was moving fast. So fast I could barely see it, I saw the motion down the alley about two blocks away. The exit of the alley on that side has a street light directly above it, it wasn't standing still, it was moving and it was moving fast. The only reason I'm positive what I saw wasn't deer or something normal is because of something I saw later that night that I will write about when I talk about my walk with Booger. It solidified that what I saw was something I wasn't supposed to see. \nIn the meantime I convinced myself I was making stuff up and being a pussy. \n As we approach the treeline of the park, the large group of deer move to the side of the street where the neighborhood is, while I'm on the side with the treeline. I noticed something in the clearing. A lone deer, separate from the large group across the street, staring directly at me. \nI have my flashlight pointed at him, and I even hung up my call with my wife to use my phone to take video of this moment. \nThis lone deer doesn't even have micro movements from breathing. The other deer across the street were constantly readjusting. \nYou might be thinking to yourself \"oh yeah, deer do that with bright lights shining at them. Deer in headlights always act like that.\" Just wait. \nFin starts to pull very hard and acts anxious, nearly knocking me over, I turn to look across the street towards the large group of deer for at most 3 seconds before quickly turning around to face the lone deer again. \nIn those 3 seconds, that lone deer is easily 30 feet closer to me, still not moving, staring directly at me. I have this on video, I have pictures. I felt weird, I felt unsafe. I've lived in rural Iowa my whole life, I am and have always lived outdoors. This didn't feel normal. I was scared. \nI back away while shining my light at the deer, once I get a block or so away, he finally turns around and calmly walks into the tree line. \nThe whole way home I feel like I'm being stalked, not just watched, but like something is following me. \nHere is a link to that video of the deer getting closer to me: \nhttps://youtube.com/shorts/S1l2FRxKO58?si=Dv8362ajs7DR8UWw\nNow, I went home and sat for a bit and tried to talk myself into believing it was all coincidence. After nearly 20 minutes, I started to walk Booger, my smaller chi mix. \nThe entire walk was nice and very enjoyable actually, I had my earbuds in and was talking to my wife about what I saw in a joking way.\n\"Man I'm such a pussy, I really scared myself for no reason\" I said. \nAt the end of the walk I turn to go down our alleyway, as I leave from the garage on our walks. \nI stop speaking from what I saw on the opposite end of the alley. My wife heard me stop. \nI want to preface this with I did not have any substances, including alcohol, for weeks up to that point. The most I ever do in that department is a few beers or I'll use some weed to ease anxiety if life is getting hard. I have no mental conditions that will cause me to hallucinate, the most I have is a personality disorder resulting from trauma that I've been overcoming quickly this last year. \nI saw two, large, muscular, pale, hairless creatures walking like apes at the end of the alley. The same thing I thought I saw with fin, this time not going fast, much closer, and it felt intentional. I saw them walk across the street very slowly, staring directly at me. \nThese were not deer. \nThey didn't have long faces like deer, they didn't have fur or tails, they didn't walk like deer. They weren't slender like a deer. My first thought was honestly that I was looking at two hairless male lions. In the middle of Iowa. \nI stood there, paralyzed with fear, well after they had left my sight. 15 seconds later, I finally get the courage to walk the few feet into the garage, when I take my first step, I see a third one. Slowly meandering across the street. Staring at me. Booger noticed him too, and started growling. \nI ran to the door and watched the garage shut all the way. \nThe entire night, Fin guarded the bedroom door. He never does that. He sat staring at the door all night. Booger stared at the windows all night. He never does that either. \nThis happened to me yesterday night, Monday, May 13, 2024. \nI don't know what to think. ", "media": null, "score": 100, "upvote_ratio": 0.91, "comment_count": 47, "over_18": false}, "39": {"id": "1cshpti", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "FluffyCost1251", "link_flair_text": null, "time": 1716165525.608531, "created_utc": 1715769707.0, "url": "https://i.redd.it/8nuvutq8kk0d1.jpeg", "title": "Possible Thylacine Found. Compelling pictures taken", "permalink": "/r/cryptids/comments/1cshpti/possible_thylacine_found_compelling_pictures_taken/", "selftext": "Forrest Galante received, what is arguably the best photo evidence that the thylacine is still alive and well in Tasmania.  Link below to the video.  Although not the brightest, I think the kid is telling the truth.   \nhttps://youtu.be/bfSzlgRZ-Xg?si=lLmK4_UlNGuR2pPE", "media": null, "score": 82, "upvote_ratio": 0.79, "comment_count": 34, "over_18": false}, "40": {"id": "1cveb8w", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Flatus_Spatus", "link_flair_text": null, "time": 1716165525.8048964, "created_utc": 1716087259.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1cveb8w/deja_vu/", "title": "deja vu? ", "permalink": "/r/Thetruthishere/comments/1cveb8w/deja_vu/", "selftext": "When i was 13 i once woke up to a really weird dream of my dog biting one of my frinds… \nthe weird thing was not especially my dog biting because he was mistreated by his owner before so we got him. he couldn’t stand man and atack them if they would come near him but, he was fine whit us and a really good boy.\nthe weird part about the dream was, it seemed all so real and i could remember everything in detail… where it happened, when it happened, what clothes people are wearing and stuff.\nso my mom told me a few days later we would go to our garden for a couple of days to relax and work on the garden, nothing special we did that a few times a year\nbut my brother immediately asked if he can bring a friend of us\nwell i told my mother about my dream and that our dog will bite him if he comes but my mom was like “boy you’re crazy, we will leash him you just have something called deja vu don’t worry about it”\ni was okay whit that answer because i trusted my parents in such things so we got to our place a few days later \nevery thing was fine, we enjoyed our trip and i almost forgot about my dream.\nwhen the situation started to happen i realized what’s going to happened.\ni was standing like 20m away from our friend who was walking towards me…\nin the second i realized what’s going to happened i shouted “get out the path jump left!” my dog who was on the leash jumped towards my friend\nthe leash broke and he bit my friend in the arm \nmy mother still to this day is telling me such things like see the future don’t exist and im totally agree whit here but this wasn’t just a deja vu i had them often but here i reacted to it \nsorry for my bad writing but i had to tell it to people because this event was stuck in my head over 20 years now ", "media": null, "score": 3, "upvote_ratio": 0.67, "comment_count": 3, "over_18": false}, "41": {"id": "1cqpm3q", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "No-Pomelo-8413", "link_flair_text": null, "time": 1716165526.2315795, "created_utc": 1715570576.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1cqpm3q/the_date_i_was_too_scared_to_leave_from_tinder/", "title": "the date I was too scared to leave from tinder ", "permalink": "/r/LetsNotMeet/comments/1cqpm3q/the_date_i_was_too_scared_to_leave_from_tinder/", "selftext": "A bunch of years ago , I matched with a guy on tinder. I was a freshman in college and just got out of a relationship and having fun. I matched with this guy (M 24), we can call him Dee. He was a little odd, but we had similar interests and went to the same school so I thought \"why not?\". \nThe red flags started rolling in immediately when I said I would go on a date with him. (Of course the fact that he was much older isn't lost on me as the initial red flag) \nAt this time, I didn't have a car. Dee offers to pick me up , but tells me that he is not in town but he would leave his grandmother's funeral early (which was at a minimum 5 hours away) to come and pick me up. \nHe showed up in sweatpants, a wife beater, and flip-flops which struck me as odd because he said he was coming from a funeral.\nWe hadn't made plans just to get a bite to eat and hang out. Since he had been out of town he asked if it was okay if we stopped to pick up his dog. He had left the dog with a friend. I like dogs so I was like no problem. It's dark and we pull up to an apartment complex and he leaves me in the car and come back with a golden retriever. The dog immediately starts growling at me, which had never happened to me before so I start feeling a little weird. Dee doesn't say anything about the dog's temperament. \nBecause we have the dog he wants to drop him off at his house. This feels logical to me, so I agree. \nWhen we pull up to Dee's house he asks if I want to come in, not wanting to sit in the car, I do. The moment I walked in I immediately knew it was the wrong choice. The house is trashed. There is garbage everywhere. Trash bags full along the front entry, bottles and wrappers on the couch, and just general crap everywhere.\nDee let's me know he has a roommate, but that roommate isn't home. I assume this is to imply the mess isn't his. After brushing the trash off the couch he asks if I want to sit and play chess. I had expressed that I was interested in learning and he seemed more than happy to help me learn. This too was a mistake. \nDee begins explaining the game to me and it isn't fun first date explaining. He has gotten vary serious and is showing me each piece while telling me what it is, what it does, and how it moves. Dee then begins questioning me over each piece, which most I get wrong. Everytime I get one wrong he yells at me the correct answer and tells me try again. \nHe got more and more frustrated and it made me very uncomfortable so I suggested we pause chess and do something else. Dee suggests watching a movie which is fine with me. The idea of us leaving and going to get food seemingly forgotten. \nDee tells me that we can watch movie in his room and I oblige, but then he explains that he has to put clean sheets on the bed. I had assumed we were moving to his bedroom because it may have been cleaner, but when we go in its not AND there is no TV in his room.\nHe proceeds to put Iron Man 2 onto his phone to have us watch. We watched about 10 minutes of it before things got sexual. I won't tell you strangers the details, but short story short we didn't have sex but other things went down. I will say those things were consensual. After they occurred I was feel really odd about the whole situation and told him I didn't want to have sex. \nDee was confused but didn't push it at first. He said fine and we watched maybe 5 more minutes of the movie before he said he didn't want to watch the movie and more. He started complaining and asking me why I didn't want to have sex with him, and I simply said I wasn't in the mood anymore. He then began pressuring me to tell him exactly what it was about him that made me feel that way. \nAt this point we had moved from the bedroom back into the dirty livingroom. You might be thinking \"Seems like a perfect time to leave\" and I thought so too but this is where things start to get scary. As if he knows I'm thinking about how I'm leaving, he explodes and begins to scream at me. \nThis is a 6 foot something man screaming in the face of a 5 foot nothing young girl. Of course I'm internally freaking out but I'm trying to make sure I don't piss him off anymore but also not agreeing to anything. \nFor the next 5 to 10 minutes, Dee screams at me about why I don't like him, why I don't want him, and continuously asks what wrong with him and to tell him. I tried to placate him as best as possible, saying the old \"it's not you it's me\" and \"no I don't want to leave\". \nAgain this man is my only ride home and I'm truthfully not sure exactly where I was. Though I did have my phone and Google maps I did not have uber at the time. \nDee finally calms down when he believes I'm going to stay. Then suggests we try playing some video game. I was in full internal freak out mode trying to make sure I was playing the part of the interested date because I was terrified that if he felt I wanted to leave he would freak out again. \nWe play this game for a while then out of no where Dee starts getting upset again. He started yelling about why no one likes him, why no one wants to get to know him, and why no one loves him. Saying that he has never had a girl friend and all his dates have been one night stands. Again I placate him with a \"I don't know. Lots of girls are just snoody like that.\" At this point I'm saying anything and everything he wants to hear. He even starts crying about how his mother never loved him and telling me very deep, dark things about what his mother has said to him and treated him. \nAfter he finally calms down once more, he gets up and goes to the kitchen to \"fix us some drinks\". Now if your anyone with a brain, you're thinking absolutely not, which was my exact thought at that moment. I decline his multiple offers for a drink. He asks if instead of alcohol, I wanted water and of course I declined that too feigning that I wasn't thirsty.\nI stayed at his apartment until about 1 am, because I was sitting next to him terrified to 1) ask him to take me home 2) say I'd walk home 3) figure out how to get anUber. \nI had been trying to download uber on my phone without him noticing but then it asks for card information and that was too hard to do without him noticing. \nSo around 1am I yawn very louded and say \"Oh wow it's 1am! My roommates going to be so worried about me \" I laugh as if my roommate would be stupid to worry and that i hadnt been watching the clock since he picked me up at 9 pm then said \"I'm so tired. I should get home soon.\" \nAgain I was super scared he would freak out but he didn't explode. He just looked at the clock and said yeah it was late, but I was not taking any chances so I said \"I have a great idea. If I get to bed, soon I'd love to have breakfast with you on campus!\" \nI was hoping my offer convinced him that I was intending to see him again, and it did he seemed very happy at the prospect of it and jumped up walking me out of my house and to his car. \nThe drive back was excruciatingly long. The Ride was completely silent, neither of us spoke. It was only a 10 minute drive but I could have sworn he slowed down everytime we got to a particularly dark area or underpass. \nDee dropped me off and I smiled and made a good show of being tired yet excited to see him tomorrow. He offered multiple times to walk me to my door but I declined everytime and said I didn't want to bother him and I'd see him tomorrow. I walked myself to the building and the moment I got around the corner, I sprinted so fast up the stairs and to my door before he could change his mind and follow me to my door.\nWhen I got in my dorm room I genuinely felt like I had just escaped a serial killer. Even now writing it makes my heart race a bit. I never met up with him but he begged me for multiple days after to meet up with him again, he ever asked to pay me $20 an hour to sit NEAR me in the library. I declined obviously and only ever saw him once after at the gym on campus. He didnt see me and I left immediately.\nI've thought about Dee occasionally since the date and wondered if all those girls he had one night stands with had the same experience I did. I still sometimes wonder how many girls there were after me. \nSo Dee, let's not meet again!", "media": null, "score": 189, "upvote_ratio": 0.98, "comment_count": 12, "over_18": true}, "42": {"id": "1cqumw4", "locked": true, "subreddit": "ghosts", "stickied": true, "category": "Paranormal", "author": "GhostsMods", "link_flair_text": "Paranormal Community [Discussion]", "time": 1716165527.0152576, "created_utc": 1715590496.0, "url": "https://i.redd.it/h36kjdwcr50d1.jpeg", "title": "To anyone considering posting a video or image - READ THIS FIRST", "permalink": "/r/Ghosts/comments/1cqumw4/to_anyone_considering_posting_a_video_or_image/", "selftext": "The overwhelming majority of orbs have nothing to do with the paranormal. The incessant parade of dust, bugs, and other debris posted is proof of that reality. Therefore, it is necessary to revisit this problem. If you have a video of an 'orb' and you believe it's paranormal, it is strongly recommended that you read this post first.\nA basic understanding of the principles that create orb-like phenomena on camera can go a long way in preventing your post from being ridiculed in the comments and removed from the sub. Please take this generous opportunity to review the above-posted article and familiarize yourself with light play and focusing issues in photography and filmography.", "media": null, "score": 148, "upvote_ratio": 0.88, "comment_count": 1, "over_18": false}, "43": {"id": "1ctryj1", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Prince100001", "link_flair_text": "Glitch Vid", "time": 1716165527.3821769, "created_utc": 1715904742.0, "url": "https://v.redd.it/pr090yf8it0d1", "title": "Somethings wrong with Charlie", "permalink": "/r/GlitchInTheMatrix/comments/1ctryj1/somethings_wrong_with_charlie/", "selftext": "", "media": null, "score": 85, "upvote_ratio": 0.88, "comment_count": 8, "over_18": false}, "44": {"id": "1cr09j5", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Inflation-Witty", "link_flair_text": "Discussion", "time": 1716165529.1520815, "created_utc": 1715609389.0, "url": "https://youtu.be/LIKXKhZKG1k?si=4Q8qVDCOYoB2uPRA", "title": "Slow disclosure is not for humanities sake, but those covering it up. This Information should be given to all humanity, and the technology to earths scientists to help save and evolve our species, and have a greater understanding of life and meaning.. Slow disclosure is wrong", "permalink": "/r/ufo/comments/1cr09j5/slow_disclosure_is_not_for_humanities_sake_but/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Signs show top senators may believe the US recovered UFOs: Analyst | Morning in America", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/LIKXKhZKG1k?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Signs show top senators may believe the US recovered UFOs: Analyst | Morning in America\"></iframe>", "author_name": "NewsNation", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/LIKXKhZKG1k/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@NewsNation"}}, "score": 161, "upvote_ratio": 0.94, "comment_count": 62, "over_18": false}, "45": {"id": "1cvn6w7", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "Video", "time": 1716165530.6738358, "created_utc": 1716121772.0, "url": "https://v.redd.it/9xt9uhkzmd1d1", "title": "AOC explains why \"UAP disclosure is a story of grassroots organizing\". \"I do think there's something going on\". \"People may wanna be cynical about that but there are a lot of people who are very interested in this topic\".", "permalink": "/r/UFOs/comments/1cvn6w7/aoc_explains_why_uap_disclosure_is_a_story_of/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/9xt9uhkzmd1d1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/9xt9uhkzmd1d1/DASH_96.mp4", "dash_url": "https://v.redd.it/9xt9uhkzmd1d1/DASHPlaylist.mpd?a=1718757529%2CMWQ3OTk4MmNiYzg2YzkyMDIxOTRlNmUyMTc1NDk5NGQxZmQ1N2QzMmQyOTdjODYxNzRhZjIyMzdjYjJmNGNlMA%3D%3D&v=1&f=sd", "duration": 234, "hls_url": "https://v.redd.it/9xt9uhkzmd1d1/HLSPlaylist.m3u8?a=1718757529%2CNzc2NjQ2ZDljNDEwY2Q3ZWJlMWRmZmEwMzI3ODkxMDcwYmNkOWIzZjlkOTZmNDJhMDZmMTcxY2VlMTgzMTgzYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1895, "upvote_ratio": 0.83, "comment_count": 294, "over_18": false}, "46": {"id": "1ctna1x", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "AltF4_Bye", "link_flair_text": "Discussion :table:", "time": 1716165532.353849, "created_utc": 1715892047.0, "url": "https://www.reddit.com/r/aliens/comments/1ctna1x/norad_leak_the_interesting_parts/", "title": "NORAD LEAK.. the interesting parts", "permalink": "/r/aliens/comments/1ctna1x/norad_leak_the_interesting_parts/", "selftext": "Since the original account/post got nuked, I’ve compiled some of the more standout statements in the original post. What are y’all’s thoughts on this??\nwaits for disinformation bots/agents to tear this apart\n”The craft use a system that originally befuddled generations of researchers, but it's essentially a 3D dijkstra algorithm. It finds points around the craft, and chooses the most efficient possible route through space time to get to that point. Some of the parameters it uses to gauge efficiency are totally unknown to us and are a serious point of contention. It's not autonomy, but rather obstacle avoidance not unlike what you would see in a self-driving car. But, the self driving car could go through air, space and water without worrying about what medium its in. Additionally, the algo accounts for the crafts place in time. I don't think this means that the craft time travel in the way we think they can, but rather go so fast that they experience dilation and can hit objects in the future, and, potentially, past at their target destination. \nAlthough the algo is extremely effective, Nuclear explosions and experiments somehow interfere with this navigation. Craft particularly avoid Diablo Canyon, even if we put something they really want there. They mostly avoid previous crash sites as well. \nThe wing I called \"Anthropology\" is the weirdest one by far. It focuses on a few different things. They originally studied NHIs intentions and \"culture\" if it's possible to call it that. The reports I read from this early research changed the way I see the world.\nAnthropology and Computer Science were at one point decompartmentalized to study how the NHI interact with the craft. The NHI are linked to their craft in a way that borders on biological.\nThis team discovered, a long time ago, that the reason why craft appear so bright to us humans is because it's not really \"light\" but rather the product of the crazy amounts of power these craft require. Sort of like smoke coming out of an exhaust pipe.\nAll I would say on a record is NHI know we can track them, and know how to avoid us. They usually avoid detection by going underwater, especially in the case of particularly large (by human measurement, enormous) craft. \nThe shape was directly informed by its purpose. Every shape is custom molded in a metallic material that would revolutionize the way we travel if we had it.\nCrash Recovery probably has the most people involved. It's split up among several parent orgs, but funding is funnelled away from it and into other departments when there's little activity. This is common among the entire agency, as funding and staff get balanced between the different wings based on progress or lack thereof. Most of the crash recovery staff are staff from tracking and security that are involved in Crash Recovery. It's also made up of members of all of our favorite three letter organizations. \nThis team also actively engages in disinformation, gaslighting and other similar campaigns. Their goal is to keep the US's secrets about this tech, secret, because other countries are close to breakthroughs.\nNHI potentially experiment on us, and definitely experiment on animals. We have no idea why.”", "media": null, "score": 765, "upvote_ratio": 0.93, "comment_count": 357, "over_18": false}, "47": {"id": "1culys4", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Nefarious_Precarious", "link_flair_text": null, "time": 1716165532.735897, "created_utc": 1715996102.0, "url": "https://www.youtube.com/live/0c9PU4VhZZ0?si=OlaxmZoMJUqoQaNx", "title": "Revealing: Pentagon's Lue Elizondo Cover-Up", "permalink": "/r/UAP/comments/1culys4/revealing_pentagons_lue_elizondo_coverup/", "selftext": "It's my full and immeasurable wish that every person, skeptic or believer, fully watch this video. The video addresses so many of the issues that keep people in the dark or ignorant to what certain parties, groups, and organizations illegal and evil deeds right under the publics nose all the while running a propaganda campaign. Very illuminating! I RECOMMEND WHOLEHEARTEDLY! ", "media": null, "score": 24, "upvote_ratio": 0.79, "comment_count": 0, "over_18": false}, "48": {"id": "1csniq6", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "G11_1", "link_flair_text": null, "time": 1716165534.2849643, "created_utc": 1715786667.0, "url": "https://www.reddit.com/gallery/1csniq6", "title": "finally the last time you'll have to watch it", "permalink": "/r/conspiracy/comments/1csniq6/finally_the_last_time_youll_have_to_watch_it/", "selftext": "I take back what I said, these little tricksters love Easter eggs 👿👿👿", "media": null, "score": 2177, "upvote_ratio": 0.88, "comment_count": 618, "over_18": false}, "49": {"id": "1csq3z1", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "caffeinedrinker", "link_flair_text": "crosspost", "time": 1716165535.3616724, "created_utc": 1715793150.0, "url": "https://www.reddit.com/gallery/1cs2h98", "title": "Forrest Galante recently shared these photos allegedly showing a living thylacine (with some skepticism). Thoughts? (Thought this might be worth an xpost)", "permalink": "/r/bigfoot/comments/1csq3z1/forrest_galante_recently_shared_these_photos/", "selftext": "", "media": null, "score": 193, "upvote_ratio": 0.9, "comment_count": 83, "over_18": false}, "50": {"id": "1ct0lex", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "HourDark", "link_flair_text": "Info", "time": 1716165536.4444537, "created_utc": 1715820474.0, "url": "https://www.reddit.com/gallery/1ct0lex", "title": "At Least Some of the Thylacine \"photos\" appear to be manipulated images of Archesuchus' Thylacine doll", "permalink": "/r/Cryptozoology/comments/1ct0lex/at_least_some_of_the_thylacine_photos_appear_to/", "selftext": "", "media": null, "score": 256, "upvote_ratio": 0.91, "comment_count": 80, "over_18": false}, "51": {"id": "1cqsu5n", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "casefilesofVJ", "link_flair_text": "Hairy Critter", "time": 1716165536.8114865, "created_utc": 1715582622.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1cqsu5n/lamington_stone_thrower/", "title": "Lamington stone thrower", "permalink": "/r/Humanoidencounters/comments/1cqsu5n/lamington_stone_thrower/", "selftext": "Tom (2018, Qld, Australia)\nI (42M) was heading on a hike to Lamington national park with a woman I was seeing for a few months at the time, Belinda. She brought along her two boys 10 - 12. I had met them a few times l, but this was going to be a good bonding experience to see how we got along on an overnight adventure. I really liked B and I wanted to get serious with her. There was a lot counting on this. \nMy old boy used to bring me up to this campsite called Binna Burra our favorite hike was the Coomera circuit. You start on the top of the mountain with all the views then descend down into the valleys where there's lush rainforest, waterfalls and what not. Stunning place, teeming with an abundance of beautiful colorful birds, reptiles, these bright blue yabbies that lay scattered along the tracks, fireflies and a multitude of leeches and ticks. Pack deet. \nThe drive from Brisbane was good and the boys loved the drive up the mountain, Belinda not so much she apparently has a fear of heights I learned. \nThere were on and off showers and the track was slippery but we packed ponchos and the kids were having a blast as we set off on our trek. \nWe booked a safari tent up near the lodge and everything seemed to be going perfectly for our weekend getaway. \nWe were about a half way through the hike when the youngest boy slipped and hurt his knee as we were crossing a creek. It was only a graze, but I think the shock of getting a bit wet and the panic made him a bit emotional and he was crying for a bit. I cleaned up the scrape and put on some bandaids and decided to carry him on my shoulders for a bit until he felt better. \nBelinda was acting quiet, and I thought maybe she wasn't enjoying herself, she was laughing and joking around just before. I thought maybe I did something wrong or she was upset her son got hurt. \nI asked if she was good and she nodded and smiled and went along gazing around quietly. \nWe started heading up the mountain for a bit and as we were walking we could hear something thundering through the trees towards us, branches snapping, loud bangs, impacts. We look up the hill to see a large stone the size of a basketball flying down just ahead of us on the trail. \nWe watched as it bounced across our path, hitting into a tree and continuing down the hill. \nI warned everyone to watch out, sometimes with erosion rocks can fall. I was honestly shaken, a rock like that could easily kill someone if it hit them. \nWe continued walking, keeping an eye on the hill above for more rocks and debris as we zig zagged up and around the mountain. Only five minutes later another rock came crashing down, this one further away, but it was followed by another that was coming right towards us, we had plenty of time to get out of the way, but if we weren't paying attention…\nWhen the third came I knew something was up, this wasn't right, someone was throwing these rocks down the mountain, it didn't feel like a natural occurrence, the way they were spread out. It didn't make sense. \nI shouted up the mountain that if it was someone doing that to stop, there's hikers. \nIn response another rock flew down towards us. \nI screamed out that they were going to kill someone and that we had children with us.\nTwo more large boulders crashed down the hill leaving a trail of destruction. \nWe heard shouts of another three or four people, another group of hikers further down the hill shouting out the same complaints as us. \nA man ran up ahead until he was in shouting distance and called out to us. \nAnother stone came crashing down and by this point the kids were crying and Belinda was shaking. \nI told them to stay there and that I would run up ahead. And I did just that. I started running up the hill, until I couldn't breathe any longer. I reached where the zig zag ended and continued along the mountain ridge and no one was there. I went up and down the trail until I reached an elderly couple sitting on a bench at a look out. \nI talked to them for a few minutes asking if they saw anything or any other hikers. They said they hadn't. That they had come from the opposite way and hadn't seen anyone for ages, a guided tourist group a few km back the other way, but too long ago to be the culprits. \nI went back down to Belinda and the kids, by this time they were with the other hikers and we did the last leg of the journey together. We caught up with the old couple as well near the exit. \nOnce we left the group with some of the other hikers bombarding one of the rangers we headed toward the shower blocks. Belinda pulled me aside once she had the kids organized and she told me that she didn't want to stay there overnight. \nI was a bit shocked. Earlier when we arrived she said she loved the safari tents and we had plans to sit around the fire and have a nice BBQ dinner. \nI asked her why and she said she didn't feel comfortable. I assured her no one would try messing with us around the campsites and it was probably just some stupid teenagers and they wouldn't be a nuisance up near the campgrounds and lodge (stupid teenagers within a year of this burnt the lodge to the ground). \nShe told me she didn't think it was teenagers. I asked her why she thought that and she said that when her boy had slipped in the water and was crying she said she thought she saw something. She said it was big and brown and when her eyes first scanned past it she thought it was just a part of the forest, like a log or a rock, but as she moved her eyes past it again, it moved. This thing she said was bigger than me and hairy, but also covered in moss and grandfathers beard and leaves so it blended in. She said she only saw it for a moment. \nShe brushed it off as just a trick of the mind, she said she knew it wasn't but she was trying to convince herself as we walked. \nI asked her why she didn't say anything and she told me she didn't want to scare the kids. Then went on to say that after the rock thing she was even more freaked out. \nI didn't know what to think and I have to admit I acted a bit pouty with her, which she was not impressed by. \nAfter we had showered and dressed she told the kids that we were going home tonight. They seemed disappointed, but didn't put up too much of a fuss. The afternoon had rattled them.\nIt was a quiet drive home and the kids were asleep by the time we reached the bottom of the mountain. \nI dropped them home and apologized to Belinda for the trip not working out that great. \nShe was in brighter spirits now we were off the mountain and thanked me so much for the day and for planning such a special weekend for her and the kids. \nWe ended up seeing each other more and eventually moved in with each other. We got married this January. \nNow after some time has passed, my wife and I have talked this over. \nWe have three theories. \n1/ It was some pesky teenagers hiding off the trail. \n2/ That friendly old couple wasn't as friendly as they seemed. \n3/ There's something weird and big up in those mountains and it likes to throw rocks at hikers. \nMy wife thinks it's option three, I'm heading closer toward option two.\nI did some research and told her that if it was a bigfoot creature she would have smelt it and that the smelliest thing out there was her feet. \nIn conclusion, we usually choose the beach over bushwalks now regardless of whether it was people or unknown cryptids, it kind of spoiled the fun of taking my family out for hikes in one of my favorite places in the world. \nI might go back one day, probably just by myself. I have done those hikes countless times before with no issues, but you best believe I'm going to be keeping a very good lookout for big hairy mountain men. \n.VJ", "media": null, "score": 51, "upvote_ratio": 0.95, "comment_count": 9, "over_18": false}, "52": {"id": "1cujrln", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "DABDEB", "link_flair_text": null, "time": 1716165537.5283294, "created_utc": 1715989413.0, "url": "https://i.redd.it/ncq4tjygp21d1.jpeg", "title": "@_Archesuchus_Makes these 1:1 poseable dolls, you add the glowing eye effect and get the photos I entered earlier from a possible sightining. MYTHBUSTED", "permalink": "/r/cryptids/comments/1cujrln/archesuchus_makes_these_11_poseable_dolls_you_add/", "selftext": "", "media": null, "score": 71, "upvote_ratio": 0.84, "comment_count": 30, "over_18": false}, "53": {"id": "1cs885r", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Correct_Detective927", "link_flair_text": null, "time": 1716165538.222697, "created_utc": 1715734324.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1cs885r/to_the_girl_i_was_best_friends_with_in_elementary/", "title": "To the girl I was best friends with in elementary school…", "permalink": "/r/LetsNotMeet/comments/1cs885r/to_the_girl_i_was_best_friends_with_in_elementary/", "selftext": "EDIT: since i messed up my age quite a bit! my family was only in that state for about two years in my early childhood. I was in the fourth grade when this all happened. It all hit the fan in fifth grade, us moving back in the middle of the year. I guess that would make me younger than I remembered to be. I guess the whole situation feeling so serious and adult that I just thought I was older when it happened. Sorry for the confusion! I guess more accurately, I’m 22 currently. I did go and check my moms facebook to confirm that we were in that new state in 2012 though! Sorry any confusion!\nWhen I was in the third grade, my family and I moved out of state for my dad’s job. I started at a new elementary school and made fast friends with a girl I’ll call Maria. The two of us were inseparable but her…hobbies were something I wasn’t used to. This was about 2012, and a big thing she loved was gore. No just any scary movie movie gore, but MLP gore. Really introduced me to a very dark side of the internet for an 11 year old girl. She kept a binder full of these gorey images and often showed them to me on the bus. First red flag.\nSecond red flag. The boyfriend. Being a literal child at the time, I didn’t understand the sudden interest of dating for my peers. But Maria had a boyfriend. It was your typical elementary school relationship, giggling at just holding hands. And it was as short lived as any elementary school relationship, with him breaking up with her without a care in the world. But she, oh she did NOT take this well. She gathered our little crew in the playground, me her right hand man. She laid out the plan, we were to chase the boyfriend (or ex boyfriend I guess), catch him, hold him down, and she would…beat him up I guess? We all didn’t want to do this obviously, but she zeroed in on me. I was her best friend. I was supposed to do this for her. I being the stupid 11 year old I was, told her she was acting insane and I was gonna play with the boys.\nFrom that point on we weren’t best friends. She was my bully. She harrassed me endlessly, little texts constantly popping up on my flip phone, calling me names on the bus, telling authority figures that I had started it. Eventually this cumulated into a sit down with the principal were we both were scolded and told to play nice. For a bit, everything was calm. Then, the art room scissors started going missing.\nRed flag number three. I had been chatting with a friend on the bus, when Maria had put a pair of scissors very close to my neck. She laughed it off, and I stayed quiet, just wanting to keep some sort of peace at school. I knew she had stolen them. Never understood why I never said anything. Things were quiet for awhile again.\nBut one day, a day that still haunts me. A day that has put up barriers in me that I shouldn’t have had at a young age. I was taking my usual bus route, arriving early and taking a seat near the back. Maria arrives, sitting by herself on the opposite side nearer to the front. We took off and began the ride to school. As we were nearing the elementary school, mine and Maria’s eyes locked. I’ll never forget that smile.\nShe proceeded to pull a kitchen knife from her bag, one of the big ones from a knife block. She flashed it me before zipping the bag as the bus came to a stop. I remember sitting in my seat as everyone piled off the bus. I don’t remember much after that. I remember freaking out in front of the school. I remember sitting in the office all day. I remember talking to men in uniforms. I remember reading something I probably shouldn’t have. She was planning to hurt me. And the boy who broke up with her. She was suspended for the rest of the year. I moved before she came back, and I never saw her again.\nSo to that girl I was best friends in elementary school, let’s not meet again.", "media": null, "score": 177, "upvote_ratio": 0.95, "comment_count": 16, "over_18": true}, "54": {"id": "1crw6wj", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Sensitive_Day3479", "link_flair_text": "Captured Apparition ", "time": 1716165539.1738553, "created_utc": 1715703653.0, "url": "https://www.reddit.com/gallery/1crw6wj", "title": "2 Spooky pictures from different states have a lot in common.", "permalink": "/r/Ghosts/comments/1crw6wj/2_spooky_pictures_from_different_states_have_a/", "selftext": "I was looking on #Ghost Sub And I found a picture from Bambinoquarentino Of what they believe could be a spirit at a theater out west.\nAmazing picture by the way!!\nIt was compelling.\nI've decided to show a picture captured at \"Twin City Opera House\"\nMcConnelsville Ohio.\nI believe it's a Larger woman  with beehive hairdo and a child with pigtails on her lap.\nBoth pictures  are so similar.\nThoughts?", "media": null, "score": 112, "upvote_ratio": 0.76, "comment_count": 41, "over_18": false}, "55": {"id": "1ct9233", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Flimsy_Scientist2636", "link_flair_text": "Glitch Pic", "time": 1716165539.47885, "created_utc": 1715852349.0, "url": "https://i.redd.it/0ohsx1rrukw41.jpg", "title": "The clouds failed to render", "permalink": "/r/GlitchInTheMatrix/comments/1ct9233/the_clouds_failed_to_render/", "selftext": "", "media": null, "score": 86, "upvote_ratio": 0.95, "comment_count": 9, "over_18": false}, "56": {"id": "1cu8so4", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Dull-Pianist-6777", "link_flair_text": null, "time": 1716165540.9253614, "created_utc": 1715961351.0, "url": "https://i.redd.it/hwa8dxn3e01d1.jpeg", "title": "How to get to the alleged Dulce base, northwest of Dulce, New Mexico - - or, at least next to it", "permalink": "/r/ufo/comments/1cu8so4/how_to_get_to_the_alleged_dulce_base_northwest_of/", "selftext": "(Not recommended by AAA)\nHOW TO GET TO THE ALLEGED DULCE BASE OF NEW MEXICO.\n(at least to the entrance of a suspicious ranch adjacent to the north slope of Mount Archuleta on the Colorado side):\n- From Dulce, New Mexico, go east on Hwy 64 to the town of Lumberton.\n- From Lumberton, take the County Rd. 357 north.\n- Enter Colorado state line.\n- Keep going on County Rd. 357.\n- Go west on County Rd. 359 (Coyote Park Rd.)\n- Go west on County Rd. 542 (Montezuma Rd.)\n- Drive for about 8 miles.\n- Look for the Redding Ranch gate on the left side.\n-The Redding Ranch gate is located on County Rd. 542 and the Great Spirit Rd.\n- Look south.\n- You will see the \"guard towers\".\n- Mount Archuleta is to the south of this area.\n- If you want to enter the Redding Ranch, do it at your own risk.\n- The premises may or may not be guarded.\n- This entire area is owned by the Utes tribe.\n- If you are still alive, keep going south all the way on the Great Spirit Rd. towards the New Mexico side.\n- You will begin to climb the north slope of Mount Archuleta.\n- If you are still alive, with much luck, you may be able to find a hidden entrance somewhere there.....\n- BUT THEN AGAIN, THERE MAY BE NOTHING THERE.", "media": null, "score": 87, "upvote_ratio": 0.89, "comment_count": 62, "over_18": false}, "57": {"id": "1cub6wj", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Gari_305", "link_flair_text": "Article", "time": 1716165542.4080653, "created_utc": 1715967132.0, "url": "https://www.dailymail.co.uk/sciencetech/article-13430771/us-law-federal-agency-ufo-reports-public-disclosure.html", "title": "Proof aliens exist? Federal agencies must now deliver all UFO reports for public disclosure - including classified material - Federal agencies have until October 20th to deliver every document, audio and video they have about UFOs to the US government for distribution to the public.", "permalink": "/r/UFOs/comments/1cub6wj/proof_aliens_exist_federal_agencies_must_now/", "selftext": "", "media": null, "score": 1837, "upvote_ratio": 0.9, "comment_count": 348, "over_18": false}, "58": {"id": "1ct6v7d", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "thehumanbean_", "link_flair_text": "News :illuminati:", "time": 1716165544.0617578, "created_utc": 1715842407.0, "url": "https://x.com/rogueuaptf/status/1790956307647693173?s=46", "title": "RougeUAPTF tweets out that the threat against Lue is real and that there is an active plan to KILL whistleblowers ", "permalink": "/r/aliens/comments/1ct6v7d/rougeuaptf_tweets_out_that_the_threat_against_lue/", "selftext": "", "media": null, "score": 666, "upvote_ratio": 0.95, "comment_count": 186, "over_18": false}, "59": {"id": "1cv9hhi", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "TheGoodTroubleShow", "link_flair_text": null, "time": 1716165544.461892, "created_utc": 1716072468.0, "url": "https://youtube.com/live/KnugxvUWsXI", "title": "Sunday, 12 pm Pacific\nAstronomer Dr. Beatriz Villarroel joins us to discuss scientific proof of the 1952 #UFO flap over Washington DC & Dr. Donald Menzel, who worked for Harvard & the NSA and destroyed scientific evidence.", "permalink": "/r/UAP/comments/1cv9hhi/sunday_12_pm_pacific_astronomer_dr_beatriz/", "selftext": "", "media": null, "score": 10, "upvote_ratio": 0.82, "comment_count": 1, "over_18": false}, "60": {"id": "1cundjh", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "J_arc1", "link_flair_text": null, "time": 1716165545.9207814, "created_utc": 1716000618.0, "url": "https://i.redd.it/d6hv252vm31d1.jpeg", "title": "Well someone must’ve gotten the answer right", "permalink": "/r/conspiracy/comments/1cundjh/well_someone_mustve_gotten_the_answer_right/", "selftext": "I was trying to read the comments on this post, and while they’re locked, I still can’t see them (reloaded many times)…coincidence???", "media": null, "score": 1712, "upvote_ratio": 0.92, "comment_count": 333, "over_18": false}, "61": {"id": "1csr27x", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "WhiteHairedBabuska", "link_flair_text": "YouTube", "time": 1716165546.8763642, "created_utc": 1715795509.0, "url": "https://youtu.be/YAmpg6gzqX0?si=LRHn6s1r3gnWG51r", "title": "See 'Bigfoot' Caught On Camera By Holidaymaker Walking His Dog In North Carolina", "permalink": "/r/bigfoot/comments/1csr27x/see_bigfoot_caught_on_camera_by_holidaymaker/", "selftext": "Of note, the guy who filmed this was a tourist renting a cabin and in the same County we had our experience. Notice how the dog run in its direction then veers left.", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "See 'Bigfoot' Caught On Camera By Holidaymaker Walking His Dog In North Carolina", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/YAmpg6gzqX0?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"See &#39;Bigfoot&#39; Caught On Camera By Holidaymaker Walking His Dog In North Carolina\"></iframe>", "author_name": "Daily Breaking News", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/YAmpg6gzqX0/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@NewsDailyBreaking"}}, "score": 150, "upvote_ratio": 0.76, "comment_count": 130, "over_18": false}, "62": {"id": "1ctxnui", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Brycer1ley1933", "link_flair_text": "Question", "time": 1716165547.8908567, "created_utc": 1715923741.0, "url": "https://i.redd.it/pgjmgth9ax0d1.jpeg", "title": "What are Your Honest Thoughts about The Oklahoma Octopus?", "permalink": "/r/Cryptozoology/comments/1ctxnui/what_are_your_honest_thoughts_about_the_oklahoma/", "selftext": "", "media": null, "score": 243, "upvote_ratio": 0.93, "comment_count": 77, "over_18": false}, "63": {"id": "1cvqsls", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Ufonauter", "link_flair_text": "Abduction Event", "time": 1716165548.2924175, "created_utc": 1716132386.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1cvqsls/in_1979_a_puerto_rican_man_would_observe_an/", "title": "In 1979 a Puerto Rican man would observe an abduction event while simultaneously being mocked by one shark-toothed grey alien", "permalink": "/r/Humanoidencounters/comments/1cvqsls/in_1979_a_puerto_rican_man_would_observe_an/", "selftext": "The following account comes from the magazine Evidencia OVNI (No.1) by way of Puerto Rican ufologist Jorge Martin, and was later translated and published in the 1997 V42N4 issue of Flying Saucer Review. The text below is the back and forth interview conducted and translated as it appears in the FSR edition. Note: The comments 'G.C.' within this post refer to FSR editor Gordon Creighton.\nWe learned recently from a Sr. Luis T., Rodriguez of Sabana Grande that, according to an informant known to him, this informant had witnessed the kidnapping of a man near Tallaboa, between the towns of Ponce and Peñuelas, in the southern part of the Island of Puerto Rico.\nThis informant, named Héctor Maldonado, a resident of Ponce, was a night-time employee of a local firm. After very great difficulty, due to his pronounced evasiveness, I did finally manage to contact this man Maldonado (aged 39, resident on Calle Isabel, Ponce), and gradually extract from him the details of his story and get him to take me to the spot where it had happened. It had been at about 9.00 o'clock one morning in November 1979, and he was out jogging near the saltings and mangrove thickets of Ponce Salt, near Tallaboa, and right by the sea, on the southern coast of Puerto Rico Island.\nHe said: \"I chanced to turn round suddenly, and there were five or six strange beings there, between 5 ft and 6ft tall, thin, with bald, biggish heads, big almond-shaped glowing eyes - just as though lit up with bright lights - not in the slightest bit normal! It was broad daylight, so it was not a case of some sort of light reflected in their eyes in the way it is at night with animal eyes. That light came from inside their eyes!\" (He does not give the actual colour -G.C.)\n\"They had thin necks and long arms, and long hands and fingers. I didn't note how many fingers - I was too shaken to notice it. The strangest thing was that their skin was a greyish-blue colour. I couldn't see any clothing on them - unless that greyish-blue stuff was itself something that covered their entire body, but to me they looked naked. I spotted no sign of any genitals at any time, though to be honest I didn't fix my attention specially on that.“\n\"The astonishing thing was that they had got hold of a man and were taking him off. He was a human, olive-skinned, about 5ft 9 in height, with lank black hair, and apparently unconscious. He looked as if he were petrified, with his eyes closed, and they had got hold of him by the armpits. They appeared to be very strong, because two of them were lifting him off the ground with ease. He wasn't even dragging his feet; I didn't get a clear view of his face, because I could only see him from the side. \"Behind the beings, above the sea, a bit beyond the mangroves, there was a machine hanging stationary in the air. It looked more or less oval in shape, with a cupola on top, and its sides sort of fluted or grooved, and on the top it had a narrow, curved, projection with lots of lights - just like a garland of lights that you see at Christmas time. The thing was of a silvery metallic colour, and big - really big. And just hanging there in the air, not making a sound.\"\n\"Suddenly one of them, who had been kneeling and seemed to be looking at something on the ground, got up and signed to me, and then I felt something as if it were inside my mind, like a voice, - but a bit strange - different from that - coming seemingly from that being. And I heard him say jestingly to the others: 'LOOK AT THAT ONE - HOW HE'S RUNNING'.\" (The eyewitness had in fact not stopped jogging).\n\"AND THEN THE BEING HIMSELF STARTED RUNNING, AND MAKING FUN OF ME. Then I got the impression that he said: 'Now - just look how I run,' and he started moving at a quite fantastic speed. Then he halted beside the others, and in my mind I heard him say to them 'WE'LL TAKE HIM TOO. The others replied something like: 'Not him - leave him alone'. ... Something like that. When he was mocking me he had got great big teeth - and pointed ones — like a shark's teeth.” (See the sketch based on the eyewitness's description).\nhttps://preview.redd.it/3p95qq6wge1d1.png?width=530&format=png&auto=webp&s=929714dd8086fc5f2afca2947f772b5d634f0cf5\n\"Next\", he said, \"That one that had laughed at me and wanted to take me, gestured towards me with his hand and threw something like a great big drop of some sort of cold liquid, which hit me on the chest. Where that had hit me, I at once began to feel very queer - as though my body was swelling up and I was feeling stiff. Like a sort of cramp. But I was so scared that I forced myself to keep on running. And, as I went on, that queer feeling began to lessen, and so I was able to go on.”\n\"And when I did look back, I saw that they were taking the man towards that craft. I just carried on running, and didn't want to look back, and when I did finally look back next, the craft, and they and the man were all gone. And I just carried on running until I'd got right away from there. \"I was terrified. And I didn't tell a soul about it. I was so scared, and felt sure that nobody would believe me. Who was going to believe a story like that? They'd say I was mad, and I wasn't going to expose myself to that, No Señor!\"\nWe asked Maldonado to give us more details of the man they were carrying off.\nHe said: \"Well, he was olive-skinned, with black hair. I don't think he would have been more than about 30. Slim. He was wearing a two-piece suit, with a check pattern, and of a creamy sort of shade. But I didn't get a clear view of his face because - as I've told you - he was sideways on to me all the time. And yes - the man was unconscious or dead. I imagine unconscious\".\nWe asked: \"Didn't you notify the Police about what you had seen?\"\n\"No\", he replied. \"As I've already told you, I was very scared. I didn't think they would believe me. For a long time I have felt bad about what might have happened to that chap that they were taking, because I've no doubt whatsoever that they were indeed taking him. But my fear was too great, and I did nothing. For a long time I carried in my mind the scene of what happened. I couldn't stop thinking about it. But bit by bit I got control of myself and was able to bear it\".\nI asked: \"Did you continue to go jogging at that place?\"\nHe replied: \"For a long time I didn't go back there, but after three years, when I was feeling calmer, I did go back there. \"One day, I was running there again, on that same sector, and I fell down suddenly, because there was a change of level in the soil there. And when I looked to see the cause, I perceived that the soil there had sunk, forming a perfect circle about 100ft. in diameter. It looked just as though something large and heavy had rested there. I was astonished to see that, but I also noticed that over on the further edge of the circle some individuals with a red minibus belonging to the Civil Defence Dept. were checking the circle. That was around 1982 or May 1983. It's near the place on the salt-flats where they spread out the shrimps in the sun.”\n\"After that, I lingered there for a while, and talked to those people, and to others, all of whom had seen UFOs thereabouts. \"Furthermore, when I read of other things that you had investigated and that you had published previously in the review ENIGMA, showing more or less similar beings that have been seen in the Island and in other places, by other people, then I realized that I wasn't the only one to have seen them.”\n\"It's true, and for some reason the Governments hide it and cover it up. But as I see it, there's far too much going on, and in the end they are going to have to give some sort of explanation and say what it is that is going on.\"\nhttps://preview.redd.it/i2s5sskzge1d1.png?width=362&format=png&auto=webp&s=2b9d605ed3dcb1cb38120cec567803b2dae61f7f", "media": null, "score": 30, "upvote_ratio": 0.92, "comment_count": 7, "over_18": false}, "64": {"id": "1cttw82", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "geos1234", "link_flair_text": null, "time": 1716165548.9458246, "created_utc": 1715910788.0, "url": "https://www.discoverwildlife.com/animal-facts/mammals/big-cat-british-countryside", "title": "Big black cat confirmed in UK", "permalink": "/r/cryptids/comments/1cttw82/big_black_cat_confirmed_in_uk/", "selftext": "Not sure if this was posted already ", "media": null, "score": 26, "upvote_ratio": 0.93, "comment_count": 4, "over_18": false}, "65": {"id": "1cv5xh3", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Ok-Climate553", "link_flair_text": null, "time": 1716165549.661457, "created_utc": 1716062618.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1cv5xh3/a_beer_bottle_appeared_in_my_apartment_when_i_was/", "title": "A beer bottle appeared in my apartment when I was gone ", "permalink": "/r/LetsNotMeet/comments/1cv5xh3/a_beer_bottle_appeared_in_my_apartment_when_i_was/", "selftext": "I was gone for a few hours last night to get dinner and drinks and when I came back to my place there was a miller lite empty beer bottle in my trash , poking out from the top like it wasn’t trying to be hidden. I have no clue how it got there, I live alone and haven’t had anyone over recently where it would make sense to be in my trash from yesterday. I remembered I left a spare key at my front desk for my friend who was supposed to visit me a few months back, and so I went to go get it from the front desk and they didn’t have it and neither did the management office. Is it possible someone used my spare key, and if so how did they know what name or apartment to ask for the key for? For context, I live in a high rise so it would be extremely unlikely they could’ve guessed my apartment number and asked for the spare key. What’s weird is they didn’t take anything, the only thing that was different was Spotify was on my laptop - which was locked. Stupidly, I did have the password written down in a stack of notebooks with other outdated passwords (for further context I was severely hacked a few years ago and made complex passwords unique to each platform / account afterwards and had them in a notebook; I no longer write them down but couldn’t keep track of them otherwise when I initially did that). So in theory someone could have tried the many passwords in there and gotten into my laptop but why Spotify? I’m guessing my computer just opened it on its own when updating maybe? Does anyone have any idea why someone would do this and leave evidence of their break in? Just to mess with me or something more sinister? Any advice or ideas would be appreciated. I’m going to get the locks changed to start. \nEdit: my apartment has a 24/7 front desk person, and key fobs required to enter- they only let people in without a fob if they know they are a resident and almost never remember me because there’s hundreds of residents here. So even if they got my spare key, they would have to a) know I was not home or maybe they hoped I would be? And b) have the front desk let them in because they wouldn’t have a fob. ", "media": null, "score": 153, "upvote_ratio": 0.95, "comment_count": 77, "over_18": true}, "66": {"id": "1cumgn5", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "EconomistNo2159", "link_flair_text": "Paranormal Community [Discussion]", "time": 1716165550.5160851, "created_utc": 1715997677.0, "url": "https://www.reddit.com/r/Ghosts/comments/1cumgn5/what_is_the_scariest_paranormal_moment_you_have/", "title": "What is the scariest paranormal moment you have faced", "permalink": "/r/Ghosts/comments/1cumgn5/what_is_the_scariest_paranormal_moment_you_have/", "selftext": "Hey all would love to hear about your  scariest most amazing moments?  Mine was in New Hampshire in a very old farm house.", "media": null, "score": 110, "upvote_ratio": 0.91, "comment_count": 288, "over_18": false}, "67": {"id": "1cv6v5y", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Floridaants", "link_flair_text": "Glitch Pic", "time": 1716165550.8200893, "created_utc": 1716065175.0, "url": "https://i.redd.it/ltiqrbgsy81d1.jpeg", "title": "How!!!?? My pencil did this", "permalink": "/r/GlitchInTheMatrix/comments/1cv6v5y/how_my_pencil_did_this/", "selftext": "", "media": null, "score": 79, "upvote_ratio": 0.8, "comment_count": 19, "over_18": false}}}