{"_default": {"1": {"id": "1dcubu9", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "clatterbegan", "link_flair_text": null, "time": 1718419352.9962578, "created_utc": 1718048053.0, "url": "https://i.imgur.com/LpxykGz.jpg", "title": "What the hell", "permalink": "/r/ufo/comments/1dcubu9/what_the_hell/", "selftext": "", "media": null, "score": 514, "upvote_ratio": 0.83, "comment_count": 71, "over_18": false}, "2": {"id": "1dbfy3z", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "quantumcryogenics", "link_flair_text": "Discussion", "time": 1718419354.7369976, "created_utc": 1717889685.0, "url": "https://x.com/GarryPNolan/status/1799580429496029383?t=4YiTOSptO0wpWvj-cGaIeQ&s=34", "title": "Garry Nolan: “AARO has discredited itself beyond redemption. No one will trust them except to put out disinformation and bad science. Let me pre-debunk their next announcement. They will release only conclusions, no raw data, and no methods. The worst kind of science that is ever done.”", "permalink": "/r/UFOs/comments/1dbfy3z/garry_nolan_aaro_has_discredited_itself_beyond/", "selftext": "", "media": null, "score": 2279, "upvote_ratio": 0.93, "comment_count": 325, "over_18": false}, "3": {"id": "1dcbvx4", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Vocarion", "link_flair_text": "Video", "time": 1718419356.5561125, "created_utc": 1717989559.0, "url": "https://v.redd.it/av6y08yywn5d1", "title": "At the second part, 1:02m left mark, you can see a humanoid figure underwater. The translation is something like: There is something weird in the water, I don't want to know what is it, lets go lets go. Just found this. Supposedly from 2023. Will post original link on comments. What you think?", "permalink": "/r/aliens/comments/1dcbvx4/at_the_second_part_102m_left_mark_you_can_see_a/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/av6y08yywn5d1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/av6y08yywn5d1/DASH_96.mp4", "dash_url": "https://v.redd.it/av6y08yywn5d1/DASHPlaylist.mpd?a=1721011355%2CZGMxOGE3NzlkMmY0MjI2ZjI0MTQ2MmZkMWY1NTQwNDA4YzM0MTNhM2MxYjdjOGQyNmY1NGVhNmE3ZjQwMjBiYQ%3D%3D&v=1&f=sd", "duration": 195, "hls_url": "https://v.redd.it/av6y08yywn5d1/HLSPlaylist.m3u8?a=1721011355%2CYmIxNDVlY2I1ZDZkMThhYWY4MWNjYTk1N2YyYjA1NmFkN2U4ODU1Njk5ZGQ1ZDA5MmFmMDg4OTBmMDJhYzlmYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2672, "upvote_ratio": 0.91, "comment_count": 479, "over_18": false}, "4": {"id": "1ddlcsd", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Article", "time": 1718419356.9148972, "created_utc": 1718130648.0, "url": "https://thehill.com/opinion/congress-blog/4712445-key-senators-believe-the-pentagons-ufo-office-is-lying/", "title": "[The Hill] Key senators believe the Pentagon’s UFO office (AARO) is lying", "permalink": "/r/UAP/comments/1ddlcsd/the_hill_key_senators_believe_the_pentagons_ufo/", "selftext": "", "media": null, "score": 102, "upvote_ratio": 0.96, "comment_count": 16, "over_18": false}, "5": {"id": "1daxxb1", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "FoolOfElysium", "link_flair_text": null, "time": 1718419358.4260266, "created_utc": 1717834087.0, "url": "https://i.redd.it/cyr6m2ap2b5d1.jpeg", "title": "Learning about Oprah really surprised me. ", "permalink": "/r/conspiracy/comments/1daxxb1/learning_about_oprah_really_surprised_me/", "selftext": "", "media": null, "score": 3677, "upvote_ratio": 0.95, "comment_count": 313, "over_18": false}, "6": {"id": "1dbv64u", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Vib_ration", "link_flair_text": null, "time": 1718419358.7031837, "created_utc": 1717943732.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1dbv64u/this_is_one_of_the_greatest_secrets_about_us/", "title": "This is one of the greatest secrets about us, which is purposely being hidden from us. ", "permalink": "/r/conspiracyfact/comments/1dbv64u/this_is_one_of_the_greatest_secrets_about_us/", "selftext": "Have you ever felt chills from good stimuli?\nThat ability can be learned to be activated with just the elated feeling, whenever you want, without any stimuli.\nThat's not why I claim that it is a secret being hidden from us, though.\nThe ability to activate this is your golden ticket, which is being swept under the rug as something unconscious and unimportant. With info on this purposely being spread as an ability available only to a few; however, it is one of the only things that every single human can access, regardless of their physical abilities or conditions.\nWhy is information on this being manipulated? Let's see.\nEver felt overwhelmed by stress or anxiety? This ability is a switch to manually induce the release of positive hormones.\nhttps://www.bbc.com/news/health-12135590\nJust imagine how being able to use it when feeling overwhelmed could benefit you.\nDon't believe me? In the eastern part of the world, Tibetan Monks know about this ability and use it differently. You can find more information on this in this Harvard \"Tummo\" experiment.\nhttps://news.harvard.edu/gazette/story/2002/04/meditation-changes-temperatures/\n\"During meditation, the monk's body produces enough heat to dry cold, wet sheets put over his shoulders in a frigid room.\"\nSince our internal body temperature is regulated by the hypothalamus, the same part of our brain that deals with positive hormone release, this proves that this ability can be used to consciously activate your positive hormones.\nEver wanted to travel virtually in an instant? People who astral project or have out-of-body experiences use this ability to trigger the \"Vibrational state\" right before the \"take off.\"\nhttps://en.iipc.org/vibrational-state/\nThese examples are just the tip of the iceberg of what you can use this ability for. In fear that my post won't be read, I won't write a book here about all the incredible things that we can do by being able to consciously activate this ability.\nFor now just understand that many different cultures observed this occurrence thousands of years before the Western new world became aware of it, and their discoveries did not stop at simply recognizing it as a physical response to music.\nEventually, you can learn how to bring up this wave of elated energy without the physical reaction of goosebumps, feel it throughout your body, and increase its duration, just like many others have succeeded in doing.\nThis ablity has been researched and documented under many names, by different people and cultures such as Bioelectricity, Life force, Prana, Chi, Qi, Runner's High, Euphoria, ASMR, Ecstasy, Orgone, Rapture, Tension, Aura, Mana, Vayus, Nen, Intent, Tummo, Odic force, Kriyas, Pitī, Frisson, Ruah, Spiritual Energy, Secret Fire, The Tingles, on-demand quickening, Voluntary Piloerection, Aether, Chills, Spiritual Chills and many more to be discovered hopefully with your help.\nIf you're interested, here are three written tutorials with concise descriptions on how to control this for your own benefit.\nIf not then I've put enough information for you to research this topic, develop this ability and bring in new techniques to the world.\nP.S. Everyone feels it at certain points in their life, some brush it off while others notice that there is something much deeper going on. Those are exactly the people you can find on the subreddit community r/Spiritualchills  where they share experiences, knowledge and tips on it.", "media": null, "score": 4, "upvote_ratio": 0.62, "comment_count": 0, "over_18": false}, "7": {"id": "1dcbw5w", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "desertfun77", "link_flair_text": "footprints", "time": 1718419359.4940023, "created_utc": 1717989584.0, "url": "https://www.reddit.com/gallery/1dcbw5w", "title": "Tracks in New Mexico", "permalink": "/r/bigfoot/comments/1dcbw5w/tracks_in_new_mexico/", "selftext": "Couple years back during December while out on a hike. Size shoe is 11 men for comparison. ", "media": null, "score": 374, "upvote_ratio": 0.97, "comment_count": 55, "over_18": false}, "8": {"id": "1ddvfs4", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "RawrRawr12345", "link_flair_text": null, "time": 1718419360.3132885, "created_utc": 1718157667.0, "url": "https://i.redd.it/f1i93s9al16d1.jpeg", "title": "Can see this passing as some cryptid", "permalink": "/r/Cryptozoology/comments/1ddvfs4/can_see_this_passing_as_some_cryptid/", "selftext": "", "media": null, "score": 397, "upvote_ratio": 0.97, "comment_count": 29, "over_18": false}, "9": {"id": "1dbvvj2", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "KOPHER_", "link_flair_text": "U.F.O. Humanoid", "time": 1718419360.6339386, "created_utc": 1717945641.0, "url": "https://www.reddit.com/gallery/1dbvvj2", "title": "Ufonaut with gas mask in Torrientes, Matanza, Cuba on October 15, 1995", "permalink": "/r/Humanoidencounters/comments/1dbvvj2/ufonaut_with_gas_mask_in_torrientes_matanza_cuba/", "selftext": "Despite the light rain, 74-year old farmer, Adolfo Serrate left his house early in order to work his cornfield. Around 920a Serrate decided to take a much needed smoke break. As he exhaled the smoke he looked towards the sky and was surprised to see a round object that was descending quickly and silently towards the nearby fields. Scared, Serrate hid among the cornfield and the edge of the field. He was concerned he ‘would be kidnapped’ since his cousin had mysteriously disappeared in the same area 2 years before. Crouching low to the ground he watched the round craft descend to the ground. It gently landed on some grass on a sort of landing gear that the witness compared to ‘skates’. The surface of the object was very smooth, without any visible details and it gave Serrate the impression that it was colored in different tones of green, almost as if camouflaged. He estimated the object to be as large as a passenger car. Breathlessly he noticed that the object had a transparent glass section, which he interpreted as the control cabin. The strange craft did not have any wings or rotors or wheels like he was familiar with when he was an aircraft mechanic in the service. To Serrate it resembled the top of a turtle. An aperture like that of a sliding door became visible, and from where he was, about 60 to 80 meters away, he could not clearly see the interior.\nHowever he was able to see what appeared to be a human-like figure come out of the opening. He was not able to see any facial features since the figure was completely covered in a suit the same color as the object. The figure’s head and face were covered with a sort of gas mask black in color. The individual walked around the object and on several occasions seemed to bend down and pluck some of the malanga and calabaza roots on the field. The figure then walked behind the object and when he came around again he leaned against the hull of the object next to the opening. He then made a sort of gesture with his head towards the inside of the object perhaps communicating with other unseen occupants. Moments later he boarded the object and the door closed, without a leaving any signs that it was actually there. Serrate remained watching the scene not knowing what to expect next. Suddenly he felt a sort of air wave or shock on his face, which also disturbed the cornstalks and other small plants around him, at the same time he could see the UFO ascending vertically into the sky, without emitting any fire, smoke and making any noise. At about 50 feet in height it stopped briefly and at this point Serrate saw what appeared to be a thin blue flame coming out from an unknown source on the top of the object. The object then took off in a horizontal flight towards the south towards the nearby National Highway, still completely silent. Immediately the witness ran home and notified the police, afraid that he had seen an “enemy aircraft engaged in sabotage”. Later investigators interviewed other locals who reported seeing the same or similar craft in flight. At the site they found physical evidence, including footprints, and leaves scorched black by the object’s propulsion system. The material was reportedly turned over to the Cuban Academy of Sciences.\nSource 1: Virgilio Sanchez-Ocejo Quoting “The Cuban Academy of Sciences.”\nSources 2: https://enigmasovni.blogspot.com/2011/07/encuentro-cercano-en-matanzas-cuba.html?m=0", "media": null, "score": 69, "upvote_ratio": 0.93, "comment_count": 11, "over_18": false}, "10": {"id": "1dettj5", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "haidchicolate", "link_flair_text": null, "time": 1718419361.2743688, "created_utc": 1718266346.0, "url": "https://i.redd.it/m0st4fysa1g91.jpg", "title": "made a response meme", "permalink": "/r/cryptids/comments/1dettj5/made_a_response_meme/", "selftext": "", "media": null, "score": 568, "upvote_ratio": 0.95, "comment_count": 81, "over_18": false}, "11": {"id": "1dbq8yw", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "SkinNYmini18", "link_flair_text": "Discussion/Advice", "time": 1718419361.445129, "created_utc": 1717927086.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1dbq8yw/gilman_springs_is_an_extremely_creepy_and_haunted/", "title": "Gilman Springs is an extremely creepy and haunted area", "permalink": "/r/Thetruthishere/comments/1dbq8yw/gilman_springs_is_an_extremely_creepy_and_haunted/", "selftext": "So Gilman Springs road is 1 of the few major roads leading into Hemet CA and its not only a very dangerous road with many deaths but its also haunted af. Me and my girlfriend go to disneyland often, so on the way back home, usually at night, we drive through Gilman Springs to come back into Hemet. And we always swear we see shadows/ghost on the sides of the roads but chock it up to us being tired from a long day and our eyes playing tricks on us. Well, we drove with one of our friends recently to a Disney D23 event, and on the way home we of course drove through Gilman Springs. Well when we got home our friend (who sat in the passenger seat) told us that she saw a creepy pale face smiling from the back seat of the car right next to me (sat in the back while my gf drove).....and as she told us this we literally saw goosebumps form all over her body so we knew she was being serious and this shit scared the fuck out of us. Now we know it might not just be our eyes playing tricks on us. The road is also on native American land and has a canyon called massacre canyon and scientology owns a huge establishment and castle near there as well. Alot of creepy shit goes on there. \nupdate\nWe ended up not sleeping much at all that night, our friend who saw the face, was basically in shock for most of the night and couldn't sleep until the sun came up, and even then, was having nightmares, but we were all struggling to sleep peacefully and my girlfriend had horrible nightmares too. \nFor those who ask why she didn't say something while we were driving, basically she said she was immediately observing the \"if you see something no you didn't, if you hear something no you didn't\" rule, AND we were driving on a very dangerous piece of road so she was trying not to startle the driver while also just immediately freezing with fear, so that combination kind of contributed to that.", "media": null, "score": 58, "upvote_ratio": 0.95, "comment_count": 13, "over_18": false}, "12": {"id": "1dbmcdc", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Saturn-Rover", "link_flair_text": null, "time": 1718419361.6903684, "created_utc": 1717910986.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1dbmcdc/narrators_lets_not_meet/", "title": "Narrators... let’s not meet.", "permalink": "/r/LetsNotMeet/comments/1dbmcdc/narrators_lets_not_meet/", "selftext": "I posted a story fairly recently as a means of self therapy of sorts. I wanted to write it out to help myself heal and move on from the trauma. \nIn this story, I was abandoned in the woods with a psychopath that wanted sex from me, and stabbed me when I refused, which led me on the most strenuous endeavor I’ve ever embarked on to survive.\nWriting the post was hard for me. It took me over two hours to write it out. I had anxiety attacks as I was revisiting it. \nI said I didn’t want it narrated. I explained that it was hard for me to write, and I wasn’t interested in having it narrated. I didn’t see it beneficial to the healing process, at least not any time in the immediate future.\nDespite this, I received 10 requests for a narration. I made another edit saying I didn’t want it narrated. I received another 10.\n20 narrators. 20 with zero regard or respect for someone’s objections. I know most narrators are probably so desperate for content that they just send an automated message requesting stories from everyone who posts. Others probably read the post, but figure they’ll give it a shot, and for whatever reason, they’ll be the exception to the rule.\nRegardless. Narrators...LETS NOT MEET!!!!\nEdit: OMG, there are narrators literally asking me if they can narrate this post. Please, if anyone ever posts here, just know that narrators don’t care about your pain, suffering, or damage. They are literally just using you for content and aren’t even giving you the respect of reading your stories. I’m done. I’m out.", "media": null, "score": 115, "upvote_ratio": 0.92, "comment_count": 9, "over_18": true}, "13": {"id": "1dcfz6g", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Ange1D3vil", "link_flair_text": null, "time": 1718419361.9754558, "created_utc": 1718005209.0, "url": "https://www.reddit.com/r/threekings/comments/1dcfz6g/experience_the_stalking_game_part_3/", "title": "[Experience] The Stalking Game [Part 3]", "permalink": "/r/threekings/comments/1dcfz6g/experience_the_stalking_game_part_3/", "selftext": "Part 1\nPart 2\nThis is a continuation of the other posts on a different account. It serves as an update to the previous posts.\nTo summarize, I successfully completed The Stalking Game. It granted me a vision of the future and it came true.\nAt the time, I had yet to understand my mental health fully. It took me all these years, but I can finally say I'm in a better place emotionally and am working hard to improve every day. Given all these things, I still struggle with my illnesses.\nSince performing the ritual, I have been diagnosed with schizoaffective disorder. The thing about schizoaffective is it's basically schizophrenia with the addition of a mood disorder. Schozo Plus if you will. It comes in 3 varieties: manic, depressive, and mixed. I have recently discovered through suffering an intense manic episode that I am a mix of both. Thus, in some way, it appears the prediction in my dream was correct and I was, indeed, diagnosed bipolar.\nThanks for keeping up with my posts despite the lack of activity. Any insight welcome! ", "media": null, "score": 5, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "14": {"id": "1dcc4zg", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "ZucchiniDisastrous51", "link_flair_text": "WDYT? (What Do You Think?)", "time": 1718419362.498207, "created_utc": 1717990409.0, "url": "https://www.reddit.com/r/Ghosts/comments/1dcc4zg/black_mass_walking_to_my_car_at_night_after_my/", "title": "Black mass walking to my car at night after my shift ", "permalink": "/r/Ghosts/comments/1dcc4zg/black_mass_walking_to_my_car_at_night_after_my/", "selftext": "Story time, this just happened to me. I just got home not even 10 minutes ago and I'm at a loss honestly.\nI work at a Dairy Queen, and we have a field parking area sort of for employees. I'm the only person who actually uses it, it keeps my car out of the actual parking lot, and the hundreds of people who come to get food/ice cream.\nI was working night shift tonight and after we were done,I was heading to the field where my car is parked. It's pitch black out there aside from a motion light that turns on at the entrance of the gate. I was walking to my car and almost walked right into this black mass. It was darker than the night. My body immediately reacted to it, all the hairs standing up on edge. I almost felt as if a small sudden rush of static washed over my whole body. I walked around the mass and b lined to my car. Fumbled for the keys and got in. When I opened the door my lights sort of illuminated the area and there was literally nothing there besides a small, old Dairy Queen Sunday cup. This mass was about as big as a gorilla, only thing I can really compare it to. Nothing followed me home and I feel fine now but in those few minutes I Felt everything.\nWhat the hell was it???? Has anyone else experienced this? I'm so curious now, it's all I can think about. -Dq Shift lead", "media": null, "score": 93, "upvote_ratio": 0.89, "comment_count": 37, "over_18": false}, "15": {"id": "1dbt6id", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "cemma2035", "link_flair_text": "Glitch Vid", "time": 1718419362.676964, "created_utc": 1717938006.0, "url": "https://i.redd.it/1hyyy5hpnj5d1.jpeg", "title": "A girl made a video, 2 days later, the same person made a follow up video but now it's a guy and even the original video is now a guy. 150+ comments swearing they remember it being a girl. I made the original comment and I'm telling you I remember a girl. It freaked me out a bit tbh. ", "permalink": "/r/GlitchInTheMatrix/comments/1dbt6id/a_girl_made_a_video_2_days_later_the_same_person/", "selftext": "", "media": null, "score": 172, "upvote_ratio": 0.75, "comment_count": 34, "over_18": false}, "16": {"id": "1db4xkt", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "MK121895", "link_flair_text": "Article", "time": 1718419364.2465165, "created_utc": 1717858997.0, "url": "https://www.irishstar.com/news/us-news/us-politician-ufo-investigation-controversy-32985051", "title": "US Congresswoman Ana Paulina Luna claims she was 'men in blacked' after UFO investigation", "permalink": "/r/ufo/comments/1db4xkt/us_congresswoman_ana_paulina_luna_claims_she_was/", "selftext": "", "media": null, "score": 317, "upvote_ratio": 0.91, "comment_count": 90, "over_18": false}, "17": {"id": "1db9mnf", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Nacho_Libre_Ahora", "link_flair_text": "Video", "time": 1718419366.0141807, "created_utc": 1717871981.0, "url": "https://v.redd.it/hd1nr2cc7e5d1", "title": "NFL player Andre James describes the UFOs he saw when flying with the Raiders.", "permalink": "/r/UFOs/comments/1db9mnf/nfl_player_andre_james_describes_the_ufos_he_saw/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/hd1nr2cc7e5d1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 338, "width": 640, "scrubber_media_url": "https://v.redd.it/hd1nr2cc7e5d1/DASH_96.mp4", "dash_url": "https://v.redd.it/hd1nr2cc7e5d1/DASHPlaylist.mpd?a=1721011364%2CZGU5YmU4MTMzNjM4NzgyMjVhOGIzYjg0MTBkY2ViNzIyOTlkZTc2OGYwZWVmYTg4NGNlNjA0MTE1MDNiZTA4NQ%3D%3D&v=1&f=sd", "duration": 112, "hls_url": "https://v.redd.it/hd1nr2cc7e5d1/HLSPlaylist.m3u8?a=1721011364%2CNjM3NDU3OGM0ZWUzODg5ODg3MzdkYTc3ZGUwZWQ5NmZiMzlhY2YyMjk2ODlmOWFmYzhmZDk0ZTI4MGFhNjg3Yg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1934, "upvote_ratio": 0.93, "comment_count": 246, "over_18": false}, "18": {"id": "1dev50x", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "frankievalentino", "link_flair_text": "Video", "time": 1718419367.704906, "created_utc": 1718272094.0, "url": "https://v.redd.it/gr7wu0iy7b6d1", "title": "Shapeshifting UFO Appears to Take Angelic Form", "permalink": "/r/aliens/comments/1dev50x/shapeshifting_ufo_appears_to_take_angelic_form/", "selftext": "", "media": null, "score": 1976, "upvote_ratio": 0.89, "comment_count": 369, "over_18": false}, "19": {"id": "1dds01s", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "News", "time": 1718419368.0230563, "created_utc": 1718147412.0, "url": "https://x.com/ddeanjohnson/status/1800659245286699199", "title": "[D. Dean Johnson] The US House of Representatives Rules Committee has turned down multiple proposed UAP Amendments to the FY25 NDAA, including the UAP Disclosure Act recently proposed by Rep. Robert Garcia (D-CA).", "permalink": "/r/UAP/comments/1dds01s/d_dean_johnson_the_us_house_of_representatives/", "selftext": "", "media": null, "score": 58, "upvote_ratio": 1.0, "comment_count": 8, "over_18": false}, "20": {"id": "1deowjw", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "ExpressSun518", "link_flair_text": null, "time": 1718419369.0029523, "created_utc": 1718247621.0, "url": "https://i.redd.it/6qyyrpac896d1.jpeg", "title": "Save this map, you’ll need it.", "permalink": "/r/conspiracy/comments/1deowjw/save_this_map_youll_need_it/", "selftext": "Can someone explain one part or more please? Let’s try to have it all in one place and see the dots connecting.", "media": null, "score": 1725, "upvote_ratio": 0.87, "comment_count": 464, "over_18": false}, "21": {"id": "1dg00pa", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Affectionate_Bet_793", "link_flair_text": null, "time": 1718419369.252609, "created_utc": 1718395779.0, "url": "https://podcasters.spotify.com/pod/show/alien-tom/episodes/New-Normal-News-15-June-14--2024-e2ks18a", "title": "Under the Radar News & Headlines Not Covered by MSM", "permalink": "/r/conspiracyfact/comments/1dg00pa/under_the_radar_news_headlines_not_covered_by_msm/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "22": {"id": "1dc7by5", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Ajiatsukinowaguma", "link_flair_text": "PGF", "time": 1718419369.96638, "created_utc": 1717975399.0, "url": "https://i.redd.it/i9nmrh9uqm5d1.jpeg", "title": "If Bob Gimlin came out tomorrow and said 'Patty' was a hoax and a man in a suit, how would you react? Would you stop believing in Bigfoot altogether?", "permalink": "/r/bigfoot/comments/1dc7by5/if_bob_gimlin_came_out_tomorrow_and_said_patty/", "selftext": "", "media": null, "score": 326, "upvote_ratio": 0.89, "comment_count": 333, "over_18": false}, "23": {"id": "1db7kyx", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Art", "time": 1718419370.5413227, "created_utc": 1717866338.0, "url": "https://i.redd.it/0pecpbblqd5d1.jpeg", "title": "\"Dragons\" and other winged flying creatures have occasionally and controversially been speculated to be living pterosaurs (or at least an animal that evolved to look like them). In this painting by Jirka Houska, we see St. George making peace with the dragon.", "permalink": "/r/Cryptozoology/comments/1db7kyx/dragons_and_other_winged_flying_creatures_have/", "selftext": "", "media": null, "score": 235, "upvote_ratio": 0.92, "comment_count": 49, "over_18": false}, "24": {"id": "1dcxc32", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "clayvn", "link_flair_text": "Humanoid", "time": 1718419370.7303946, "created_utc": 1718055346.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1dcxc32/extremely_positive_experience_i_had_in_2018/", "title": "Extremely Positive Experience I Had in 2018", "permalink": "/r/Humanoidencounters/comments/1dcxc32/extremely_positive_experience_i_had_in_2018/", "selftext": "Full Disclosure:\nI posted about this before years ago, but have since removed the post because I embellished some details about where I was staying, as I was afraid of not being taken seriously. \nI am not sure what sort of entity I encountered. I won't claim to know what it was, and I doubt I will ever truly understand what happened. \nThis was not sleep paralysis or a dream. I was fully conscious and awake when it happened, relaxed, and able to move around, speak, and see clearly. I've had sleep paralysis a few times before, but it's very rare for me and when I've had it I was completely unable to move and overwhelmed by panic and fear. I was sober at the time and I don't have a psychotic disorder or anything like that.\nLocation and Context:\nThis happened in the hills of Hollywood, CA in 2018. Specifically, I was staying at a medical detox center that was located in a normal two-story house in a nice, quiet neighborhood.\nBefore coming to this detox, I had been sober for 1-2 months off stimulants and alcohol. I was feeling pretty normal other than having a lot of anxiety and urges to use. I had been staying at a sober living during this time, and relapsed on a legal drug called Phenibut which is an unremarkable downer similar to Lyrica and Gabapentin. I took it for 2-3 days before staff caught on. \nI wasn't going through withdrawal, but they had me stay at their detox due to liability and so they could monitor me, which is a common practice for places like this. I felt fine the next day after I slept off the drowsiness from the Phenibut high. \nExperience:\nThis encounter happened on the 7th or 8th day that I was there. I was sitting in bed reading in the room I was staying in. The overhead lights in the room were on and the door was closed. I heard a rustling sound and felt like there was someone in my room, so I put down my book. \nBy the door, I saw what at first looked like an old woman. I couldn't make out all of her features but she was probably about 5'2\", hunched over, and wearing several long silver necklaces, and dangly earrings. She had messy jet-black hair covering her face, so I couldn't make out any facial features. She had grey somewhat wrinkly skin and long arms and fingers that went past her knees. She was wearing a white sleeveless floor-length dress with a scoop neck that showed the top of her chest. She was flat-chested with wide shoulders and bony collarbones and wrists. She carried a walking stick that looked like a twisted branch from a tree.\nThe way she moved was fluid and ethereal, but also somewhat robotic. She waddled towards me and her footsteps sounded like sticky bare feet on vinyl flooring. I wasn't scared of her at all. It looked like she was signing with her hands, similar to someone who gestures a lot while talking, and made labored sounding grunts as if she was frustratedly trying to communicate with me. \nI moved to sit on the edge of the bed facing her. She held out a handwritten note to me that had most of the lines on it scratched out aggressively. I looked at it but didn't have much time to examine it, maybe less than a minute. I couldn't make out what it said, but it seemed like it had to do with my life or my past. It felt immediately very meaningful.\nAt that point I was in a trance like state. She stood beside me and essentially transmitted meaning into my mind. She told me that everything was going to be ok and that things would get better. I felt very safe and comforted. I didn't hear words in my head, just feelings of pure love and hope. I said \"Okay\", handed the note back to her, and turned away. I came out of the trance what felt like a few minutes later and the next thing I knew she was gone.\nI went outside to smoke a cigarette, looked up at the night sky, and felt an incredible sense of peace and calmness overcome me. The feeling was better than anything I'd ever felt before. I didn't feel worried about the encounter because throughout it I never felt like I was in danger. She seemed like she was trying to protect me or watch over me. I imagine this is what unconditional love feels like. I felt truly relaxed and serene until I went to bed.\nThis experience sticks out to me and I think about it often. I've never experienced anything else like it. It was overwhelmingly positive, unexplainable and unexpected. Without going into too much detail, the previous few years before this happened were extremely difficult and dark for me, and it made me realize that it's possible to have hope again and that there is something else out there besides my own suffering.", "media": null, "score": 64, "upvote_ratio": 1.0, "comment_count": 15, "over_18": false}, "25": {"id": "1ddqjba", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Flamegrilledsnake", "link_flair_text": null, "time": 1718419371.7083714, "created_utc": 1718143491.0, "url": "https://v.redd.it/episw5rom06d1", "title": "Thoughts on Cryptid Tattoos?", "permalink": "/r/cryptids/comments/1ddqjba/thoughts_on_cryptid_tattoos/", "selftext": "Cryptids have fascinated me for as long as I can remember, the Wendigo being the most intriguing to me. Has anyone else got Cryptid Tattoos? Would you get one? What would you get?", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/episw5rom06d1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/episw5rom06d1/DASH_96.mp4", "dash_url": "https://v.redd.it/episw5rom06d1/DASHPlaylist.mpd?a=1721011370%2CMjIxNGYxZjViYjU0MmFmNTU2YjA0ZDc1NTg4MzBlYjAxZWY2ODg5YzRiMzE3Y2M5YTAwNmM2MWVkYjMzOWZkMQ%3D%3D&v=1&f=sd", "duration": 4, "hls_url": "https://v.redd.it/episw5rom06d1/HLSPlaylist.m3u8?a=1721011370%2CZDgxMTM5MTU3NjNmODRhNzE1MjdhY2I5YjM3Nzc4NTA4ODBlZTE5ODdiZjMwNDQ3MTJmNzZmMWM5MWZiNGQxYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 368, "upvote_ratio": 0.93, "comment_count": 57, "over_18": false}, "26": {"id": "1daybiz", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "KingKuko", "link_flair_text": null, "time": 1718419371.8809984, "created_utc": 1717835765.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1daybiz/confusing_memories/", "title": "Confusing memories?", "permalink": "/r/Thetruthishere/comments/1daybiz/confusing_memories/", "selftext": "I was at work one day and was given a task by my manager to go get something from the freezer. When I was walking to the freezer I had a sudden rush of deja Vu. I didn’t think anything of it until I started to “remember” a dream I had. The “dream” didn’t feel like a dream but a memory. Like I had a sudden rush of remembering dreams of the last 20 years all at once. The thing is that when I would think of them they felt like actual memories that I’ve had, and when I tried to pin point what I was even trying to think of, new memories kept flooding into my thoughts and I couldn’t articulate what the memory I saw was. I was so genuinely confused I couldn’t move, I could move but I was moving super slowly through my tasks. It was a super weird feeling. Like I just felt memories of myself that never happened being implanted into my conscious. That’s the best way I can describe it. It’s almost as if I was simultaneously experiencing a life from a different universe. I have had a handful of near death experiences if that matters. Anyone else experience the same thing?", "media": null, "score": 7, "upvote_ratio": 0.77, "comment_count": 6, "over_18": false}, "27": {"id": "1dek7a1", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "jldeep", "link_flair_text": null, "time": 1718419372.0752013, "created_utc": 1718233280.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1dek7a1/i_was_punched_in_the_face_while_delivering_taco/", "title": "I was punched in the face while delivering Taco Bell. This happened in a crowded area, right in front of the police.", "permalink": "/r/LetsNotMeet/comments/1dek7a1/i_was_punched_in_the_face_while_delivering_taco/", "selftext": "This happened last July (2023), but a hilariously unfortunate Instagram notification reminded me of this unusual incident. My birthday was yesterday, and I (26M) got a \"celebrate the year!\" notification that an algorithm paired with a picture of my black eye from when I first posted about what happened. While this is far from the creepiest encounter on this subreddit, it's certainly a bizarre one.\nFor context, I was a struggling homeless DoorDash delivery \"driver\" in New York City at the time of this incident. I say \"driver\" in quotes because back then, I didn't have a car or know how to ride a bike. I made deliveries either by taking the subway trains or limiting my delivery radius to a mile or less.\nI tried to stay in hostels whenever I could afford them, but on one unlucky night last July, I was out making deliveries at 4 in the morning since I had nowhere to go. Maneuvering on-foot with food at this time made me an easy target, so I decided to stay near the highly populated and brightly lit Times Square area.\nI received an order from the Taco Bell in Times Square and accepted it since it paid well, and the destination was less than a mile away. As I turned the first corner, I felt something was off.\nI noticed two men walking closely behind me. Given the bright lights and tourists surrounding me, I initially dismissed the uneasy gut feeling that I was being stalked. Then, they started walking faster and closer. I started changing my movement patterns, and they copied my exact movements.\nAt this point, I realized they were probably after the food I was carrying. I eventually said, \"back off!\". They kept following closely behind. I started walking faster, with the men also increasing speed.\n\"BACK THE FUCK OFF!!!\" I yelled more aggressively. They continued to follow closer. Tourists and bright lights still surrounded me, even at this point. As I approached the intersection into the following neighborhood, I continued shouting at my stalkers. One of them yelled, \"Shut up!\" while the other punched me in my right eye.\nLuckily, I caught the attention of the police who were right at the intersection where I was punched. Unfortunately, this was also the moment I lost all faith in the NYPD. The men that attacked me fled, and two cops started chasing them. However, the bumbling morons lost sight of the attackers before even a minute passed.\nI stayed at the scene for about a half hour or so with about six officers, with a couple of them interviewing the many witnesses. I remember feeling a sense of validation for what I just went through when one of the witnesses came up to me and said, \"That's fucked up, man. I hope they get 'em!\".\nThe officers eventually had me ride in one of the patrol cars to see if I could identify the attackers. My memory of them was hazy due to the chaos, but I remembered the clothes they wore. We eventually passed by some other officers cuffing the attackers, who I was able to identify from their clothing and from seeing their faces again.\nI was advised to go to the hospital, which I initially declined due to my financial situation. However, I eventually decided to go since I had no idea how severe my injuries were. Ultimately, I only had a black eye that healed after a few days.\nThe DoorDash order was canceled despite the customer making no attempts to contact me. This meant I got full pay and could keep the Taco Bell Cravings Box for myself. Not gonna lie, it was nice to have a place to rest for a bit and enjoy a free meal, despite it being cold by that point. After examination, I was permitted to rest for a few hours, when I was rudely awakened and told to leave in ten minutes before security was called.\nMy takeaway from this incident is that even in brightly lit areas with multiple eyewitnesses, it's always best to stay aware of your surroundings. Food delivery at night is no joke - believe me, I have a laundry list of other sketchy encounters I could share here. But this was the only time I was attacked in front of so many others, including police officers themselves! \nThankfully I now have a full-time job and my own place, so these incidents are far less likely to occur to me. Even though I'm in Texas now, I still say to the dumbass hungry stalkers that tried to rob me in front of the cops - let's not meet!", "media": null, "score": 109, "upvote_ratio": 0.94, "comment_count": 13, "over_18": true}, "28": {"id": "1dc29ud", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "AM1119", "link_flair_text": null, "time": 1718419372.3729067, "created_utc": 1717962185.0, "url": "https://www.reddit.com/r/threekings/comments/1dc29ud/what_candle_color_can_i_light_to_give_the_spirit/", "title": "What candle color can I light to give the spirit in my house more energy/power?", "permalink": "/r/threekings/comments/1dc29ud/what_candle_color_can_i_light_to_give_the_spirit/", "selftext": "If I can't do that with candles then what will I need to help it gain more energy/power?", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "29": {"id": "1dfhldx", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "WarthogUnhappy9979", "link_flair_text": "Is this paranormal?", "time": 1718419372.8296862, "created_utc": 1718336315.0, "url": "https://v.redd.it/b02xg573kg6d1", "title": "WTF how and why did this balloon in the kitchen start moving turn the corner come into my bedroom come behind me hit me in. Head then come back to door then go back into my room??something woke me up I sat on side of bed my birds even woke up ", "permalink": "/r/Ghosts/comments/1dfhldx/wtf_how_and_why_did_this_balloon_in_the_kitchen/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/b02xg573kg6d1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/b02xg573kg6d1/DASH_96.mp4", "dash_url": "https://v.redd.it/b02xg573kg6d1/DASHPlaylist.mpd?a=1721011372%2CZWQ2YTc4NDYxMTIzMWI0NDU4NGQ5MjcwNzc5ODcxZWI3ZTI4MjdlZDc3M2JlMGNjZDU0MGQxZjhhODE2ZmZhNQ%3D%3D&v=1&f=sd", "duration": 128, "hls_url": "https://v.redd.it/b02xg573kg6d1/HLSPlaylist.m3u8?a=1721011372%2CMjE2ZjY0ZjFkNTUyODQ5YzY4MDU1YjEzNWQyYmI4ZTBhZTllMGFlNGY0NDZiZTU1ZmE4NjM1ZjZmNTk1ZWVmZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 84, "upvote_ratio": 0.72, "comment_count": 80, "over_18": false}, "30": {"id": "1dca20e", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Just_Database_8888", "link_flair_text": "Glitch Pic", "time": 1718419373.0272405, "created_utc": 1717983738.0, "url": "https://i.redd.it/g5vbmxvofn5d1.jpeg", "title": "is that the end of a skybox or something?", "permalink": "/r/GlitchInTheMatrix/comments/1dca20e/is_that_the_end_of_a_skybox_or_something/", "selftext": "", "media": null, "score": 71, "upvote_ratio": 0.93, "comment_count": 4, "over_18": false}, "31": {"id": "1deo8le", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Stephen_P_Smith", "link_flair_text": null, "time": 1718419374.6356692, "created_utc": 1718245476.0, "url": "https://www.dailymail.co.uk/sciencetech/article-13514283/pentagon-official-blue-ufo-encounter-canada.html", "title": "Pentagon official reveals tantalizing seven-minute encounter with glowing blue UFO - which emitted enough energy to 'power a small city'", "permalink": "/r/ufo/comments/1deo8le/pentagon_official_reveals_tantalizing_sevenminute/", "selftext": "", "media": null, "score": 237, "upvote_ratio": 0.86, "comment_count": 50, "over_18": false}, "32": {"id": "1dflrc7", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "MissMorticia69", "link_flair_text": "Classic Case", "time": 1718419376.0052724, "created_utc": 1718352725.0, "url": "https://i.redd.it/e6e4zrovwh6d1.jpeg", "title": "I got this from Bob Lazar", "permalink": "/r/UFOs/comments/1dflrc7/i_got_this_from_bob_lazar/", "selftext": "Here’s a look at the UFO sketch by Bob lazar and signed by him too 🙂", "media": null, "score": 1881, "upvote_ratio": 0.86, "comment_count": 441, "over_18": false}, "33": {"id": "1deet8q", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "pokezillaking", "link_flair_text": "Question :snoo_thoughtful:", "time": 1718419377.5888956, "created_utc": 1718219454.0, "url": "https://i.redd.it/29w317jiw66d1.png", "title": "is this possible??", "permalink": "/r/aliens/comments/1deet8q/is_this_possible/", "selftext": "", "media": null, "score": 1077, "upvote_ratio": 0.87, "comment_count": 393, "over_18": false}, "34": {"id": "1deafl4", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "Discussion", "time": 1718419377.9775555, "created_utc": 1718208609.0, "url": "https://x.com/NewParadigmInst/status/1800916449411928301", "title": "The next POTUS will make critical decisions about UAP disclosure and government transparency. It’s time for all presidential candidates – Joe Biden, Robert F. Kennedy, Jr, and Donald J. Trump – to commit to UFO/UAP disclosure and transparency. TAG THE CNN MODERATORS & CANDIDATES ON X! ", "permalink": "/r/UAP/comments/1deafl4/the_next_potus_will_make_critical_decisions_about/", "selftext": "", "media": null, "score": 40, "upvote_ratio": 0.79, "comment_count": 5, "over_18": false}, "35": {"id": "1ddvw0u", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "MainBrief2189", "link_flair_text": null, "time": 1718419378.9965165, "created_utc": 1718159097.0, "url": "https://i.redd.it/5zomhmf3x16d1.png", "title": "Is this a \"smoke screen\"?", "permalink": "/r/conspiracy/comments/1ddvw0u/is_this_a_smoke_screen/", "selftext": "", "media": null, "score": 1711, "upvote_ratio": 0.8, "comment_count": 493, "over_18": false}, "36": {"id": "1dby41p", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "geraldo555", "link_flair_text": null, "time": 1718419379.2566643, "created_utc": 1717951462.0, "url": "/r/conspiracy/comments/1dbmpbv/elon_musks_ai_chatbot_accidentally_discloses_his/", "title": "Elon Musk's AI chatbot reveals real outer-space conspiracy. ", "permalink": "/r/conspiracyfact/comments/1dby41p/elon_musks_ai_chatbot_reveals_real_outerspace/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.75, "comment_count": 0, "over_18": false}, "37": {"id": "1db22dt", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Ok_Selection_8570", "link_flair_text": "merchandise", "time": 1718419379.9576519, "created_utc": 1717850409.0, "url": "https://i.redd.it/ifqp5gk8fc5d1.jpeg", "title": "Airport Attire ", "permalink": "/r/bigfoot/comments/1db22dt/airport_attire/", "selftext": "", "media": null, "score": 253, "upvote_ratio": 0.97, "comment_count": 39, "over_18": false}, "38": {"id": "1dcl8gd", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "ACLU_EvilPatriarchy", "link_flair_text": "Sightings/Encounters ", "time": 1718419380.4871297, "created_utc": 1718025295.0, "url": "https://i.redd.it/rx01ud09vq5d1.jpeg", "title": "Terrifying tales of giant spiders sighted by Military personnel in the Americas with future President Teddy Roosevelt reporting giant spiders that ate dogs in South America and further reports of horse eating spiders in South America.", "permalink": "/r/Cryptozoology/comments/1dcl8gd/terrifying_tales_of_giant_spiders_sighted_by/", "selftext": "The Goliath birdeater (Theraphosa blondi) belongs to the tarantula family Theraphosidae. Found in northern South America, it is the largest spider in the world by mass (175 g (6.2 oz)) and body length (up to 13 cm (5.1 in)), and up to 30.5 cm leg span second to the giant huntsman spider by leg span.\nSeveral stone Indian pipes having been excavated from Mound Builders culture sites depicting a massive hairy spider with a human skull death's head. The stone Precolumbian Midwestern Indian pipe example in the above pic displays a spider body length of nearly 8 inches (for a stretched out leg span approaching 2 feet across). An oddly heavy enormous pipe overall length associating human fatality with its design.\nGiant spider reports from  North America from 2 feet across leg span and up to 8 times the weight of a large South American Goliath Bird Eater dinner plate spider, to the size of a man, to approaching the size of a Volkswagen beetle automobile killing a German Shepherd dog and spinning a cocoon around it while shooting silk threads from its abdomen, near a Military Base and swamp.\nWestern reports 2:15 in onward and comments:\nhttps://youtu.be/rG8uyaa-tAc?si=d0vDtV_0hvULc3GE\nVideo footage of a giant tarantula of unknown species carrying off an opossum:\nhttps://youtu.be/cuKfAFI19pg?si=uhxUpIRf0g-g5eRD\nCongo giant spider in tree canopy:\nhttps://youtu.be/imgh92fB2qg?si=EVNINltF8RdCY5_i", "media": null, "score": 151, "upvote_ratio": 0.87, "comment_count": 64, "over_18": false}, "39": {"id": "1df1qw5", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Ufonauter", "link_flair_text": "U.F.O. Humanoid", "time": 1718419380.6930897, "created_utc": 1718292538.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1df1qw5/from_1940_to_1952_cathie_connelly_would_be_taken/", "title": "From 1940 to 1952 Cathie Connelly would be taken on series of strange and curious  journeys across the globe by alien beings.", "permalink": "/r/Humanoidencounters/comments/1df1qw5/from_1940_to_1952_cathie_connelly_would_be_taken/", "selftext": "The following text is taken directly out of the UK magazine \"gemini\" issue no.1 of 4 which ran only within the year 1972. Mrs. Connelly in this was speaking to investigator R W Tibbitts and G ashby. The managing editor of this magazine Norman T Oliver also chimes in after the bulk of the text and can be read within the source at the bottom of the post (16-20 pdf; 28-37 true page number). The larger more detailed image comes from a separate magazine issue and was not part of the original gemini issue.\nMrs Cathie Connelly is a very pleasant Coventry lady in her late forties altogether the opposite sort of person from whom the following type of story usually emanates. Her story is startling and it has too many references tying in with points from other contact claims for it to be disregarded as utter nonsense. This story that Mrs Connelly tells is a long one. It has all the ingredients one expects in a case of its kind, yet it is bewildering, misleading and very complicated with many implications. At first hearing, the case seems too incredible to have really taken place; but when considering the age of her experiences and also that Mrs Connelly's command of English is not all she wishes it were, we can understand that she has become confused, and in turn, the story which she tells is now mixed up and hard to understand.\nShe states her first contact with beings from the 'unknown' was in 1940, and the last in 1952, although she claims that even now she meets these 'people' in the streets of Coventry. The only way she recognises them is by their action of 'touching' a special 'watch' worn on their wrists. This, she says, seems to bring more of the experiences back to her.\nHere, then, is Cathie's story:-\n\"One Sunday afternoon during the war years, I was out walking down a lane in Meriden, near Coventry. By sheer accident I came across a metal, dome-shaped structure which I then took to be a permanent building. Next to this structure, apparently poking up through the grass, was a row of smoking chimneys.\n\"There were tall men all around the structure, seemingly adjusting some thing at the centre. As I walked past them the man who was facing the lane raised his hands to face level, he appeared to be cleaning them with a duster. As he walked closer to me I gave him a smile, but he didn't smile back until he had finished cleaning his hands and then this was a 'slow' smile, he seemed to be weighing me up.\n\"All the men were wearing one-piece garments. They had unusually high foreheads and their skin seemed to be tanned. This was unusual because during the war people tended to be \"pastey-faced'. There was also something definitely different about the eyes.\n\"The structure appeared to be quite strong solid that is, giving off a grey-blue light. I recall walking past, and on retracing my steps was surprised to find it had gone.\nThe next contact\n\"A few months later I had a second experience. This time it took place at work when I was inspecting some chain links in the machine room, with a micrometer I had been given. As I did this, a man who looked like the men I had seen at Meriden spoke to me and said, \"Your war is upsetting my world.\" I reminded him that it was his war too, but he replied, \"I don't come from this world take me to your King and Queen\". I told him that I could not. He asked if I was colour blind, and I said not. He then asked who he should contact, and I told him he should contact the head scientists and leaders at their country homes.\n\"He asked me several times if I would go with him. Once he asked me to go on a long journey and see \"nice colours\". I refused. He had no accent and I don't recollect seeing him again at the factory during the three years that I worked there.\n\"If I ever got depressed or miserable I used to think of this unusual person and yearn for a meeting with him. Then one day in 1951, I arrived home to find I had a visitor. He explained that he was a messenger and said that he had asked to sign for the job. He said that unless I really DID want to meet the person I had met at the factory, I was to refrain from thinking and intruding upon his thoughts. I was completely bewildered and recalled thinking he must have been mad, as it was impossible for me to have done that.\n\"I was taken several times to the craft, which was usually situated upon some lonely grassland spot. I got the impression that these people had something for erasing your memory from the time of contact until you were on the craft. I am sure that it had something to do with the \"watch\" they wore on their wrists.\nOld Nick?\n\"One time I found myself in a spacecraft, surrounded by men who were holding me down on a table. One of them said, \"We are not going to hurt you we only want to see if you are pregnant.\" I said, \"What's that?\" He answered with a question: \"You don't know?\" (Mrs C must have led a sheltered childhood.)\n\"I then said, \"My mother says that if you go out at this time of night, Old Nick will get you: why have you come for me? I have not hurt anyone.\" He then asked who \"Old Nick\" was and I replied that he was the Devil. I said if he was not the Devil he could not be God because his skin... then I stopped short and said that no-one had told me the colour of God's skin.\nhttps://preview.redd.it/hsq7p7bltc6d1.jpg?width=600&format=pjpg&auto=webp&s=cf0d6bff0df4b5083c6b851bf048a006217768a0\n\"The man had slits at the side of his mouth reaching almost to his ears. The ears were long and animal-like, lying flat upon his head. His nostrils were long straight holes, disappearing up into his face. His coloured skin was unblemished. Most of the crew looked similar to us, averaging six to seven feet in height, with high foreheads and greased black hair cut just above the shoulders. Others in the craft were different: they had blue complexions in fact it was one of these men who talked to me.\" Mrs Connelly says she was told that the beings resembling us were \"prisoners\" and that the others were free to come and go from the craft. To some it might seem more likely that those beings who were very different to us were in fact \"prisoners to the craft\", either because of responsibilities or because they could not exist long in our atmosphere. Mrs Connelly continues:\n\"The man (interrogator) had a cat-like face with no whites to his eyes which were set to the side of his face. The men similar to him all wore either blue or brown one-piece overalls.\n\"I told him that we had very good plastic surgeons and explained to him what they could do to change his face. Gently he replied, \"If I had everything changed, then I would be alright.\"\n\"The craft inside was about the size of four double bedrooms. It was well lit all through, but I could not tell where the light came from. One side of the wall was filled with row upon row of meters. In the centre was the table which was made of some sort of fibre glass, this slid into the floor.\nAircraft upon the scanner\nhttps://preview.redd.it/khiw587ytc6d1.png?width=569&format=png&auto=webp&s=9a1e6946b65b9a18de246362b0f141e5f1661908\n\"As I looked through the scanner I could see that we were traveling, for I saw aeroplanes engaged in combat: I could hear the crews of the aircraft speaking. Looking down to some water below I could see ships and said that there were too many people in them. All the time a voice kept saying above my head: \"This is your world!\" I kept denying it.\n\"I pointed to an aircraft and said that this was not my world: \"He is a cockney!\" (Mrs C is Scottish born). The voice repeated: \"This is your world: look, they are coming in all directions.\"\n\"Then one of the crew of one of the planes spotted us. They shouted spasmodically: \"They've got a captive: its a woman: no, its a child: don't shoot: don't fire: I aint 'anging around to find out!\"\n\"Now we appeared to be traveling alongside the aircraft and some of the crew were looking straight at us. One of them made the sign of the cross at me. At this point my space friend asked me if I knew him and I said not. He then asked why he had moved his hands at me, and I explained that he might have been a Catholic and was praying for me. I then said I hoped they would be alright. The man said that I would be.\n\"Then we changed course and I was looking at the Statue of Liberty. My space friend said he wouldn't tell me what I was looking at as he didn't wish to embarass me. We seemed to be flying above a street in New York, and I could see newsvendors selling lots of papers. Something important seemed to have happened: I could see many men but no women.\n\"When we changed course again, I was standing alone at the scanner with my space friend in the middle of the room; the other men had gone into other compartments. Only on one occasion did I hear them speak in any language other than English and this was completely unintelligible.\n\"I thought the most intriguing thing about them was the way they were able to transfer their thoughts: they tried to teach me how to do it. I was told I didn't try hard enough and that anyone could do it. When I didn't wander off and just stared, I found I was able to read their thoughts and answer them. I was asked many questions, such as how blood transfusions were carried out and about household gadgets.\n\"They wanted to know about everything I had ever done or witnessed and what I believed to be right and wrong. Often they did not understand what I meant and asked me to visualise such things.\nChrist\n\"While at the scanner I looked down and saw a man on a cross-shaped stake. A crowd of people running to and fro threw what appeared to be dirt and stones. A small child at the back, unable to see the man, was imitating them. The man was beautiful and I wondered why these people were doing that to him.\n\"The voice above my head said, \"This is your world\". I was indignant and replied that it was not my world and they were savages from the past. Then the voice said, \"Are they any different to that where you come from?\"\n\"At this I burst into tears, rushed to the man in the centre of the room and said that I was sorry I had thought of him as the Devil: that it was peaceful in the craft and Hell outside.\n\"I was told that these people were \"Christians\" in attitude, but were not ceremonious where they came from. They said we were still immature and had to grow up. They showed me a map of a solar system, and a book in which there was writing very similar to Chinese or shorthand. When I asked where they came from, they told me to look to the East to find their people.\n\"The book was fairly thick with a dark embossed cover. Another feature in the craft was a black screen, on which white lettering would appear and seemingly self-erase. I was told that some of the crew had signed on for the mission without knowing really what it entailed. However the leader of the craft was always told the purpose. He was responsible for the craft and never left it unless there was a replacement.\n\"The next time I was in their craft they showed me a film of myself trying to walk across a road by some traffic lights. was always told to do this as it was the best place to cross.\" Several times Mrs C was taken \"back in time\" and saw herself as a young girl.\n\"They were also interested in my hearing. I told them that when anyone spoke to me fast the words got churned and muddled together. Again they asked me if I was colour blind and said only wanted to help me for it was the least they could do. \"You once helped me,\" the man said.\n\"I told him that I didn't help him, but had only told him to go to a plastic surgeon. He said I had done the best I could.\" It seems possible that the beings then operated upon Cathie's eyes in some way and cured her apparent inability to distinguish colours.\n\"They put me under sedation, and when I came round I remember saying that I could not bear anyone touching my eyes. Then I said to the man, \"Your skin must be a green colour, I can see it very clearly on your ears.\"\nOne of the messages Mrs Connelly received from the aliens was, that before people could live together in harmony there would be trouble amongst the races. She was told it could be so bad that people of all races would be ashamed afterwards to mention it.\n\"Another time I was in the craft, the spaceman said there was a bus coming along the road and they wanted me to get on if I could. I said that if there was an empty seat I would get on. They repeated, \"Get on if you can!\"\nIt seems that the craft then landed: so Cathie disembarked and attempted to board the bus. It is possible that all this took place in her mind due to a type of imaging/telepathic process induced by the UFO occupants. It certainly would explain the impracticability of the episode and would also serve as an ideal process by which the alien power could \"teach their lessons\". The question could also be asked as to whether the craft ever did take off. The \"trips\" mentioned could have been deliberately induced by the aliens by means of sedation/telepathy and the black screen mentioned earlier. The reasons for such behaviour by the aliens are not clear, but it is obvious a great deal of confusion is present in Cathie's mind, perhaps as a direct result of the interference made by the experimentations. Cathie continues: \"When the bus stopped and I tried to get on, there was confusion. The people on the bus said that I could not get in: it was not allowed. They all had dark skins.\n\"After seeing an empty seat I forced my way on. They said, \"Haven't you brought Fritz with you?\" I thought they meant a dog, so I said I had no dog and made my way to the empty seat. A young, well-built man was sitting next to it and he opened his knees to make it difficult for me to sit down. I forced myself onto the corner of the seat. The driver then asked me for my fare and I got some money out but he said it was no good. He asked me where I came from, and I told him I came from Coventry. He then told me I would have to get the money changed, but I said I would not be there long enough. I asked him the name of the place and he said \"Rhodesia\". As the bus started I swore because I was so uncomfortable on the corner of the seat. At this, a young lady sitting nearby with a small child on her knee, covered its ears and said, \"You swore!\" I retorted that swearing would not do lasting harm but segregation would.\n\"The man next to me closed his knees: then one of the passengers asked me where I had come from before I had got on the bus. I said I had come in a flying saucer. When I said the people on the flying saucer had told me to get on the bus, it stopped, and the people told me I was upsetting the driver and had to be quiet.\n\"They asked me where I wanted to get off and I said I didn't know but my space friends would meet me. They all went quiet as the bus started up once more, and soon afterwards it was flagged down by the tall spaceman. The driver and the others stretched out their hands in a friendly gesture to help me off the bus. The spaceman grinned and asked if I had behaved myself. The driver said that I had been alright and wished that all white people were like me.\nSquare One\n\"Another time I was on the craft they took me to Florida and we had been talking about Rhesus babies etc., and one of the men said, 'These people know more about Genetics than we do.' There was also some talk about having an exchange of ideas with us. On this occasion also, I saw myself in the past. was kneeling at the altar in a little wooden Salvation Army Church. The captain was with me: I saw myself being daubed with water by him. At this the spaceman asked me what we were doing. I said the captain was reading out what I was then promising to undertake. Then the spaceman asked me if I always kept a promise. I said that I never made promises impossible to keep and I never broke a promise. Then the voice above me said, 'You're back in square one, Cathy, because....' I replied, 'If I'm back in square one because...., what square are all the murderers, liars and thieves in?' (Mrs C couldn't remember the reason for being back in square one.)\n\"The voice replied, 'They are not in any square at all, its up to you to get them in the running.'\n\"I saw myself kneeling at the altar once more and the voice above me said, 'You promised allegiance to God: do you know what allegiance to God means?' I said yes, 'Allegiance to God means allegiance to all people of all religions and creeds.' Then I said that God knows I would never break a promise and that he would help me to keep it.\"\nThere, Mrs Connelly's story ends. It leaves the would-be investigator more baffled than before. However I feel that this case is only a small part of the Universal Jigsaw, but an integral part: each piece fixing together to portray the Truth, but when complete, will we be able to recognise it? To quote Cathie: \"This story was cut short, the odds were against me telling it a story that was meant to end with a miracle.\"\nQuestions put to Mrs Connelly {Q-questions, A-answers}\nQ Why did you walk down the lane at that time?\nA For pleasure\nQ Did you immediately recognise the dome-shaped structure as what you now know to be a UFO? A No\nQ How tall were the men standing around the object in relation to it?\nA About half its size\nQ You said that one man did something with his hands before returning your smile. Could you expand upon this?\nA He, or another man said he had photographed me\nQ What were your impressions when you found the object had gone?\nA Mystified.\nQ How did the watches worn by the aliens affect your memory?\nA I now know that they bring my memory back\nQ What appeared on the scanner?\nA The outside world and scenes through the walls of buildings\nQ Which group of beings called themselves prisoners?\nA The people who looked like us\nQ Were any names mentioned?\nA Yes, Jasiv or Jaskik\nQ Describe the features of the \"blue-skinned\" beings\nA Catfaced\nQ Did they always talk to you in English?\nA Yes\nQ Did they communicate with you in any other way?\nA Yes, Telepathy. The people who looked like us used this too\nQ How did you discern the younger from the older members of the crew?\nA By the smoothness of the skin\nQ Were any future events foretold?\nA Yes, on the scanner\nQ What made you feel these men were from space?\nA They showed me a map of a solar system\nQ What was (is) their purpose in coming to the Earth?\nA To show us our capabilities\nQ Why did they contact you?\nA I was in an ideal place. It had to be someone\nQ How can one contact these people?\nA Praying: this is telepathy\nQ You say you have had recent contact with these people. How did you recognise them?\nA By past acquaintance and their watches. (They touch them with one finger)\nQ Have you been in one of their craft recently?\nA No\nQ Did you ever see any of their craft land or take off?\nA No\nQ Did you ever fly in one?\nA Yes\nQ Did you, or any of the beings, have any difficulty in breathing during your contacts?\nA No\nQ Did you ever leave the Earth in one of their craft?\nA Yes\nQ Did you hear any sounds during your time in and near the craft which could have been a motor?\nA Yes, like fast running water\nQ Were any peculiar smells present during your contacts?\nA No\nOP note: there are additional comments within this article by the interviewers and Normal Oliver but for the sake of post length as well as not confusing my comments for the original interviewers/editors they are not included but can be viewed within the below source.\nsource: https://files.afu.se/Downloads/Magazines/United%20Kingdom/Gemini%20(Stenhoff%20Oakley-Hill%20Oliver)/Gemini%20-%20Vol%201%20No%201%20-%201972.pdf", "media": null, "score": 31, "upvote_ratio": 0.93, "comment_count": 10, "over_18": false}, "40": {"id": "1de1rvq", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "tavernofterrors", "link_flair_text": null, "time": 1718419381.3727503, "created_utc": 1718181389.0, "url": "https://v.redd.it/0tdhznker36d1", "title": "please make it stop", "permalink": "/r/cryptids/comments/1de1rvq/please_make_it_stop/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/0tdhznker36d1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/0tdhznker36d1/DASH_96.mp4", "dash_url": "https://v.redd.it/0tdhznker36d1/DASHPlaylist.mpd?a=1721011380%2CZTA4YzgyZThmZTJhMTc4MGEwZDQwNWE4YTRmNDI4ODQwM2MyYmJlM2UzNWE3MzI4NGYzZDAyMjU2M2MyYzA0NQ%3D%3D&v=1&f=sd", "duration": 12, "hls_url": "https://v.redd.it/0tdhznker36d1/HLSPlaylist.m3u8?a=1721011380%2CNTU2ZjAzZDNjODdjN2QyNmFiYWYzYTFmMjNkYjQzM2ExZTcxZGU1MjBkMDViOWJmOWM3NjRhYWE5NmNiNDYzZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 320, "upvote_ratio": 0.98, "comment_count": 19, "over_18": false}, "41": {"id": "1dfbb3j", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Sillygoose1018", "link_flair_text": null, "time": 1718419381.5513103, "created_utc": 1718316979.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1dfbb3j/a_story_from_when_i_was_younger/", "title": "a story from when i was younger", "permalink": "/r/Thetruthishere/comments/1dfbb3j/a_story_from_when_i_was_younger/", "selftext": "so when i was way younger i think like maybe 7 or 8 i was at home with my sister and my brothers all older then me. we were home alone and we were sitting in my sisters room playing games on our iPad/phones (except my oldest brother) when we hear the sound of a woman humming noticeably an adult woman so my sister wasn't a culprit. at first we had no idea of what to do so we just stayed in my sisters room for a little bit not knowing what was happening. eventually we do get out but discover no ones in the house. we ask our oldest brother (i forget what happens here sorry. but i think he heard it but didn't care since no one was breaking in or something) so as we look around the house we notice the sound never really faded away it only grew louder when we were in our parents room and our dogs seemed to hear it one went in there and just slept the other two stayed away they didn't bark once during this whole thing. eventually we call our parents and they don't know what's happening and that they're on their way home. after this it was really just a lot of scared theory crafting but my brother said that maybe it was an animal in the vents so at this point we deicide to go into the basement this part i have the least memory of due to the short amount of time that we were in there but all i remember is that the sound was definitely coming from the first floor. then the sound just stops and about 5 min later our parents get home and nothing much has happened since that. thoughts?", "media": null, "score": 6, "upvote_ratio": 0.87, "comment_count": 2, "over_18": false}, "42": {"id": "1ddsd05", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "theimperishableroach", "link_flair_text": null, "time": 1718419381.755954, "created_utc": 1718148403.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ddsd05/the_smiling_man/", "title": "The smiling man ", "permalink": "/r/LetsNotMeet/comments/1ddsd05/the_smiling_man/", "selftext": "I’m aware that the title sounds like a horror movie or creepypasta, and if I hadn’t lived it, I would think it was. This is one of many stories that I have from working night shift at a laundromat in a bad area, and it’s definitely the freakiest. \nSo for context, my mom took a job years ago at a local laundromat because we knew the owner and needed extra money. I was around 10 when she got the job, and she allowed me to come with her, because she would give me a little allowance for helping her do small tasks. \nI ended up going with her every night for years, and as I got older I mainly went to make sure my mom was safe because I worried about her. We regularly dealt with angry customers refusing to leave, most of which were drunk or high, and we had to call the police a few times. My mom was always worried about me tagging along, but I insisted, and to this day I still can’t say I regret it. \nA lot of good came out of it, mainly the work experience, and that made up for how intense it could be. I have a lot of interesting stories from that time, but the this one takes the cake for the most horrifying, and it took place when I was about 12. \nBeing the young and dumb kid that I was, I designated myself the job of chasing people off when it was closing time. We would have people parking behind the building pretty regularly, so I would walk to the side of the building and start yelling that they were now trespassing and I’d call the cops if they didn’t leave. I feel that this is important to bring up, because I now realize that I let any shady person hanging around the building at night know of my presence, and that’s a dangerous thing to do when you’re a 12 year old girl. \nI was blissfully unaware that anything could happen to me, until one night when we showed up to find that the door lock had been broken.\nMy mom had unlocked the building that morning, so it wasn’t like this was a break in attempt since it had been unlocked all day. We were a bit shaken up, but my mom texted her boss to let him know about it, and just told me to tell her if I saw anyone pull up. \nAfter about 30 minutes, I finished my few tasks and sat down to draw in my sketchbook. I had barely been sat down for a few minutes when I heard the door swing open, which startled me because normally people just knock when they see the (very obvious) closed sign. My mom noticed it too and yelled out that we were closed. \nI heard an older man’s voice respond, explaining that he had just come in to use our drink machine. We normally let people in to use our snack and drink machines, so my mom told him he had a few minutes and went back into the closet to grab something. I was sat about 7 ft away from the drink machine, so I heard him walk up, but didn’t really pay much attention to him. \nI continued to draw until I started getting the feeling that someone was watching me, and I realized didn’t hear this guy put any money in the drink machine. I nervously glanced to my left, and saw a tall man in his mid 60’s staring right at me with a big smile on his face. I jumped a little, but forced an awkward smile back at him and directed my attention back to drawing. \nAs soon as I did this, I heard what sounded like shuffling, and when I looked over again and he was closer. I didn’t know what to do, so I tried to just not look at him, but every time I would look away he would shuffle closer. his body was still facing the drink machine, but his neck was craned in my direction, and he wouldn’t stop smiling and staring. \nI began shaking and panicking, and my eyes were darting back and forth between him and the closet door while I tried to plan a fast escape. I went to reach for my knife in my bag, because I couldn’t even imagine this man’s intentions, and quickly realized that it was not there. I had left my knife at home when I needed it the most, and I was petrified. \nI decided to just stare back at him, despite being terrified and trembling violently, and after what felt like eternity he suddenly broke eye contact and yelled to my mom to have a good night before turning around and walking out. Relief hit me instantly, and I tried to calm myself down after what had just happened. I thought I was finally safe, and started to get up to go splash some water on my face, when I saw him sit down on the bench outside. \nPanic and dread hit me like a brick and I sprinted into the closet to hide. I filled my mom in on everything and she told me to run to the car and she’d get between me and him and pepper spray him if needed. I did as she told me and ran to the car, and as I passed him he stood up and began walking toward the car. \nMy mom yelled at him to get away from her car and his reaction was to try to calmly start a conversation about the make and model or her car while staring right at me. She ignored him, hopped in the car, locked us in, and started backing up as quickly as she could. I ducked down in my seat, but could still see him standing there, and I know he could see me because I watched as he lifted his hand and waved me goodbye before walking around to the back of the building and disappearing into the darkness. \nI felt sick. I couldn’t sleep that night, and I never dared set foot anywhere near the back of the building again, so I guess that was a lesson learned. \nCreepy old smiling man, let’s not meet again. \nTLDR: deranged old man wanders into my work right after I discover the front door lock is broken, pretends to want a drink, and tries to creep up on me while staring and smiling. ", "media": null, "score": 102, "upvote_ratio": 0.93, "comment_count": 17, "over_18": true}, "43": {"id": "1dbjzoq", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "caprianna", "link_flair_text": "Captured Apparition ", "time": 1718419382.4944468, "created_utc": 1717902475.0, "url": "https://www.reddit.com/r/Ghosts/comments/1dbjzoq/grieving_ghost_at_st_augustine_florida/", "title": "Grieving Ghost at St. Augustine Florida ", "permalink": "/r/Ghosts/comments/1dbjzoq/grieving_ghost_at_st_augustine_florida/", "selftext": "https://preview.redd.it/8fk3g53tpg5d1.png?width=1080&format=png&auto=webp&s=7bd426c12a457be64d6d451b77cf55986626823e\nJune 1st 2024, my friends and I did a ghost hunt at Lighthouse Park in St. Augustine Florida. I was taking pictures around the area while my friends were off doing solo investigating. On their way back I took this photo of them. There was NO lady in between them at the time, especially one with a COMPLETELY still candle, dirty blond hair and a bouquet of white and yellow flowers. The spirit appears to warp my friend’s body in order to appear as her whole right arm is missing while her left holds a K-2 meter. We think my friend may have walked through the spirit when this picture was taken. NO editing performed other than watermark. I have the raw .CR2 files to prove it.", "media": null, "score": 77, "upvote_ratio": 0.88, "comment_count": 31, "over_18": false}, "44": {"id": "1demn2g", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Ok-Bear2732", "link_flair_text": "Glitch Pic", "time": 1718419382.689663, "created_utc": 1718240398.0, "url": "https://i.redd.it/hgca1fivm86d1.jpeg", "title": "Ctrl+C Ctrl+V", "permalink": "/r/GlitchInTheMatrix/comments/1demn2g/ctrlc_ctrlv/", "selftext": "", "media": null, "score": 29, "upvote_ratio": 0.91, "comment_count": 3, "over_18": false}, "45": {"id": "1dcobj9", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Stephen_P_Smith", "link_flair_text": null, "time": 1718419384.1632452, "created_utc": 1718033405.0, "url": "https://www.dailymail.co.uk/sciencetech/article-13502357/The-haunting-connection-UFOs-Americas-nuclear-weapons-laid-bare-fascinating-new-study-concludes-Theyre-trying-stop-annihilating-ourselves.html", "title": "The haunting connection between UFOs and America's nuclear weapons is laid bare in fascinating new study which concludes: They're trying to stop us from annihilating ourselves", "permalink": "/r/ufo/comments/1dcobj9/the_haunting_connection_between_ufos_and_americas/", "selftext": "", "media": null, "score": 204, "upvote_ratio": 0.91, "comment_count": 106, "over_18": false}, "46": {"id": "1dck9il", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "NHI", "time": 1718419385.691117, "created_utc": 1718022428.0, "url": "https://v.redd.it/2xlrf6fomq5d1", "title": "Admiral Gallaudet: \"I'm totally convinced that we are experiencing a Non-Human Higher Intelligence\". \"Because I know people who were in the legacy programs that oversaw both the crash retrieval and the analysis of the UAP data\".", "permalink": "/r/UFOs/comments/1dck9il/admiral_gallaudet_im_totally_convinced_that_we/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/2xlrf6fomq5d1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/2xlrf6fomq5d1/DASH_96.mp4", "dash_url": "https://v.redd.it/2xlrf6fomq5d1/DASHPlaylist.mpd?a=1721011384%2CNWMwNGJjZTYxN2YyZDI2MTdjNmJkYzEyMjMwMTgxMjI0Njc0ZDc5YzA4N2NiODllNTBhMDQ0OTRlZjQ1MWMxNw%3D%3D&v=1&f=sd", "duration": 28, "hls_url": "https://v.redd.it/2xlrf6fomq5d1/HLSPlaylist.m3u8?a=1721011384%2CNjU5MzJlMjQyNzA0MmQ3OWE0NDRjZDIwNmYxYTE2MTJkYjRlMzdhMmNjODI5MzMwNTQ4M2Q3ZDgxZDkzMTA0Mw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1804, "upvote_ratio": 0.89, "comment_count": 480, "over_18": false}, "47": {"id": "1ddupwf", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Dontbelievethehype0", "link_flair_text": "Discussion :table:", "time": 1718419387.2946174, "created_utc": 1718155442.0, "url": "https://www.reddit.com/gallery/1ddupwf", "title": "How come everyone stopped talking about the Corbell “Jellyfish” UAP video?", "permalink": "/r/aliens/comments/1ddupwf/how_come_everyone_stopped_talking_about_the/", "selftext": "I remember the video was taken of a UAP flying through a military base in the Middle East. And it was invisible to the naked eye, but IR cams picked it up. If anyone can find the video and post a link I’d appreciate it but I can’t for the life of me find it anywhere. You can clearly see that the UAP is not a stain and is 3D because it rotates in the video.", "media": null, "score": 576, "upvote_ratio": 0.9, "comment_count": 330, "over_18": false}, "48": {"id": "1dcr5a1", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "v022450781", "link_flair_text": "Resource", "time": 1718419387.6394315, "created_utc": 1718040366.0, "url": "https://www.uapcaucus.com/call", "title": "This is an important week to contact Congress regarding critical amendments to the NDAA. You can use this speed dial tool and phone script from UAP Caucus.", "permalink": "/r/UAP/comments/1dcr5a1/this_is_an_important_week_to_contact_congress/", "selftext": "", "media": null, "score": 36, "upvote_ratio": 0.97, "comment_count": 4, "over_18": false}, "49": {"id": "1dasvt0", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "opendiscourser", "link_flair_text": null, "time": 1718419389.228336, "created_utc": 1717815099.0, "url": "https://www.reddit.com/gallery/1dasvt0", "title": "Everyone’s worried about Kate, but no one has seen Charlotte in person since Christmas either: a theory", "permalink": "/r/conspiracy/comments/1dasvt0/everyones_worried_about_kate_but_no_one_has_seen/", "selftext": "Missing princess theory for you. Kate didn’t figure out the family tradition until after the second child was born. And she didn’t like it. If she told them she was going to speak up, that would not be an option for them to just accept. What could they do to ensure neither would ever speak of this secret ever again? \nI suppose things will take a turn for the worst with her cancer in the next few months. This will be the cause of death. \nBut where is charlotte? Why was her sweater edited in the released photo? \nWhat is the significance of the red shoe?", "media": null, "score": 1613, "upvote_ratio": 0.87, "comment_count": 560, "over_18": false}, "50": {"id": "1dbwgzw", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "HamptonsOnline", "link_flair_text": null, "time": 1718419389.4166105, "created_utc": 1717947201.0, "url": "https://youtube.com/shorts/ceB1xeoEqdI?si=cZ7eZJBDOKIAlRPS", "title": "\"Stranger Things\" in Montauk, learn the TRUTH 📡👽 #strangerthings  #hampt...", "permalink": "/r/conspiracyfact/comments/1dbwgzw/stranger_things_in_montauk_learn_the_truth/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.75, "comment_count": 0, "over_18": false}, "51": {"id": "1dbc9bb", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Green_Cream_1758", "link_flair_text": "exhibit", "time": 1718419390.0182152, "created_utc": 1717879183.0, "url": "https://i.redd.it/xy5qsqesse5d1.jpeg", "title": "Always Big, Never Boring", "permalink": "/r/bigfoot/comments/1dbc9bb/always_big_never_boring/", "selftext": "Big hairy love to the North American Bigfoot Center in Boring, OR. Great staff.  The joy this place brings to my boy is unmeasurable.  That feeling alone makes Bigfoot more real than most things in our day to day lives.", "media": null, "score": 203, "upvote_ratio": 0.98, "comment_count": 24, "over_18": false}, "52": {"id": "1dehc51", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1718419390.5041792, "created_utc": 1718225792.0, "url": "https://i.redd.it/aayc6isff76d1.png", "title": "The entzaeia-yawá is an Ecuadorian cryptid described as a large water tiger. It's said to come in many colors, either white, brown, black, or red. The creature was so deadly that people wouldn't swim in the water alone out of fear it would attack them.", "permalink": "/r/Cryptozoology/comments/1dehc51/the_entzaeiayawá_is_an_ecuadorian_cryptid/", "selftext": "", "media": null, "score": 127, "upvote_ratio": 0.96, "comment_count": 7, "over_18": false}, "53": {"id": "1ddnsn7", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Niskara", "link_flair_text": null, "time": 1718419391.2940052, "created_utc": 1718136591.0, "url": "https://i.redd.it/w8c8k3z6206d1.jpeg", "title": "Think I got a visit from Mothman", "permalink": "/r/cryptids/comments/1ddnsn7/think_i_got_a_visit_from_mothman/", "selftext": "", "media": null, "score": 230, "upvote_ratio": 0.93, "comment_count": 21, "over_18": false}, "54": {"id": "1dbcmj3", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "throwestof", "link_flair_text": null, "time": 1718419391.6513395, "created_utc": 1717880228.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1dbcmj3/i_thought_i_finally_made_a_friend/", "title": "I thought I finally made a friend ", "permalink": "/r/LetsNotMeet/comments/1dbcmj3/i_thought_i_finally_made_a_friend/", "selftext": "Finally, this throwaway account is useful. I (18M) met up with an online friend (19M) about 2 weeks ago. We met from facebook, he sent me a message asking if we could be friends. I thought sure, why not? I didn't have any friends most of my life, due to parents thinking the friends I had were a \"bad influence\" on me. This resulted in me having basically zero friends since 2019. Because of this, I was really quick to say yes. \nI absolutely do not post anything on facebook and there's no way he would have come across my account from his feed. My account is public however, so the only way he would have found it is either by going through the friend list of someone that has me added, or through just searching my name directly. We both have about 20 mutual friends, but then again he has around 4000 people added, so I'm not surprised that we have a few mutials.\nSo naturally the first thing I asked him was how he found me or who he is. He replied something like \"you know me\" with a hint of \"don't pretend you don't know\" (this is hard to translate to english but that's the general intended meaning of his message). Since we live in the same town, we agreed to go for a motorcycle ride at night.\nHe was cool, we talked about all sorts of things. He did tell me about his childhood, and not gonna lie it was rough. I'll spare you the details but he moved to this town to escape his parents. \nAnyway, one thing led to another and he randomly confessed to having gay sex with his cousin? I mean, okay... but why do I need to know? Didn't sit right with me. He was 17 at that time and the cousin he mentioned was at least 25+ (he initiated it, not the cousin by the way). He told me it in extreme detail that I don't even want to type out. I tried to change the topic but he was so... determined (?) to finish it so I figured okay fine I'll just let him finish his story, and then bring up another topic. Almost right after that he started telling me about how he manipulated his drug addict older brother into having sex with him?? Like what the fuck dude. Extreme drug addicts like him would do anything to get that money to buy drugs, and he took that chance because he found his brother attractive (also this was with extreme detail too). Right after that, he told me about doing it with his classmate (as expected, with extreme detail). Oh god give me a break. I swear he was talking about it for more than an hour. \nWe were out for about 3 hours, so I needed to use the bathroom. I told him and he said his apartment is nearby. We went there so I could use the bathroom, and I also wanted check out his apartment. I got in his room but he didn't turn on the lights for about 30 seconds. I asked him to turn on the lights, he immediately changed the topic. I asked again, and he finally turned it on.\nAfter I finished using the bathroom, I came out to the lights off again. It was 2 am at that point so I asked him to drop me off. I don't know the way around that area so I had to rely on him. His tone immediately changed. In a half-moan kind of tone, he said \"Are you leaving already?\" and put his hand over my arm. That sent a chill down my spine, but I still kept my cool and told him that it's 2 am so I gotta go sleep. Then I suddenly remembered something he said while he was telling the story about his brother: \"I like it dark when I do things like this\". I knew what his intentions were. I knew what was on his mind. At that moment I got a gut feeling to get out of there ASAP. Fortunately he agreed to drop me off. I say fortunately because he's bigger than me and he easily could have prevented me from going if he wanted to. \nAfter dropping me off, he sent several messages saying I'm cute and he was resisting the urge to hug me all that time.\nIt's been 2 weeks since then, and he has asked me to meet up several times already. What does he expect after all that? NOPE. NEVER MEETING AGAIN.", "media": null, "score": 96, "upvote_ratio": 0.93, "comment_count": 26, "over_18": true}, "55": {"id": "1ddvtnz", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "TheMordorian", "link_flair_text": "Paranormal Community [Discussion]", "time": 1718419393.0391064, "created_utc": 1718158896.0, "url": "https://www.reddit.com/r/Ghosts/comments/1ddvtnz/tell_me_your_ouija_board_experiences_both_good/", "title": "Tell me your Ouija Board experiences: both good and bad. I need to know I'm making the right choice. Tell me your stories!☺️💀", "permalink": "/r/Ghosts/comments/1ddvtnz/tell_me_your_ouija_board_experiences_both_good/", "selftext": "Regale me!☺️☺️💀", "media": null, "score": 71, "upvote_ratio": 0.77, "comment_count": 137, "over_18": false}, "56": {"id": "1df9sr6", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Abid7158", "link_flair_text": "Glitch Pic", "time": 1718419393.242454, "created_utc": 1718312925.0, "url": "https://i.redd.it/prl4ewhgme6d1.jpeg", "title": "Random Black Moth Appearing in my Room and Disappearing without a trace. (Story in Comments)", "permalink": "/r/GlitchInTheMatrix/comments/1df9sr6/random_black_moth_appearing_in_my_room_and/", "selftext": "", "media": null, "score": 11, "upvote_ratio": 0.87, "comment_count": 2, "over_18": false}, "57": {"id": "1das6k9", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Big-Mix4490", "link_flair_text": null, "time": 1718419395.0800004, "created_utc": 1717812769.0, "url": "https://i.redd.it/ij4sfk6bb95d1.jpeg", "title": "What is this?? ", "permalink": "/r/ufo/comments/1das6k9/what_is_this/", "selftext": "Obx nc. Saw someone post recently and saw a different one but it was the same thing. What is this ? ", "media": null, "score": 134, "upvote_ratio": 0.79, "comment_count": 117, "over_18": false}, "58": {"id": "1dexm7z", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "News", "time": 1718419396.3381376, "created_utc": 1718281171.0, "url": "https://i.redd.it/3jabyt0vzb6d1.png", "title": "Here are the two Republicans currently blocking UFO disclosure legislation from even being debated in the House: Mike Rogers (R-AL) and Tom Cole (R-OK). ", "permalink": "/r/UFOs/comments/1dexm7z/here_are_the_two_republicans_currently_blocking/", "selftext": "", "media": null, "score": 1787, "upvote_ratio": 0.9, "comment_count": 442, "over_18": false}, "59": {"id": "1dbu9ed", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Powderandpencils", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1718419398.4034672, "created_utc": 1717941241.0, "url": "https://i.redd.it/d0vxyxubxj5d1.jpeg", "title": "Thought you guys would enjoy this painting I did of an alien ", "permalink": "/r/aliens/comments/1dbu9ed/thought_you_guys_would_enjoy_this_painting_i_did/", "selftext": "", "media": null, "score": 560, "upvote_ratio": 0.95, "comment_count": 54, "over_18": false}, "60": {"id": "1dcyzq8", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Peruvian-Flortist", "link_flair_text": "Discussion", "time": 1718419398.720983, "created_utc": 1718059642.0, "url": "https://www.reddit.com/r/UAP/comments/1dcyzq8/tired_of_the_uapnhi_slow_drip_the_foreplay_has/", "title": "Tired of the UAP/NHI slow drip - the foreplay has fizzled out ", "permalink": "/r/UAP/comments/1dcyzq8/tired_of_the_uapnhi_slow_drip_the_foreplay_has/", "selftext": "We get it, your extra-dimensional existence/technology/capabilities are shocking and cutting edge and all. But flittering around here and there around the planet is getting boring and old.\nWhy would UAP like the UAP featured in the Nimitz video do stuff like that, and not have any follow up in any substantial way? ", "media": null, "score": 32, "upvote_ratio": 0.7, "comment_count": 26, "over_18": false}, "61": {"id": "1de2r96", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "External-Noise-4832", "link_flair_text": null, "time": 1718419399.8728538, "created_utc": 1718185708.0, "url": "https://i.redd.it/7k43rr89446d1.jpeg", "title": "The Australian Government has killed a Child by refusing her a Transplant without a Covid Jab.", "permalink": "/r/conspiracy/comments/1de2r96/the_australian_government_has_killed_a_child_by/", "selftext": "They are most definitely NOT trying to Save People & NOT trying to Help.\nRIP Dazelle Peters", "media": null, "score": 1546, "upvote_ratio": 0.73, "comment_count": 1026, "over_18": false}, "62": {"id": "1dfz69f", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "charlestonbound", "link_flair_text": null, "time": 1718419400.0942442, "created_utc": 1718393560.0, "url": "/r/u_charlestonbound/comments/1dfssk0/what_is_this_seen_from_a_recent_flight_from/", "title": "What is this?  Seen from a recent flight from Austin TX to Charleston SC.", "permalink": "/r/conspiracyfact/comments/1dfz69f/what_is_this_seen_from_a_recent_flight_from/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "63": {"id": "1de1zrf", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "HitchInTheGit", "link_flair_text": "eyewitness encounter", "time": 1718419400.8787146, "created_utc": 1718182344.0, "url": "https://www.reddit.com/r/bigfoot/comments/1de1zrf/im_getting_old_so_i_thought_i_should_document_my/", "title": "I'm getting old so I thought I should document my sighting story.", "permalink": "/r/bigfoot/comments/1de1zrf/im_getting_old_so_i_thought_i_should_document_my/", "selftext": "This might be kinda long so I apologize.\nThis happened in 1970 or maybe 71. I was 14 or 15. My friend and I were in the Boy Scouts and that summer we went to Arkansas to do a couple hikes for some merit badge, if I remember correctly, and one of them was the Butterfield Hiking Trail.\nThe trail started in Devils Den State Park and that is where we camped. When we awoke we started the hike. Remember, this was 1970, the trail wasn't marked well and not that heavily traveled. Our gear was rudimentary, I'm not even sure I had real boots. All our gear was pretty much army surplus stuff, canteens, compass, tents. We must have had a map but I think it as not much better than a hand drawn map.  I just checked and today it says the trail is 15 miles. It certainly wasn't then and we had planned doing it as a day hike and just carried a canteen each, the map and a compass. Being scouts we probably had some sort first aid kit we put together.\nThere was a trailhead we could walk to when we got up in the morning and initially the trail was pretty well beaten down. The terrain wasn't to tough. It was a deciduous forest, very thick under brush. It was also summer and would get pretty hot and there is a lot of humidity.\nI don't recall anything unusual or exciting for most of the hike until the trail we were following eventually petered out. I really have no idea how far we hiked but it was pretty hot and it was late afternoon I think. So, we realized we were lost the trail and probably was too late to head back the way we came. While trying to figure out what to do we believed we heard a motor vehicle in the distance off to the west. We figured getting to a road would be the best option but in order to get there we would have to bushwhack through dense under brush. At least it was down hill. So, we headed down the hill.\nAgain, not sure how long or far it was but we broke out on to a very nice, wide and well traveled trail.  Hallelujah! We were really hot and tired from going through the brush so we sat down to rest and drink some water. We were both relieved to at least find a well traveled trail. We could also hear what we thought might be a creek flowing.\nThis is where things got weird.  While we were resting we heard something in the bush just up the slope not too far away call out. The best way I could try to describe it as like some sort of monkey/ape yell. Just after that yell we heard a tree shake and heard a thump/thud. We could see the top of the tree sway. Big tree. This was also up  slope and really not that far away.\nThe trail we had found pretty much ran horizontal down the slope. That is the direction we had planned on going. There was a dip in the trail and a curve that went out of visual sight. We were curious what was making the noise and I told my friend to start down the trail and I would hang back and stay kneeling where I was.  The thought was maybe the creature that yelped/screamed would show it's self thinking we both had taken off.  My friend disappeared out of sight and the creature we heard called out again but this time another creature further down the trail were my friend went yelled back. I couldn't see anything through the brush and I must have realized hanging back wasn't the best idea so I got up and stared down the trail.\nI then realized the trail wasn't too far from where the tree shook, noise and scream. By this point I was feeling pretty uncomfortable. I got to the where the trail headed straight down the hill and my friend was waiting there and we headed down. My friend was in the lead and as soon as we started down I heard something running through the brush from where we had just come. I immediately yelled at my friend to run. I wasn't sure it was running after us or not but I looked back over my left shoulder and I saw it running back up the trail we had just come down.\nLike I said the brush was thick and I only caught glimpses except one point where I could see it's chest, shoulder and face. I was running down the hill looking back and it was running up the trail and looking down at us.\nIt's crazy, it's been almost 55 years and I vividly remember the whole encounter. It was only glimpses. I saw black hair, the face had a sheen from the sun. It was looking at us while we were running west and in to the sun. I know it was pretty tall because walking down the trail  I could not see anything down slope. This thing was tall enough to be seen and see us.\nThe rest is anticlimactic but I should go ahead and finish the story I suppose.  We kept running down the hill until we came out of the brush in to a clearing with a herd of cattle next to the creek we heard. We thought we saw a bull and we sprinted across the creek. Nothing had chased us and there was also the road we had heard. A gravel/dirt road but a road just the same. We headed north, I believe, and eventually a guy in a pickup drove by and gave us a ride to our camp.\nThat night I remember washing my clothes at the campground laundry and talking to a park ranger and telling about our day. He didn't think we were crazy and said people see some pretty strange things out there.\nThis was before the internet and I really had not heard anything about bigfoot sightings and now with the internet and reading all the peoples experiences I read and nod my head because I know exactly what some of these people are talking about.\nLike I said, I'm older and I stayed in touch with my friend all these years and I wanted to confirm what I remembered with him and this is what he remembers as well. Although, when I yelled run he did just that and he didn't look back so he didn't see what I saw.\nAgain, sorry this was so long but I felt I need to document my story.\nEdit1: There was mention of a baby sasquatch which triggered something that I forgot about and I will add here. Just before the trail petered out we stepped over a small puddle that was just mud at that point. Something caught my eye and it took a couple steps for my brain to tell me there was something unusual in the mud.  \nI told my friend to hold up and we went back to the mud spot and there was a foot print in it. It was clearly a barefoot print. It was not a large footprint at all. It was maybe 8-9 inches long and fairly narrow. We were pretty much in the middle of nowhere and who would be walking around barefoot out there anyway?  We shrugged our shoulders and soldiered on. \nHadn't really considered a youthful bigfoot but, thinking about it now maybe it was. We heard two once we bushwhacked down the hill. Maybe it was one of them or, maybe there more than two? Who knows. ", "media": null, "score": 198, "upvote_ratio": 0.98, "comment_count": 53, "over_18": false}, "64": {"id": "1dehv5y", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1718419401.4825106, "created_utc": 1718227136.0, "url": "https://i.redd.it/3hdqc97li76d1.jpeg", "title": "Argentavis was a giant bird that went extinct millions of years ago. It has been suggested to be the identity of the thunderbird.\nI've seen multiple different websites give the extinction date for argentavis as only 10,000 years ago which is inaccurate.", "permalink": "/r/Cryptozoology/comments/1dehv5y/argentavis_was_a_giant_bird_that_went_extinct/", "selftext": "", "media": null, "score": 110, "upvote_ratio": 0.91, "comment_count": 31, "over_18": false}, "65": {"id": "1dcpkuu", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Molech996", "link_flair_text": null, "time": 1718419402.2989702, "created_utc": 1718036516.0, "url": "https://i.redd.it/a6o9z324rr5d1.jpeg", "title": "I would like to inform you that people are stuffing cash between the mothman statue's ass crack again...", "permalink": "/r/cryptids/comments/1dcpkuu/i_would_like_to_inform_you_that_people_are/", "selftext": "", "media": null, "score": 173, "upvote_ratio": 0.98, "comment_count": 29, "over_18": false}, "66": {"id": "1dda49i", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Milk_n_rice", "link_flair_text": null, "time": 1718419402.6823533, "created_utc": 1718098797.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1dda49i/someone_put_a_power_drill_in_my_car/", "title": "Someone put a power drill in my car… ", "permalink": "/r/LetsNotMeet/comments/1dda49i/someone_put_a_power_drill_in_my_car/", "selftext": "For context I live with my girlfriend. In the last month her and I are the only people (that I know of) that have been in my car. We live in an apartment complex right off the highway. Apartment won’t add more parking despite not having enough.. so sometimes end up having to park right off the highway with no one around. I’ve been worried that’d make it a higher risk to get car broken into.. but we live in a decent area so didn’t think about all that much. Anyway Saturday night me and my lady get back from hanging out with some friends. I had brought my backpack over so I went to my back seat to get it out and noticed a red craftsmen power drill sitting under my seat. I grabbed it assuming my gf had put it there but she didn’t recognize it.. dad and bro had come over to help with a project a few weeks ago so I thought maybe they’d placed it there but after reaching out they as well had never seen the drill before… I’ll keep this last part short but bc of what I already mentioned I’m always checking my phone to make sure I remembered to lock my car. (Can see if it’s locked in app.) the Wednesday or Thursday morning before however I’d woken up and noticed I left my car unlocked all night. Didn’t notice anything out of the ordinary though. \nTLDR: left car unlocked one night on accident - two days later find a power drill in the car that was not placed by me or anyone I know.\nAm I reaching here? What else could it be? Why would someone put a drill in my car and leave? \nEdit: forgot to add - drill seemed like it was at full battery when I found it ", "media": null, "score": 46, "upvote_ratio": 0.84, "comment_count": 15, "over_18": true}, "67": {"id": "1dc03ym", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "kirby__000", "link_flair_text": "Cemeteries ", "time": 1718419403.5216827, "created_utc": 1717956633.0, "url": "https://www.reddit.com/r/Ghosts/comments/1dc03ym/on_one_of_the_american_television_channels_this/", "title": "On one of the American television channels, this kind of thing happened.\nDuring a report, a ghost came out of a grave ", "permalink": "/r/Ghosts/comments/1dc03ym/on_one_of_the_american_television_channels_this/", "selftext": "https://reddit.com/link/1dc03ym/video/ppuc1dzx6l5d1/player", "media": null, "score": 33, "upvote_ratio": 0.73, "comment_count": 13, "over_18": false}, "68": {"id": "1dcjc0k", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "CubitsandMetres", "link_flair_text": "Glitch Pic", "time": 1718419403.7019067, "created_utc": 1718019304.0, "url": "https://i.imgur.com/tCZhKO8.jpeg", "title": "First one I’ve had that I thought was worth posting.", "permalink": "/r/GlitchInTheMatrix/comments/1dcjc0k/first_one_ive_had_that_i_thought_was_worth_posting/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.44, "comment_count": 9, "over_18": false}}}