{"_default": {"1": {"id": "16gom4a", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Additional_Ad3796", "link_flair_text": null, "time": 1695078125.197014, "created_utc": 1694517456.0, "url": "https://www.reddit.com/r/conspiracy/comments/16gom4a/the_mh370_videos_are_real/", "title": "The MH370 Videos Are Real", "selftext": "Hello r/conspiracy! This is Ashton from Twitter and I have been writing about the MH370 videos for the past month. They are real leaked military videos.\nI don't want you to believe me I want to convince you with the facts. This isn't all of the facts, just some of the most compelling;\nThe Videos- Oldest Archive is a satellite stereoscopic video from Regicideanon with an Archive upload date of May 19, 2014. The description reads \"Received March 12, 2014 Source: Protected\"\n​\nStereoscopic Images from the Regicide video\n​\nArchived description\nhttp://web.archive.org/web/20140525100932/http://www.youtube.com/watch?v=5Ok1A1fSzxY\n​\nInterestingly there's a higher quality version without stereoscopic capability uploaded in Aug of 2014, indicating that it's unlikely Regicide was the original source of the videos.\n​\nvimeo higher quality version released Aug\nhttps://vimeo.com/104295906\nIt is currently presumed this stereoscopic satellite footage was taken by USA-229 which was at the right location at 18:40UTC to take the video we see here given the coordinates we can see at the bottom of the original video.\n​\ncoordinates with a designation \\\"NROL-22\\\" presumed relay satellite\nThe thermal video was released in June 2014 and is of an MQ-1C Gray Eagle. This video was leaked because we ignored the first video proof. In this video a thermal layer has been added to the camera. It appears as though the purpose of adding the color was to see how the orbs move, and to notice that they are not normal technology, they are floating and being pulled forward somehow.\n​\nweb archive of Thermal MQ-1C Gray Eagle from Regicide\nhttps://web.archive.org/web/20140827060121/https://youtube.com/watch?v=ShapuD290K0\n​\nYou can actually see the orbs spinning on their axis with the thermal layer\n​\nnotice the dark trails lead the orbs trajectory\nAs to the strongest evidence;\nNO DEBRIS FIELD. This is impossible. A 777 crashing into the Ocean would have caused a debris field visible from space for days, but the official search didn't find a single piece of the plane above or underwater. The single piece that has been tied to the plane wasn't found by the official search and was tied to the plane by a non unique serial number. Even if this piece is part of MH370, which is highly contested, it is not inconsistent with the energetic event we see.\nThe lack of debris field is why Jeff Wise and Florence De Changy, smart individuals, came up with alternate theories.\nThere is a Witness. Katherine 'Kate' Tee saw the plane in the location we see with the coordinates in the video. Her testimony is alarming. She mentions being too afraid to talk about what she saw. She admits she saw a glowing orange plane at a low altitude so low she thought it may be landing. She never changed her story and 8 years later until she went silent believed there was a coverup. I personally believe she directly saw the events of our videos and has been scared to tell people since.\nThe timing and location of the witness make it guaranteed by all flightpaths that she saw the plane.\nhttps://web.archive.org/web/20141017154637/https://saucysailoress.wordpress.com/\nhttps://saucysailoress.wordpress.com/2018/09/24/life-after-mh370/\n​\nKate Tee's last Twitter Post\nThe Ping Data - It turns out that the narrative of this plane going to the South Indian Ocean is a complete fabrication. There's no evidence at all the plane went there. I went ahead and looked at this excel data of pings that comes from Victor of the Independent Group, and there's an alarming anomaly at 18:40UTC in the data.\n18:40UTC is the time when the plane is near Nicobar Islands, the coordinates in the video, Kate Tee, and the time the Independent Group claims the plane made a hard turn to the SIO.\nAt 18:40UTC in the SU Log tab of the data, the data looks like it's interrupted. The 18:40UTC time logs begin to show a bunch of rows of 0s, then from 19:40-23:15UTC there's 10 rows total of data, compared to hundreds of pages previously for each ping of the flight. This data looks like either something happens at 18:40UTC, or the data has been manipulated and the extra rows inserted.\n​\nNotice at 18:40UTC this weird anomaly begins in the data\n​\nYou can see 5 hours of data gets condensed into 10 rows. Up until this point every time stamp has pages of data. There also appears to be a pattern in this data.\nLastly, the Pilot Suicide Narrative is also complete fiction. In a suicide scenario the pilot would have crashed the plane. The pilot could not disable all four transponders, and certainly not within the 64 second time window. Everyone has supported the pilot from officials to his wife. He was an experienced pilot with 18,000 flight hours that everyone loved. There is no indication in the events of a suicide and the idea that he flew by Penang, the largest airport that can accommodate a 777 in an emergency scenario, to say goodbye to his hometown, is laughable.\nIf you want to read more about any of these topics, you can check out my twitter \"Ashton\" or hashtag, #MH370x. This evidence only scratches the surface I've written much more.\nSo if they teleported a plane, where did it go? Everyone assumes Diego Garcia, and there's evidence. EXIF data from a Phillip Wood photo, eye witness accounts from the islands just north of the base, and lookalikes from the facebook of Diego Garcia that match the crew. In addition to this there's been tens of millions of underground construction contracts awarded.\nThere are two main theories for the events of the videos that are supported by the evidence;\n\nEspionage - reverse engineered wormhole tech to steal the semi-conductor scientists on board as they may have cracked superconductivity 9 years ago. May be a shadow arms race for this tech. The US is filming in this scenario because they're conducting an operation.\nUFO Encounter - An emergency scenario arises at 17:21UTC that interrupts the electromagnetic electronics and possibly causes a fire onboard the plane. The plane attempts to go to Penang but cannot land, makes communication with US Military who is having exercises with Thailand. The US films the ending of the encounter as they track the plane.\n\nThere could be other possibilities but these have the most support. This appears to be the largest verifiable conspiracy of all time.\n-Ashton\n​", "media": null, "score": 4845, "upvote_ratio": 0.92, "comment_count": 906, "over_18": false}, "2": {"id": "16jf1nh", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "wowwheredyafindthis", "link_flair_text": null, "time": 1695078125.560139, "created_utc": 1694788425.0, "url": "https://i.redd.it/qjy5ix6vlaob1.jpg", "title": "What do you think this painting that ellen degeneres owns signifys? You cannot find this piece ANYWHERE online other than the 1 or 2 Twitter or reddit posts asking about it. People think it's a basquiat", "selftext": "", "media": null, "score": 4, "upvote_ratio": 0.75, "comment_count": 6, "over_18": false}, "3": {"id": "16kym3t", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "danielyomama", "link_flair_text": null, "time": 1695078127.805154, "created_utc": 1694951199.0, "url": "https://i.redd.it/7p1aoh840tob1.jpg", "title": "What is this?", "selftext": "Saw it yesterday in Heidelberg, Germany around 10 pm", "media": null, "score": 509, "upvote_ratio": 0.87, "comment_count": 230, "over_18": false}, "4": {"id": "16h76q4", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "skywalker3819r", "link_flair_text": "Video", "time": 1695078129.7454405, "created_utc": 1694562354.0, "url": "https://v.redd.it/ep2bv84tvwnb1", "title": "MEXICO RELEASES NEW UAP FOOTAGE 🛸 🔥 ", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/ep2bv84tvwnb1/DASH_1080.mp4?source=fallback", "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/ep2bv84tvwnb1/DASH_96.mp4", "dash_url": "https://v.redd.it/ep2bv84tvwnb1/DASHPlaylist.mpd?a=1697670128%2CODc4MDExYWQyMmVmMzFlZDZiN2RhY2U5NzlkOTBiM2QyMWY0ZTgyYjVlODI0ZDU1YzBlZmQ0ZTAyZGVlYjk5NA%3D%3D&v=1&f=sd", "duration": 147, "hls_url": "https://v.redd.it/ep2bv84tvwnb1/HLSPlaylist.m3u8?a=1697670128%2CZTk3MzgxNjNlYjBlODU2NmE0MWYyODkyNzg3MDQ0NWQzZDUwMzdkMzk3ODBiODFmOWZlNjkyODUyNTVhYTdlMA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 20612, "upvote_ratio": 0.83, "comment_count": 3238, "over_18": false}, "5": {"id": "16htppz", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "DarkPixelmind", "link_flair_text": "Image 📷", "time": 1695078131.6926312, "created_utc": 1694627391.0, "url": "https://i.redd.it/wxno3xo292ob1.png", "title": "Made my own Peru Alien mummy. Began working on it in 2018 (after the news about the mummies came out) and finished three days ago. What do you think? Should I send it to the Mexican government so they can add it to their collection?", "selftext": "", "media": null, "score": 57216, "upvote_ratio": 0.86, "comment_count": 2206, "over_18": false}, "6": {"id": "16hvjnq", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "tehringworm", "link_flair_text": null, "time": 1695078132.233375, "created_utc": 1694631529.0, "url": "https://v.redd.it/a5jpdoex02ob1", "title": "The \"ET\" corpses were debunked way back in 2021.", "selftext": "", "media": null, "score": 2663, "upvote_ratio": 0.91, "comment_count": 632, "over_18": false}, "7": {"id": "16iuuyh", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "Baby_Fishmouth123", "link_flair_text": "Update", "time": 1695078132.7123017, "created_utc": 1694727696.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16iuuyh/ellen_greenberg_suspicious_death_in_philly_area/", "title": "Ellen Greenberg Suspicious Death in Philly area: Appeals Ct rules against family", "selftext": "The Ellen Greenberg case has been addressed on this forum before. To recap, Ellen Greenberg was a 27 year old first-grade teacher who was found dead in the apartment she shared with her fiance. She had a large knife sticking out of her chest. Philly PD investigators termed it a suicide despite many strange and suspicious circumstances:  over 20 stab wounds all over her body (from different angles), a large stab wound to the back of her neck, inconsistencies in her fiance's story (for example, he said a security guard was with him when he found the body, but the guard filed an affidavit saying he did not go with him), no suicide note or tendencies, the apartment was cleaned very soon after the body was discovered, and so on. The medical examiner originally termed her death a homicide but later changed it to suicide, despite a great deal of evidence suggesting it was homicide and no real evidence of self-harm.\nHer parents have struggled for 12 years to get someone to take their claims seriously, hiring top pathologists who say it couldn't be suicide, and pointing out serious inconsistencies and suspicious activity. The cops did a poor job, basically mailing it in after they decided it was suicide. The Philly authorities refused to budge & the case was ultimately sent to a neighboring county for re-evaluation, where it is still pending. (Fun fact: same county that recently had a convicted murderer escape for 2 weeks). \nHer parents filed a lawsuit seeking a writ of mandamus (which essentially is a court order requiring an official to do something they are obligated to do) to get the coroner's office to change the cause of death to homicide or undetermined. The lower court found in their favor. This week an appellate court regretfully ruled that there were procedural issues that prevented the court from issuing the order. The court's opinion included a very detailed description of the death and investigation, calling the investigation \"deeply flawed\" and the facts of the case \"extremely disturbing.\"\nPhilly Inquirer article with link to opinion here\n​\n​", "media": null, "score": 1156, "upvote_ratio": 0.97, "comment_count": 449, "over_18": false}, "8": {"id": "16gfjh2", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "RondoClinton", "link_flair_text": null, "time": 1695078133.4612396, "created_utc": 1694486741.0, "url": "https://www.fbi.gov/wanted/ecap/unknown-suspect-1", "title": "In 2007, two videos were posted on the internet of a man raping a young child. The perpetrator accidentally showed his face for a few seconds during one of the videos, and the FBI has been looking for him ever since. His identity and whereabouts are unknown to this day. (More info on FBI ECAP)", "selftext": "", "media": null, "score": 5704, "upvote_ratio": 0.99, "comment_count": 490, "over_18": true}, "9": {"id": "16lat13", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "jessicamshannon", "link_flair_text": null, "time": 1695078133.6110892, "created_utc": 1694981539.0, "url": "https://www.reddit.com/r/Jessicamshannon/comments/16lat13/in_torajan_tradition_babies_who_die_before/", "title": "In Torajan tradition, babies who die before teething are thought to have pure souls. They are interred within hollows carved into living trees. The holes are covered in palm fibers, and as the tree heals itself, the remains are absorbed. Then the sacred tree becomes the new womb for their souls.", "selftext": "This is one of MANY elaborate burial traditions of the Torajan people, a tribe indigenous to Indonesia.  They're renowned for their complex and unique funeral rights. I'll definitely be posting more at some point. Among other things, they disinter many of their (adult) relatives every few years. They show them appreciation by changing their clothes, giving them presents, etc.  They also cut graves into cliff walls and caves.  I've been going down this rabbit hole all morning and it's fascinating.  \n​\n​\nhttps://www.amusingplanet.com/2015/03/the-peculiar-burial-rites-of-tana-toraja.html\nhttps://www.dailymail.co.uk/news/article-3270383/The-tree-graves-Indonesia-dead-babies-buried-inside-trunks-growing-plants-absorbed-nature.html", "media": null, "score": 61, "upvote_ratio": 0.97, "comment_count": 3, "over_18": true}, "10": {"id": "16i1fcf", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "MythUnleashed", "link_flair_text": null, "time": 1695078133.7469203, "created_utc": 1694645211.0, "url": "https://youtu.be/4-l6CCcoHh4", "title": "Legends of New England", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Legends of New England", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/4-l6CCcoHh4?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Legends of New England\"></iframe>", "author_name": "Mythology Unleashed", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/4-l6CCcoHh4/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@MythologyUnleashed"}}, "score": 6, "upvote_ratio": 0.87, "comment_count": 0, "over_18": true}, "11": {"id": "16hfa2d", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "MrDankSnake", "link_flair_text": "DEBUNKED", "time": 1695078133.8667145, "created_utc": 1694585864.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/16hfa2d/something_came_into_my_campsite_and_i_have_no/", "title": "Something came into my campsite, and I have no idea what the thing was.", "selftext": "This happened to me probably 6 or so years ago, and I’m still extremely confused on what happened. I just found this sub, so maybe I can get some clarity. So to set the scene, I was camping with about 5 other friends along the South Holston river in the Appalachian mountains of East Tennessee. It was probably around 2 in the morning when this happened. Me and one of my friends slept in a couple of hammocks, while the rest of the group were split up into a couple of tents that were maybe 15 feet away. I was the only one awake at the time, but I was just about to fall asleep. Suddenly I hear this insane noise. It sounded like a man letting out a loud, deep scream at the top of his lungs as if he was in pain. At first it sounded about 20 feet away, but I heard it move extremely quickly through the middle of the campsite, right between where I was sleeping and where my friends in tents were. It was just a few feet from me as it went by. Once it passed through the camp, the noise stopped. It only lasted maybe 3-4 seconds. Despite the fact that whatever making the noise was clearly moving through the camp very quickly, there was no sound of hurried footsteps, leave crunching, or anything like that to indicate that something was moving. It was only the sound of screaming. It woke everyone up and we were all terrified. \nWe got up and looked around camp, but there was no sign of anything passing through. We thought maybe it was a type of bird since there were no footsteps, but none of us have been able to find any bird from the area that makes a sound anywhere close to that. Our first theory was a screech owl, but we looked up what their calls sound like, and it definitely wasn’t one of those. We all agreed that it sounded like a man, but it was too fast for a person. We thought maybe something like a deer, bear, or mountain lion, but we would have undoubtedly heard some footsteps if it was. We are completely out of theories at this point. Does anyone have any thoughts on what could possibly explain what we heard?", "media": null, "score": 223, "upvote_ratio": 0.97, "comment_count": 31, "over_18": false}, "12": {"id": "16libmf", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Scare_Country", "link_flair_text": null, "time": 1695078133.9854121, "created_utc": 1695001064.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/16libmf/i_was_almost_a_victim_of_a_killer/", "title": "I was almost a victim of a killer.", "selftext": "Over 4 years ago, I went to work at a warehouse in a small town as a Quality Control Technician. I decided to leave after my health started to get worse physically and I was diagnosed with panic disorder and severe anxiety after the situation that I'm about to tell you. This changed the way that I developed friendships after that job; that's for certain.\nSo, I started this job on April Fools day of 2018 (which was odd to me) and I had no kind of high expectation of the job. All I wanted was to do my job, get paid, and go home as I had two children at home and many things that I could work on there. The job wasn't hard and it made pretty good money for all duties considered so, I really couldn't complain. I worked second shift for about 5 months and I went to dayshift.\nWhile working on second shift, I kept to myself mostly until, one day, I met someone from one of the lines after we struck up a conversation about gaming. For the sake of anonymity, we'll name him JF. Well JF was a pretty good guy and we had a lot of things in common. I went home that night and he popped up as a suggested friend on Facebook (again, another oddity) so, I decided to add him. When I did, we started talking more at work until he suggested that we should hang out so, we did hang out. Pretty frequently.\nWe were friends for a month at this point and one day, he decided that he was going to introduce me to his partner. She seemed decent at first: super nice, didn't seem to be a judgmental type so, I was cool with her. From then on, I would hang out with him when my kids were spending time with my mother. One time, we were talking at a restaurant and he started to vent to me. \"Dude, she's such a bitch sometimes. The other day, I forgot to take the trash out and she threatened to stab me if I didn't. I've never been in a relationship where someone's threatened me but, she's got good intentions, dude.\" When he said that to me, I was concerned but, of course, we had only been friends for a month so, I thought that maybe, he was being morbid jokingly so, I chuckled at him. He gave me a pretty serious look and said, \"I'm not joking. She really did.\" That concerned me.\nFast forward about 8 months: They're still together and we all hang out pretty regularly forgetting the things he told me then. One day, we were all talking and he seemed a little off that day so, I asked him what was wrong in front of her. He flashed a smirk and said, \"Nothing, dude. I'm just a little tired.\" He didn't have his eyes on me though. He had them on her when I asked that. When we went to work the next day, I asked him again. \"Do you promise to keep this between us?\" Of course, I agreed. He said that he was breaking up with her and she went a little crazy. He said that she grabbed her gun and pointed it at him and said, \"If I can't have you then, no one will.\" He said that he diffused the situation and is trying to look for a way out. Not really knowing what to say, I just said, \"You'll figure it out, man. If you need somewhere to go then, you can come stay with me until you get her out of the house.\" \nFast forward to another year: he finally decided to leave her. When he did, she flipped out again. This time, he told her over text. She said that she was going to find him and kill him and he was actually out of work that day with a vacation day. He sent me a text that said, \"Hey, let me know if she comes over to work looking for me.\" That struck me as odd because, I had no idea of the situation that was unfolding. She actually did come to our job and she asked me where he was and I said, \"I have no idea. I thought he was with you and you guys went out of town or something.\" All she did was roll up her window and drive off. I called him and told him that she came by and he called the police about it. They had found her up the road with a loaded gun in the car.\nTwo months later: he decided to talk to her again and when he did, he had something to tell me. When he called me, he asked if I had seen her around and I hadn't. He said, \"I would take some vacation days if I were you.\" Dumbfounded, I asked him why. He said to me, \"Because, she's out of jail and her cousins are in town trying to find the people she has personal vendettas with. You're one of them.\" At that point, I was terrified. I grabbed my kids and went out of town. Took two weeks off of work. Come to find out, that next day, her and her cousins went to the next town over and shot 3 people in an apartment and killed them. I got the news about it the day after it happened. The reason why he knew they were coming after me is because, they made a Facebook Messenger group that he was included in and sent a list of names. Everyone regarded it as spam and decided to disregard the message but he knew what it was. 3 of the names on that list were the people that they shot. The fourth name on that list... was mine. After they found the evidence and he decided to go public about the group and screenshots that he had, they were all charged with first degree murder.\nFrom then on, I was very careful about who I would stick my neck out for because, even though, he knew the context of that list and her intentions, he decided to not inform anyone else on it. Needless to say, we aren't friends anymore and I dodged a bullet. Literally. Sorry for the long post. I felt like it needed context. Stay safe, y'all.", "media": null, "score": 276, "upvote_ratio": 0.96, "comment_count": 21, "over_18": true}, "13": {"id": "16m2lle", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "dannydutch1", "link_flair_text": null, "time": 1695078134.1143723, "created_utc": 1695060294.0, "url": "https://i.redd.it/uz8rdb6i02pb1.jpg", "title": "The preserved body of John Torrington, one of the Franklin expedition mummies left behind after the crew was lost in the Canadian Arctic in 1845.", "selftext": "", "media": null, "score": 37, "upvote_ratio": 1.0, "comment_count": 2, "over_18": true}, "14": {"id": "16do2su", "locked": false, "subreddit": "crimescene", "stickied": false, "category": "Crime", "author": "vaughndag", "link_flair_text": "MURDER", "time": 1695078134.2831025, "created_utc": 1694211414.0, "url": "https://www.reddit.com/r/CrimeScene/comments/16do2su/removed_by_reddit/", "title": "[ Removed by Reddit ]", "selftext": "[ Removed by Reddit on account of violating the content policy. ]", "media": null, "score": 534, "upvote_ratio": 0.98, "comment_count": 52, "over_18": true}, "15": {"id": "16lzrw8", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "wetpipedreams", "link_flair_text": null, "time": 1695078134.4033873, "created_utc": 1695053652.0, "url": "https://allthatsinteresting.com/brandon-swanson", "title": "Brandon Swanson was on his way home for spring break in May 2008 when he got into a minor car accident and called his parents for help. Then, he suddenly vanished without a trace.", "selftext": "", "media": null, "score": 8, "upvote_ratio": 0.83, "comment_count": 1, "over_18": false}, "16": {"id": "16hoird", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "OutlandishnessRound7", "link_flair_text": null, "time": 1695078134.5138004, "created_utc": 1694615410.0, "url": "https://www.reddit.com/r/threekings/comments/16hoird/what_kind_of_demons_are_there/", "title": "What kind of demons are there?", "selftext": "Like there's thing about wish granting always coming at a price, but im actually not sure if the rituals are demons, spirits or something, but I am curious how to find myself more apart from this subreddit like i want to find a spirit that would Grant me a egocentrical wish but the price would be something like i have to entertain it,if it doesnt exist, once I die, hows the process of becoming a spirit actually?", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "17": {"id": "16hfu8d", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "DilonMcdermotMulrony", "link_flair_text": null, "time": 1695078135.0287836, "created_utc": 1694587807.0, "url": "https://i.redd.it/pv46ovskzynb1.jpg", "title": "My one and only Ghost Photo taken in the Fall of 2014", "selftext": "On a Monday morning in the Fall of 2014 I was visiting Virginia City, NV. I stopped in to the \nOld Washoe Club with a buddy. While he was in the back museum I casually took a couple pictures in the mirror located in the middle of the building. Several people have reported seeing an apparition of a woman on the staircase. Out of four pictures this is the only one I got with what looks like a woman standing over my shoulder. Note I’m 6’4” tall and was only about a foot away from the back wall and no one was in the small room with me. Decide for yourself.", "media": null, "score": 1656, "upvote_ratio": 0.88, "comment_count": 350, "over_18": false}, "18": {"id": "16gj132", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "jadaasmall", "link_flair_text": "Glitch Pic", "time": 1695078135.335763, "created_utc": 1694497658.0, "url": "https://i.redd.it/b79gvrpijrnb1.jpg", "title": "Random receipt my friends and I found on the living room floor. The plaza is renamed now and the store is closed, literally no idea how this could’ve ended up in the house and none of us are old enough to have acquired this ourselves.", "selftext": "", "media": null, "score": 440, "upvote_ratio": 0.97, "comment_count": 71, "over_18": false}, "19": {"id": "16jhqot", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Hobbitsliketoparty", "link_flair_text": "humor", "time": 1695078136.0712402, "created_utc": 1694794759.0, "url": "https://i.redd.it/mlxi5m2l2gob1.jpg", "title": "Mexican government releases photo of actual Bigfoot body", "selftext": "", "media": null, "score": 1576, "upvote_ratio": 0.96, "comment_count": 154, "over_18": false}, "20": {"id": "16gal6v", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Nosferatu517", "link_flair_text": null, "time": 1695078136.657377, "created_utc": 1694473625.0, "url": "https://i.redd.it/h2hrfds1kpnb1.jpg", "title": "What Do You Do If This Guy Comes Running Full Speed At You?", "selftext": "", "media": null, "score": 361, "upvote_ratio": 0.94, "comment_count": 364, "over_18": false}, "21": {"id": "16hhwzb", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "onefluffyboi1", "link_flair_text": "Personal", "time": 1695078136.8329878, "created_utc": 1694595532.0, "url": "https://i.redd.it/fusm07vjmznb1.jpg", "title": "Fat man with striped pajamas that only I could see. (Full encounter in comments)", "selftext": "Apologies for the drawing, I'm going as minimalist as possible because when I draw 'him' in too much detail it get out of perportion and it would simply take too much time.", "media": null, "score": 316, "upvote_ratio": 0.9, "comment_count": 171, "over_18": false}, "22": {"id": "16jr5xd", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "tron_eclipse", "link_flair_text": null, "time": 1695078137.7990546, "created_utc": 1694817521.0, "url": "https://v.redd.it/jl3r7mkkyhob1", "title": "Think we saw something.", "selftext": "My friend and I go on regular walks at night and our topic of choice is usually paranormal shit. The other night I left him to go gym and he decided to walk back alone and he went the long spooky way and took some pictures as he was walking. We always take pictures of the stars and for our Instagram stories of randoms shit. I think it could just be a person but the silhouette and outline of this shape is really strange. At first we thought it was an animal but after he increased the exposure we could see something. I know it’s 100 percent unedited other than the exposure increase because I saw the original photograph on his phone and the time he took the picture on his iPhone. Any ideas of what it may be and any expert able to give us some tips? Today we went near the area again at night and heard noises as if we were being followed but we were to spooked to go into to the depths of the darkness.", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/jl3r7mkkyhob1/DASH_480.mp4?source=fallback", "height": 854, "width": 428, "scrubber_media_url": "https://v.redd.it/jl3r7mkkyhob1/DASH_96.mp4", "dash_url": "https://v.redd.it/jl3r7mkkyhob1/DASHPlaylist.mpd?a=1697670137%2CMTNmZTUzNzM4YjJhYTRmM2E0NjVlYmM3NWQzOWVlYWY3OGI2MjA1YmUyOGNhNDc0YWMwNWMxMmZiNGM2ZjVmNw%3D%3D&v=1&f=sd", "duration": 17, "hls_url": "https://v.redd.it/jl3r7mkkyhob1/HLSPlaylist.m3u8?a=1697670137%2CMWUzMjQxM2U3YzliZTE1ZWI0YTkwZTg4OGVhYzUxNTk0YzYwN2IzOGYzMTEyMjNkYTNhMTZjNTA4NDU1NWRhOQ%3D%3D&v=1&f=sd", "is_gif": true, "transcoding_status": "completed"}}, "score": 1646, "upvote_ratio": 0.96, "comment_count": 204, "over_18": false}, "23": {"id": "16hcs9b", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "dirtysailor66", "link_flair_text": null, "time": 1695086357.0678878, "created_utc": 1694577707.0, "url": "https://www.youtube.com/watch?v=tu7Y0e_9HWU&t=6684s", "title": "Mexican Congress just showed alien bodies in a live hearing!", "selftext": "", "media": null, "score": 3532, "upvote_ratio": 0.89, "comment_count": 1273, "over_18": false}, "24": {"id": "16jjro5", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1695086357.4807348, "created_utc": 1694799610.0, "url": "https://i.redd.it/ilr43dilggob1.jpg", "title": "Do People Like You More When You Are Fake as Compared to Being Real? (Full Episode: https://youtube.com/live/62cNebuYpcM)", "selftext": "", "media": null, "score": 3, "upvote_ratio": 0.81, "comment_count": 1, "over_18": false}, "25": {"id": "16hb8bc", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "slv2xhrist", "link_flair_text": null, "time": 1695086360.3722255, "created_utc": 1694573187.0, "url": "https://i.redd.it/h9cr83w3sxnb1.jpg", "title": "One of the objects shown at Mexican UFO hearing. A spherical object of light/energy in the air with with 3 layers. Thoughts?", "selftext": "", "media": null, "score": 456, "upvote_ratio": 0.9, "comment_count": 206, "over_18": false}, "26": {"id": "16h8ds0", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "chisoph", "link_flair_text": "Video", "time": 1695086361.866716, "created_utc": 1694565455.0, "url": "https://youtube.com/clip/UgkxWhk4GLYz0JzqhF13ImeqX8ioFZVSvasO?si=OS48M9b9_l_BcfCM", "title": "Mexican government displays alleged mummified EBE bodies", "selftext": "", "media": null, "score": 9085, "upvote_ratio": 0.8, "comment_count": 3713, "over_18": false}, "27": {"id": "16hb3u7", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "GoldIsAMetal", "link_flair_text": "Image 📷", "time": 1695086364.0269732, "created_utc": 1694572830.0, "url": "https://www.reddit.com/gallery/16hb3u7", "title": "More Photos from Mexico UFO Hearings", "selftext": "These images were from the slides in Mexicos UFO hearing today. From about 3hr13min - 3hr45min https://www.youtube.com/live/-4xO8MW_thY?si=4sf5Ap3_OZhVoXBM", "media": null, "score": 45015, "upvote_ratio": 0.68, "comment_count": 10985, "over_18": false}, "28": {"id": "16h5rga", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "doppio", "link_flair_text": null, "time": 1695086364.9851933, "created_utc": 1694558848.0, "url": "https://www.nasa.gov/press-release/nasa-to-release-discuss-unidentified-anomalous-phenomena-report", "title": "NASA to Release, Discuss Unidentified Anomalous Phenomena Report", "selftext": "", "media": null, "score": 227, "upvote_ratio": 0.97, "comment_count": 57, "over_18": false}, "29": {"id": "16hvmdt", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "Basic_Bichette", "link_flair_text": "Update", "time": 1695086365.7310438, "created_utc": 1694631693.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16hvmdt/mother_of_baby_mary_murdered_newborn_found_in/", "title": "Mother of \"Baby Mary\", murdered newborn found in Mendham Township, New Jersey in 1984, identified and charged", "selftext": "On the morning of December 24, 1984, the body of a newborn baby girl was pulled out of a creek by two boys in Mendham Township, New Jersey. At autopsy it was discovered that the infant had been born alive and had died of exposure, with the death ruled a homicide. Although little could be done in 1984 to identify her the case was never shelved; she was eventually buried in 1989 under the name of \"Baby Mary\", with a memorial service being held at St. Joseph's Church in Mendham Township every Christmas Eve on the anniversary of her discovery.\nLast week the Morris County Sheriff's Office, the Morris County Prosecutor's Office, and the Mendham County Police announced that they have identified Baby Mary's parents using \"new technology\". The mother has been arrested and charged with juvenile manslaughter, as she was a minor at the time and this is the only charge available to them. Her name is also not being released due to her having been a minor.\nThe child's father is deceased; the police say there's no evidence he knew of the pregnancy, let alone of the child's birth or death.\nMendham Township Police Chief Ross Johnson said at the press conference, “Every Christmas Eve for the past 35 years, members of our department and community have left their own families at noon to remember Baby Mary at a service by her grave, to ensure she is never forgotten. Today, we are finally able to bring closure to this case and the community that has supported her.\"\n\nhttps://www.morriscountynj.gov/Morris-County-News/Charge-Filed-in-1984-Cold-Case-Homicide-of-“Baby-Mary”\nhttps://www.nbcphiladelphia.com/news/national-international/cold-case-of-baby-mary-newborn-found-dead-in-blanket-in-nj-woods-in-1984-cracked/3641009/\nhttps://www.dailyrecord.com/picture-gallery/news/crime/2023/09/07/prosecutor-announce-charges-in-1984-baby-mary-cold-case/70787453007/\nhttps://www.doenetwork.org/cases/1005ufnj.html\nhttps://unidentified-awareness.fandom.com/wiki/Baby_Mary", "media": null, "score": 1019, "upvote_ratio": 0.96, "comment_count": 436, "over_18": false}, "30": {"id": "16l2wbo", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "morbidology", "link_flair_text": null, "time": 1695086366.3112206, "created_utc": 1694962878.0, "url": "https://morbidology.com/the-disturbing-case-of-noah-crooks/", "title": "13 year old Noah Crooks called 911 after killing his mother. He said to the operator: “I tried to rape her. I tried to rape her but I couldn’t do it.”", "selftext": "", "media": null, "score": 4273, "upvote_ratio": 0.98, "comment_count": 756, "over_18": true}, "31": {"id": "16itx48", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "FoulestSky", "link_flair_text": null, "time": 1695086366.547739, "created_utc": 1694725546.0, "url": "https://www.reddit.com/gallery/16itx48", "title": "Ancient Peruvian elongated skull with implanted metal. Bone shows signs of healing.", "selftext": "", "media": null, "score": 39, "upvote_ratio": 0.92, "comment_count": 1, "over_18": true}, "32": {"id": "16lyddb", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "wetpipedreams", "link_flair_text": null, "time": 1695086366.7662854, "created_utc": 1695050369.0, "url": "https://www.reddit.com/r/UrbanMyths/comments/16lyddb/that_time_the_queen_kidnapped_10_native_children/", "title": "That time the Queen kidnapped 10 Native children and they were never heard or seen from ever again.", "selftext": "One quick Google search will turn up results from sources such as Reuters, usatoday or even Snopes stating that such an event never happened and that all claims stating as such are \"obviously\" false however to the trained eye who knows to look a little deeper past these publicity fronts used to brainwash the masses and convice them of their own \"truth\", a deeper, more sinister story lies in wait.\nThe day is October 10th, 1964. The location, a residential school located in Kamloops, Canada about a 5 hr drive from the American border. The Queen and Prince Philip had decided to come pay a visit to the lands first generational, youthful inhabitants for reasons to this day still unbeknownst. I introduce to you the only surviving member of a group of 3 boys who claim to have bare witnessed to the abduction of about 10 children whos grieving parents to this day still have no knowledge as to what became of them. William Coombes recounted that said group of 10 children were amoung the brightest in their classes and had left with the Queen and Prince Phillip on a \"Picnic\". \"In October, 1964 when I was 12 years old, I was an inmate at the Kamloops school and we were visited by the Queen of England and Prince Phillip. I remember it was strange because they came by themselves, no big fanfare or nothing. But I recognized them and the school principal told us it was the Queen and we all got given new clothes and good food for the first time in months the day before she arrived.The day the Queen got to the school, I was part of a group of kids that went on a picnic with her and her husband and some of the priests, down to a meadow near Dead Man’s Creek. I remember it was weird because we all had to bend down and kiss her foot, a white laced boot.After awhile, I saw the Queen leave the picnic with ten children from the school, and those kids never returned. We never heard anything more about them and never met them again even when we were older. They were all from around there but they all vanished.The group that disappeared was seven boys and three girls, in age from six to fourteen years old. They were all from the smart group in class. Two of the boys were brothers and they were Metis from Quesnel. Their last name was Arnuse or Arnold. I don’t remember the others, just an occasional first name like Cecilia and there was an Edward.What happened was also witnessed by my friend George Adolph, who was 11 years old at the time and a student there too. But he's dead now.\".\nWilliams was subject to multiple forms of abuse during his time at the school that included being tied down to a wooden rack where he had been physically assaulted by one of the Male members whos name was Brother Murphy of the Church who worked as staff at the time. In addition to this, Williams also stated to have seen the same male staff throw an eight year old girl to her death from a balcony aswell as bury another with another priest in the schools orchard late one night. Why am I including all of these extra details you may ask? It is indisputable that such horrors and tragedies occured at the Kamloops residential school as a mass grave site filled with children was just uncovered in recent years, what would it be for a group of 10 children to go missing and vanish into thin air\nFast forward now to 2013, An international court located in Brussels (ICLCJ) found Queen Elizabeth and Prince Phillip guilty for the disaperance of 10 native children from the catholic residential school in Kamloops B.C. The arrest warrant issued by six judges of the international common law court of Justice in Brussels had been issued however Canadian courts refused to her the case. From what I have been able to dig up, nothing ever became of that arrest warrant so I dont know how much weight this court in brussels held however I am sure arresting the Queen regardless of who indicts her isnt as easy as it sounds as far as an arrest process goes. So, what ever happened to William you might ask? He died suddenly in hospital shortly before he was to go public about the abduction and disapperance of his school mates. He was aged 59 and in good health, scheduled to be a primary witness at the opening session of the international Tribunal into Crimes of the Church and State on September 12th in London, England. A source close to William claimed that he had gone to the hospital and while there underwent \"testing\" despite the fact that William had always been of sound health and never had any adverse health events in his past. During this testing, Williams health began to deteriorate, \"I last saw William ten days ago, on the eve of my departure for a European speaking tour, and he looked better than i had seen him in years\" according to his partner Mae. His cause of death remains undisclosed. The vancouver coroners office refuses to comment on Williams death. The Kamloops school was closed in 1977 and the parents of the missing children have to this day been prevented from taking any such legal action in the court of law, all but being dismissed and from what i can tell, this was the reasoning for such matters to be brought to the attention of the international common law court in Brussels.\nKevin Annett is the name of the man who set out the \"Prima facie\" evidence for Queen Elizabeth and Prince Phillips personal involvement in the disapperance of the 10 native children who were abducted between the dates of October 5th-13th never to be seen or heard from again. Since 2008, Queen Elizabeth and the Canadian government have continuously denied requests by the ITCCS'S for excavation even though a mass grave site has been discovered moreso recently in the last few years.\nNow, with that being said regardless of wether or not you believe this event ever took place, you can be the judge of that but one irrefutable fact is that this school in Kamloops was one of over 130 schools of its kind operating in Canada between 1874 and 1977 with the last residential school all but having been closed in 1997 (Who was in charge of said school and why it was allowed to stay open is still a hot topic up for debate). This time in Canadas history portrays a very dark reality where Native children effectively had their identitys stripped away in an attempt to assimilate them to the ways of the Catholic church. Sexual, Physical, Emotional and Psychological abuse went on rampant for over a hundred years unchecked and the effects of these schools can still be seen in our countries native identifying members to this day. So with that being said, what are we thinking? Adrenochrome harvesting? Satanic rituals involving Child Sacrafice? Id love to know what you think in the comments.\nEdit: People are having a meltdown in the comments over a brief oversight I had when stating that this event happened when the Queen came to visit during the 100th anniversary of confederation which took place in 1967 and not when the events of said abduction of 10 native children took place in October of 1964. I have removed the line \"The Queen and Prince Philip had come to visit Canada to celebrate the 100th anniversary of Confederation\" and nothing more. Thanks!\n\"Source?.\" ---\nhttps://www.thestudentroom.co.uk/showthread.php?t=1669764\nhttps://westminsterorangeville.ca/kjs/1964-kamloops-residential-school-queen-elizabeth", "media": null, "score": 5, "upvote_ratio": 0.67, "comment_count": 7, "over_18": true}, "33": {"id": "16lqujh", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Low-Structure-6073", "link_flair_text": "Askreddit etc", "time": 1695086366.9848354, "created_utc": 1695029657.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/16lqujh/woman_appeared_in_the_middle_of_the_road/", "title": "Woman appeared in the middle of the road", "selftext": "When I was 12, my mother was driving me to the train station before school, at around 7am. Clear as day, in the middle of the road, I saw a slender woman dressed in a white gown, with long dark hair. I yelled out to my mother to stop as I was worried she would hit her. My mother didn't stop, and the woman just vanished. I asked my mother if she had saw the woman, and she didn't. \nIt's been 8 years now and I still remember the woman clearly. I never had an experience like this since. Any thoughts?", "media": null, "score": 44, "upvote_ratio": 0.96, "comment_count": 5, "over_18": false}, "34": {"id": "16kmu4f", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Reddit-892", "link_flair_text": null, "time": 1695086367.204363, "created_utc": 1694910658.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/16kmu4f/i_thought_i_was_alone_so_i_tried_to_sleep_i_was/", "title": "I thought I was alone so I tried to sleep. I was wrong.", "selftext": "This story is something that I think about from time to time and it creeps me out. So I am writing this to get it off my chest so anyways lets begin.\nTwo almost three years ago I was seventeen years old at this point I was accustomed to being in horrible situations, as all I had was my mother and she could not hold down a job for long because she had her own issues to tackle and so as I grew up we stayed in and out of roommates houses. We never really had our own place to stay except twice but that didn't last long either and we would be forced into a new environment with a snap of a finger. So when I was 17 we are lead into a situation where we are going to be homeless again and I was used to it at this point as I had slept in the street more than I'd like. The day comes when we have to leave our roommates house and my mom is able to stay at her boyfriends trailer. I had nowhere to go as I had no friends at this point as I halted my friendships because they were bad for my health and mental state and overall were toxic. My mom offered me to go with her but I didn't want to as I felt like getting between my Mom and her boyfriend was kind of weird plus I'm used to the street and I didn't think it was as bad as it was at the time.\nSo here we are I get dropped of at a McDonalds and I eat some burgers before I go off into the streets once more. Eventually the sun fled and darkness was all that remained and so I look for a place to sleep for the night. I went into many places that night trying to sleep but none of them were working because it was either too hot or the lights were too bright or the mosquitos were biting me. That's when I remember a house that I used to go into to chill in, this house was under construction and nearly finished so the doors all shut and the windows were all settled so there were no Mosquitos. I go through the back like always and I make my way upstairs. Eventually I settle in the bathroom because there is less debris on the floor. \nSo I lay there and I try to sleep. Eventually I hear some sounds down stairs but I didn't think anything of it. I figured it was the door that I came through swinging open and close or something.  Eventually after laying there for maybe a hour I open up my phone and I look at old photos of my life thinking about how messed up it was that I got to this point and how I lost everything. The noises were still happening this entire time but I paid no mind to it. Eventually for whatever reason I get up and I go to sit down on the back porch because I just couldn't sleep. \nI make my way down stairs and out the back door to the porch. I am messing around on my phone for maybe 5 minutes when it happens. I see movement to my left from the back door I just exited from. I glance over and time itself freezes. At first I think that it's a illusion but I was in fact wrong. I see a man shrouded in darkness peering past the wall inside to gaze at me. \nHis lower half of his figure was behind the wall entirely and I could not see anything but his upper body. The rest of his body has leaning to the left peaking behind this wall almost like the man was trying not to let me see his full body as it would make his presents known. The man was a pure black silhouette and I could not make out any features. After noticing him I just sat there and stared at him for what seemed like forever but was probably a minute or two. I expected him to come outside and talk to me because I normally talked to a lot of homeless people and I thought the man was just homeless.  He didn't come outside though, he had not moved at all actually. \nHe was as still as a statue, quiet as a mouse, maybe if I had not noticed him he would have stared at me the entire time. I eventually after staring at him got up and got my bicycle and made my way out of the property. As I am walking out of the backyard I peer into the window that is next to the door I saw the man in. The moonlight revealed the man was still there only now he was watching me walk out of the property. I could tell because the moonlight revealed the top of the mans head and I saw his left eye gazing at me. He was a white male who was very tall and had a jacket of some kind on. \nI could not make out many details because he was still cloaked in darkness. After seeing this I just move a little faster out of there. I got to the front of the house on the street and I looked inside to see if I could see him again. I could not. I got on my bicycle and waved goodbye to the house because I figured the man was still watching me. Then I drove away. For the rest of the night I could not sleep. I tried two different spots but both were no luck.\nThis is where the story ends I know I didn't have a crazy chase or fight to the death or anything but this was real life and its not the same as the movies or books. I don't know what the man was doing in there, I assume he was trying to sleep like I was but the way he was staring on me was very unnerving. It makes me wonder how long the man was in the house for and what would have happened if I actually fell asleep in the house. Would he have stared at me while I was asleep completely blinded to his presents? Or did he have other intentions? I will never know but now I don't go into houses like that anymore at all after this experience.\nSo, to the man shrouded in darkness, lets not meet again.\n​\nEdit 09/18/2023: Upon request I spaced out the block of text into paragraphs.", "media": null, "score": 99, "upvote_ratio": 0.95, "comment_count": 12, "over_18": true}, "35": {"id": "16k6cke", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "dannydutch1", "link_flair_text": null, "time": 1695086367.44132, "created_utc": 1694867296.0, "url": "https://www.dannydutch.com/post/the-mad-monk-that-burnt-2000-people-at-the-stake", "title": "A frail 78-year-old Dominican monk died on this day in 1498...and thousands of people rejoiced. His name was Tomás de Torquemada and he was the first Grand Inquisitor of the Spanish Inquisition who was reportedly responsible for the deaths of 2,000 people", "selftext": "", "media": null, "score": 22, "upvote_ratio": 0.97, "comment_count": 2, "over_18": false}, "36": {"id": "16ivjw0", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "CamelIllustrations", "link_flair_text": null, "time": 1695086368.0982478, "created_utc": 1694729331.0, "url": "https://www.reddit.com/r/threekings/comments/16ivjw0/how_risky_is_it_to_visit_anneliese_michels_grave/", "title": "How risky is it to visit Anneliese Michel's grave? What protections would you suggest I prepare? Is it risky to visit the graves of people who has association with the demonic in general?", "selftext": "I'm visiting Germany this winter as part of a Euro trip. One of my favorite movies of all time is The Exorcism of Emily Rose  So it should be obvious of how familiar I am with the Anneliese Michel case. To the point I didn't just read the book that by Felicitas Goodman that was used as the primary specific guide for the movie and watched Requiem, the German film treatment of the story, on top of currently reading German articles and books.\nSo this is a definitely on my to-do list. That should while I'm not religious, I'm open enough to believe that demons and other spirits exist so I'm also a bit nervous about visiting her grave. Since in her life she wasn't just associated with the demonic, she was a major magnet for evil entities (if you haven't read her wikipedia article yet, she was possessed by 6 demons simultaneously!), I am wondering if I'd be at a gigantic risk of opening door ways? I legitimately fear ofthe possibility a foul spirit following me home. So people here experienced with the supernatural, do I run the risk getting into trouble with the paranormal? What steps can I take to minimize the risk of an malevolent being getting entangled with me? Like what rituals or ingredients or other things can I prep for this pilgrimage visit?\nAs a bonus question, is visiting the grave sof people who were known to have gotten involved with demonic stuff during their life time a risky proposition to do? Like if I visit Alistair Crowley's grave in England or those of Ed and Lorraine Warren in Connecticut's  Stepney Cemetary, would this potentially be an invitation for an evil spirit's mischief?\nHonestly I'm looking for advice.", "media": null, "score": 2, "upvote_ratio": 0.54, "comment_count": 11, "over_18": false}, "37": {"id": "16ipsiz", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "RUFFA1F", "link_flair_text": null, "time": 1695086368.9196842, "created_utc": 1694715730.0, "url": "https://v.redd.it/zgvp9moxj9ob1", "title": "York is a known place for ghost encounters , it is a historic city. This happened in York shambles the other night , what do u lot think ? ", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/zgvp9moxj9ob1/DASH_720.mp4?source=fallback", "height": 1280, "width": 590, "scrubber_media_url": "https://v.redd.it/zgvp9moxj9ob1/DASH_96.mp4", "dash_url": "https://v.redd.it/zgvp9moxj9ob1/DASHPlaylist.mpd?a=1697678368%2CODI3YTg1ZTI0NjBiZTFkMzMwOTY0ODIxMGNlNWQxMmU5YmJmYmFkNDMwZmFiMmQ5ZmI3ZmVhM2Q1ZjQ3ODU3YQ%3D%3D&v=1&f=sd", "duration": 12, "hls_url": "https://v.redd.it/zgvp9moxj9ob1/HLSPlaylist.m3u8?a=1697678368%2CMGVhMzhhNTUyOTI5ZjliY2NmOTg5ZjUyMzg3MTNhOTQxNGIxOTVkNWM3YWE5N2RlZWE4NWNjYTk3OTdhNjgyNA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 490, "upvote_ratio": 0.87, "comment_count": 95, "over_18": false}, "38": {"id": "16l4anf", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "_man_of_meme_culture", "link_flair_text": "Glitch Vid", "time": 1695086369.3682067, "created_utc": 1694966197.0, "url": "https://v.redd.it/ba9nlm0q8uob1", "title": "3 persons in same position and same clothes ", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/ba9nlm0q8uob1/DASH_720.mp4?source=fallback", "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/ba9nlm0q8uob1/DASH_96.mp4", "dash_url": "https://v.redd.it/ba9nlm0q8uob1/DASHPlaylist.mpd?a=1697678369%2CNGQ2ODlkMjg2NmZlN2E3Yjc1YzNkMTdlN2ZlY2NiYzM3ODY4MjE4NzIzMDFjNWI1ZjkwMjI4MzdjNzIyMmUzYQ%3D%3D&v=1&f=sd", "duration": 29, "hls_url": "https://v.redd.it/ba9nlm0q8uob1/HLSPlaylist.m3u8?a=1697678369%2CZTA5N2EwYTc4MGJjNTM5MDllZDM2M2QyOWEyOWFmNDIyYmY2NzAxZmJiZDU1MDUxZWFiYzJhNWJmZDFiM2M1OA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 232, "upvote_ratio": 0.95, "comment_count": 11, "over_18": false}, "39": {"id": "16j3b7e", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Yohoho-ABottleOfRum", "link_flair_text": "encounter story", "time": 1695086370.3222249, "created_utc": 1694751209.0, "url": "https://www.reddit.com/r/bigfoot/comments/16j3b7e/know_what_i_saw_but_still_dont_believe_it/", "title": "Know what I saw but still don't believe it.", "selftext": "Staying up in the mountains in a small southwest North Carolina town since this past Sunday. Have gone to town to socialize and have a drink/dinner and came back between 10:30-11pm every night. \nBefore anyone says anything about me being drunk or having too many, it's been a single beer which was drank when I first got there, meaning it's been 3-4 hours since I had it by the time I have been getting back.\nHonestly it's been unnerving getting out of my car at night. It's literally pitch black. The sounds of the animals are super intense since it's so quiet. Mostly bugs and crickets or whatever but I kept feeling on alert like I was being watched. Didn't think anything of it, just thought I was paranoid because of the darkness and bolted down the driveway and into the house.\nMonday and Tuesday night same thing...kept having a weird feeling of being watched even tho I didn't see anything.\nThen Wednesday night will be a night I will never forget. I was driving back again and it was a little after 11pm. I turned off the main road onto this little gravel road that kind of goes around a bend with thick woods on the left and a cornfield on the right and of course I had my high beams on since there are no lights anywhere around. \nI come around the bend onto a stretch of straight road and I see this massive creature standing in the road. I slammed the brakes on and immediately just felt panic because I didn't know what I was looking at. It was HUGE...like 7-8 feet tall and hairy. As I sat there frozen looking at it, it slowly turned toward me and looked for a second, then kind of fast walked/jogged back into the woods on the left side of the road and was gone. However, the way it moved was weird. I can't really describe it...didn't look normal to me.\nI know what I saw but I still don't believe I saw it. I am an analytical person by nature, a software engineer who was raised by  scientists that taught me to question everything but always demand proof before you believe it. As such, I never really believed in bigfoot, per se, as I didn't see proof, but now it's kind of shaken my foundation of how I view reality to the core.\nI have seen a black bear. I've seen a black bear standing up. It was NOT a black bear. It looked like a giant gorilla mixed with a Wookie but dark colored. Unless a giant gorilla just escaped from a local zoo, I don't have an explanation for what I saw. I'm still shook by it even a day later and I haven't really slept since because all I can do when I close my eyes is see a replay of that over and over again in my mind and I honestly don't want to remember it, I just want to pretend I never saw it so I can go back to my own view of reality again.\nAlso noticed as I drove past where it was there was a strong smell of what I can only describe as exceedingly strong BO like if a person didn't take a shower for a year times 10. Didn't have the windows down but had the vent going because for whatever reason the windshield constantly wants to fog up so I need to blast the air on it while driving to prevent it.\nHonestly I don't even know why I am posting this. I guess it's because I need to get this off my chest and tell SOMEONE, and it's better to tell a random group of strangers online than to tell my friends or family who will all think I am crazy and will talk behind my back.\nI saw what I can only describe as a bigfoot and I kinda feel like I've been being watched by them since I have been here. Maybe the watching part has all been in my imagination but every time I get out of the car at night I have a huge adrenaline burst and I get a knot in the pit of my stomach and I just want to run as fast as I can to get in the house.\nI've been researching all day and reading everything I can find because I need to understand this more. I am not a person that can have something like this happen and just go on about their life. I need to know more about this now. What it is, why it's here, how it got here, where did it come from, etc.\nI am sure people will tell me I am full of it and I saw something else, but I know what I saw and I know there is nothing else it could have been.\nFINAL UPDATE:\nLeft the place this morning and am now back home but had another weird situation occur on the way out. Well, I think it was weird, perhaps it was just dumb chance but I guess I will explain.\nGot back around 8pm yesterday right around when it was dusky...not completely dark but almost dark. Thankfully didn't see anything. Decided I would load the car up before going to bed since I was leaving early this morning(left at around 4:30 AM).\nHas the same weird feeling again like I was being watched but quickly loaded the car and went back inside and went to bed.\nWoke up this morning, got to the car and got in to start driving. Going down the mountain road with all the switchbacks and turns, got to the end of the road I was on to turn into the main road(it forms a T) and about 15 feet prior to the end of the road was a large rock sitting in the middle of the road.\nThat rock was not there at 8pm. I go hiking a lot in an area where rock slides happen at times and usually of that happens the rocks end up by the side of the road, not in the middle of it. It honestly looked like it was placed there by someone or something in order to force someone to get out of their car and move it. \nI got the same unnerving feeling as if I was being watched and I almost started panicking. No way in hell I was getting out, so I very carefully drove a little off the side of the road on one side and managed to get around it.\nI sped out of there pretty quick after that. I honestly got the feeling I was being fucked with by them as if they noticed me loading the car and figure out I would be leaving early so they made it more difficult or wanted to play a trick on me.\nI have no proof of this at all and maybe it's just me being over imaginitive but I find it difficult to believe this rock could have randomly ended up where it did in the timeframe between when I drove past that area at 8pm and 4:30am. It's not like there is a ton of traffic on the road and I didn't see a place where a rock would have came from although it's possible rocks fall down from there...\nHonestly have gone from being shook to kind of being pissed not only that I have had my version of reality ripped from me unwantingly but now that they seemingly were fucking with me too and I imagine laughing at me the whole time.", "media": null, "score": 258, "upvote_ratio": 0.96, "comment_count": 156, "over_18": false}, "40": {"id": "16jf0hc", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1695086371.1993582, "created_utc": 1694788346.0, "url": "https://i.redd.it/gfx81njtjfob1.jpg", "title": "In 1928 Robert Aiken was stationed at Pearl Harbor in Hawaii when he saw a group of 40 foot (12m) long octopuses off the coast. All known octopuses in the region only grow to about half the length of the sighting. They were later sighted in 1950", "selftext": "", "media": null, "score": 201, "upvote_ratio": 0.98, "comment_count": 25, "over_18": false}, "41": {"id": "16hsawn", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Ruffly30Cats", "link_flair_text": "Personal", "time": 1695086371.4562798, "created_utc": 1694624138.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/16hsawn/maroon_gumby_in_corn_field/", "title": "Maroon “Gumby” in corn field", "selftext": "This is my first ever post to this group, so I apologize if there is anything I’ve formatted wrong.  \nI live in a very rural farming area of Kansas.  This happened in the fall of 2007. \nI went for a night drive with a friend on some country roads amid corn fields. Where I live, corn stalks grow\ntall on both sides of the road in many places.  It is a VERY desolate and dark area at night.  -No one around for miles and you could see the Milky Way in all her glory because there are no lights- \nAs I was driving, we saw something resembling the cartoon character “Gumby” run across the dirt road lit up by our headlights.  \nIt crossed probably 10 feet in front of us.  The creature was dark maroon in color and with bulbous hands and feet.  No digits.  It walked on two legs.  It had very smooth-looking skin - almost like a shark or dolphin.  It didn’t stop to look at us and I never felt threatened.  The creature ran like it was afraid from one corn field, across the road to another.  \nWe didn’t witness anymore strange sightings that night or have any weird experiences after.  \nHave you ever seen a maroon creature like I did?", "media": null, "score": 134, "upvote_ratio": 0.96, "comment_count": 40, "over_18": false}, "42": {"id": "16i65i4", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "diaperfeast", "link_flair_text": null, "time": 1695086373.0143273, "created_utc": 1694657959.0, "url": "https://i.redd.it/l3slwsf6s4ob1.jpg", "title": "Frogman found-footage movie coming soon", "selftext": "I had the opportunity to draw up this poster for FROGMAN coming out in 2024. It’s a found-footage creature/body horror flick and from the teaser and behind the scenes images I got to see while working on this, it’s going to be a great cryptid feature.", "media": null, "score": 363, "upvote_ratio": 1.0, "comment_count": 33, "over_18": false}, "43": {"id": "16l8k1h", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Splash", "link_flair_text": null, "time": 1695088940.8731318, "created_utc": 1694976174.0, "url": "https://i.redd.it/j0nvz2ga1vob1.png", "title": "Trump posing in front of pyramids with some happy looking humanoid aliens.", "selftext": "", "media": null, "score": 2220, "upvote_ratio": 0.85, "comment_count": 418, "over_18": false}, "44": {"id": "16jf89b", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "real_politik_pod", "link_flair_text": null, "time": 1695088941.2549016, "created_utc": 1694788864.0, "url": "https://www.podchaser.com/podcasts/coast-to-coast-pm-4749189/episodes/ep-69-when-keepin-it-ouija-goe-185551975", "title": "When Keepin’ It Ouija Goes Wrong: AWOL Soldier Edition", "selftext": "", "media": null, "score": 3, "upvote_ratio": 0.72, "comment_count": 1, "over_18": false}, "45": {"id": "16gw9ra", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "brats699", "link_flair_text": "Discussion", "time": 1695088943.082022, "created_utc": 1694537003.0, "url": "https://www.howandwhys.com/einstein-student-robert-sarbacher-ufo-letter/", "title": "Grusch said over-classification of UAP-like tech began with Sarbacher & Oppenheimer. Sarbacher said that UFO crashes and alien bodies were more important than Atom Bomb. Scientists Vannevar Bush, von Neuman & OPPENHEIMER were involved in crash debris analysis.", "selftext": "", "media": null, "score": 373, "upvote_ratio": 0.94, "comment_count": 114, "over_18": false}, "46": {"id": "16huhlz", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "blue_estron", "link_flair_text": "Discussion", "time": 1695088944.6144085, "created_utc": 1694629120.0, "url": "https://twitter.com/uncertainvector/status/1702023350803959988", "title": "Ryan Graves on Twitter: \"Unfortunately, yesterday’s demonstration was a huge step backwards for this issue... I will continue to raise awareness of UAP as an urgent matter of aerospace safety, national security, and science, but I am deeply disappointed by this unsubstantiated stunt.\"", "selftext": "", "media": {"oembed": {"provider_url": "https://twitter.com", "url": "https://twitter.com/uncertainvector/status/1702023350803959988", "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">After the U.S. Congressional UFO hearing, I accepted an invitation to testify before the Mexican Congress hoping to keep up the momentum of government interest in pilot experiences with UAP.  Unfortunately, yesterday’s demonstration was a huge step backwards for this issue. My…</p>&mdash; Ryan Graves (@uncertainvector) <a href=\"https://twitter.com/uncertainvector/status/1702023350803959988?ref_src=twsrc%5Etfw\">September 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n", "author_name": "Ryan Graves", "height": null, "width": 350, "version": "1.0", "author_url": "https://twitter.com/uncertainvector", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}, "type": "twitter.com"}, "score": 7654, "upvote_ratio": 0.89, "comment_count": 1859, "over_18": false}, "47": {"id": "16j3kje", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "depressionly_", "link_flair_text": "Image 📷", "time": 1695088946.5243676, "created_utc": 1694752049.0, "url": "https://i.redd.it/rh9054mxjcob1.jpg", "title": "What people think aliens look like vs what they actually look like:", "selftext": "", "media": null, "score": 15171, "upvote_ratio": 0.95, "comment_count": 687, "over_18": false}, "48": {"id": "16j2xb5", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "MathAndCodingGeek", "link_flair_text": null, "time": 1695088947.141877, "created_utc": 1694749980.0, "url": "https://www.reddit.com/r/UAP/comments/16j2xb5/is_nasa_ready_for_aliens_nasas_disaster_of_a_uap/", "title": "Is NASA Ready for Aliens? NASA's Disaster of a UAP News Conference.", "selftext": "I'm writing this post hoping it is not \"chaff.\" I watched a disaster of an online conference. Can anyone please help NASA hold a news conference? The idea of aliens flying spaceships to Earth is a cultural goliath, and NASA, ironically, needs help understanding what they are dealing with, not scientifically but culturally.\nI'm sure everyone agrees that Dr. Avi Loeb is one of our great scientists. One of Dr. Loeb's criticisms is that the scientific community refuses to use aliens when they are the most likely explanation for a particular phenomenon. Nothing can better describe NASA's news conference about the conclusion of the UAP Independent Study than Dr. Loeb's words.\nIn case you missed it, this news conference announced the conclusions from a study designed to kick off the founding of NASA's UAP| Science Mission Directorate. Bill Nelson insisted that NASA would tell us the truth about aliens and UAPs even as everything he said otherwise indicated that NASA could not handle the truth if that truth is aliens.\nSo, for example, right off the bat, Bill Nelson emphatically said that NASA found no conclusive evidence that aliens are behind the UAPs. Though that statement is technically correct, the problem with it is that it sounds like a conclusion. \"We found no conclusive evidence\" is often the statement scientists use to mean that the new wonder drug won't harm anyone. Mr. Nelson decided to hedge his words with his bias instead of saying we don't know yet.\nBy the way, Dr. Loeb believes he has physical evidence of alien technology, and no one asked about it during the meeting. \"Show me the evidence,\" said Mr Nelson. Dr. Loeb says he has it; call him up.\nAfter concluding there was no evidence of aliens, Mr. Nelson told us that the investigation would be open to the public just before another panelist said that NASA would not disclose who would head up the UAP Directorate. I mean, I got whiplash.\nThe next thing that happened was that a panelist referred to most people's opinions as chaff. Did he really need to say that? I understand this statement; there is a lot of annoying noise because Aliens are a cultural goliath, but this is a big deal, and dismissing people, no matter who they are, will make things worse.\nScience is meeting culture and politics, a dangerous combination; just ask Dr. Faucy. Two works of science fiction should be required reading at NASA. They are \"Solaris\" and \"His Masters Voice,\" both by Stanislaw Lem. These books warn scientists about the weakness of science when it comes to interaction with politics and society.\nThe novel Solaris is about discovering a planet that seems alive and has technology far superior to humans. Yet, scientists cannot find \"conclusive evidence\" in the story that the exo-planet is alive or intelligent even though anyone with common sense can see it, so, of course, the politicians eventually have to step in, and chaos ensues.\nThat is the danger in this UAP investigation: everyone sees it obviously as intelligent alien life, including the scientists, but science is afraid of drawing conclusions from the evidence. NASA is already closing in on this scenario.\nIn the second novel, the Earth receives an incomprehensible alien signal—all attempts to decode the signal fail even though the message is broadcasted in a way that seems like a message. Again, everyone knows it is a message, but there is no conclusive evidence that the broadcast is a message because it is too alien to be translated. The theories of what is obviously an alien message regress to not a message simply because scientists cannot draw conclusions even though they know it is an unmistakable message.\nLet's put it another way: In 1896, Svante Arrhenius was able to calculate the effect of increasing atmospheric Carbon Dioxide on the temperature of the Earth's surface; not 1996, that was in 1896! In 1902, Svante published a theory that coal combustion could lead to human extinction due to climate change. In 1960, 10,000 scientists signed a letter that the Earth is in trouble with global warming. It's 2023, and there still needs to be a plan to fight climate change, even though everyone can see it happening, and 127 years after humanity knew about the problem and needed such a plan. Humans could become extinct because people fear to say what is in front of their faces.\nNone of my criticism here is about science as a discipline or scientists. My complaint is that fear paralyzes our scientific institutions: fear of being wrong, losing jobs, and losing funding.\nI learned nothing substantive listening to the conference except that NASA is not ready as an institution to encounter alien life if it bites them on the nose.", "media": null, "score": 168, "upvote_ratio": 0.85, "comment_count": 126, "over_18": false}, "49": {"id": "16iiump", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "moondog151", "link_flair_text": "Murder", "time": 1695088947.830894, "created_utc": 1694698945.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16iiump/after_an_8yearold_girl_failed_to_return_home_the/", "title": "After an 8-year-old girl failed to return home the police conducted a massive search only to later find her body in an apartment garbage bin having been forced down the chute.", "selftext": "(Disclaimer: This write-up may be a little disturbing\nAnd in case you are wondering. The Chinese language wikipedia has 20 separate articles and lists dedicated to documenting every murder in Hong Kong (that they can find) and I'm just going through the unsolved ones on the list)\nOn August 7, 1976, 8-year-old Ng Wai-kuen living in Kwun Tong, Hong Kong was sent by her father to walk quickly to her mother's to pick up the key to her and her father's apartment. After she failed to return home half an hour later her father went to the home to ask his wife about Wai-kuen and was told that she never showed up. The two parents searched on their own for hours until finally contacting the police on August 8, at 11:50 a.m.\nPolice began an extensive search effort but it was too late. Her body was found in a garbage bin. The body was identified by Wai-kuen's parents. The body was found at block 22 while she lived at block 24. She was found by a cleaning lady who was moving the bin towards a garbage truck when she noticed the bin was heavier than usual. So in response, she stopped and dug through the garbage. After doing so she found hair sticking out of the garbage. She rummaged around a little more thinking it was a doll toy until she found Wai-kuen's body with her screaming alerting other sanitation workers nearby.\nAccording to the police, Wai-kuen was likely killed elsewhere and disposed of in the garbage bin via being shoved down the garbage chute. The garbage was mostly from blocks 22 and 24 meaning the killer was someone who lived in that area. The pathologist examined Wai-kuen's body was barefoot and her shirt had been rolled up to her head and her lower body was naked and tragically blood was seeping from her vaginal area with the killer having very likely raped her which an autopsy confirmed. The cause of death was strangulation and she was likely killed at 9:30 p.m. to 10:30 a.m. on August 7.\nPolice dispatched 150 officers to the scene and searched every garbage room and chute in the area and in the garbage room on the eighth floor of Block 22, they found Wai-kuen's trousers, underwear and slippers. This led police to believe that she was likely killed there. Police found some of her belongings in the same location and called off the evidence search soon after.\nAs soon as the case went public a witness soon came forward. A man came forward and told police that on 2:00 a,m, on August 8 when he returned home, he passed by the stairwell on the fifth to sixth floors of Block 24, and heard screaming and crying coming from the garbage room. Police revised their theory and believed that she was killed there and her belongings and clothes were disposed of at the other garbage room to mislead police. The police then issued a reward of 10,000 Hong Kong Dollars for any information leading to an arrest.\nAfter more rounds of investigation, police soon came up short and even lost their progress as the clothing recovered from the garbage room was revealed to actually not belong to Wai-kuen. Police also had no idea where the murder had actually taken place and thus made a dummy matching Wai-kuen's build and weight and slid it down various garbage chutes to see if it'd end up and possibly reveal where the murder took place.\nOn August 9 the police continued with their efforts going door to door and visiting a total of 2,500 residences to ask for information. During their interviews, they learned that the neighbourhood had a very high crime rate such as burglaries and had an especially high sex crime rate with rapes and assaults being more common than the police realized with many of the victims simply not making reports. Some witnesses who wanted to remain anonymous also told police of a well-known local sex fiend who was 20-30 years of age. Most of the victims of these unreported assaults and rapes were 8-9 years old and the crimes often took place in refuse rooms and lifts.\nOn July 1, 1974, another gruesome murder of a child took place in the same area. 1 and a half-year-old Ho Ka Kin went missing for seven days before being found in on the 14th floor of block 22. His body was forced upside down head first into a latrine pit with his body covered in wounds and his lower body was burnt with boiling water. This crime also was never solved.\nPolice in a rather controversial move had Wai-kuen's sister wear her clothing and walked around the area with police escorting her in hopes that someone would see her and be reminded of her sister and suddenly remember details on the case. As a result of this police did arrest three young men but they were found to be innocent and released.\nTheir next course of action was to have several plainclothes officers monitor and attend Wai-kuen's vigil held on August 15 at the scene where her body was discovered. They were hoping the killer would revisit the scene and they seemingly thought it had worked. They saw a man acting furtively and looking evasive and soon went to the alter to offer incense. Officers decided to follow him after he left and made plans to arrest him. The man was brought to the police station for interrogation but released the next day due to an alibi with numerous witnesses corroborating it.\nPolice then questioned 40 people suffering from leprosy and had young female officers dress in plain clothes and stay in various areas of the neighbourhood in hopes of setting a trap and arresting anyone who would attempt to assault them only for no one to take the bait.\nThe last suspect came on September 3 when a 4-year-old girl was kidnapped, raped and left for dead in a garbage room. Fortunately, she survived and the police arrested two young men. Unfortunately, they were simply copycats using the same publically known method as they both had alibis for Wai-kuen's death.\nNo more leads or suspects ever came forth leaving the case unsolved.\nSources\nhttps://frogwong.com/2018/11/11/%E8%97%8D%E7%94%B0%E5%A7%A6%E9%AD%94/\nhttp://hongkongheavycase.blogspot.com/2019/06/1976_3.html", "media": null, "score": 607, "upvote_ratio": 0.98, "comment_count": 47, "over_18": true}, "50": {"id": "16k0i1u", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "LadyRed6", "link_flair_text": null, "time": 1695088948.3245373, "created_utc": 1694846787.0, "url": "https://www.reddit.com/gallery/16k0i1u", "title": "Victims in WTC rubble", "selftext": "Pictures labeled and zoomed in to show picture details. Never Forget the evil that took almost 3,000 innocent lives that day. An evil act that is still claiming victims to this day.", "media": null, "score": 3319, "upvote_ratio": 0.94, "comment_count": 172, "over_18": true}, "51": {"id": "16kqvfc", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "jessicamshannon", "link_flair_text": null, "time": 1695088948.5474114, "created_utc": 1694923071.0, "url": "https://i.redd.it/l6yc0nrhoqob1.jpg", "title": "Doctors bow to honor a 17 year old organ donor. Her untimely death saved several lives and allowed someone to see again.", "selftext": "I found this on r/medizzy and the picture really moved me. If you are a U.S. cirizen and you haven't signed up to be an organ donor, here's how you can remedy that. I also encourage you to sign up to donate bone marrow through Be The Match. There's an outdated belief that bone marrow donation is painful. It used to be, but that is no longer the case. You could literally save a life. Don't wait to sign up. \nHere's the google translate version of the article on the young woman in the picture.\n https://www.chinadaily.com.cn/china/2012-11/23/content_15952137.htm\nBy ZHENG CAIXIONG in Guangzhou (China Daily)\nUpdated: 2012-11-23 01:52\nA 17-year-old girl's liver, two kidneys and two corneas were transplanted after her death to save others' lives at the General Hospital of Guangzhou Military Command in Guangdong province on Thursday evening.\nThe liver surgery was jointly conducted by Huang Jiefu, vice-minister of health, and Huo Feng, a senior surgeon at the hospital.\nWu Huajing, the organ donor, was a student from Shaoguan College of Medical Science. She had been in critical condition since she was seriously injured in a traffic accident in Shaoguan on November 9. Wu was declared dead on Wednesday afternoon. Her organs were removed on Thursday afternoon.\nBefore she died, Wu told her parents of her wish to donate her organs to help others and repay society.\n\"Wu's liver was successfully transplanted to a 41-year-old man from a local property management company. The man has had liver cancer for years and has been in very poor condition\", Huo Feng said at a news conference on Thursday night.\nBut Huo did not reveal details of the patients who received Wu's kidneys and corneas.\nVice-Minister Huang said he was deeply moved by Wu's gift.\n\"I think Wu would have been happy if she had known her organs have helped save others' lives,\" Huang said.\nOn Wednesday morning, Huang also acted as the operating surgeon for a 52-year-old woman surnamed Zhang who donated her liver, kidneys and corneas after she died of cerebral hemorrhage in Guangzhou.\nZhang's liver was transplanted to a man of a similar age. The man who had cirrhosis of the liver and liver cancer has waited for a liver transplant for more than two months.\nZhang's two kidneys were transplanted to another man and a woman, both in their 30s, who had urinaemia and had been on the hospital's waiting list for kidney transplants for many years.\nZhang's corneas were transplanted to a 5-month-old child from Zhuhai and a 65-year-old man from Shenzhen.\n\"Zhang's donation has helped save three lives and helped another two people recover their sight,\" Huang told media after the operations at the No 3 Hospital Affiliated to Sun Yat-sen University in Guangzhou on Wednesday.\nHuang said he paid homage the organ donor Zhang before starting the transplant operation.\nHuang is a well-known expert in liver transplants.\nChina has become the second-largest country in terms of organ transplants, Huang said.\nSince the country introduced a posthumous organ donation system in March 2010, China has completed organ transplant surgeries for 465 organ donors in 38 designated hospitals across the nation from March 2, 2010, to September 30.\nThe system was jointly implemented by the Red Cross Society of China and the Ministry of Health. It is aimed at encouraging more people to donate their organs after death to help people in need.\nA total of 1,279 organs have been donated for life-saving purposes in the past two and a half years, Huang said. Of the organ donors, more than 120 came from Guangdong.\nChina's reliance on organ transplants from condemned prisoners will end within two years as the donation system is proving successful, Huang said.", "media": null, "score": 39, "upvote_ratio": 0.91, "comment_count": 4, "over_18": true}, "52": {"id": "16hn8gs", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "happypants69", "link_flair_text": null, "time": 1695088948.732644, "created_utc": 1694612154.0, "url": "https://www.youtube.com/watch?v=d-Xx0EPScew", "title": "\"Non-human\" alien corpses displayed at Mexico's Congress, believed to be 1,000 years-old", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Alien Mummies in Mexico | Scientists  Unveil 1000-Year-Old Corpses | Alien Mexico Congress", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/d-Xx0EPScew?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Alien Mummies in Mexico | Scientists  Unveil 1000-Year-Old Corpses | Alien Mexico Congress\"></iframe>", "author_name": "MIRROR NOW", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/d-Xx0EPScew/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@mirrornow"}}, "score": 3, "upvote_ratio": 0.6, "comment_count": 1, "over_18": true}, "53": {"id": "16m6ulb", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "bjemiller1998", "link_flair_text": null, "time": 1695088949.1458728, "created_utc": 1695070021.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/16m6ulb/serial_killer_robber_i_have_no_idea/", "title": "Serial killer? Robber? I have no idea", "selftext": "This happened early this morning. I needed to change my transmission fluid in my car, and my apartment complex doesn't allow you to work on your car on the property. I figured I'd go to a hiking trail parking lot thats pretty secluded, and do it there. When I pulled up, there was only one car (Red). I get out my tools, start unhooking my front bumper to access the drain plug, when I notice another car (Grey) pulling up in my peripheral vision. I didn't think much of it, just figured it was a hiker. 30 seconds after the second car got there the red car left, 15 seconds later a older white guy (60-70 years old) pops around the backside of my car and is like \"Hey how's it going? What you got going on there?\". At first I just assumed casual talk like older guys like to do, but I noticed he seemed really off..god/my inner gut was yelling at me to stay as close as possible to him and watch his hands and every movement. I explained to him how I was trying to unbolt my transmission fluid drain plug and he'd just kind of go \"aaah\", stare at the car, my tools, and look over at the woods. He goes \"anybody know you're this far out?\" RED FLAG.  I could see the gears turning in his head as if he wasnt sure if he wanted to try to make his move or not. Both of his hands were in his pockets, so I figured he had a weapon. There was so much tension, you could slice it with a knife. I pretend to be friendly, introduce myself and go for a handshake to force his hand out of his pocket. I could see he let go of something before pulling his hand out. Another red flag! I remember hearing one of the best ways to survive serial killers (not saying he was one) is to humanize yourself, tell them about you, your goals, ask them their name etc. So, thats just what i did. I told him how i found out yesterday, that my wife amd I are having our first child, and asked him if he had any kids. He said he has one son, and I could finally see some light in his eyes. I continued by asking him tips on how to be a good, decent father. He started to open up, but shortly began acting weird again with his hand in his pocket. I could tell he was waiting for the right moment. Plan A was a fail, now on to plan B. I'm a pretty built guy at 220 6'2, so I knew my only chance if he tried anything, was to keep him in arms reach. He kept trying to back away from me slightly to pull whatever he had out of his pocket, but once he realized I was on to him he was like \"Alrighty I'm gonna chuck out of here\". THE DUDE THEN TRIES TO WALK BEHIND ME TO GO BACK TO HIS CAR. I turn and watch him the entire time and tried to stay behind the engine block in case I needed to take cover. Once he was closer to his car, I grabbed my tool box and tossed it in the passenger seat from the driver side window and hopped in the car. He hears it and turns around to walk back towards my car with this evil look on his face, but by that time I'm literally drifting out of there with my bumper hanging half off. I think back on it, and wonder if he just wanted to rob me, but there's no way since he was driving a brand new Jaguar SUV. I'm not sure what his intentions were, but thankfully I didn't find out.", "media": null, "score": 37, "upvote_ratio": 0.96, "comment_count": 7, "over_18": true}, "54": {"id": "16kvt7y", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "GeneralDavis87", "link_flair_text": null, "time": 1695088949.3264213, "created_utc": 1694941496.0, "url": "https://youtu.be/__A3YyHL2Q4?si=qb5fkxo48gZjPmQT", "title": "1st Marine Division in Action at Bunker Hill North Korea", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "1st Marine Division in Action at Bunker Hill North Korea", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/__A3YyHL2Q4?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"1st Marine Division in Action at Bunker Hill North Korea\"></iframe>", "author_name": "The Federal File", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/__A3YyHL2Q4/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@TheFederalFile"}}, "score": 7, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "55": {"id": "16lh2tb", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Moist-Customer-1953", "link_flair_text": null, "time": 1695088950.6520574, "created_utc": 1694997477.0, "url": "https://www.reddit.com/r/Ghosts/comments/16lh2tb/toddler_says_shes_seeing_ghosts_after_an_accident/", "title": "Toddler says she’s seeing ghosts after an accident", "selftext": "I’m not sure if this is the right place to post, we’ve recently been in a car accident it was pretty knarly but we are all okay. My daughter 2.5 years old sustained an injury, and thankfully is okay. It’s been a few weeks, now she is saying that she sees ghosts. It is random usually she’ll point and say “ghost!” Sometimes she’s happy to see them, sometimes it’s a scary ghost. Has anyone else had something like this happen? Maybe it is a result of her injury but I’m just interested if anyone has had something similar happen", "media": null, "score": 337, "upvote_ratio": 0.92, "comment_count": 92, "over_18": false}, "56": {"id": "16k5dg0", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "GaminGoNEON", "link_flair_text": "Glitch Pic", "time": 1695088951.056286, "created_utc": 1694864371.0, "url": "https://i.redd.it/d531eivxtlob1.jpg", "title": "devs please fix this rendering issue", "selftext": "", "media": null, "score": 98, "upvote_ratio": 0.95, "comment_count": 10, "over_18": false}, "57": {"id": "16leewj", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "PPL_WW", "link_flair_text": "Art I made and am selling.", "time": 1695088951.8339267, "created_utc": 1694990228.0, "url": "https://www.reddit.com/gallery/16leewj", "title": "6 Big Foot Sun Catchers", "selftext": "These are cut out by hand on a scroll saw. Multiple colors, multiple wood species, all covered in dichroic glass. Comment for details.", "media": null, "score": 180, "upvote_ratio": 0.96, "comment_count": 34, "over_18": false}, "58": {"id": "16gvl5j", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "0todus_megalodon", "link_flair_text": "Lost Media and Evidence ", "time": 1695088952.498769, "created_utc": 1694535378.0, "url": "https://i.redd.it/gar6ylwinunb1.png", "title": "Cryptid lost media - report of a diver's encounter with a supergiant jellyfish", "selftext": "", "media": null, "score": 134, "upvote_ratio": 0.93, "comment_count": 41, "over_18": false}, "59": {"id": "16jknzp", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "RelevantConsequence5", "link_flair_text": "Strange", "time": 1695088952.7298534, "created_utc": 1694801829.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/16jknzp/encounter_in_woods_seeking_answers/", "title": "Encounter in woods, seeking answers?", "selftext": "Location/Time : Sharpsburg, GA, United States\n (fall of 2008)\nSo, I am 19 (F) and this happened to me when I was ab 4/5 yrs old. I was with my older brother who was about 11/12 at the time. Most of the people in my life like friends/family, pretty much know ab this story as well. I think about this event a lot, probably everyday. This event has for sure left me very paranoid, esp around the woods. Yet, I am still pretty curious about it at the same time. \nAnyways, one morning my brother and I were heading to the car for school. It was still a bit dark outside, but you could see the sun coming up. I remember the sky having a sort of greenish tint. \nWe typically don’t use the front door ever, and usually just use the side door to the house. We have one large storm door, and then your typical glass door on the outside of it. \nAs we are heading to go outside, I reach for the handle and my brother stops me mid reach, and pulls me away from the door. (he can see outside as the door is glass). At the time, my house was also completely surrounded by woods. You cannot see it from the street either. \nMy brother points to what he sees and as I remember, it was incredibly tall. I was ofc very small at the time so you’d think oh maybe it just appeared larger to us bc we were kids. But I swear this shit was like 7 foot tall. \nThis thing looked almost solid white/grey and it had what looked like 3 dark circles or holes going down it’s body. We knew this thing was abnormally tall because of how slow and big it’s strides were. It almost looked like slow motion in a way. It was also just body and 2 legs. that’s all it looked like. I’m not even sure if there was a face or a head. It was walking at the edge of our woods and it seemed to be heading to the back yard. sorta minding its own business ig. \nI don’t have any memory of what happened after, but my mom has always said that right after it happened, we ran to her and my dad crying and panicked. She said she separated us and asked us separately what happened. We both described the same thing and told the same story. My mom said it freaked her out pretty bad as well. \nI remember my brother and I tried to guess what we saw and all we could think was that maybe it was a dying animal walking. Because it could have been bone that we saw. But, I remember it wasn’t limping or dragging any skin or anything. It was walking perfectly straight and upright. \nA few years after, we started hearing this horrible screaming at night. I know there’s foxes, owls, and all that other stuff that screams lol. But, this thing would run around the house. Like circle around the house in the middle of the night on and on. I would hear it in my sleep and it would make me have horrible nightmares of my family being eaten. This happened for a short period of time. My dad had finally had enough and he got a permit to shoot and take out whatever it was. As soon as he got the permit, it quit. Never heard that thing again and we have lived here for 13 years. \nI’m not sure if it’s related, but i struggled with terrible sleep paralysis for a few years and it was only at this house. I would wake up, unable to move and would have a man or woman screaming into my ear. I would finally be able to move and instantly cry bc of fear and ACTUAL pain in my ear. I would also sometimes be paralyzed and then feel my body going up. My body wasn’t going up , but i was? Whenever this would happen I would be fully conscious and aware. I could hear myself in my head and i just kept saying “ PUT ME DOWN . PUT ME DOWN IM NOT GOING UP “. and i would slowly go back down, but it would always take so long it felt like. \nThis used to scare me to the point that I was afraid to even fall asleep. Eventually, I talked to a few different mediums and they gave advice that helped. Anyways, I could go way more into that topic but that’s not what this post is about. I have a few true experiences with the supernatural/spiritual and I will prob post them on here as well. \nOverall, I am hoping someone could give some useful insight on this situation. Maybe it isn’t what I think it is and someone else has a better answer. \nMy heart rate has been going bonkers while typing this.", "media": null, "score": 67, "upvote_ratio": 0.93, "comment_count": 16, "over_18": false}, "60": {"id": "16hzvzh", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "e_ben", "link_flair_text": null, "time": 1695088954.0031328, "created_utc": 1694641559.0, "url": "https://i.redd.it/p8w650sef3ob1.jpg", "title": "Have you been to the cryptozoology and paranormal museum in Littleton?", "selftext": "I haven’t seen a single post about it on this whole subreddit and I’m a massive fan of the museum, there’s a ton of cool artifacts and displays. I’m wondering if any of the people on this subreddit have stopped by it.", "media": null, "score": 112, "upvote_ratio": 0.99, "comment_count": 10, "over_18": false}, "61": {"id": "16jldag", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "PepeLives00", "link_flair_text": null, "time": 1695092227.6918695, "created_utc": 1694803552.0, "url": "https://i.imgur.com/OFpV6wS.jpg", "title": "So close to being self aware…..", "selftext": "", "media": null, "score": 1817, "upvote_ratio": 0.85, "comment_count": 543, "over_18": false}, "62": {"id": "16h1wts", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1695092227.993215, "created_utc": 1694550043.0, "url": "https://i.redd.it/7lwlf4q5uvnb1.jpg", "title": "The Mothman vs The Chupacabra | What's The Bigger Story? (Watch The Full Episode https://youtube.com/live/DlFl69edrgI)", "selftext": "", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "63": {"id": "16id884", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "KhanTheGray", "link_flair_text": "Article", "time": 1695092229.6021214, "created_utc": 1694681589.0, "url": "https://www.reddit.com/r/ufo/comments/16id884/scientists_call_fraud_on_supposed/", "title": "Scientists call “fraud” on supposed extraterrestrials presented to Mexican Congress", "selftext": "UPDATE; Independent study of CT Scans of mummies by Cyprus University of technology experts, dismissed the mummies as mishmash of human and lama bones. \nPage 15:\n“Actually the fact that the 1st vertical vertebrae enters the basicranium of Josephina would discourage any serious researcher to investigate further because it’d show that the remains were articulated from various bones, fitting together in a mechanistic and unfunctional way. The cervical vertebrae in Josephina should destroy the brain if there was downward impact on the head, because in the absence of any stopping mechanism, the vertebrae would enter the brain case.”\nhttps://www.iaras.org/iaras/filedownloads/ijbb/2021/021-0007(2021).pdf\nThis specimen has simply been put together by another human. There is nothing alien about it. It’s a mishmash of bones of multiple people.\n“In 2017, Maussan made similar claims in Peru, and a report by the country's prosecutor's office found that the bodies were actually “recently manufactured dolls, which have been covered with a mixture of paper and synthetic glue to simulate the presence of skin.”\nThe report added that the figures were almost certainly human-made and that “they are not the remains of ancestral aliens that they have tried to present”. The bodies were not publicly unveiled at the time, so it is unclear if they are the same as those presented to Mexico's congress.\nOn Wednesday, Julieta Fierro, researcher at the Institute of Astronomy at the National Autonomous University of Mexico, was among those to express skepticism, saying that many details about the figures “made no sense.”\nFierro added that the researchers' claims that her university endorsed their supposed discovery were false, and noted that scientists would need more advanced technology than the X-rays they claimed to use to determine if the allegedly calcified bodies were “non-human”.\n“Maussan has done many things. He says he has talked to the Virgin of Guadalupe,” she said. “He told me extraterrestrials do not talk to me like they talk to him because I don’t believe in them.”\nThe scientist added that it seemed strange that they extracted what would surely be a “treasure of the nation” from Peru without inviting the Peruvian ambassador.\nCongressman Sergio Gutiérrez Luna of the ruling Morena party, made it clear that Congress has not taken a position on the theses put forward during the more than three-hour session.\nhttps://abcnews.go.com/amp/International/wireStory/ufos-green-men-mexican-lawmakers-hear-testimony-existence-103166991", "media": null, "score": 350, "upvote_ratio": 0.84, "comment_count": 254, "over_18": false}, "64": {"id": "16inxcy", "locked": true, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Flimsy-Union1524", "link_flair_text": "Witness/Sighting", "time": 1695092230.9972954, "created_utc": 1694711339.0, "url": "https://v.redd.it/5r3hk0wo69ob1", "title": "Don't forget Donna Hare, former NASA employee: “We have many high-resolution photos of UFOs or alien spacecraft and I can testify before Congress.”", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/5r3hk0wo69ob1/DASH_360.mp4?source=fallback", "height": 360, "width": 540, "scrubber_media_url": "https://v.redd.it/5r3hk0wo69ob1/DASH_96.mp4", "dash_url": "https://v.redd.it/5r3hk0wo69ob1/DASHPlaylist.mpd?a=1697684230%2CMTk3YzI3MDM0ZTk0NDY1MjE2MDBlYThiZjYzMWQ3M2E4OTAwMGE1ZDZjNThhOWRhZGQ0ZWEzMjMwNTEyMTMwMw%3D%3D&v=1&f=sd", "duration": 213, "hls_url": "https://v.redd.it/5r3hk0wo69ob1/HLSPlaylist.m3u8?a=1697684230%2CZGU5N2Q2MTA1OTgxYjZmZDE5MjA3ODM1ZTFiN2RkMmZhM2QyZTFmYmRjNTA4ZDFjZjZiY2RmMjZmZDQ4YzlkMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 5655, "upvote_ratio": 0.87, "comment_count": 548, "over_18": false}, "65": {"id": "16hqych", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Twig_Scampi", "link_flair_text": "Image 📷", "time": 1695092232.4298263, "created_utc": 1694621027.0, "url": "https://i.redd.it/jqe6v1a9q1ob1.jpg", "title": "Debunked Mummy from 2 Years Ago vs. Current", "selftext": "", "media": null, "score": 15043, "upvote_ratio": 0.87, "comment_count": 2822, "over_18": false}, "66": {"id": "16i53b6", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Smurphilicious", "link_flair_text": null, "time": 1695092233.3754284, "created_utc": 1694654915.0, "url": "https://www.reddit.com/r/UAP/comments/16i53b6/ryan_graves_on_twitter_unfortunately_yesterdays/", "title": "Ryan Graves on Twitter: \"Unfortunately, yesterday’s demonstration was a huge step backwards for this issue... I will continue to raise awareness of UAP as an urgent matter of aerospace safety, national security, and science, but I am deeply disappointed by this unsubstantiated stunt.\"", "selftext": "Here's Ryan's tweet\nhttps://twitter.com/uncertainvector/status/1702023350803959988\nand once again, here's the video I made regarding disinformation tactics so you understand the context of what I'm about to say next\nhttps://youtu.be/RAXGxiMufoc?si=iCdsTnYA8V-GcMNM\nNow think back to when Grusch, Graves, and Fravor testified, and /r/news perma-banned everyone who submitted the news articles. Remember how reddit coordinated to keep those posts confined only to subreddits like /r/UFOs and /r/aliens.\nSo when you see posts about \"mexican aliens\" hitting the front page on several subs like /r/pics and /r/Damnthatsinteresting , you should expect a very public rug pull. \nIf these \"mummified aliens\" presented a genuine threat to the disinformation campaign, it wouldn't have been given several spotlights. That's just \"lining up the shot\". Then you just wait for users start to behaving the way you intended them to. You bait out the believers, use your bots to push the news and \"positive\" comments to the top...\n... and then you sweep the leg. Once you've lured out the ones who support disclosure, you pull the rug out to embarrass them. To quote John Lear again, \n\n\"Fear of ridicule is the foundation on which the cover up is placed.\"\n\nForget this mexico story, it's another distraction like whatever that airplane thing was a bit ago. Shake it off, ignore the coordinated cesspool that every thread and comment section has been turning into lately. Don't let yourselves become victims to all of this amateur behavioral psychology. We all need to keep focused on the thing that actually got \"them\" shook when it happened. \nFocus on Grusch, Graves, and Fravor.\nCall your reps. \nDemand that they support getting Grusch into a Sensitive compartmented information facility.\nStop wasting your time arguing with 'AIMS' type disinformation bots on reddit. Understand that Reddit's primary purpose is astroturfing. If you want disclosure, call your reps. Stay loud. Maintain public pressure.", "media": null, "score": 147, "upvote_ratio": 0.93, "comment_count": 17, "over_18": false}, "67": {"id": "16i33ij", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "TaraCalicosBike", "link_flair_text": "Murder", "time": 1695092233.8790467, "created_utc": 1694649490.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16i33ij/three_years_after_34_year_old_diana_ferris_was/", "title": "Three years after 34 year old Diana Ferris was present at the scene of a murder, she and her unborn child were also murdered- beaten and strangled to death in her Connecticut apartment in April of 1996. Who murdered Diana and her unborn child, and was it related to the murder of Thomas Myers?", "selftext": "Typically, I cover cases from Arizona, but for the next 43 write ups, I will be covering one case from each state in alphabetical order. Today will be case a from Connecticut.\nIn 1996, three years had passed since 34 year old resident Diana Ferris had the traumatizing experience of having been present at the scene of a murder, despite not see the killing actually unfold. Three years prior, in 1993, Diana was driving within the city of East Hartford, Connecticut, when she came across a man she did not know: 37 year old Thomas F. Myers. Myers needed a ride to the Dutch Point Housing Project, and Diana had agreed to bring him there for unknown reasons. While Diana had briefly left her car with Myers still sitting in it, when she returned to the blue Mercury Marquis, she found Myers slumped over the passenger side dashboard, bleeding from the chest and left side, the car idling. He had been stabbed to death. Diana was reluctant to speak to police, not eager to divulge anything she knew, and Thomas murder is still unsolved to this day. While there hasn’t been a resolution to the case, there is strong suspicion that the murder had to do with drugs. \nDiana, mother of three children and one on the way, had her own history of struggling drug addiction, particularly with the use of cocaine. In 1996, Diana was five and a half months pregnant, and living on her own- at the time, her live in boyfriend, forty one year old Harold Rice, was in jail for first degree robbery, a $50,000 bond set in place. Diana’s three children were living with their aunt in another state- her oldest child, her sixteen year old daughter, Meranda, spoke to her mother nearly every day on the phone. \nIn April of 1996, days had gone by where friends and family were unable to contact Diana Ferris, which was very much unlike her. She often called her children, and spoke to her friends by phone. Meranda was worried because every time she called her mother that week, she was getting an endless busy signal. Meranda had been set to visit her grandparents in South Carolina for a week long trip, and she wanted to hear her mother’s voice before she left. Unable to get through to Diana, Meranda boarded the plane to her grandparents, hoping they had an idea where her mother might be and could ease her worries when she got there. When she arrived in South Carolina, that is where she learned some devastating news: her mother and her unborn sibling were dead. \nOn April 11th, after several concerned phone calls to the apartment complex Diana lived at, a maintenance worker entered her 2nd floor home located at 447 Gaden Street. Diana was discovered lying sideways in her bed, a blood covered pillow lying on her face, a telephone cord wrapped around her neck. Her hands were bloody from attempting to defend herself, and it is believed that she had been dead for days before her discovery. Her five and a half month old fetus was pronounced stillborn at the scene. There was signs of a struggle at the crime scene: the phone had been ripped away from the wall, a wire ripped from the wall jack and lying in the daybed where Diana was discovered. \nAn autopsy concluded that Diana’s death was a homicide. Twenty seven years later, and police are still urging the public to come forward with any information they know. Police believe that neighbors had to have seen people coming and going from Diana’s apartment. They hope with the passage of time that these witnesses may now feel comfortable coming forward. The only lead they currently have is the statements from an unknown man: this man claims that two men he knows confessed to having killed Diana and her child in April of 1996. These men claimed that she was beaten before she was murdered, and that they had been looking for drugs that they knew to have been in the apartment. The man signed a witness statement claiming that these details are true, and police believe he may be on to something, as the details he provided are in line with what police know to be true about the crime scene. Some speculate that the same people involved in Myers murder may be the same individuals behind the murder of Diana. \nWhen Meranda, who is now an adult, thinks back to her mother, she thinks back to her mother’s most important goal: to get clean and sober for her children. Meranda said this about Diana to a local newspaper: \n\n”Her dream always was to get clean and sober, get a good job and get her kids back. If my mother was a pillar in the community– if she was a doctor, a teacher, a lawyer– I feel that maybe the police and community would have cared a little bit more.”\n\nMeranda had to learn the gruesome details of her mother’s death as she grew older, and with each year, her desire for justice grows stronger and stronger. She wants to see her mother’s killers be brought before a judge, and sentenced for that they have done to her- taking not only her mother from her, but her younger sibling too. She wants justice for Diana and she wants justice for her younger brothers as well, stating: \n\n”I think I deserve justice, I think my brothers deserve it and I think her grandchildren deserve it. I want my day in court to tell them what I think of them.\"\n\nLinks \nCT Insider\nUncovered\nFind A Grave", "media": null, "score": 555, "upvote_ratio": 0.97, "comment_count": 59, "over_18": false}, "68": {"id": "16ipbog", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "ricksrollinn", "link_flair_text": null, "time": 1695092234.2954674, "created_utc": 1694714607.0, "url": "https://slatereport.com/true-crime/the-tragic-case-of-a-child-who-killed-his-abusive-neo-nazi-father/", "title": "In 2011, 10-year-old Joseph Hall shot and killed his neo-Nazi father. Joseph said he was tired of his father hitting him and his stepmother. Despite his age, ten-year-old Joseph Hall was charged with the murder of his father.", "selftext": "", "media": null, "score": 3287, "upvote_ratio": 0.98, "comment_count": 226, "over_18": true}, "69": {"id": "16matur", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Alexurfavourite", "link_flair_text": null, "time": 1695092234.8533032, "created_utc": 1695079445.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/16matur/date_gone_wrong/", "title": "Date gone wrong", "selftext": "In june 2023, i was on a lot of dating apps and would meet people regularly to have sex. I was texting with someone and he invited me over. I took a uber to his place in the afternoon. The building was old and a bit creepy, i started feeling unsafe but my rational side took over and i went in. The front door was broken so i was able to go in. I texted him that i just got there and was waiting for him to show up. A few minutes later, I knocked to what I thought was his apartment. He texted me « apartment 9 » but he wasn’t there. I went back to the lobby and texted that I was leaving in the next few minutes since I didn’t get any reply. A man shows up in the lobby and I follow him to apartment 15.\nI said \n« That’s weird, why would you tell me you lived in apartment 9? »\n« No i live here, apartment 15 »\n« Yes I noticed. But you said apartment 9, why? »\nHe didn’t seem to understand my question, he looked intoxicated. \nApartment 15 was disgusting. Trash everywhere and it smelled like death. I knew i had to leave but i didn’t want to offend him. At this point, i’ve been in the apartment for a few minutes only.\n« blow me »\nAint no fkg way. I showed him our text messages.\n« Is this your phone number? » I asked.\n« No »\nI panick. I tell him that I have to leave. I unlock the door, opened it, step outside. I feel something in my back, he was burning me with his cigarette. He then tried to pull me inside, beat me up and stole my bag. I was on the floor of the hallway when he kicked me in the face then close the door. \nI ran outside and called the cops.\nTHE SAME NIGHT, he text me « ? » WHICH IS SO WEIRD WTF.\nMy jaw was fractured on both side, i lost a tooth and chipped another one.\nHe’s now in jail and we’re waiting for the court to know exactly how much time he will serve.", "media": null, "score": 15, "upvote_ratio": 0.86, "comment_count": 9, "over_18": true}, "70": {"id": "16kcqhr", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "im_a_scallywag", "link_flair_text": null, "time": 1695092234.9886904, "created_utc": 1694884439.0, "url": "https://paulschumann.substack.com/p/what-the-devil-told-the-doctor-ii", "title": "Vaughn Bateson’s Harrowing Account of Serving in Gallipoli During WWI", "selftext": "This is a link to my SubStack article transcribing Vaughn Bateson’s memoir, What the Devil Told the Doctor. But fear not, I’ll be posting all the sections you’d be interested by in the comments.", "media": null, "score": 3, "upvote_ratio": 0.81, "comment_count": 2, "over_18": false}, "71": {"id": "16j98lf", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Most_Piccolo_2859", "link_flair_text": null, "time": 1695092235.8743503, "created_utc": 1694772580.0, "url": "https://www.reddit.com/gallery/16j98lf", "title": "2020, Main, US. Walking through the cemetery the best selling book “Pet Cemetery” was based on.", "selftext": "Included a few photos I was taking that don’t include the ghost I caught on cam. I didn’t realize “she” was there until later that week when I was going through the pics I had taken.", "media": null, "score": 167, "upvote_ratio": 0.86, "comment_count": 36, "over_18": false}, "72": {"id": "16lkz6b", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Mcgwizz", "link_flair_text": "Glitch Pic", "time": 1695092236.1817546, "created_utc": 1695009015.0, "url": "https://i.redd.it/mdmvzzkivwob1.png", "title": "When your doppelganger shows up in the same outfit...", "selftext": "", "media": null, "score": 62, "upvote_ratio": 0.89, "comment_count": 3, "over_18": false}, "73": {"id": "16ma24o", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "kargethdownload", "link_flair_text": null, "time": 1695092236.9633105, "created_utc": 1695077531.0, "url": "https://www.reddit.com/gallery/16ma24o", "title": "the greatest bigfoot photos in my opinion", "selftext": "", "media": null, "score": 127, "upvote_ratio": 0.89, "comment_count": 75, "over_18": false}, "74": {"id": "16la5c0", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1695092237.5597403, "created_utc": 1694979947.0, "url": "https://i.redd.it/bfzozfcldvob1.jpg", "title": "Many people know about the U-28 sea monster, where an alleged giant reptilian was launched into the air after the sinking of a ship. But there are actually three other similar stories, one taking place on the UB-85, one on the U-108, and one on a yet-unidentified ship", "selftext": "", "media": null, "score": 113, "upvote_ratio": 0.99, "comment_count": 16, "over_18": false}, "75": {"id": "16itwat", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "kur0mi18", "link_flair_text": "Unsolved", "time": 1695092237.7184463, "created_utc": 1694725495.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/16itwat/what_did_i_see/", "title": "What did I see?", "selftext": "This happened in London in 2000 or 2001. I was 6 at the time and I was at a park with my mother, her friend, and her friend’s daughter who was around my age. It was the middle of the day. This other little girl and I were playing at the edge of the grass near some hedges, and we saw what we thought was a ghost in the hedge. He looked like an old man but he seemed to be totally grey, his clothes, hair, stubble, and skin. He whistled at us to get our attention and then just smiled at us and made strange clicking sounds like clicks you would make to a horse. He didn’t speak. We were spooked and ran away back to our mothers, squealing that we’d seen a ghost. They had thought we were looking at squirrels. It bothers me to this day not knowing if this was really something supernatural or just a creepy guy in the shadows.", "media": null, "score": 61, "upvote_ratio": 0.9, "comment_count": 12, "over_18": false}, "76": {"id": "16l78le", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "_karoux_", "link_flair_text": null, "time": 1695092238.6355891, "created_utc": 1694973072.0, "url": "https://i.redd.it/crdxpdjoymob1.jpg", "title": "Yucca Men 🏜️✨", "selftext": "", "media": null, "score": 90, "upvote_ratio": 0.97, "comment_count": 4, "over_18": false}, "77": {"id": "16jhqgp", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Orangutan", "link_flair_text": null, "time": 1695092239.9424577, "created_utc": 1694794743.0, "url": "https://i.redd.it/pd8qr83qvdob1.jpg", "title": "Greta getting arrested in Malmo.", "selftext": "", "media": null, "score": 1756, "upvote_ratio": 0.82, "comment_count": 666, "over_18": false}, "78": {"id": "16m3mno", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1695092240.2917097, "created_utc": 1695062672.0, "url": "https://youtube.com/live/k43jW4vCDMI?feature=share", "title": "This is twice that the UFO hearing in Mexico lied to us about Aliens", "selftext": "", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "79": {"id": "16ha47j", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Manglerr", "link_flair_text": null, "time": 1695092241.9110987, "created_utc": 1694570092.0, "url": "https://www.reddit.com/r/ufo/comments/16ha47j/mexican_uap_hearing_shown_alien_bodies/", "title": "Mexican UAP hearing ( shown alien bodies", "selftext": "How is this not blowing up throughout all the subreddits. \nhttps://www.youtube.com/live/7kVl-bKVVlE?si=8ictgMkC5eqD5N4C\n3 hour mark shows the mummified bodies followed by X-rays and MRIs\nLink to the post with the DNA results of the mummified bodies \nhttps://www.reddit.com/r/aliens/comments/16h9ays/can_someone_post_the_ncbi_research_papers_for_the/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1", "media": null, "score": 336, "upvote_ratio": 0.85, "comment_count": 257, "over_18": false}, "80": {"id": "16haw9v", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "What-Is-The-Internet", "link_flair_text": "Video", "time": 1695092243.166433, "created_utc": 1694572267.0, "url": "https://youtu.be/bMGatrWkG2c?si=gCiRTuPywcpUWb4V", "title": "This “Debunked” video from a Russian crash looks eerily similar to what the Mexican Gov’t just showed.", "selftext": "Similar body structure, head and facial constructions", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "UFO Video of dead alien found in snow in Russia - UFO crash?", "type": "video", "thumbnail_width": 480, "height": 200, "width": 267, "html": "<iframe width=\"267\" height=\"200\" src=\"https://www.youtube.com/embed/bMGatrWkG2c?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"UFO Video of dead alien found in snow in Russia - UFO crash?\"></iframe>", "author_name": "Michael Cohen", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/bMGatrWkG2c/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@Allnewsweb"}}, "score": 4254, "upvote_ratio": 0.9, "comment_count": 1066, "over_18": false}, "81": {"id": "16h8eaw", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "im2much4u2handlex", "link_flair_text": "Evidence :upvote:", "time": 1695092245.099977, "created_utc": 1694565496.0, "url": "https://i.redd.it/210vrxj85xnb1.jpg", "title": "Aliens revealed at UAP Mexico Hearing", "selftext": "Holy shit! These mummafied Aliens are finally shown!", "media": null, "score": 14835, "upvote_ratio": 0.74, "comment_count": 4415, "over_18": false}, "82": {"id": "16ixx3c", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "SargeRedVsBlue", "link_flair_text": null, "time": 1695092245.638231, "created_utc": 1694735494.0, "url": "https://v.redd.it/2s755nkwmaob1", "title": "The obstruction of FOIA by NASA regarding the Fragology files (Kecksburg). They had to be sued to comply, and even after that, they lied. Anyone who says NASA is not involved in a coverup, should do his or her homework.", "selftext": "", "media": null, "score": 146, "upvote_ratio": 0.94, "comment_count": 29, "over_18": false}, "83": {"id": "16km3zg", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "2000outsider", "link_flair_text": "Murder", "time": 1695092246.0945377, "created_utc": 1694908633.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16km3zg/who_killed_rachel_runyan_in_late_august_1982/", "title": "Who killed Rachel Runyan in late August 1982?", "selftext": "Rachel Runyan was a three-year-old girl living in Sunset, Utah, who got abducted from a playground and murdered by an unknown individual, on August 26, 1982.\nOn August 26, 1982, Rachel's mother, Elaine Runyan was making Sloppy Joe's for lunch for Rachel and her two brothers. 5 year old Justin & 3 year old Rachel were outside playing with a 10 year old boy, at a park that was 15 feet from the family's backyard fence. As they were playing, a man approached them. He was described as an African American man, between the ages of 25 & 30, he was 6 feet tall with a medium build, and he had a mustache. He talked to the children for about 15 minutes, and then he asked them if they would like to go for some bubble gum and ice cream. Rachel agreed and she started to walk away with the man.\nWhen her brother realized that a stranger was leading her away, he yelled for her to come back. She turned to walk back, and that's when the man grabbed her, and ran to a blur car with wood paneling. The 2 boys ran to the Runyan's house, screaming that someone had grabbed Rachel. The police responded as quickly as they could for 1982, but by the time they got to the park, Rachel and her kidnapper were gone. Sadly, her naked body, with her hands tied behind her back, was found 24 days later, less than 20 miles away from where she was kidnapped.\nThe murder shocked the small city of Sunset, but no one was arrested in the aftermath of the brutal crime. And then strange things started to happen. First, on 2 separate occasions, Rachel's father found a black rose at her gravesite. Next about 2 & a half years after Rachel was kidnapped, the police were called to a 24-hour laundromat. On a stall door in the washroom, in marker, someone wrote **\"Beware. I'm still at large. I killed the little Runyan girl! Remember Beware!\" **Then below the message, there was an inverted cross, and then there was three 6's, one at the head of the cross, and the other two at the arms of the cross.\nThe police aren't sure if the killer left the roses, or wrote the message, but a psychologist who worked on the case said it was possible. Some people believe that the black roses, and the inverted cross, surrounded by \"6 6 6\", indicated that the murder was occult in nature. The police have had about 100 suspects in the murder, but they have yet to charge anyone. In the years since her daughter's death. Rachel's mother has been an advocate for kidnapped and missing children. In August 2016, the park where Rachel was kidnapped, was renamed the \"Rachel Runyan Memorial Park\".\nSources: https://www.deseret.com/2012/2/27/20499133/does-arrest-offer-new-lead-in-30-year-old-rachael-runyan-case#in-this-august-26-2007-file-photo-maureen-benson-davis-county-sheriff-lieutenant-and-kelly-kent-salt-lake-city-sgt-listen-during-a-news-conference-regarding-rachael-runyan-who-was-abducted-and-murdered-in-1982-to-the-right-is-a-drawing-of-racheal-runyan\nhttps://www.abc4.com/news/the-justice-files-rachel-runyon-murder-now-investigated-by-ags-cold-case-unit/", "media": null, "score": 540, "upvote_ratio": 0.97, "comment_count": 153, "over_18": false}, "84": {"id": "16gm9k7", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "schkopp", "link_flair_text": null, "time": 1695092246.4842951, "created_utc": 1694509371.0, "url": "https://www.reddit.com/r/MorbidReality/comments/16gm9k7/the_911_story_of_a_woman_who_was_just_a_head_but/", "title": "The 9/11 story of a woman who was just a head but alive", "selftext": "Edit: found it! It’s an account from Ernest Armstead the EMT. As I thought my memory did exaggerate the story, she was more than a head and an arm but still a crazy read. Full account on 911archive sub.\nI was wondering if anyone can direct me to the story where there was a paramedic who had to triage bodies under the WTC, then he came across a woman who was just a head and an arm but she was alive. I first heard of it on Reddit but believe it has been published on another website. Sorry if this is a rubbish explanation, it’s all I can remember and have tried searching", "media": null, "score": 3184, "upvote_ratio": 0.97, "comment_count": 428, "over_18": true}, "85": {"id": "16k8l1x", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Skeptically-Positive", "link_flair_text": null, "time": 1695092248.4307137, "created_utc": 1694873633.0, "url": "https://www.reddit.com/r/Ghosts/comments/16k8l1x/are_youtube_hoaxers_ruining_credibility_of_the/", "title": "Are Youtube hoaxers ruining credibility of the paranormal", "selftext": "There are far too many clearly fake channels out there, taking advantage of the gullible nature of people, to monetise.\nI know people may say well it is harmless.  No it is not. \nA/ they are passing it off as genuine which is a scam\nB/ they are preying on peoples sympathy  take for example  https://www.youtube.com/c/ReallyHaunted\nwho makes videos moaning about how demons are taking over his home, and all the comments are from people wishing him sympathy and wanting to donate to his cause.\nNot to mention the `omg dude what was that`  BS from these young gen z fakers like twin paranormal with the fake voices.\nYoutube is one of the worst places for ghost investigations in my opinion", "media": null, "score": 131, "upvote_ratio": 0.88, "comment_count": 111, "over_18": false}, "86": {"id": "16hxdk9", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Lucky_Lucky_Baldie", "link_flair_text": "Glitch Vid", "time": 1695092248.773479, "created_utc": 1694635764.0, "url": "https://v.redd.it/1tcagyowx2ob1", "title": "Can someone explain this? Feels like someone forgot to code the lightnings correctly. Took my eyes off it for a literal second, turned around and it was gone. Simply poof! 💨", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/1tcagyowx2ob1/DASH_1080.mp4?source=fallback", "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/1tcagyowx2ob1/DASH_96.mp4", "dash_url": "https://v.redd.it/1tcagyowx2ob1/DASHPlaylist.mpd?a=1697684248%2CN2E4YjA2NWIwYzFiMWIxMjJjNTlkNzAyMDNkOTJiNTE4Zjc5ZjE4YjYwNDA3Y2M4ZDc5MzYwNTAyY2QzODQ3Yw%3D%3D&v=1&f=sd", "duration": 44, "hls_url": "https://v.redd.it/1tcagyowx2ob1/HLSPlaylist.m3u8?a=1697684248%2CNjBjMGUxYmQ2ODQxMDE4YjE5ZTBlM2IxMmNiMWEwMGQwNWY3YWJiMTQxNTNkYjQ0MjA1Njc2Yjk4Y2YxNWE2Nw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 49, "upvote_ratio": 0.82, "comment_count": 17, "over_18": false}, "87": {"id": "16h9d9m", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Laddy2003", "link_flair_text": "TV show", "time": 1695092249.4407957, "created_utc": 1694568042.0, "url": "https://v.redd.it/jlbcrsabotnb1", "title": "THE SIX MILLION DOLLAR MAN Vs. BIGFOOT!", "selftext": "", "media": null, "score": 115, "upvote_ratio": 0.93, "comment_count": 37, "over_18": false}, "88": {"id": "16ls8uz", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1695092250.0055544, "created_utc": 1695034363.0, "url": "https://i.redd.it/ijuv05obvzob1.png", "title": "Weird observation I had about the Si-Te-Cah of Nevada, the Nittaewo of Sri Lanka, and the Ebu Gogo of Flores. Different cultures around the world have a shared story of a cannibalistic race of hairy hominids being forced into a cave and burned to death by humans.", "selftext": "", "media": null, "score": 115, "upvote_ratio": 0.92, "comment_count": 33, "over_18": false}, "89": {"id": "16hanop", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Fractal-Farter", "link_flair_text": "Personal", "time": 1695092250.1588206, "created_utc": 1694571599.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/16hanop/the_woods_speak/", "title": "The woods speak.", "selftext": "Back when I was much younger, single digit ages, I like in a duplex with a nice large yard that backed up to a set of woods. I used to like wandering said woods, and it was also a shortcut to our local armory. One day my friend and I decided to venture into the woods at night, we had some cheap flashlights for our only light followed by the moon. We ventured past the armory exit trail, deeper into the woods, now mind past this point thre weren't any houses. We continue to go deeper, not too sure what if anything we were looking for, out of boredom we decide to turn back and head home, as we turn we hear \" so soon?\" Slightly confused and intrigued, we answer back \"yes, why should we stay?\" After a short time we get silence. . . So we continue about our way back to our homes, the friend suddenly feels a tug on his pant leg, he looks down and sees a disturbing upper body of a child, he says it was from waist up and it was reaching up, tugging on his pant leg. I don't really buy it at the time, but a bit freaked out we then run back home. He tells me what he saw and demands the next day we go back and see if we can experience something else.\nNext day, later in the night, we head back to the woods, around the same spot we went the night prior, instead of impatience we decide to continue to wait. We begin to hear twigs snapping in the bot so far distance of the woods, sounds like something crawling toward us, a bit scared we turn to where the noise is coming from, flash our lights in the direction and now we both see the same thing, simply the upper body of a child around our ages. Stunned, we can't move and just watch this thing crawl closer to us, until we hear his mom yell our names, at the time we thought her voice shouting for us was scarier than what we saw, we were kids afraid of consequences, so we ran back home. Now, the best way to describe what we saw was an upper body, no legs or anything below the waist, scratched, tattered clothing, but the body looked fresh, no rot or decay it looked like a kid maybe between 6-8. To this day, we still have no idea what it was, and sadly the area we used to roam has been developed in townhouses and shit, so we may never know what it was. The year, not certain mid 90s, so 95 or 96 late summer. Location was Alliance, Ohio.", "media": null, "score": 30, "upvote_ratio": 0.96, "comment_count": 8, "over_18": false}, "90": {"id": "16lvyea", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "patmarek", "link_flair_text": null, "time": 1695092251.125905, "created_utc": 1695044599.0, "url": "https://i.redd.it/0vwh0umup0pb1.jpg", "title": "Mothman spotted over Riot Fest", "selftext": "Here’s a 8x8ft mural I did at last weekend’s Riot Fest in Chicago.", "media": null, "score": 81, "upvote_ratio": 0.98, "comment_count": 5, "over_18": false}}}