{"_default": {"1": {"id": "1fux8h2", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Only_Reading_2075", "link_flair_text": "Announcement", "time": 1728097160.9341295, "created_utc": 1727921293.0, "url": "https://youtube.com/watch?v=8bSbmn9ghQc", "title": "In the new documentary \"The Discovery,\" filmmakers reveal that by projecting a diffracted laser onto a surface and ingesting DMT, one can see the code running through reality -- Guys I feel like these could be the markings that appear on the side of UFOs (including the Roswell craft). ", "permalink": "/r/ufo/comments/1fux8h2/in_the_new_documentary_the_discovery_filmmakers/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Discovery", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/8bSbmn9ghQc?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"The Discovery\"></iframe>", "author_name": "Dan Go Thoughts", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/8bSbmn9ghQc/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@dangothoughts"}}, "score": 460, "upvote_ratio": 0.79, "comment_count": 449, "over_18": false}, "2": {"id": "1fsin51", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Frugal_Ferengi", "link_flair_text": "Sighting", "time": 1728097162.260112, "created_utc": 1727655062.0, "url": "https://www.reddit.com/r/UFOs/comments/1fsin51/longtime_astrophotographer_wife_and_i_finally_saw/", "title": "Longtime Astrophotographer, Wife and I Finally Saw One", "permalink": "/r/UFOs/comments/1fsin51/longtime_astrophotographer_wife_and_i_finally_saw/", "selftext": "I debated posting this, because I don't have a picture, but I figured with my astro background, maybe this can simply be another data point in the bucket, or maybe more importantly help others with camera setups (I'll mention this at the end). Here's what my wife and I saw last night 9/28/2024 at 8:15PM Mountain Time, clear sky, in the Black Hills of SD.\nI'm an astrophotographer, so I'm well-versed in what a typical night sky looks like in terms of high and low earth satellites, Starlink, northern lights, rocket launches, and military craft (we have a major Air Force base in Rapid City). I’m familiar with these because they often interfere with my astro shots, and I’m outside enough to notice them. The night sky between here and Wyoming is usually clear and stunning. That being said, what my wife and I both saw last night made our jaws drop. There is simply no man-made explanation for what we witnessed.\nMy wife and I were stargazing in our backyard around 8:15 PM Mountain Time when I personally noticed something odd: an orb with a gray haze surrounding it shot across the sky in about 6 seconds. It looked incredibly strange, and I mentioned it to my wife, who missed it. I tried to convince myself that maybe I was just seeing things, but then, as I pointed out the area I saw it in, a massive right-angle-shaped craft appeared from the northwest and crossed the sky to the east in about 10 seconds. It wasn’t V-shaped per se, but rather a perfect right angle.\nTo my eyes, the craft seemed to be in the upper atmosphere or low orbit, and it had to be the size of multiple football fields. There were a few planes in the sky, and this was way higher than those, but not as high as Starlink satellites, at least from what I could tell. What made it even stranger was the clearly visible under-lights, which were white and structured. Surrounding the lights was almost a grayish-white hazy aura, giving it an ethereal appearance. The whole craft, for lack of a better term, looked almost like a ghost ship with that eerie aura. When it passed above us, you could see both the lights and the structure. It moved silently, like a stingray gliding through the sky, smooth and quick and did not change directions. We only had about 10 seconds to observe it, just enough to grasp what we were looking at. Even if we had our astro gear set up, it wouldn’t have been a good enough shot to capture it because it moved too quickly and would have been blurry.\nBased on my experience, satellites can take up to 2-5 minutes to cross the sky, but this took only 10 seconds and had a visible structure. It had to be moving at an incredible speed, way faster than any military aircraft in our area and faster than any satellite. I would estimate it was about 3 times slower than a typical shooting star.\nMy wife and I both confirmed what we saw. To avoid influencing each other’s perspective, we went inside and drew what we saw without sharing until we were done. We depicted the same craft. Later, we made a Photoshop image of it, which I’ll attach here below.\nBased on my research, a typical Low Earth Orbit (LEO) satellite travels at about 7.8 km/s (approximately 17,500 mph) and takes around 5 minutes (300 seconds) to cross the sky, covering a distance of roughly 2,340 km. In contrast, the object I observed covered a similar distance in just 10 seconds, meaning it was moving at an incredible speed of about 234 km/s, or 523,440 mph. To put this into perspective, the fastest known spy plane, the Lockheed SR-71 Blackbird, publicly has a top speed of over 2,200 mph. This means the object I saw was moving at speeds approximately 238 times faster than our fastest aircraft.\nPersonally I feel like the only way you could capture what we saw would have been with some type of combination of night vision goggles and a high-speed camera, and be extremely lucky to be pointing at the right part of the sky for that brief moment. There's absolutely no way a cell phone camera could capture this, not even my Sony A7 III astro setup either. This is because it would require a long exposure shot, and with that speed, it would of just been a smear.\nOur minds are blown, it's kinda hard to go back to normal work after seeing this.\nI used photoshop to try to show what we saw.\nMy wife's picture recall on the left, mine on the right (I'm a bad artist).\nOff topic just some astro pictures up here lately", "media": null, "score": 3012, "upvote_ratio": 0.93, "comment_count": 411, "over_18": false}, "3": {"id": "1fs41a2", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "JuliaJune96", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1728097164.3047402, "created_utc": 1727615528.0, "url": "https://i.redd.it/7f0v6jayzqrd1.jpeg", "title": "When humans finally learn telepathy ", "permalink": "/r/aliens/comments/1fs41a2/when_humans_finally_learn_telepathy/", "selftext": "", "media": null, "score": 2571, "upvote_ratio": 0.98, "comment_count": 91, "over_18": false}, "4": {"id": "1ft823n", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Vaiken_Vox", "link_flair_text": null, "time": 1728097164.5654385, "created_utc": 1727733981.0, "url": "https://v.redd.it/enrr37ucwyrd1", "title": "The Program (Trailer) Directed by James Fox", "permalink": "/r/UAP/comments/1ft823n/the_program_trailer_directed_by_james_fox/", "selftext": "", "media": null, "score": 102, "upvote_ratio": 0.97, "comment_count": 7, "over_18": false}, "5": {"id": "1fuhm86", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "AshleyMyers44", "link_flair_text": null, "time": 1728097165.9473798, "created_utc": 1727879568.0, "url": "https://i.imgur.com/mKmrNcD.jpeg", "title": "Was pop star Sia trying to send a coded message about Beyonce and P Diddy?", "permalink": "/r/conspiracy/comments/1fuhm86/was_pop_star_sia_trying_to_send_a_coded_message/", "selftext": "", "media": null, "score": 8847, "upvote_ratio": 0.93, "comment_count": 818, "over_18": false}, "6": {"id": "1frvkhh", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnthonyofBoston", "link_flair_text": null, "time": 1728097166.1087785, "created_utc": 1727581188.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1frvkhh/a_look_at_the_paramilitary_rank_and_file_of_mars/", "title": "A look at the paramilitary rank and file of Mars 360", "permalink": "/r/conspiracyfact/comments/1frvkhh/a_look_at_the_paramilitary_rank_and_file_of_mars/", "selftext": "A look at the paramilitary rank and file of Mars 360 https://www.academia.edu/114910170/The_Mars_360_Paramilitary_rank_and_file", "media": null, "score": 2, "upvote_ratio": 0.75, "comment_count": 0, "over_18": false}, "7": {"id": "1frc6x9", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "glittertitzmcgee", "link_flair_text": "merchandise", "time": 1728097166.8817723, "created_utc": 1727522846.0, "url": "https://www.reddit.com/gallery/1frc6x9", "title": "Love my new bag!! ", "permalink": "/r/bigfoot/comments/1frc6x9/love_my_new_bag/", "selftext": "", "media": null, "score": 756, "upvote_ratio": 0.98, "comment_count": 22, "over_18": false}, "8": {"id": "1fsjf2r", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "B_Wing_83", "link_flair_text": null, "time": 1728097167.7093492, "created_utc": 1727657481.0, "url": "https://i.redd.it/mchwaa7pgurd1.jpeg", "title": "I love how the internet agreed that this is how the Bloop looks in everyone's head canon. ", "permalink": "/r/Cryptozoology/comments/1fsjf2r/i_love_how_the_internet_agreed_that_this_is_how/", "selftext": "", "media": null, "score": 494, "upvote_ratio": 0.92, "comment_count": 67, "over_18": false}, "9": {"id": "1fsh6dc", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "emilos260", "link_flair_text": "Just plain weird", "time": 1728097167.9449246, "created_utc": 1727650663.0, "url": "https://i.redd.it/slkq9dhdttrd1.jpeg", "title": "Bizarre encounter with a \"Neanderthal on a stick\" in Belarus, 2012 (full story in the comments)", "permalink": "/r/Humanoidencounters/comments/1fsh6dc/bizarre_encounter_with_a_neanderthal_on_a_stick/", "selftext": "", "media": null, "score": 613, "upvote_ratio": 0.98, "comment_count": 69, "over_18": false}, "10": {"id": "1fvimf8", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "ArtNiles", "link_flair_text": null, "time": 1728097168.5102744, "created_utc": 1727990446.0, "url": "https://i.redd.it/279o13voylsd1.jpeg", "title": "Mothman Taxidermy I made for my Etsy! ", "permalink": "/r/cryptids/comments/1fvimf8/mothman_taxidermy_i_made_for_my_etsy/", "selftext": "", "media": null, "score": 375, "upvote_ratio": 0.99, "comment_count": 35, "over_18": false}, "11": {"id": "1fslekd", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "frog-pond-soup", "link_flair_text": "Discussion/Advice", "time": 1728097168.6761208, "created_utc": 1727663809.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1fslekd/what_did_she_see/", "title": "What did she see?", "permalink": "/r/Thetruthishere/comments/1fslekd/what_did_she_see/", "selftext": "Last year my mom called me panicked about what she just saw when driving home. To this day nobody has an answer and I'm curious if anybody has an idea. \nShe was driving on the highway, between two small towns where most the drive consists of farmland and patches of wooded area. What she described was a skinny dog-like creature standing on its hind legs. However, that's not what makes it wierd. It's legs were bending backwards. When it noticed the car she watched it grab the deer carcass on the road and drag it off the side of the road and into the wooded area. \nI've tried finding similar stories but the closest thing I found was the dogman in Michigan. However it didn't have backwards hind legs, and we live in Missouri; so that hypothesis went out the door. Anybody have ideas or similar experiences?", "media": null, "score": 54, "upvote_ratio": 0.97, "comment_count": 15, "over_18": false}, "12": {"id": "1fvkwg9", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Alba_Michele23", "link_flair_text": null, "time": 1728097168.8477798, "created_utc": 1727996704.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1fvkwg9/someone_impersonated_my_sister_and_invited_me_to/", "title": "Someone impersonated my sister and invited me to the shadiest part of Los Angeles.", "permalink": "/r/LetsNotMeet/comments/1fvkwg9/someone_impersonated_my_sister_and_invited_me_to/", "selftext": "Last year, I started law school in Los Angeles.\nI have never lived in a big city before and I was really excited to be in a massive city with over four million people.\nEver since I was little, I always knew I had a half-sister in LA, but my parents had this weird anger toward her that always made it feel like a taboo topic. Of course I had looked her up on social media and I knew what she looked like, but that was about all. We had never actually met. She was never that active on social media so there wasn't a lot I could see.\nOut of nowhere one day in my first year of law school, I got a friend request on Facebook from my sister. Her profile seemed legitimate, she had Facebook friends, and her profile picture looked like her.\nShe sent me a message inviting me to a little dinner party at the park with her friends. We could finally meet each other for the first time. I was new to LA (still am) and I had no idea which parts of the city to avoid at night.\nI was so excited about that idea, but I had a lot of anxiety about it too. It would be nice if we met, totally clicked, and became besties for life. But what if we ended up sobbing like we were in some dramatic movie scene? What if I tried to talk with her, and she just didn't click with me, and she started showing me an attitude? Or worse—what if it's all going well until we have some kind of disagreement, someone said something hurtful, and then we were both crying in front of everyone?\nHonestly, if she had suggested a cozy little bakery for desserts instead, I would have gone. But going to a park with other people didn't feel right. I thought it was like such a precious moment that I didn’t want to have in front of all these other people.\nI couldn’t bring myself to go. I didn’t want to risk having a meltdown in front of other people. I was worried about how messy it could get.\nA few weeks later, I googled that park just to see what it was like. Maybe we could meet up there together, just one on one. That's when I learned something was wrong.\nI won't say the name of the park, but anyone who has lived in LA for long will tell you that it's NOT a safe place for girls to be having a dinner party at night. The area surrounding that park has very high violent crime rates. It's controlled by gangs. Even people who do illegal business in that park are forced to pay a \"tax\" to the gang in exchange for being left alone.\nSo now I was really concerned and curious.\nI actually tried to get ahold of my sister myself. She was an undergrad at the time, a local college. I had a friend who went to her school. I asked my friend to reach out to her on campus and ask her if she'd be ok with meeting us. They connected and the three of us met at my friend's house.\nIt was great. We got along so well. My friend was also very happy to do that for us. The three of us had so much fun. We weren't bursting in tears but we let out a few. We had dinner, we watched a movie, and we spent the night at my friend's house.\nWhen I told my sister about that whole thing, she said she hadn’t used Facebook since high school—so clearly someone was impersonating her. I would have told her to report the fake account but it had already been deleted.\nShe knew she had been impersonated on social media though. Another one of her friends had been scammed by someone pretending to be her. It was some scheme involving fake concert tickets or something like that.\nSomeone had been impersonating my sister; they knew I was in town, and they literally tried to lure me into one of the most dangerous parts of LA at night. I have no idea what their motives were. I don't know if I even want to find out.\nMeeting my sister after all these years was a beautiful thing but the whole backdrop was terrifying.", "media": null, "score": 280, "upvote_ratio": 0.99, "comment_count": 9, "over_18": true}, "13": {"id": "1fv9rbu", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "AtmanDharma", "link_flair_text": null, "time": 1728097169.2396724, "created_utc": 1727967516.0, "url": "https://i.redd.it/t35ce96l2ksd1.jpeg", "title": "Former model and Miss Switzerland finalist Kristina Joksimovic 'pureed' in blender by husband", "permalink": "/r/truecreepy/comments/1fv9rbu/former_model_and_miss_switzerland_finalist/", "selftext": "", "media": null, "score": 299, "upvote_ratio": 0.96, "comment_count": 38, "over_18": false}, "14": {"id": "1fsg7ip", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "elegant_mango__", "link_flair_text": null, "time": 1728097169.3636794, "created_utc": 1727647899.0, "url": "https://www.reddit.com/r/threekings/comments/1fsg7ip/i_need_help_from_someone_with_experience_urgent/", "title": "I need help from someone with experience (URGENT)", "permalink": "/r/threekings/comments/1fsg7ip/i_need_help_from_someone_with_experience_urgent/", "selftext": "I have a friend who's REALLY obsessed with a boy who's not only straight, but in a relationship with a very nice girl, me and my other friends tell him all the time to stop with this and move on, but he won't listen, but the reason I'm asking in this subreddit is simple, my friend is doing those little rituals to make the boy fall in love with him (I think it's called sympathy or smth).\nI'm not sure of what he did specifically, but it involves writing names on papers, blood and re-doing it a few times, I don't really believe in these things, but I'm still worried they might do something neither to him, the boy or his gf.\nIs there anything I can do to protect the boy and his gf? I tried searching it, but I don't really trust Google and it only shows rituals to protect your family. \nPlease answer fast, I'm afraid karma does something bad to my friend, he already has problems with depression and anxiety and I'm afraid he might do something he regrets", "media": null, "score": 12, "upvote_ratio": 0.93, "comment_count": 3, "over_18": false}, "15": {"id": "1ftqcha", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Character_Banana4157", "link_flair_text": "ISO (In Search Of)", "time": 1728097169.8550162, "created_utc": 1727795171.0, "url": "https://www.reddit.com/r/Ghosts/comments/1ftqcha/whats_the_best_ghost_documentary_available/", "title": "What’s the best Ghost documentary available?", "permalink": "/r/Ghosts/comments/1ftqcha/whats_the_best_ghost_documentary_available/", "selftext": "I am constantly searching for good ghost / haunting / paranormal documentaries.\nI’m only after ones that are serious and nothing where people run about with “spirit boxes” shouting at ghosts!\nThe type of thing I am looking for, and my best example so far is “ghosts of the underground”.\nAnyone have any good suggestions?", "media": null, "score": 210, "upvote_ratio": 0.95, "comment_count": 191, "over_18": false}, "16": {"id": "1ftzp3s", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Historical-Cookie-77", "link_flair_text": "NSFW B/C UNDERWEAR - NO NUDITY", "time": 1728097170.02053, "created_utc": 1727818245.0, "url": "https://i.redd.it/ccgiuteqq7sd1.jpeg", "title": "My Underwear is messed up??", "permalink": "/r/GlitchInTheMatrix/comments/1ftzp3s/my_underwear_is_messed_up/", "selftext": "", "media": null, "score": 1215, "upvote_ratio": 0.91, "comment_count": 153, "over_18": true}, "17": {"id": "1fsklkg", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Throwaway-Ender", "link_flair_text": null, "time": 1728097171.0473628, "created_utc": 1727661248.0, "url": "https://i.redd.it/7zbqr39wrurd1.jpeg", "title": "Saw this in the sky tonight above Telluride CO ", "permalink": "/r/ufo/comments/1fsklkg/saw_this_in_the_sky_tonight_above_telluride_co/", "selftext": "Anyone know what’s going on here? About 6:30pm. ", "media": null, "score": 181, "upvote_ratio": 0.89, "comment_count": 55, "over_18": false}, "18": {"id": "1fv4s9n", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "Video", "time": 1728097172.2958863, "created_utc": 1727952408.0, "url": "https://v.redd.it/um3jr3tzsisd1", "title": "For the first time ever, the exact Roswell UFO crash site has been revealed on the \"Unresolved Mysteries\" series on Netflix. An \"egg shaped craft about the size of a Volkswagen Beetle\" was found crashed 27 miles from where the metallic debris was found. \"Alien bodies\" were also recovered.", "permalink": "/r/UFOs/comments/1fv4s9n/for_the_first_time_ever_the_exact_roswell_ufo/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/um3jr3tzsisd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/um3jr3tzsisd1/DASH_96.mp4", "dash_url": "https://v.redd.it/um3jr3tzsisd1/DASHPlaylist.mpd?a=1730689171%2CNzZlOTY5ZmQ5NGM5NDc0M2M3NzU3ZTc5YTFiMGFjZTZjZTI5MTQ5MmIwMGEyNGM5NmJkODFhOGUxNDU1YmYxMg%3D%3D&v=1&f=sd", "duration": 85, "hls_url": "https://v.redd.it/um3jr3tzsisd1/HLSPlaylist.m3u8?a=1730689171%2CNmNhYThlZmEwMzI2NDkxMWNmNGJjNzJjZDQ4NWIyMGRkZGEzNjczY2UzN2MwOTE2ZDlhOWZlNmIzYTJkM2QyMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2930, "upvote_ratio": 0.93, "comment_count": 286, "over_18": false}, "19": {"id": "1fu4g0f", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "pokezillaking", "link_flair_text": "Video", "time": 1728097173.6569722, "created_utc": 1727831620.0, "url": "https://v.redd.it/nerxgztzt8sd1", "title": "What is the scariest aspect of the UAP phenomena?", "permalink": "/r/aliens/comments/1fu4g0f/what_is_the_scariest_aspect_of_the_uap_phenomena/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/nerxgztzt8sd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 822, "width": 1920, "scrubber_media_url": "https://v.redd.it/nerxgztzt8sd1/DASH_96.mp4", "dash_url": "https://v.redd.it/nerxgztzt8sd1/DASHPlaylist.mpd?a=1730689172%2CY2U0MjEwMWVmMWJmYzY4YTA4YWUwM2ZhYTQzODZjMDI3NTk4OWYyMzg4Yjc5Y2VkNWJkNGMzMGQ0NmUzNzhkNw%3D%3D&v=1&f=sd", "duration": 121, "hls_url": "https://v.redd.it/nerxgztzt8sd1/HLSPlaylist.m3u8?a=1730689172%2CN2ViODQzMThkODU5YzhiZDg0M2Q1ZTgxZjI1NDRmMjhmZWEwOGRjN2NmYjgyZWIxMDA4ZWRjMzBlODdhYjc4Nw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1435, "upvote_ratio": 0.95, "comment_count": 351, "over_18": false}, "20": {"id": "1fs3um6", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "HemlocknLoad", "link_flair_text": null, "time": 1728097173.9614596, "created_utc": 1727614953.0, "url": "https://youtu.be/bVhSPH2A5Vw", "title": "Jesse Michels interviews James C. Fox - \"The Most Important UFO Investigator On The Planet\"", "permalink": "/r/UAP/comments/1fs3um6/jesse_michels_interviews_james_c_fox_the_most/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Most Important UFO Investigator On The Planet", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/bVhSPH2A5Vw?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"The Most Important UFO Investigator On The Planet\"></iframe>", "author_name": "Jesse Michels", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/bVhSPH2A5Vw/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@JesseMichels"}}, "score": 75, "upvote_ratio": 0.91, "comment_count": 10, "over_18": false}, "21": {"id": "1ftzh0c", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Alex4944", "link_flair_text": null, "time": 1728097175.121089, "created_utc": 1727817656.0, "url": "https://i.redd.it/srjctd2zo7sd1.jpeg", "title": "a Reddit classic", "permalink": "/r/conspiracy/comments/1ftzh0c/a_reddit_classic/", "selftext": "", "media": null, "score": 7288, "upvote_ratio": 0.97, "comment_count": 233, "over_18": false}, "22": {"id": "1frfvta", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Vib_ration", "link_flair_text": null, "time": 1728097175.2886071, "created_utc": 1727534809.0, "url": "https://youtu.be/eUKDNB06iJ0?si=hwdFNn-0sMy_Ojnv", "title": "What if you could feel natural euphoria on demand would you want to know how", "permalink": "/r/conspiracyfact/comments/1frfvta/what_if_you_could_feel_natural_euphoria_on_demand/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "What If you could Feel Natural Euphoria On-Demand?", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/eUKDNB06iJ0?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"What If you could Feel Natural Euphoria On-Demand?\"></iframe>", "author_name": "SpiritualChi", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/eUKDNB06iJ0/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@SpiritualChills"}}, "score": 1, "upvote_ratio": 0.57, "comment_count": 0, "over_18": false}, "23": {"id": "1ftxtup", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Nathannyil", "link_flair_text": "art", "time": 1728097175.9513915, "created_utc": 1727813536.0, "url": "https://i.redd.it/5skl4xzpc7sd1.jpeg", "title": "Bigfoot drawing I just finished ", "permalink": "/r/bigfoot/comments/1ftxtup/bigfoot_drawing_i_just_finished/", "selftext": "", "media": null, "score": 461, "upvote_ratio": 0.97, "comment_count": 36, "over_18": false}, "24": {"id": "1fra4ma", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1728097177.0970151, "created_utc": 1727513677.0, "url": "https://i.redd.it/wty6ktx2lird1.png", "title": "This story deserves a lot more attention", "permalink": "/r/Cryptozoology/comments/1fra4ma/this_story_deserves_a_lot_more_attention/", "selftext": "", "media": null, "score": 424, "upvote_ratio": 0.98, "comment_count": 28, "over_18": false}, "25": {"id": "1fs9mmh", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "KOPHER_", "link_flair_text": "U.F.O. Humanoid", "time": 1728097177.3167615, "created_utc": 1727630661.0, "url": "https://www.reddit.com/gallery/1fs9mmh", "title": "Strange humanoids with astronaut suits reported in Tortoreto,Teramo in Abruzzi at the end of August in Italy,1978.", "permalink": "/r/Humanoidencounters/comments/1fs9mmh/strange_humanoids_with_astronaut_suits_reported/", "selftext": "After a sighting that occurred in Chieti, Abruzzi on August 28 of the same year, Italian UFO sources indicate that in Tortoreto, Abruzzo, Italy, at the end of August 1978, at 1:00 p.m., four young women from Sant'Egidio were returning home by car. While two were sleeping in the back seat, the two in the front saw something very unusual, which they realized was a globe-shaped object (a luminous white sphere) that descended rapidly onto a hill or plain that was near an abandoned colonial house.\nThey stopped the vehicle on the side of the road because they realized that the phenomenon was strange. They quickly woke up the other two women, went out and quickly looked for what they saw, as the four approached, they saw an almost blinding glow, it was a white light that changed to red and then to green, it revolved around the UFO and illuminated the surroundings. Between the flashes, they managed to observe a human silhouette near the sphere - or inside the sphere in a later version.\nTwo others appeared, although the witnesses did not see where they came out, these characters described them as \"dressed in space suits, a diving suit with a visor and equipment similar to that of astronauts, with short boots and apparent gloves, all white.\"\nThe three beings were the same size as the witnesses (1.80 to 1.90). They moved with small steps or jumps near the sphere, holding their arms slightly away from their bust, they seemed interested in the ground and acted independently of each other and in a distant manner. For almost an hour, the UFO illuminated the hill even more, and a precise source emitted a rotating light that changed from white to red and then to green (like emergency lights) in which the object subsequently took off emitting a bright flash, leaving \"apparently\" the three occupants on the ground, lost from sight.\nThis case was reported 18 years later, in 1996.", "media": null, "score": 69, "upvote_ratio": 0.97, "comment_count": 6, "over_18": false}, "26": {"id": "1fuf8lz", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": null, "time": 1728097177.763479, "created_utc": 1727872928.0, "url": "https://i.redd.it/q5uomvl99csd1.png", "title": "For Halloween, Here's a list of Cryptids That Have Killed ", "permalink": "/r/cryptids/comments/1fuf8lz/for_halloween_heres_a_list_of_cryptids_that_have/", "selftext": "", "media": null, "score": 310, "upvote_ratio": 0.98, "comment_count": 62, "over_18": false}, "27": {"id": "1fvi0uo", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Nightshadepastry", "link_flair_text": null, "time": 1728097177.91812, "created_utc": 1727988885.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1fvi0uo/did_i_hear_someone_screaming_for_help/", "title": "Did I hear someone screaming for help?", "permalink": "/r/Thetruthishere/comments/1fvi0uo/did_i_hear_someone_screaming_for_help/", "selftext": "After having lived in a small, single floor condo for a few years I began to hear sounds, usually in the early mornings that would often wake me up. I would hear knocking (often at the door of my room) thumps, bangs, slamming doors, loud crashes and even a young man's voice coming from somewhere else in the house. Not every day, but several times a week I would wake up to one or more of these.\nIn the early days I would usually come out of my room and ask my family wth is going on, who was knocking at my door, banging stuff around. I was really alarmed by the loud crashes and sometimes a voice coming from the other end of the house. No one else heard any of it, they had no idea what I was talking about. This place was 900sqft with three people living there. Many times I would come out and there would be no one there, nothing disturbed. The voice sounded like a young man a few years older than my son at the time (who was around 10), so I would often go to him and ask him what's up. It wasn't him, he was asleep or quiet in his room and heard nothing.\nThis became so frequent that I eventually stopped investigating the commotion. I'm sure you've all heard of hypnopompic hallucinations, I just accepted it and learned to live with the noise. I would often lie in bed and ask myself \"What are the chances I'm hearing something real? Probably low\" Then I'd just ignore it.\nOver a couple of years the noises escalated in frequency and \"volume\". It was definitely affecting my sleep as it happened almost every day at least once or twice. Then the screaming started. I was asleep, early morning, and suddenly it felt like someone stood next to the bed, put their mouth directly next to my ear and screamed at the top of their lungs. I jolted awake and took out my earplug. There was no one there, I was so scared and confused. My ear was ringing and painful! It was a male voice, maybe teen aged; a long drawn out word, it sounded like \"HELP\". This happened a few more times and it's when I started to take it a bit more seriously.\nI was really shaken by the sound of utter desperation and pain in that voice. It broke my heart to think \"what if there is a real person (ghost) screaming for help?\" I decided to do a little experiment. I operated under the assumption that this person was real and was asking for my help (for science). Over a couple of days I prayed earnestly for him. I prayed to angels, spirit guides, helpers; anyone who might be listening. I asked that he be helped, protected, guided home where he belongs etc. Immediately, everything stopped. Not one more knock or bump that I had become so accustomed to. I lived in that house for several more years and the noises never came back after that. It makes me wonder, if it was indeed a real ghost, why was I the only one to hear the sounds? And what the hell was he doing to make all that racket??", "media": null, "score": 29, "upvote_ratio": 0.97, "comment_count": 6, "over_18": false}, "28": {"id": "1ftg7by", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Lighton876", "link_flair_text": null, "time": 1728097178.1105475, "created_utc": 1727758704.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ftg7by/weird_saleswoman_me_and_my_older_brother_met_in/", "title": "Weird saleswoman me and my older brother met in 1995", "permalink": "/r/LetsNotMeet/comments/1ftg7by/weird_saleswoman_me_and_my_older_brother_met_in/", "selftext": "This story takes place when I was around 9 or 10 years old. There used to be this record store in walking distance from our house that me and my older brother used to go to often to buy our favorite music. (We were both into hip hop, jazz, and reggae) and we were basically regular customers at that point.\nOne day while me and my brother were walking down there, we spotted this woman who was walking towards us. When she caught up to us she started following us and asking us questions about our favorite magazines. Since me and my brother weren't into magazines and knew about stranger danger we basically kept replying with \"I dont know.\" Eventually she pulls out this bag that she was carrying with her and pulls out some adult magazines and tries to sell them to us. (Can't remember the price.) Me and my brother were both clearly minors so her trying to sell explicit magazines to us was weirded out my brother. I was young so I didn't understand it at the time.\nAt this point she starts getting sort of aggressive and insists that we buy her dumb magazines. When my brother grabs my arm so we can keep walking she decides to grab me buy the shirt and hold on to me so I dont go anywhere. I scream as loud as I could and that made her let go. Once she let go me and my brother ran all the way home. We didn't tell our parents in fear that we might not be able to go back ever again if we did so.  We went back to that same record store for a couple more years but we never saw that woman again. For the better of course.", "media": null, "score": 147, "upvote_ratio": 0.98, "comment_count": 7, "over_18": true}, "29": {"id": "1fs6pha", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "littlequeef99", "link_flair_text": null, "time": 1728097178.248007, "created_utc": 1727623032.0, "url": "https://i.redd.it/gp7x7xk9mrrd1.jpeg", "title": "A 1993 photograph of an cougar was captured in Maine, even though Eastern cougars have been believed extinct since the 1940s. Many accuse wildlife services of refusing to acknowledge their existence", "permalink": "/r/truecreepy/comments/1fs6pha/a_1993_photograph_of_an_cougar_was_captured_in/", "selftext": "", "media": null, "score": 236, "upvote_ratio": 0.98, "comment_count": 6, "over_18": false}, "30": {"id": "1fweyt7", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "ZestyCheezClouds", "link_flair_text": null, "time": 1728097178.359553, "created_utc": 1728090790.0, "url": "https://www.reddit.com/r/threekings/comments/1fweyt7/recent_invocation/", "title": "Recent Invocation", "permalink": "/r/threekings/comments/1fweyt7/recent_invocation/", "selftext": "Hey, it's my first time in this group and posting here. I just finished a ritual attempting to invoke Lucifer for some guidance, assistance with connection and motivation. Mid-ritual, I got a brief vision of being handed a white feather. I'm hoping someone might be able to tell me if there's anything meaning behind this?\nThanks in advance", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 3, "over_18": false}, "31": {"id": "1fvet7p", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Technical-Echidna-57", "link_flair_text": "Caught on Camera 🎥 ", "time": 1728097178.8371794, "created_utc": 1727980631.0, "url": "https://v.redd.it/9qe1ky8l5lsd1", "title": "Anyone know what this is? Backyard camera caught it", "permalink": "/r/Ghosts/comments/1fvet7p/anyone_know_what_this_is_backyard_camera_caught_it/", "selftext": "This is from my backyard camera last night. Heard some strange noises outside and my camera motion sensor went off. Thought it was an animal but this is what the camera got.", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/9qe1ky8l5lsd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/9qe1ky8l5lsd1/DASH_96.mp4", "dash_url": "https://v.redd.it/9qe1ky8l5lsd1/DASHPlaylist.mpd?a=1730689178%2CMjdhZDZkY2M0ZDQzNDViMTkyNDI4MjFmYWYzYzRmNTY0NDYxMThmNWI4Y2JhNDhhNTc4NzZlNGFiZTM3MTA1NA%3D%3D&v=1&f=sd", "duration": 12, "hls_url": "https://v.redd.it/9qe1ky8l5lsd1/HLSPlaylist.m3u8?a=1730689178%2CODJiNmIyZjU2MDUyYzM4ZTY4NWJhYmQwMzEyNTY5MTAyYTEzMjViN2VmZTVlZmUxYzg5YmM5Y2ZjMjIzZGFlZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 204, "upvote_ratio": 0.84, "comment_count": 73, "over_18": false}, "32": {"id": "1fryzrx", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Prince100001", "link_flair_text": "Glitch Pic", "time": 1728097179.018714, "created_utc": 1727595081.0, "url": "https://i.redd.it/nr9r9x1wzlrd1.jpeg", "title": "Two girls named Laura Buxton meet after a balloon travels 225 km, with unbelievable coincidences between them.", "permalink": "/r/GlitchInTheMatrix/comments/1fryzrx/two_girls_named_laura_buxton_meet_after_a_balloon/", "selftext": "", "media": null, "score": 348, "upvote_ratio": 0.96, "comment_count": 13, "over_18": false}, "33": {"id": "1fs7g0w", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "DamnyG4", "link_flair_text": null, "time": 1728097180.018462, "created_utc": 1727624985.0, "url": "https://i.redd.it/vuomwbo2srrd1.jpeg", "title": "I saw a UFO in my Uber ", "permalink": "/r/ufo/comments/1fs7g0w/i_saw_a_ufo_in_my_uber/", "selftext": "So this was in 2019, I worked in downtown NYC I just got out of work and was going to meet some friends in Brooklyn, I got out at 10 and didn’t wanna be too late so I called an Uber from my job to their location in Brooklyn. \nIn my Uber while on the Manhattan Bridge I was looking out of my window and I noticed that glowing triangle, the photo I attached is a screenshot from a video.\nWhen I rewatched the video I took I was upset because it didn’t do it any justice at all, this thing was much larger and brighter in person, It was literally just a floating glowing triangle that stood silent above the bridge. As a native NYer we see planes all the time from LaGuardia and JFK this was much larger than any commercial plane I’ve ever seen and it wasn’t moving at all, like I said previously it was just a bright triangle in the sky.\nUnfortunately my Uber drove past it, but it was NY, 2019 in the Summertime if any one else has any experiences around that time.", "media": null, "score": 174, "upvote_ratio": 0.9, "comment_count": 42, "over_18": false}, "34": {"id": "1fusykj", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "AtomicCypher", "link_flair_text": "Rule 6: Bad title", "time": 1728097181.655714, "created_utc": 1727908338.0, "url": "https://v.redd.it/0l5d8ckf6fsd1", "title": "Al Jazeera news coverage inadvertently broadcasts what looks like a TRIANGULAR SHAPED OBJECT shooting down rockets over northern Israel.", "permalink": "/r/UFOs/comments/1fusykj/al_jazeera_news_coverage_inadvertently_broadcasts/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/0l5d8ckf6fsd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/0l5d8ckf6fsd1/DASH_96.mp4", "dash_url": "https://v.redd.it/0l5d8ckf6fsd1/DASHPlaylist.mpd?a=1730689180%2CYTczYWQ5YTk2NmZlOGE1M2FjNmIwNmM4OGZlNGQ0MTdlODhmOWY1YzI1MWUxMTY3ZDI4MjM5MjVkMzA4NmMyMw%3D%3D&v=1&f=sd", "duration": 15, "hls_url": "https://v.redd.it/0l5d8ckf6fsd1/HLSPlaylist.m3u8?a=1730689180%2CMWQ5NTQ1NmU1ZjU1NGZjZGU1YThkZGZhMzY1YmQ5NTM5MDQ0NzAxYWIyOTM5M2E3NzYzOTEwMGI5ODJjNWMzZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2886, "upvote_ratio": 0.7, "comment_count": 842, "over_18": false}, "35": {"id": "1fvmbsb", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Open-Storage8938", "link_flair_text": "Video", "time": 1728097183.6869678, "created_utc": 1728000878.0, "url": "https://v.redd.it/cx7y52sdtmsd1", "title": "A disk-shaped, silver UFO appeared in Kumburgaz, Turkey. in 2007, 2008, and 2009.", "permalink": "/r/aliens/comments/1fvmbsb/a_diskshaped_silver_ufo_appeared_in_kumburgaz/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/cx7y52sdtmsd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 768, "scrubber_media_url": "https://v.redd.it/cx7y52sdtmsd1/DASH_96.mp4", "dash_url": "https://v.redd.it/cx7y52sdtmsd1/DASHPlaylist.mpd?a=1730689182%2CYmIxNjg1NDIzYmY3NmU2ZGVmZTliOWU0ZTBlMWU0YTJlODM5OTBiYWUwYjgxZTExNjE1MjAzZjA2MzU4ODY2ZA%3D%3D&v=1&f=sd", "duration": 26, "hls_url": "https://v.redd.it/cx7y52sdtmsd1/HLSPlaylist.m3u8?a=1730689182%2CZjFiZjIwYTJmYzY5N2UwYWM2ZTE1MmU2YzI3NjZmMjQyZTUwOGUxODBmMDVhNTljMTRmMTIyYjUwNWM1YjFmZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1343, "upvote_ratio": 0.94, "comment_count": 147, "over_18": false}, "36": {"id": "1fw3jlq", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": null, "time": 1728097184.0148246, "created_utc": 1728059788.0, "url": "https://v.redd.it/x5o889junrsd1", "title": "The U.S. Government is in Possession of Non-Human Craft", "permalink": "/r/UAP/comments/1fw3jlq/the_us_government_is_in_possession_of_nonhuman/", "selftext": "", "media": null, "score": 69, "upvote_ratio": 0.86, "comment_count": 8, "over_18": false}, "37": {"id": "1fv7xj7", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "MemberBenefits", "link_flair_text": null, "time": 1728097185.0442076, "created_utc": 1727962589.0, "url": "https://i.redd.it/3agipaeunjsd1.jpeg", "title": "So far this year....", "permalink": "/r/conspiracy/comments/1fv7xj7/so_far_this_year/", "selftext": "", "media": null, "score": 6436, "upvote_ratio": 0.79, "comment_count": 1126, "over_18": false}, "38": {"id": "1frkz5x", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1728097185.194245, "created_utc": 1727548667.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1frkz5x/three_videos_were_filmed_from_a_plane_and_from_a/", "title": "Three videos were filmed from a plane, and from a high altitude. Clear video footage of a UFO.", "permalink": "/r/conspiracyfact/comments/1frkz5x/three_videos_were_filmed_from_a_plane_and_from_a/", "selftext": "Interesting UFO video scenes from different places, watch them and tell me what you think.\nThis is one of the closest and clearest UFO footage, from the skies over the Philippines.\nhttps://www.youtube.com/watch?v=MS-Ok1uajgM\nClear video footage of a UFO, rotating around itself and quickly passing next to the plane.\nhttps://www.youtube.com/watch?v=fQSAcnIrC-o\nClear video footage of a UFO, exciting scenes with clear object details.\nhttps://www.youtube.com/watch?v=ikxMys9qkew", "media": null, "score": 0, "upvote_ratio": 0.46, "comment_count": 0, "over_18": false}, "39": {"id": "1fug36m", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Pruedrive", "link_flair_text": "art", "time": 1728097185.874146, "created_utc": 1727875396.0, "url": "https://i.redd.it/pgxo55ingcsd1.jpeg", "title": "Bought this cheeky drawing I found on vacation, yet no frame could do it justice, so I made my own. ", "permalink": "/r/bigfoot/comments/1fug36m/bought_this_cheeky_drawing_i_found_on_vacation/", "selftext": "", "media": null, "score": 333, "upvote_ratio": 0.95, "comment_count": 38, "over_18": false}, "40": {"id": "1fv1qjg", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "isst_arsch", "link_flair_text": "Question", "time": 1728097186.6619043, "created_utc": 1727938121.0, "url": "https://i.redd.it/gjw5j781nhsd1.png", "title": "This photo has been on the internet for forever, but I've never been able to find the origin of this photo. Does anyone here know the origin? ", "permalink": "/r/Cryptozoology/comments/1fv1qjg/this_photo_has_been_on_the_internet_for_forever/", "selftext": "", "media": null, "score": 332, "upvote_ratio": 0.91, "comment_count": 104, "over_18": false}, "41": {"id": "1ft4xj9", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "EternalReverie1", "link_flair_text": "Possible Mis-Identification", "time": 1728097186.8758168, "created_utc": 1727726217.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1ft4xj9/wolf_thing/", "title": "Wolf thing", "permalink": "/r/Humanoidencounters/comments/1ft4xj9/wolf_thing/", "selftext": "This happened a long time ago I was around 13-14 in north wester ga on the corner of alabama and tn (context I am now 22) I was at my stepdads house which is situated down a long driveway in the woods. there is a house just ahead of his separated by a thin veil of trees but no other houses or buildings for a good few miles on either side and the woods in the back go on for a good while so it's very isolated I had taken my dock jack out to pee (rip jack he died a while back) and as I walked down the stairs of the deck with him he stops and starts to growl whimper towards the woodline along the right side of the house I thought maybe there was a coyote or somthing so I walked towards the wood line to get a better view to see what he was freaked out by and I see somthing just barley in sight it stood a good 6- 7 feet tall and had patches of fur like mange a short snout very canine looking but kind of human like face staring at me I backed up grabbed jack ran up the stairs and locked the front door behind me I never saw it after that and it didn't make any moves other than when it was looking at me but it spooked me so bad I refused to go out side or even anywhere within the house by myself to the point I was too scared to even leave my room to use the bathroom (yes I had a few accidents I know gross embarrassing but I was a kid and freaked tf out) \nNow that I'm older I've started to wonder maybe I just imagined it or maybe it was missidentifyed but who knows 🤷‍♂️\nEdit :I am now able to go outside and stuff now I even avidly hike and work for the state parks service now lol so don't worry about that but even now I don't like to be at my stepdads house as it gives me the creeps and always feels like somthing watching me", "media": null, "score": 46, "upvote_ratio": 0.94, "comment_count": 12, "over_18": false}, "42": {"id": "1ft8i29", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "ThiccccRevolution", "link_flair_text": null, "time": 1728097187.3787649, "created_utc": 1727735152.0, "url": "https://i.redd.it/lqytpdknv0sd1.jpeg", "title": "Oh my, little Mothman!", "permalink": "/r/cryptids/comments/1ft8i29/oh_my_little_mothman/", "selftext": "My husband and I are going through IVF right now and came up with our baby room theme - cryptids! I found the illustrated image on Pinterest. Sorry for not knowing the artist, but credit goes to their great design!", "media": null, "score": 294, "upvote_ratio": 0.98, "comment_count": 19, "over_18": false}, "43": {"id": "1ftwypu", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Thin-Passenger-8125", "link_flair_text": null, "time": 1728097187.535232, "created_utc": 1727811428.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1ftwypu/forest_ghosts/", "title": "Forest Ghosts", "permalink": "/r/Thetruthishere/comments/1ftwypu/forest_ghosts/", "selftext": "Went camping this passed weekend in the forest and welp things got weird. \nSo around 10pm night one I hear some ruffling around my tent. Some teenagers I gathered were trying to have some fun bothering me. Then I hear a gruff adult male voice say \"argh, what? I was laying in the grass\" I get out my tent with a weapon and see nothing. Some kid says from the shadows of the woods \"are you a ghost too?\" Typical typical. So I start pretending I'm talking to someone they can't see \"I was wondering why they didn't respond to you, you're probably a ghost Mr (insert whatever)\" All got quiet. I went back into the tent.\nAfter a sec I see a light on my tent, then my vape lights up on its own pointed at the tent wall. Important to not here is that if someone was watching the tent they would have seen where my cell phone light was, meaning they would know it wasn't me. \nAbout 15 mins later someone says \"whatever that ghost was!\" And I had no further issues.\nWas my fake ghost friend a real friendly spirit? We're the bullies actual people or ghosts scared off by the friendly spirit? Or did the vape lighting up just legitimize my fake ghost friend and scare them off...if so tho why would it randomly malfunction?\nWeird situation. Probably not camping there ever again.", "media": null, "score": 28, "upvote_ratio": 0.94, "comment_count": 9, "over_18": false}, "44": {"id": "1fsx17s", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "whamthankuham", "link_flair_text": "NO NARRATIONS", "time": 1728097187.6762428, "created_utc": 1727706899.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1fsx17s/truck_that_followed_me_on_the_freeway/", "title": "Truck that followed me on the freeway", "permalink": "/r/LetsNotMeet/comments/1fsx17s/truck_that_followed_me_on_the_freeway/", "selftext": "10 years ago my ex and I were at the drive ins on a Tuesday night, I only had Wednesdays off at the time and it was perfect because Tuesday was $5 movie night. We watched Gone Girl and the movie ended close to midnight so it was late as we were leaving. \nI was the one driving so we left the theaters and I hopped on the freeway to get home. As I got on the freeway I was in the right lane and stuck behind a semi so I put on my blinker to pass them on the left, it was late and I didn’t see a car in sight besides the semi so I got over to pass them. Not even a minute later a white truck was behind me flashing his brights and getting really close to my rear bumper so my first thought is “crap, did I accidentally cut them off?” Didn’t seem likely as I checked my mirrors and didn’t see anyone behind me on the freeway at all. I got up past the semi and moved over to the right again thinking well if I’d been a dick and cut this dude off he can flip me off and be on his way. But no. \nAs soon as there was enough of a gap he filled the tiny space between me and the semi and was on my bumper again. My ex had fallen asleep and I didn’t want to wake him yet as this could be just some guy pissed off and maybe I made a mistake and didn’t see him. Granted there were three whole empty lanes to the left of us he could have passed me  miles ago. He’s still flashing his brights and tailing me so I get over hoping he’ll just have established his dominance and moved on. He follows me in every lane I change to. I stop using my blinker when changing lanes and he still just swerves to be right behind me. At this point I am scared he’s going to hit my bumper and I pump it up to 90 and he follows  suit. I’m shaking and finally nudge my ex with my elbow and say “babe I think we’re being followed.” He wakes up and looks behind us and I change lanes and he sees what I mean. My exit to get home isn’t for another few miles and I’m trying to get my ex to call the police because I know at this point this guy isn’t letting up. He doesn’t call he’s just watching. \nI finally get a hold of my nerves and realize there’s an exit to another freeway coming up. I’m in the lane second from right and as soon as I see the exit I swerve as fast as I can to get on the freeway exit barely missing the concrete pillar to the bridge above it. I only look over to the truck for a second but I can see him looking straight at us. \nI’m sobbing at this point and my ex just looks at me and I know he saw him looking at us too. I pull off the first exit and find the first well lit gas station I can because I am in no shape to drive anymore. My ex lets me sob for a bit and we switch so he can finish the drive home. Once we get home and I’m a little calmer we start talking about it and I explain what happened while he was asleep and we get to the point where we’re talking about pulling off and him looking at us and how fucking freaky that was. He kind of looks at me confused and then is just quiet and he goes “babe, he had a gun pointed at us.” I have no fucking idea what this guy had in mind for us that night, the drive ins were uneventful and we hadn’t pissed anyone off or even talked to anyone so I don’t think he followed us from there. Whoever you are giant white truck guy, let’s not ever meet. ", "media": null, "score": 137, "upvote_ratio": 0.99, "comment_count": 8, "over_18": true}, "45": {"id": "1ftl4zn", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "happypants69", "link_flair_text": null, "time": 1728097187.7948039, "created_utc": 1727779793.0, "url": "https://v.redd.it/nvupo5xck4sd1", "title": "During Queen Elizabeth's funeral procession, a female voice cut into the news feed & was heard saying: \"The death is irreversible and the fact that she is trapped...\" before it was cut off. ", "permalink": "/r/truecreepy/comments/1ftl4zn/during_queen_elizabeths_funeral_procession_a/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/nvupo5xck4sd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1272, "scrubber_media_url": "https://v.redd.it/nvupo5xck4sd1/DASH_96.mp4", "dash_url": "https://v.redd.it/nvupo5xck4sd1/DASHPlaylist.mpd?a=1730689187%2CM2Y4NjkwN2Y1YTBhMDJiZTFlODRiMDY3YTVkYjY4YzhmNmIyYjZlMTRjM2E3ZDUwZDQyNWJlZTg3ZmRkOGE0MQ%3D%3D&v=1&f=sd", "duration": 20, "hls_url": "https://v.redd.it/nvupo5xck4sd1/HLSPlaylist.m3u8?a=1730689187%2CYjFjNTM5YzNiZmQ1ODJiMTFlOWIwNGJlMzMzODZkN2Q4MGEzYTEyYjIyMmZmMDdkMzA1MzFhY2JlNDQ0Mjk0NQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 211, "upvote_ratio": 0.97, "comment_count": 10, "over_18": false}, "46": {"id": "1fuuq6q", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Appropriate-Coat-573", "link_flair_text": "Captured Apparition ", "time": 1728097188.3038056, "created_utc": 1727913606.0, "url": "https://www.reddit.com/gallery/1fuuq6q", "title": "Picture of a face taken in Tombstone August 2024", "permalink": "/r/Ghosts/comments/1fuuq6q/picture_of_a_face_taken_in_tombstone_august_2024/", "selftext": "My picture from the Bird Cage Theater in Tombstone, Az.\nHello all, this is my first time posting in here. I’ve been doing paranormal research destinations for over twenty years and I’ve had one other picture featured on a few TV shows. \nI took this photo in August of this year at the Bird Cage theater in Tombstone, Az. while on vacation be of their ghost tours. Side note, if you’ve never been out to Tombstone or Bisbee, I highly recommend you add those spots on your places to visit. \nPicture was taken with an iPhone 14 Pro Max. I had my flash off and had my exposure set to max to get in good night shots. The photo was taken when someone else was using flash photography which is why everything has a grey tint. I am just now posting the picture because I wanted to receive my copyright certificate before sharing it with the World.\nDuring the tour, there is a portion where you sit in the main hall area in the dark with your guide. There are various sensors placed around the room such as K2 meters, a rempod (in the picture), spirit box, and a doll with an integrated K2 meters.\nI took this picture right when the rempod started going off next to our guide. I took this as someone else was taking a picture using flash photography which made everything grayish, but you can still see the red light from the rempod lighting up the area. I have also added a picture of what the view looks like with the lights turned on so you can see that there is nothing in the framed picture which could be confused for the face. There were no other individuals in our group who looked like the man in the picture (I did take a video of everyone in the group out of habit, it helps to exclude). You can clearly make out facial features, a receding hairline, mouth features, and the ears. ", "media": null, "score": 162, "upvote_ratio": 0.66, "comment_count": 91, "over_18": false}, "47": {"id": "1fsuzj2", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "SpineSalad", "link_flair_text": "Glitch Pic", "time": 1728097188.508761, "created_utc": 1727701318.0, "url": "https://i.redd.it/mj0plds13yrd1.jpeg", "title": "Skybox isn't finished loading. ", "permalink": "/r/GlitchInTheMatrix/comments/1fsuzj2/skybox_isnt_finished_loading/", "selftext": "", "media": null, "score": 24, "upvote_ratio": 0.77, "comment_count": 1, "over_18": false}, "48": {"id": "1frtad8", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Smooth_Atmosphere_48", "link_flair_text": null, "time": 1728097189.6010144, "created_utc": 1727573330.0, "url": "https://www.reddit.com/gallery/1frtad8", "title": "UFO 9/27/24 Nebraska", "permalink": "/r/ufo/comments/1frtad8/ufo_92724_nebraska/", "selftext": "Looked like a random star but moved fast as I could see back and forth with one quick large flash. Pictures are standard zoom and zoomed into best of my availability.", "media": null, "score": 99, "upvote_ratio": 0.85, "comment_count": 43, "over_18": false}, "49": {"id": "1fs27j0", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "Video", "time": 1728097190.8637068, "created_utc": 1727609218.0, "url": "https://v.redd.it/abzuu17wgqrd1", "title": "Lue Elizondo is asked which UFO/ET movie is closest to the truth", "permalink": "/r/UFOs/comments/1fs27j0/lue_elizondo_is_asked_which_ufoet_movie_is/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/abzuu17wgqrd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/abzuu17wgqrd1/DASH_96.mp4", "dash_url": "https://v.redd.it/abzuu17wgqrd1/DASHPlaylist.mpd?a=1730689190%2CNzU4ODgzMDQyNDcyNTIwYWQ5ZTI1Y2ExODBjMTA0ZTgxZGQ4NzEyZDc2ZDI0YzBhYmE0OGVkYjFiM2UxMzEzYg%3D%3D&v=1&f=sd", "duration": 84, "hls_url": "https://v.redd.it/abzuu17wgqrd1/HLSPlaylist.m3u8?a=1730689190%2CMTNjNjNmODhkZWRkZTJlMmZhYzIyOWE1YTU5MGU0NTFiZDNmZjJiMTA3ZTM1ZGYwMGUwN2VlZTFlZjM1YmRiNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2303, "upvote_ratio": 0.89, "comment_count": 547, "over_18": false}, "50": {"id": "1fvw4x0", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Inner-Ferret7316", "link_flair_text": "Image 📷", "time": 1728097192.4058926, "created_utc": 1728038563.0, "url": "https://i.redd.it/hzjt4xnowpsd1.png", "title": "Collage of some of the best NHIs photos & depictions collected around the Internet. ", "permalink": "/r/aliens/comments/1fvw4x0/collage_of_some_of_the_best_nhis_photos/", "selftext": "", "media": null, "score": 1111, "upvote_ratio": 0.94, "comment_count": 314, "over_18": false}, "51": {"id": "1ftuw43", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "thhedk", "link_flair_text": null, "time": 1728097192.752872, "created_utc": 1727806382.0, "url": "https://youtu.be/SzAG1tzhcsY", "title": "The 1971 Costa Rica UFO visualized in 3D - Could this be how it looked ?", "permalink": "/r/UAP/comments/1ftuw43/the_1971_costa_rica_ufo_visualized_in_3d_could/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The 1971 Costa Rica UFO - Visualized in 3D", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/SzAG1tzhcsY?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"The 1971 Costa Rica UFO - Visualized in 3D\"></iframe>", "author_name": "ThomasH", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/SzAG1tzhcsY/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@thhedk"}}, "score": 44, "upvote_ratio": 0.87, "comment_count": 17, "over_18": false}, "52": {"id": "1fvjesc", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "External-Noise-4832", "link_flair_text": null, "time": 1728097193.8614454, "created_utc": 1727992544.0, "url": "https://i.redd.it/izpfmmi05msd1.jpeg", "title": "What the hell is going on?", "permalink": "/r/conspiracy/comments/1fvjesc/what_the_hell_is_going_on/", "selftext": "Homeland Security Secretary Alejandro Mayorkas set off outrage Wednesday when he told reporters that the Federal Emergency Management Agency (FEMA) “does not have the funds” to see Americans through the rest of this Atlantic hurricane season — after the agency spent more than $1.4 billion since the fall of 2022 to address the migrant crisis. - Source\nAlejandro Mayorkas claims those on the ground who reveal the administration \"is not doing enough to help\" the hurricane recovery are wrong. - Source\nAlejandro Mayorkas is an American attorney and government official who is the 7th United States Secretary of Homeland Security, serving since 2021.\nUntil 2020, he served on the board of HIAS — a radical left-wing group that is actively ferrying illegals into America.\nLast week ukraine received $8 Billion.\nLast week Israel Received $8.7 Billion.\nLast week Taiwan Received $567 Million. ", "media": null, "score": 4800, "upvote_ratio": 0.79, "comment_count": 1456, "over_18": false}, "53": {"id": "1funt69", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1728097194.05393, "created_utc": 1727894855.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1funt69/three_videos_from_brazil_cuba_and_italy_clear/", "title": "Three videos from Brazil, Cuba and Italy. Clear video footage of a UFO.", "permalink": "/r/conspiracyfact/comments/1funt69/three_videos_from_brazil_cuba_and_italy_clear/", "selftext": "Interesting UFO video scenes from different places, watch them and tell me what you think.\nThis scary UFO suddenly appears and disappears without a trace in the sky over Brazil.\nhttps://www.youtube.com/watch?v=KN-xbmak80c\nClear video footage of a UFO, with a strange design, rotating around itself, was filmed in Cuba.\nhttps://www.youtube.com/watch?v=1V2Z10ItoRY\nExciting video footage of a triangle-shaped UFO, filmed in Italy.\nhttps://www.youtube.com/watch?v=qvuuVnNUhZg", "media": null, "score": 0, "upvote_ratio": 0.36, "comment_count": 1, "over_18": false}, "54": {"id": "1fvbp7i", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Zealousideal-Fix9257", "link_flair_text": "tik tok ", "time": 1728097194.7321913, "created_utc": 1727972676.0, "url": "https://v.redd.it/38ugnfyuhksd1", "title": "Authentic?", "permalink": "/r/bigfoot/comments/1fvbp7i/authentic/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/38ugnfyuhksd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 590, "scrubber_media_url": "https://v.redd.it/38ugnfyuhksd1/DASH_96.mp4", "dash_url": "https://v.redd.it/38ugnfyuhksd1/DASHPlaylist.mpd?a=1730689194%2CMGNkNjQzZDVmZmE0OTVkOWFlYTMxYTYzZTkyZGVkZGMzZmQ4YjkxNzAzYzhkNGUzZWU5Mjk2YWVlMDY0N2JkNg%3D%3D&v=1&f=sd", "duration": 10, "hls_url": "https://v.redd.it/38ugnfyuhksd1/HLSPlaylist.m3u8?a=1730689194%2CMzRjYTU4NDZkYzllNDQ2ZTZjOGRiYmI5MjQ3NmQ4MGMxYzk4YzY4MTMwMDMyZTIyODBhODYxMmJmOTI5ZDJjZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 254, "upvote_ratio": 0.66, "comment_count": 393, "over_18": false}, "55": {"id": "1fuf6o3", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1728097195.4516673, "created_utc": 1727872756.0, "url": "https://i.redd.it/fkks3zur8csd1.png", "title": "For Halloween, Here's a list of Cryptids That Have Killed", "permalink": "/r/Cryptozoology/comments/1fuf6o3/for_halloween_heres_a_list_of_cryptids_that_have/", "selftext": "", "media": null, "score": 259, "upvote_ratio": 0.95, "comment_count": 57, "over_18": false}, "56": {"id": "1fuvin4", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "ThatGuyCollin", "link_flair_text": "Shadow Person", "time": 1728097195.6422923, "created_utc": 1727915985.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1fuvin4/my_childhood_shadow_girl/", "title": "My Childhood “Shadow Girl”", "permalink": "/r/Humanoidencounters/comments/1fuvin4/my_childhood_shadow_girl/", "selftext": "Hey everybody👋 i was randomly suggested this subreddit by a reddit notification and after reading a couple posts and realizing there was a popular shadow person tag here, i thought i’d share my own experience from when i was a child with the entity i’ve called the “shadow girl” for as long as i can remember.\nit should be said that i’m 19(M) now and all three of the events i’m about to describe happened when i was pretty young, from when i was around 6-8.\nwhen i was younger and my parents were still married, it was me, my one older brother, my two younger sisters and my parents obviously. my dad is in a very high post-secondary educational position which he got when we were young in Winnipeg, where i still live now. as he was in the process of getting this position, we lived half of the time in winnipeg as we looked for a place to live there and half the time in a house across the US border in Pembina.\nWe eventuallly got a house in Winnipeg, and we slowly moved into that house from the pembina house over some period of time, i don’t really remember how long, but that isn’t important.\nThe First Encounter:\ni was in the second grade when i saw her at our new(er) house. i had come home from school and very soon after, decided that i wanted to play minecraft on our family tablet, which was kept charging in my parents room on the second floor of our house. I ran up our curved staircase, and turned right immediately through the doorway of my parents room. as i entered and stood to face my parents bed, the tablet directly across the room from the foot of their bed, i saw her.\ni stood completely in shock. the pitch black silhouette of a young girl in a puffy dress was sitting on the foot of my parents bed, staring straight forward at the wall ahead of her. i didn’t know what to do, but i felt paralyzed. as i watched her, she ever so slowly turned her head to look at me with these saucer like white eyes. just an absence of black on her face where instead was white, those were her eyes. i slowly leaned out of my parents doorway after a couple seconds of eye contact and yelled downstairs.\n“Dad!…DAAAAAAD!!…”\nbut nothing back. and so as i peaked back into the room, she was gone. just gone. i was afraid and so i stepped carefully, but still retrieved the tablet and scurried downstairs as if something were nipping at my ankles.\nPembina is a small town now, it was even smaller when i was young. in our house (which we called “the little house” or “the pembina house,” there was a (very creepy) basement, a main floor, and a second floor. my brother and i shared a room on the second floor, as did my sisters, and my parents slept in a room on the main floor.\nThe second Encounter:\ni don’t remember the context for why i was going to my room or anything or how far apart this was from the first encounter, but i rounded a corner to enter the stairwell and, i remember distinctly, i was looking at my feet on the first two steps. i looked up the stairs and froze as i saw her at the top of the stairs, again just staring at me.\ni-…i don’t know what had gotten into me at this time, but i was annoyed enough at this thing for showing up that i went up the stairs at a full sprint to try and catch her. i watched her as her whole body just turned, without lifting her legs, and walked so slowly around the corner and up the stairs which led to the second floor just past the corner.\ni made it to the top and, surprise surprise, she was nowhere. i looked in every room upstairs, and nothing. disappeared again.\nThe Last Encounter: this happened at our pembina house. i was a very outdoorsy kid and loved catching bugs and collecting rocks and building forts and everything, it was awesome. in our backyard, i had caught a butterfly with a glass from our kitchen, and decided that the best place to store it was in my sisters closet. under a glass. with a single branch..\nmy logic was that it would (a) be safe, and (2) not be found and stolen by anyone since my sisters didn’t use their closet.\ni slid a paper under the glass to seal the butterfly in, and i remember that the paper had a drawing i had done of the iron robot from that animated kids movie of the same name. very crudely drawn, but i remember that fun detail.\nanyways,\nthe next day, i went back. up the stairs to the second floor, into my sisters closet, and, to my surprise, discovered a very dead butterfly. i was very sad and looked out my sisters window at that moment and immediately caught her gaze. she was standing, far out in our yard, very far, but she was looking up at me through the window. i put down the butterfly and slowly walked to the window, not breaking eye contact. after about a minute of her staring, she once again turned without moving her legs and almost floated off to the side, out of view behind a hedge.\nTo this day, i have no explanation further than her being a shadow person, and i was first introduced to that revelation in the sixth grade when i was reading a “haunted canada” book which had a story detailing a shadow person.\ni hope people don’t think im just making things up, as i tried to include every detail i could remember. To this day, im still scared she’s watching sometimes, but it’s just paranoia im sure, since i haven’t seen her since then.\nanyways, if people liked this, i actually have a LOT more ghost encounters that my whole family has experienced after my parents divorce, which i would be happy to share.\nhave a great day, and thank you for reading! (if you made it this far)", "media": null, "score": 30, "upvote_ratio": 0.96, "comment_count": 4, "over_18": false}, "57": {"id": "1frxi8e", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Yourclosetmonster", "link_flair_text": null, "time": 1728097196.049599, "created_utc": 1727588720.0, "url": "https://i.redd.it/41bf8t07sord1.png", "title": "MothMan-icure", "permalink": "/r/cryptids/comments/1frxi8e/mothmanicure/", "selftext": "", "media": null, "score": 233, "upvote_ratio": 0.96, "comment_count": 9, "over_18": false}, "58": {"id": "1fs6ufq", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "SmallReplacement8736", "link_flair_text": null, "time": 1728097196.1952949, "created_utc": 1727623403.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1fs6ufq/i_saw_a_ghost_the_pubbar_i_lived_in_was_haunted/", "title": "I Saw a Ghost. The Pub/Bar I Lived In Was Haunted.", "permalink": "/r/Thetruthishere/comments/1fs6ufq/i_saw_a_ghost_the_pubbar_i_lived_in_was_haunted/", "selftext": "It must of been around 2004-2006 I was a young boy roughly around 2-3 years old and my family lived in a pub (bar in NA?) and it was most defentially haunted. If you know how to change a beer barrel in a pub you'll know they can't be done by themselves/on the off chance. Well it did all the pipes would disconnect at night, the floor boards would creek at night, the windows/doors would open when they were locked. The till (cash register) would open by itself, the lights would come on, and one night I remember being in my own room, I remember it like yesterday, I was trying to sleep and I felt like something was watching me, that erie feeling, then 3 year old me saw this ghost, from what I remember of the ghost because for some reason the night I remember seeing the ghost, but I can't picture its features, anyway it looked like a \"young boy in old clothes\" as this is what I told my mother. I remember it telling me to stay in bed but I was like fuck that lmao and ran like a bitch outta there crying my eyes out into my mum and dads room, as I got older they would tell me they knew it was haunted apparently by a young victorian boy but they didn't really believe it until I said what I saw, my mum and dad are quite resiliant? and not fussed by the paranormal and things went on as normal becuase we lived where we would generat income. I dont know how long after this but the electrics tripped (was 04-06? we didn't have fuses then) and a fire broke out during the night and the firefighter said to my mother I was 2 minutes from dying so take it as you will. My personal belief is that paranomal activity does exsist. Me and my partner buy creepy dolls from charity/thrift shops all the time and they've moved and during the night all we hear is chairs screeching across the floor downstairs ect. We don't even have chairs downstairs lmao only a sofa.\nThat's my story kek.", "media": null, "score": 23, "upvote_ratio": 0.87, "comment_count": 5, "over_18": false}, "59": {"id": "1ft7gfi", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "RichGeci", "link_flair_text": null, "time": 1728097196.3698742, "created_utc": 1727732415.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ft7gfi/creepy_naked_guy_stole_my_pizza/", "title": "Creepy naked guy stole my pizza.", "permalink": "/r/LetsNotMeet/comments/1ft7gfi/creepy_naked_guy_stole_my_pizza/", "selftext": "This happened a few hours ago and I’m not scared anymore just angry my pizza got stolen.\nIn my town there’s a story that a guy has moved into the deep woods close to our town. I never believed it as I go for night drives occasionally and never saw him or anything resembling a man that lives in the woods. \nAnyway, tonight I decided to go for a drive and drove past a pizza place, being hungry I decided to get a pizza before I went home. In my head I had a plan to eat pizza and play some Minecraft as I’m in my 2 week Minecraft phase at the moment. \nI paid for my pizza and started walking to my car with the pizza in one hand and my phone in the other messaging my friend if he wants to play some Minecraft when I get home. I look up from my phone to cross the road to the car park and I see something under my car. It looks like a shadow or something dark.\nI put my phone in my pocket and pull out my keys. I unlock the car to scare off anything close to the car, I was thinking it may be a car or a dog just hanging around my car, but when I unlock the car nothing happens. No cat running away and nobody running away. \nThe shadow looked like it was cast from the drivers side so I was gonna have to look at what it was whether I wanted to or not to get in. I put my keys away and pull out my phone again and turn the flash light on to see better in the dark. \nAs I turn towards the driver side of my car I see him. A dirty naked guy with big eyes staring right at me. He was crouched down trying to hide from me. \nNow I don’t usually get scared of anything. But this guy scared me. He looked like he rolled around in mud and it dried out on his skin, his eyes looked creepy, bloodshot and kind of bulging out of his head. And he was naked. \nI get startled and jump backwards out of instinct dropping my pizza in the process. It falls out of its box and onto the floor. I start moving back slowly and shout at him to get away from my car. \nHe looks up at me, then at the pizza, then back at me again. He tilts his head to one side and then jumps towards the pizza, like a dog, grabs it and starts running away down the road and I assume he ran all the way to the woods, I wouldn’t know where he went as I didn’t feel like following him.\nI lock my car and run back to the pizza place and stay there for a bit. The workers obviously don’t believe me when I tell them what happened but I know what I saw. \nOnce the fear subsides after a while, I realise that this guy just stole my pizza. Angry as I was looking forward to it I decide to get another one and run to my car this time. I get in put the pizza on the passenger seat and go home. \nOnce I got home I locked all my doors and windows. I even locked my bedroom door as I feel a little scared still. I think I’ll be playing Minecraft until the sun comes up. \nCreepy dirty naked guy that lives in the woods close to my town I never wanna see you again because I may have to fight you for stealing my pizza. ", "media": null, "score": 98, "upvote_ratio": 0.96, "comment_count": 17, "over_18": true}, "60": {"id": "1fro7py", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "SaltyAd7827", "link_flair_text": "WDYT? (What Do You Think?)", "time": 1728097197.0991445, "created_utc": 1727557647.0, "url": "https://www.reddit.com/gallery/1fro7py", "title": "Spotted a Ghostly Face in the Background of My Group Photo", "permalink": "/r/Ghosts/comments/1fro7py/spotted_a_ghostly_face_in_the_background_of_my/", "selftext": "", "media": null, "score": 130, "upvote_ratio": 0.65, "comment_count": 85, "over_18": false}, "61": {"id": "1fweteu", "locked": true, "subreddit": "glitchinthematrix", "stickied": true, "category": "Paranormal", "author": "BroderzYt", "link_flair_text": "Mod Announcement", "time": 1728097197.294316, "created_utc": 1728090314.0, "url": "https://www.reddit.com/r/GlitchInTheMatrix/comments/1fweteu/rglitchinthematrix_moderator_applications_are_open/", "title": "r/GlitchInTheMatrix Moderator Applications Are Open!", "permalink": "/r/GlitchInTheMatrix/comments/1fweteu/rglitchinthematrix_moderator_applications_are_open/", "selftext": "Are you a frequent visitor of the subreddit? Or a long time lurker? Do you have an interest in keeping subreddits safe and enjoyable? Well then you might want to consider applying as a moderator for r/GlitchInTheMatrix. We are currently in the process of recruiting a few mods to join our team, and you could be one of them! \nMinimum Qualifications:\n- Account must be at LEAST 1 year old\n- Account must have at LEAST 5,000 karma (500 comment karma required)\n- Account must have some sort of consistent activity\n- Must be willing to contribute to moderation\nAdditional Qualifications (Not required to have, but could be useful):\n- Previous moderation experience (Reddit or other sites/apps)\n- Previous activity within the subreddit (Posts/Comments)\n​\nIf you meet our minimum qualifications, you can apply here!\nWe appreciate everyone who takes the time to complete the application, however we will only be contacting those who have been selected to move further into the application process. Thank you for understanding.\nr/GlitchInTheMatrix Mod Team\n​\n​", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "62": {"id": "1fu75vi", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Dull-Pianist-6777", "link_flair_text": "Discussion", "time": 1728097198.3079126, "created_utc": 1727840311.0, "url": "https://noriohayakawa.wordpress.com/2024/10/01/mystery-drone-incursions-over-air-force-plant-42-in-palmdale-california/?", "title": "Mystery drone incursions over Air Force Plant 42 in Palmdale, California", "permalink": "/r/ufo/comments/1fu75vi/mystery_drone_incursions_over_air_force_plant_42/", "selftext": "", "media": null, "score": 75, "upvote_ratio": 0.92, "comment_count": 1, "over_18": false}, "63": {"id": "1frlnaq", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "ir0ngut5", "link_flair_text": "Likely Identified", "time": 1728097199.4859838, "created_utc": 1727550476.0, "url": "https://v.redd.it/bsixi4limlrd1", "title": "Crew 9 coverage captures tumbling object which drastically changes direction and speed", "permalink": "/r/UFOs/comments/1frlnaq/crew_9_coverage_captures_tumbling_object_which/", "selftext": "Go to YouTube T+00:09:22 of NASASpaceflight launch coverage of Crew 9 today (September 28,2024). Anomalous object can be seen tumbling into frame and then drastically changes direction and speed.", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/bsixi4limlrd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/bsixi4limlrd1/DASH_96.mp4", "dash_url": "https://v.redd.it/bsixi4limlrd1/DASHPlaylist.mpd?a=1730689198%2CYjVlM2Y0ODc3ZDk2ZWY1MzY4MTI2ZDk3ZDNjZWNkMGU1MDA5NDk4MDdhMGNiNzRmMDZkNGUzN2MxMjIwZTQ4OQ%3D%3D&v=1&f=sd", "duration": 7, "hls_url": "https://v.redd.it/bsixi4limlrd1/HLSPlaylist.m3u8?a=1730689198%2CNTViY2Y0NmQzOWFmOTgwOTZkYzUyNzYzOTRiMDU3ZjYyNjMwMjM5NzA5YjExYWM5NjEyNGVmMGQyZTJkMWNhNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2253, "upvote_ratio": 0.85, "comment_count": 268, "over_18": false}, "64": {"id": "1ftbeur", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "SystematicApproach", "link_flair_text": "News :illuminati:", "time": 1728097201.262196, "created_utc": 1727743281.0, "url": "https://www.reddit.com/r/aliens/comments/1ftbeur/researchers_have_found_40_holes_measuring_between/", "title": "Researchers have found 40 holes, measuring between 500 and 1,000 feet in diameter at the bottom of Lake Michigan", "permalink": "/r/aliens/comments/1ftbeur/researchers_have_found_40_holes_measuring_between/", "selftext": "We should probably look down a lot more than up.\nhttps://preview.redd.it/ixswhgy2k1sd1.png?width=836&format=png&auto=webp&s=63df4eae62704f52626c4581c0d600bd71b6b954\nLake Michigan has been the site of various UFO sightings and mysterious occurrences. Notably, on March 8, 1994, hundreds of people across Michigan reported seeing bright, multicolored lights in the sky, which were widely documented and investigated. The area is also part of the \"Great Lakes Triangle,\" a region associated with mysterious disappearances similar to the Bermuda Triangle.\nhttps://www.msn.com/en-us/weather/topstories/eerie-structures-discovered-at-the-bottom-of-iconic-us-lake/ar-AA1ruEOV?ocid=socialshare&pc=W011&cvid=7175f182e6e045c2c88c58c456785189&ei=13", "media": null, "score": 994, "upvote_ratio": 0.96, "comment_count": 153, "over_18": false}, "65": {"id": "1fv8y1q", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "upquarkspin", "link_flair_text": null, "time": 1728097201.6019459, "created_utc": 1727965376.0, "url": "https://i.redd.it/hr13xi58wjsd1.jpeg", "title": "UAP related Books List", "permalink": "/r/UAP/comments/1fv8y1q/uap_related_books_list/", "selftext": "Here’s my personal list of 100 essential UFO and phenomena books, organized by category. It's a bit oldskool, but goes far beyond Elizondo...\nClassic UFO Books\n1.  The Flying Saucer Story by Donald Keyhoe (1950)\n2.  Behind the Flying Saucer by Frank Scully (1950)\n3.  The UFO Experience: A Scientific Inquiry by J. Allen Hynek (1972)\n4.  Passport to Magonia: From Folklore to Flying Saucers by Jacques Vallée (1969)\n5.  The Interrupted Journey by John G. Fuller (1966)\n\nUFO Sightings and Encounters\n6.  The Betty and Barney Hill Abduction by Budd Hopkins (1988)\n7.  The Rendlesham Forest Incident by Larry Fawcett and Barry Greenwood (1980)\n8.  The Roswell Incident by Charles Berlitz and William Moore (1980)\n9.  The Phoenix Lights by Lynne D. Kitei (1997)\n10. The Roswell UFO Conspiracy: Exposing a Shocking and Sinister Secret by Nick Redfern (2011)\n\nAlien Life and Theories\n11. Chariots of the Gods? by Erich von Däniken (1968)\n12. The Gods Never Left Us by Robert Bauval (1999)\n13. The Sirius Mystery by Robert K.G. Temple (1976)\n14. Ancient Skies by Philip Coppens (2005)\n15. The Ancient Alien Question by Philip Coppens (2011)\n\nGovernment Cover-Ups and Conspiracy\n16. The CIA and the UFO by Richard Dolan (2009)\n17. The Majestic 12 by Stanton T. Friedman and Don Berliner (1997)\n18. The UFO Cover-Up by Jim Marrs (1989)\n19. The Disclosure Trilogy by Richard Dolan (2012–2014)\n20. Dark Fleet: The Secret Nazi Space Program and the Battle for the Solar System by Michael Salla (2020)\n\nSkeptical Perspectives\n21. Skeptical Inquirer on UFOs by Kendrick Frazier (1983)\n22. The UFO Phenomenon by James R. McGovern (1983)\n23. The UFO Book by Jerome Clark (1998)\n24. The UFO Enigma by J. Allen Hynek (1998)\n25. UFOs: Reframing the Debate by Robbie Graham (2012)\n\nScientific and Academic Approaches\n26. The UFO Phenomenon: A Scientific Analysis by Peter A. Sturrock (1996)\n27. UFOs and the National Security State by Richard M. Dolan (2009)\n28. The UFO Casebook by Allan Hendry (1979)\n29. UFOs: The Scientific Evidence by Stanton T. Friedman (2013)\n30. Science, UFOs & Theories by Richard F. Haines (2014)\n\nModern UFO Sightings and Encounters\n31. The Alien Autopsy by Robert O’Neil (1992)\n32. The Alien Abduction by John E. Mack (1994)\n33. Close Encounters of the Fifth Kind: Contact Has Begun by Steven Greer (2013)\n34. The UFO Highway by Stan Gordon (2014)\n35. The Dyatlov Pass Incident by Donnie Eichar (2017)\n\nPsychological and Sociological Aspects\n36. The UFO Experience: A Psychological Investigation by Robert M. Pynadath (1973)\n37. The UFO Abductees by Carol M. Christensen (1988)\n38. The Cult of Alien Abduction by Chris Aubeck and Jennifer Stein (2000)\n39. The Psychology of Alien Encounters by David J. Hufford (2015)\n40. Abduction: Human Encounters with Aliens by Susan A. Clancy (2017)\n\nAncient Civilizations and Lost Knowledge\n41. The Lost Civilization of Mu by James Churchward (1931)\n42. The Atlantis Connection by Brad Steiger (1983)\n43. The Hall of Record by Edgar Cayce (1972)\n44. The Secret Teachings of All Ages by Manly P. Hall (1928)\n45. The Lost Cities of Ancient Aliens by David Childress (2014)\n\nEsoteric and Spiritual Perspectives\n46. The Mystery of the Cathedrals by Christopher Knight and Robert Lomas (1996)\n47. The Holographic Universe by Michael Talbot (1991)\n48. The Field by Lynne McTaggart (2002)\n49. The Missing Secrets of UFOs by Ron M. Jones (2011)\n50. The Universal Mind by Carl Sagan (2013)\n\nFamous UFO Cases\n51. The Kenneth Arnold Sighting by Robert B. Palmer (1971)\n52. The Mantell Crash by Bill Jorgensen (1998)\n53. The Kelly-Hopkinsville Encounter by Loren Coleman (1975)\n54. The Travis Walton Abduction by Travis Walton (1978)\n55. The Flatwoods Monster: A Legacy of Fear by Frank Feschino (2015)\n\nUFO Sightings in History\n56. The Nuremberg Celestial Phenomenon by Andrew D. Basiago (2010)\n57. The UFO Sightings of the Ancient Greeks by Mark McElroy (2011)\n58. The UFO Sightings of the Ancient Egyptians by Mark McElroy (2011)\n59. The UFO Sightings of the Ancient Sumerians by Mark McElroy (2011)\n60. The UFO Sightings of the Ancient Chinese by Mark McElroy (2011)\n\nUFO Sightings in Other Countries\n61. The UFO Sightings of Brazil by John A. Keel (1970)\n62. The UFO Sightings of Argentina by Alejandro Lazo (2007)\n63. The UFO Sightings of Chile by Alejandro Lazo (2007)\n64. The UFO Sightings of South Africa by J.P. Lockhart (2008)\n65. The UFO Sightings of Australia by Andrew L. MacGregor (2010)\n\nUFOs in Popular Culture\n66. The X-Files by Chris Carter (1993)\n67. Close Encounters of the Third Kind by Steven Spielberg (1977)\n68. E.T. the Extra-Terrestrial by Steven Spielberg (1982)\n69. Independence Day by Roland Emmerich (1996)\n70. Men in Black by Barry Sonnenfeld (1997)\n\nUFOs and Science Fiction\n71. The Time Machine by H.G. Wells (1895)\n72. The War of the Worlds by H.G. Wells (1898)\n73. The Moon Is a Harsh Mistress by Robert A. Heinlein (1966)\n74. 2001: A Space Odyssey by Arthur C. Clarke (1968)\n75. The Hitchhiker’s Guide to the Galaxy by Douglas Adams (1979)\n\nUFOs and Paranormal Activity\n76. The Haunting of Hill House by Shirley Jackson (1959)\n77. The Amityville Horror by Jay Anson (1977)\n78. The Exorcist by William Peter Blatty (1971)\n79. The Conjuring by James Wan (2013)\n80. The Shining by Stephen King (1977)\n\nUFOs and Secret Societies\n81. The Illuminati by Adam Weishaupt (1776)\n82. The Freemasons by Christopher Knight and Robert Lomas (1997)\n83. The Knights Templar by Henry Lincoln (1975)\n\nModern UFO Books (Post-2010)\n84. The Alien Deception by Bill Chalker (2012)\n85. The Truth About UFOs by Peter Robbins (2012)\n86. The Secret Space Program: The Alien Connection by Michael Salla (2013)\n87. UFOs and the National Security State: Chronology of a Cover-Up by Richard M. Dolan (2014)\n88. The Giza Death Star Deception by Joseph P. Farrell (2011)\n89. UFOs: Generals, Pilots and Government Officials Go on the Record by Leslie Kean (2011)\n90. Close Encounters of the Fifth Kind: Contact Has Begun by Steven Greer (2013)\n91. The Expanse Series by James S.A. Corey (2011–2021)\n92. The Dark Forest by Cixin Liu (2015)\n93. The Three-Body Problem by Cixin Liu (2017)\n94. Area 51: The Night That Changed the World by Annie Jacobsen (2011)\n95. The UFO Cult by Christopher Partridge (2015)\n96. Aliens, Gods, and the Bible by Chuck Missler (2019)\n97. The Dyatlov Pass Incident by Donnie Eichar (2017)\n98. Atlantis and the Coming Ice Age by Frank Joseph (2015)\n99. The Lost Star of Myth and Time by Walter Cruttenden (2015)\n100.    The UFO Casebook: A Scientific Investigation of UFOs and Other Phenomena by Bruce Maccabee (2012)\n\nThis list ensures a wide scope of topics, from historical accounts and ancient civilizations to government cover-ups, alien theories, and modern UFO sightings.", "media": null, "score": 33, "upvote_ratio": 0.79, "comment_count": 12, "over_18": false}, "66": {"id": "1fu1o4f", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "loadstarReddit", "link_flair_text": null, "time": 1728097202.6442564, "created_utc": 1727823507.0, "url": "https://i.redd.it/7os8w0ac68sd1.jpeg", "title": "Never Forget on this day 7 years ago, one of the most covered up incidents in modern American history unfolded ", "permalink": "/r/conspiracy/comments/1fu1o4f/never_forget_on_this_day_7_years_ago_one_of_the/", "selftext": "", "media": null, "score": 4146, "upvote_ratio": 0.95, "comment_count": 369, "over_18": false}, "67": {"id": "1frkww2", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "KevMo615", "link_flair_text": "crosspost", "time": 1728097203.528629, "created_utc": 1727548485.0, "url": "https://i.redd.it/8oihr9wh2lrd1.jpeg", "title": "Wish we had this luck with BF someday - fascinating!", "permalink": "/r/bigfoot/comments/1frkww2/wish_we_had_this_luck_with_bf_someday_fascinating/", "selftext": "", "media": null, "score": 170, "upvote_ratio": 0.93, "comment_count": 57, "over_18": false}, "68": {"id": "1frdgn3", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "AllColoursSam", "link_flair_text": null, "time": 1728097204.2820153, "created_utc": 1727527440.0, "url": "https://v.redd.it/75z023lzpjrd1", "title": "A Loch Ness Monster segment of Arthur C. Clarke's Mysterious World. (1980)", "permalink": "/r/Cryptozoology/comments/1frdgn3/a_loch_ness_monster_segment_of_arthur_c_clarkes/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/75z023lzpjrd1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 480, "scrubber_media_url": "https://v.redd.it/75z023lzpjrd1/DASH_96.mp4", "dash_url": "https://v.redd.it/75z023lzpjrd1/DASHPlaylist.mpd?a=1730689203%2CYjllYjkxMzg4ZTZhYjgyMGVhODAwYzE0MzUzZDBkNDhhZWM1ZmMyZjk3NWI3NGRhMDA2MmI1ZDRiNTE3NTVmMg%3D%3D&v=1&f=sd", "duration": 486, "hls_url": "https://v.redd.it/75z023lzpjrd1/HLSPlaylist.m3u8?a=1730689203%2CZjkwNDc2NmRjMjg1NGI3NDM0NWNhNzUyZTkxOWI4ODliNDQ0OTIzZWVjZTUxYWI0NzgwMWMwNDU3Y2VmYjZiOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 239, "upvote_ratio": 0.98, "comment_count": 20, "over_18": false}, "69": {"id": "1fsmrwh", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "_Civilian_", "link_flair_text": "Unsolved", "time": 1728097204.5022998, "created_utc": 1727668363.0, "url": "https://i.redd.it/srbb9o22dvrd1.jpeg", "title": "Streak Lights “Humanoid Shape” On Middle of the Road ", "permalink": "/r/Humanoidencounters/comments/1fsmrwh/streak_lights_humanoid_shape_on_middle_of_the_road/", "selftext": "Hello everyone! This is my first post here and something strange happened tonight and I can’t really tell what I saw. \nI was driving back from my parents house, a couple hours ago. (Around 10 pm on my local time zone) I’m from São Paulo, Brazil. And as I was driving, I saw something on the lane to my right, something that I can describe as a Streaks of White Lights. It went so fast. I thought for a millisecond that could be a Cyclist. But it’s impossible to be a Cyclist (person). This highway is one of the fastest highways in the country. Where the speed limit is 120 km/h (74 mph). But on Sunday night, where the road is clear. Drivers don’t go less then 130-140km/h (80-86mph). I was around 80mph. The lack of lights would get this cyclist killed in less than a minute. It’s a stretch that’s almost entering the city but it’s still a rural area. \nSo It had a Shape of Humanoid kind of it but it was just lights. White shining lights. I wasn’t alone in the car. My girlfriend was with me on the passenger seat. But she was on the phone I asked and she saw nothing. \nI already had multiple encounters with the supernatural in my life, wasn’t the first time. But I got very curious of what it might be that I saw on that road. \nI found the picture online. I know it’s not the best way to describe it. But by the pattern of lights / streaks it can give you guys an idea! (This picture has nothing to do with supernatural, it’s a photo art by a photographer) ", "media": null, "score": 23, "upvote_ratio": 0.77, "comment_count": 4, "over_18": false}, "70": {"id": "1fv0ewp", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "LarkAspic", "link_flair_text": null, "time": 1728097205.014643, "created_utc": 1727932487.0, "url": "https://i.redd.it/u5terlqc6hsd1.jpeg", "title": "Illustration of the Flatwoods Monster.", "permalink": "/r/cryptids/comments/1fv0ewp/illustration_of_the_flatwoods_monster/", "selftext": "", "media": null, "score": 234, "upvote_ratio": 1.0, "comment_count": 7, "over_18": false}, "71": {"id": "1fswo3p", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Rishuab", "link_flair_text": null, "time": 1728097205.1945636, "created_utc": 1727705940.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1fswo3p/the_possessed_night/", "title": "The Possessed Night", "permalink": "/r/Thetruthishere/comments/1fswo3p/the_possessed_night/", "selftext": "This is my father's story, from a time before I was born. One evening, my father was at home with his elder sister (my aunt), along with my grandparents (my father’s mother and father). My aunt was casually walking on the roof of our house. Behind our home, there was a small alley-like area.\nWhile walking, my aunt absentmindedly spit down from the roof and then came back inside. Everything seemed normal. Later, everyone gathered for dinner, and the night went on without any issues.\nHowever, as the night progressed, my aunt began feeling strange. Her body started heating up, and she became restless, almost as if she had lost control over herself. Suddenly, she began speaking in a heavy voice, saying, “Why did you spit on me? I will kill you!” She kept repeating this in a voice that didn't sound like hers.\nHer body became stiff, and my father, along with my grandparents, tried to hold her down. It felt as if something had taken control of her body. It seemed that where she had spit earlier, something or someone was present, and it had been angered by her action.\nFor some time, my aunt continued speaking in that strange voice. My grandparents, realizing something was very wrong, began apologizing to the unknown entity that seemed to have possessed her. They begged for forgiveness, saying they didn’t know it was there or meant any harm.\nAfter some time, things returned to normal, and my aunt was herself again.\nToday, my aunt is no longer with us, but this story was passed down to me by my father, who was quite young at the time. He said it was the first time he had ever experienced anything like that.", "media": null, "score": 17, "upvote_ratio": 0.82, "comment_count": 5, "over_18": false}, "72": {"id": "1ful3yd", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "A_Deadly_Sloth", "link_flair_text": null, "time": 1728097205.3558524, "created_utc": 1727888232.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ful3yd/attempted_ambush_at_night/", "title": "Attempted Ambush at Night", "permalink": "/r/LetsNotMeet/comments/1ful3yd/attempted_ambush_at_night/", "selftext": "This happened four years back. It was the middle of winter, and the night was unseasonably warm, without a hint snow on the ground. I left my apartment around 8 PM to go for my daily walk (I worked nights and my schedule was screwed up, hence the 8 PM walk), figuring I would cross the bridge into the city nearby. For further context I'm a tall guy who's fairly athletic, and I was in my late 20's at the time. I'd rarely had a problem walking at night, and at the time, I felt safe to do so. I put on my headphones and headed towards the bridge.\nThe first twenty minutes were uneventful. I passed by old houses, a subpar Mexican restaurant, a really good Mexican restaurant, a sketchy gas station, some newly built upscale apartments, and finally, I was at the river, enjoying the view of the bright lights over the dark flowing water, not yet frozen. I crossed the bridge into the city and hit a crosswalk button at a four way intersection, then noticed someone standing on the corner opposite, the only other soul I'd seen outside that night. Seemingly she was doing nothing, and I assumed she was waiting for an uber to come pick her up, since she didn't seem to be waiting for the light to change.\nThe street, ordinarily busy during the daytime, was silent. The light changed, and I crossed, headed in her direction. As I neared her I noticed that she would cast glances in my direction, then look away, almost sheepishly. She did this multiple times, and I figured she was unnerved by me. I sympathized, figuring it must have made her uneasy, us being the only two people on a dimly lit street. As I passed by, I took in her outfit, mostly because I thought she looked cold: she wore a knitted hat with tassels, a sweater that looked too thin for the winter, tight jeans, and a little plastic children's backpack on her back. I thought she was in her teens at first, but upon closer inspection she appeared to be in her late twenties or thirties. She had short cropped light brown hair and a pale complexion. She was skinny and was of average height; I was maybe a head taller than her. I walked by and continued down the street.\nI passed by high rise hotels on my right and left, and made my way into a central park. During peak hours this place would be packed with tourists and locals alike, but that day, at an odd hour and with the pandemic in full swing, I felt like the only man in the city. I admired the brilliant display of lighted trees as I crossed through the center of the park; then, figuring I was at a good halfway point in my journey, I made my way around an old marble and stone library, back towards the bridge. As I turned the corner of the library back onto the street from which I'd come, I nearly collided with someone, moving towards me.\nIt was the same woman I'd seen not ten minutes earlier. My noise cancelling headphones were still on, so I pulled down one side and said something by way of apology. She said nothing in return. Instead, she stepped back from me and stood below a street light, not making eye contact. She stole tiny glances at me, that same tick I'd noticed before. I put my headphones back on, nodded a goodnight, and headed towards the nearest crosswalk.\nReason told me that she must be headed in the direction I'd come from, since we'd nearly run into each other headed opposite ways, but some part of me whispered that she wasn't headed that way. Sure enough, when I turned to look, she was trailing close behind me, her strides surprisingly long and energetic. I found this odd enough that I continued to watch her out of the corner of my eye.\nShortly after I reached the crosswalk, as I stood there waiting for the light to change, she caught up with me, passed me by, and stopped. A car when past, and as it did so, she squatted over her plastic bag a few meters from me, rifling frantically for something, looking up at me on occasion. I hit a button on my headphones, stopping my podcast, so that I could hear her better. What I found disturbing about the motion of her looking through her bag is that it struck me as fake, as though she were pretending for some reason. She was barely looking inside, and her careless motions struck more like bad acting. Something about her motions, the way she kept looking at me, felt wrong.\nThe light changed, and I began to walk quickly, but she was faster. She stood suddenly, darting past me towards the museum, swinging the half open little pink backpack over her shoulder. I watched her silhouette disappear into the darkness beyond the reach of the street lights. I hoped that that was the end of that, and after a few beats of not seeing her, I let my guard fall a little, restarting my podcast.\nBeyond the museum was a patch of poorly lit sidewalk, in front of a squat building with mirrorlike windows. I wasn't far from the bridge now. As I made my way back there, I turned my head to look at the reflections of buildings and streetlights in the windows. To my horror, a dark figure sprinted silently towards my reflection, dreamlike.\nI'm not sure why, maybe out of sheer confusion, but I turned to meet her as she hurtled towards me. Perhaps surprised by my sudden turn, she halted mere feet from me, staring. Her eyes were wide, and looked frantic, wild. She kept looking at my arms, then back at my face, as though sizing me up. My accidental bluff had worked, and in the darkness, I suppose I must have looked more prepared to fight back than I felt. She gripped something small tightly in one hand, though she held it off to the side, and in the shadow of the building I couldn't see what it was.\nSeconds dragged as we stood there, staring at one another. Immobilized by fear and confusion, I waited for her to make some move, to attempt to use whatever object she held in her hand.\nJust then, to my enormous relief, a car trundled slowly past. A bit of my strength returned, and over my blaring podcast I felt more than heard myself shouting at her, \"what do you want?\" No reply. I slowly backed away from her, expecting her to move. She just watched me, that same intense look on her face. I took another step back, then another, steadily backing away from her until I felt confident enough to turn and carefully walk away.\nAs I reached a better lit area, I began to move faster, all the while keeping my eyes trained on her shadowy form. She stood there for some time, statuesque. Then abruptly, having spontaneously abandoned whatever plan she may have had for me, she turned from me and without looking for traffic, she crossed the street with long strides, and disappeared around the corner of a building. Something about the casual air of it disturbed me.\nI kept my eyes trained behind me on my walk home, afraid that she would follow me. The bridge was well lit, and I saw no sign of her. Knowing that this was the only way for her to follow me and keep up on foot, I breathed a sigh of relief. I saw no more cars headed from the city, no more pedestrians out walking.\nNothing happened after that. I'm not sure why, but I didn't call the cops that night. I still regret having not called, despite my roommates insisting I do so. I just remembering thinking that I wasn't sure what to say to the cops, that I hadn't really been attacked, that they wouldn't be able to find her anyway. I made up excuses. I suppose I must have been in shock, in denial at having been nearly ambushed, especially by someone smaller than me, in my own city, so close to my apartment. One of my roommates called the cops for me. A cop drove through the area, but by that point, she was gone. \nWoman with the little pink backpack, let's not meet again.", "media": null, "score": 59, "upvote_ratio": 0.98, "comment_count": 8, "over_18": true}, "73": {"id": "1frqrn4", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Direct-Disaster2472", "link_flair_text": "Personal Encounter ", "time": 1728097206.1090775, "created_utc": 1727565250.0, "url": "https://www.reddit.com/r/Ghosts/comments/1frqrn4/little_girl_dissapeared_right_in_front_of_me_and/", "title": "Little girl dissapeared right in front of me and im kinda trippin", "permalink": "/r/Ghosts/comments/1frqrn4/little_girl_dissapeared_right_in_front_of_me_and/", "selftext": "so im walking my dogs in my apt complex, and i see this little girl with a blue shirt, glasses, and a giraffe plushie just walking in the middle of the road. i didnt really know what to do or what was happening so i just looked around to see if there were any parents around, and therw were none. so she keeps walking to the this bend that would block my view, but she walks past this tree and boom. gone. i had assumed she had hid in a bush or behind a car, so i walk over there and nothing. am i tripping or did i see a ghost? ive never seen one before or experienced paranormal activity so im kinda at a loss. note: her clothing was modern another note: no drugs or inhibitors were involved", "media": null, "score": 70, "upvote_ratio": 0.92, "comment_count": 38, "over_18": false}}}