{"_default": {"1": {"id": "16mn1oc", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "mitte90", "link_flair_text": null, "time": 1695352188.3855114, "created_utc": 1695118344.0, "url": "https://www.reddit.com/r/conspiracy/comments/16mn1oc/ill_start_caring_whether_or_not_russell_brand_had/", "title": "I'll start caring whether or not Russell Brand had some questionable sex a decade or 2 ago when the media starts caring what Bill Gates or Prince Andrew was doing on Epstein's island, or when it starts naming the customers Ghislaine Maxwell was convicted of supplying trafficked minors to.", "selftext": "And I'll care about what one former US president is or isn't guilty of when the media starts caring what other former US presidents are or are not guilty of (or even what the current one's been up to lately).\nAnd I'll care about a more powerful country invading a less powerful country when the media reports the conflict and its context in exactly the same tone and with the same degree of neutrality versus moral outrage as it uses when the more powerful country in question is the USA (or any other NATO member).\nUntil that day, the mainstream media and everyone who repeats its talking points on social media is nought but idle gossip and the sound of one hand clapping.\nUntil that day I could not give less fucks about who the msm says any fucker fucked or didn't fuck, so fuck the msm. Let anyone it fucks with tell it to fuck the fuck off with its farcical fuckery.", "media": null, "score": 4616, "upvote_ratio": 0.8, "comment_count": 1012, "over_18": false}, "2": {"id": "16mwnu3", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1695352189.2679925, "created_utc": 1695143539.0, "url": "/r/BrowardCountyFLTruth/comments/16mwlqw/thanks_google_search_for_truth_hidden_by_monopoly/", "title": "Thanks Google search for truth hidden by monopoly Comcast.. Wasted 30 min on phone being lied to... Found out Xfinity's 30% overpriced voip internet phone service NOW blocks text messages, a key feature. Monopoly power is only way they get away with charging so much, for so little and customer abuse", "selftext": "", "media": null, "score": 7, "upvote_ratio": 0.89, "comment_count": 0, "over_18": false}, "3": {"id": "16mchxa", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "DragonfruitOdd1989", "link_flair_text": "Discussion", "time": 1695352191.0910418, "created_utc": 1695083852.0, "url": "https://www.reddit.com/r/ufo/comments/16mchxa/mexican_hospital_determines_the_nonhuman_body/", "title": "Mexican Hospital determines the \"Non-Human\" Body presented during the Mexican UFO Hearing is a real body that once walked on Earth.", "selftext": "Link to analysis performed live: https://www.youtube.com/watch?v=Eief8UMIwZI\nMajor points:\n\nThe team agrees this being once walked on Earth.\nThere is a metallic implant on the chest that they don't know how it was installed.\nThere are eggs.\nThe cranium connection to the spine is organic and natural. The hospital team would have been able to tell if it was manufactured.\nThere are no signs of manufacturing, glue or anything that would indicate a hoax.\nThe rib system is unique.\nThe hospital would like to perform a DNA analysis.\nThe hospital begs for others to ask for access and to analyze rather than ignore this discovery.\n\n​", "media": null, "score": 1410, "upvote_ratio": 0.84, "comment_count": 975, "over_18": false}, "4": {"id": "16m1p4x", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "CreditCardOnly", "link_flair_text": "Video", "time": 1695352192.921169, "created_utc": 1695058205.0, "url": "https://v.redd.it/btdnujezt1pb1", "title": "Neil deGrasse Tyson responds to David Grusch: \"Debating is not the path to objective truth; the path to objective truth is data\"", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/btdnujezt1pb1/DASH_720.mp4?source=fallback", "height": 716, "width": 1280, "scrubber_media_url": "https://v.redd.it/btdnujezt1pb1/DASH_96.mp4", "dash_url": "https://v.redd.it/btdnujezt1pb1/DASHPlaylist.mpd?a=1697944191%2CY2ZlZTk2OGQ0NDQ3MTI5NjVhNDlhMDY2MDdlMDJkMDk1ZjJiYmFkYmFkZThiZTQ5ZTJjOTk3ZjRhYWYwOGJiNg%3D%3D&v=1&f=sd", "duration": 277, "hls_url": "https://v.redd.it/btdnujezt1pb1/HLSPlaylist.m3u8?a=1697944191%2CMDAyMTgyMTcxMmJiZWU5Yjk2YjlhYWY4YzgyODE4MDdmYzdhNTlkZTc3ODBkYWQ1OTE1NDI0YTAwNzM0ZGQ0Mw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 6205, "upvote_ratio": 0.87, "comment_count": 1641, "over_18": false}, "5": {"id": "16j3kje", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "depressionly_", "link_flair_text": "Image 📷", "time": 1695352195.1167696, "created_utc": 1694752049.0, "url": "https://i.redd.it/rh9054mxjcob1.jpg", "title": "What people think aliens look like vs what they actually look like:", "selftext": "", "media": null, "score": 15459, "upvote_ratio": 0.95, "comment_count": 690, "over_18": false}, "6": {"id": "16j2xb5", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "MathAndCodingGeek", "link_flair_text": null, "time": 1695352195.7862213, "created_utc": 1694749980.0, "url": "https://www.reddit.com/r/UAP/comments/16j2xb5/is_nasa_ready_for_aliens_nasas_disaster_of_a_uap/", "title": "Is NASA Ready for Aliens? NASA's Disaster of a UAP News Conference.", "selftext": "I'm writing this post hoping it is not \"chaff.\" I watched a disaster of an online conference. Can anyone please help NASA hold a news conference? The idea of aliens flying spaceships to Earth is a cultural goliath, and NASA, ironically, needs help understanding what they are dealing with, not scientifically but culturally.\nI'm sure everyone agrees that Dr. Avi Loeb is one of our great scientists. One of Dr. Loeb's criticisms is that the scientific community refuses to use aliens when they are the most likely explanation for a particular phenomenon. Nothing can better describe NASA's news conference about the conclusion of the UAP Independent Study than Dr. Loeb's words.\nIn case you missed it, this news conference announced the conclusions from a study designed to kick off the founding of NASA's UAP| Science Mission Directorate. Bill Nelson insisted that NASA would tell us the truth about aliens and UAPs even as everything he said otherwise indicated that NASA could not handle the truth if that truth is aliens.\nSo, for example, right off the bat, Bill Nelson emphatically said that NASA found no conclusive evidence that aliens are behind the UAPs. Though that statement is technically correct, the problem with it is that it sounds like a conclusion. \"We found no conclusive evidence\" is often the statement scientists use to mean that the new wonder drug won't harm anyone. Mr. Nelson decided to hedge his words with his bias instead of saying we don't know yet.\nBy the way, Dr. Loeb believes he has physical evidence of alien technology, and no one asked about it during the meeting. \"Show me the evidence,\" said Mr Nelson. Dr. Loeb says he has it; call him up.\nAfter concluding there was no evidence of aliens, Mr. Nelson told us that the investigation would be open to the public just before another panelist said that NASA would not disclose who would head up the UAP Directorate. I mean, I got whiplash.\nThe next thing that happened was that a panelist referred to most people's opinions as chaff. Did he really need to say that? I understand this statement; there is a lot of annoying noise because Aliens are a cultural goliath, but this is a big deal, and dismissing people, no matter who they are, will make things worse.\nScience is meeting culture and politics, a dangerous combination; just ask Dr. Faucy. Two works of science fiction should be required reading at NASA. They are \"Solaris\" and \"His Masters Voice,\" both by Stanislaw Lem. These books warn scientists about the weakness of science when it comes to interaction with politics and society.\nThe novel Solaris is about discovering a planet that seems alive and has technology far superior to humans. Yet, scientists cannot find \"conclusive evidence\" in the story that the exo-planet is alive or intelligent even though anyone with common sense can see it, so, of course, the politicians eventually have to step in, and chaos ensues.\nThat is the danger in this UAP investigation: everyone sees it obviously as intelligent alien life, including the scientists, but science is afraid of drawing conclusions from the evidence. NASA is already closing in on this scenario.\nIn the second novel, the Earth receives an incomprehensible alien signal—all attempts to decode the signal fail even though the message is broadcasted in a way that seems like a message. Again, everyone knows it is a message, but there is no conclusive evidence that the broadcast is a message because it is too alien to be translated. The theories of what is obviously an alien message regress to not a message simply because scientists cannot draw conclusions even though they know it is an unmistakable message.\nLet's put it another way: In 1896, Svante Arrhenius was able to calculate the effect of increasing atmospheric Carbon Dioxide on the temperature of the Earth's surface; not 1996, that was in 1896! In 1902, Svante published a theory that coal combustion could lead to human extinction due to climate change. In 1960, 10,000 scientists signed a letter that the Earth is in trouble with global warming. It's 2023, and there still needs to be a plan to fight climate change, even though everyone can see it happening, and 127 years after humanity knew about the problem and needed such a plan. Humans could become extinct because people fear to say what is in front of their faces.\nNone of my criticism here is about science as a discipline or scientists. My complaint is that fear paralyzes our scientific institutions: fear of being wrong, losing jobs, and losing funding.\nI learned nothing substantive listening to the conference except that NASA is not ready as an institution to encounter alien life if it bites them on the nose.", "media": null, "score": 171, "upvote_ratio": 0.85, "comment_count": 131, "over_18": false}, "7": {"id": "16lukjc", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "StarlightDown", "link_flair_text": "Lost Artifacts", "time": 1695352196.527584, "created_utc": 1695041096.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16lukjc/where_is_cleopatras_tomb/", "title": "Where is Cleopatra's tomb?", "selftext": "Cleopatra spent her last days in writhing pain and misery. Her torso was marred with wounds, self-inflicted—first after witnessing the horrific suicide of her lover Mark Antony, who stabbed himself to a slow death after the defection of his entire cavalry, and again after her house arrest, when she grabbed a dagger before being quickly disarmed by a Roman soldier. Already bedridden, her wounds became infected and she developed a violent fever. In an act of defiance, she refused to eat. Her defiance relented when her captors threatened to harm her children. A political prisoner of her fame wasn't about to die so soon. It was decided that Cleopatra would be brought to Rome as a trophy of the Roman conquest of Egypt, and the crowning achievement of Octavian—a man we know today by the name Augustus Caesar, the first Emperor of the Roman Empire. Link, link\nIn an account that may be more mythology than history, a peasant brought Cleopatra a basket of figs. The guards thought nothing of it. Shortly afterward, Octavian received a letter from Cleopatra, asking to be buried alongside Mark Antony. He rushed to her quarters, but it was too late. The bodies of her servants, forever loyal to their Queen, surrounded her. Snakebites dotted her arms, freeing her from the life of captivity and humiliation she dreaded. Queen Cleopatra VII was found dead on her bed, still dressed in her beautiful ornate regalia.\nOctavian respected her wishes, and at their grand mausoleum, buried Cleopatra and Mark Antony together.\nWhere is Cleopatra's tomb?\nCleopatra and her story has been celebrated across the ages. Perhaps that makes it all the more unfortunate that we no longer know where her tomb is. Even more remarkable is the fact that we do not know the location of any tomb for any ruler of Ptolemaic Egypt, dating back to Alexander the Great, who conquered Egypt for the Greeks. Finding just one tomb could point us in the right direction, at least. What do historical records have to say?\n\nIn the late fourth or early third century B.C. the body of Alexander was removed from its tomb in Memphis and transported to Alexandria where it was reburied. At a still later date, Ptolemy Philopator (222/21-205 B.C.) placed the bodies of his dynastic predecessors as well as that of Alexander, all of which had apparently been buried separately, in a communal mausoleum in Alexandria.  \nThe literary tradition is clear that the tomb was located at the crossroads of the major north-south and east-west arteries of Alexandria. Octavian, the future Roman emperor Augustus, visited Alexandria shortly after the suicide of Cleopatra VII in 30 B.C. He is said to have viewed the body of Alexander, placing flowers on the tomb and a golden diadem upon Alexander's mummified head.\n\nThis seemingly narrows down the search to Alexandria, an ancient, storied city that served as the capital of Egypt for one thousand years. Ptolemaic rulers were buried at a grand communal mausoleum in the heart of the city. How hard could it be to lose a giant mausoleum in the middle of a major city? Your guess is as good as mine, but there's a hint that the passage of time was not kind to this monument, and as far back as the 4th century CE:\n\nWhen St. John Chrysostom visited Alexandria in A.D. 400, he asked to see Alexander’s burial place, adding, “His tomb even his own people know not.” It is a question that continues to be asked now, 1,613 years later.  \nCleopatra took gold from the tomb to pay for her war against Octavian (soon to be the emperor Augustus). There were subsequent visits to the tomb by numerous Roman emperors and then, beginning in A.D. 360, a series of events that included warfare, riots, an earthquake, and a tsunami, threatened—or perhaps destroyed—the tomb by the time of Chrysostom’s visit. From that point on, Alexander’s tomb can be considered lost.\n\nThose earthquakes and tsunamis did more than just potentially destroy a mausoleum. They permanently submerged a large section of ancient Alexandria underwater. Unfortunately, this might be the reason why we can't find the tomb of Cleopatra, or of any Ptolemaic Egyptian ruler. They're all in the Mediterranean.\nWas Cleopatra really buried in Alexandria?\nThe twist is that there's a good chance that Cleopatra was not buried in Alexandria. Historians are in disagreement about even the general location of Cleopatra's resting place, but it is clear that she built a new mausoleum for herself and Mark Antony. The mausoleum was incomplete at the time of her death, but Octavian finished its construction. It was adjacent to a landmark temple of Isis. Link\nA 45-minute drive west of Alexandria lies a temple of Isis that has attracted more attention than most. Named Taposiris Magna, this Ptolemaic Egyptian site drew the interest of archaeologists after the 2006 discovery of several hundreds of ancient coins depicting Cleopatra. Excavations here have also uncovered Isis figurines, Greco-Roman-style mummies, and even a mask which has been claimed to bear the resemblance of Mark Antony. Ground-penetrating radar has revealed three possible sealed subterranean burial chambers in the area. Most recently, in 2022, archaeologists discovered a 43-foot deep, 4,300-foot long tunnel at the site, considered an unusual construction for its time. The purpose of the tunnel is unknown, and there has been speculation that it could lead to more tombs. Link, link\nMany archaeologists still believe that Cleopatra's mausoleum was in Alexandria, and was destroyed along with much of the ancient city long ago. A digital reconstruction of ancient Alexandria made by historian Michael Bengtsson, backed up by historical accounts, places the mausoleum on a peninsula upon the coast. If it really was here, it was certainly destroyed by a tsunami and would only exist as underwater rubble now at best.\nMaybe that's for the best. Countless tombs across history have been looted and vandalized. People robbed them of their treasure, but more disappointingly, they robbed them of our heritage. If the last of Cleopatra's great tomb is sitting scattered beneath the seafloor sediment, safe from robbers but waiting for future archaeologists to bring them into the light, I'd be happy.", "media": null, "score": 944, "upvote_ratio": 0.98, "comment_count": 36, "over_18": false}, "8": {"id": "16l2wbo", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "morbidology", "link_flair_text": null, "time": 1695352197.1899772, "created_utc": 1694962878.0, "url": "https://morbidology.com/the-disturbing-case-of-noah-crooks/", "title": "13 year old Noah Crooks called 911 after killing his mother. He said to the operator: “I tried to rape her. I tried to rape her but I couldn’t do it.”", "selftext": "", "media": null, "score": 4545, "upvote_ratio": 0.99, "comment_count": 780, "over_18": true}, "9": {"id": "16lat13", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "jessicamshannon", "link_flair_text": null, "time": 1695352197.419353, "created_utc": 1694981539.0, "url": "https://www.reddit.com/r/Jessicamshannon/comments/16lat13/in_torajan_tradition_babies_who_die_before/", "title": "In Torajan tradition, babies who die before teething are thought to have pure souls. They are interred within hollows carved into living trees. The holes are covered in palm fibers, and as the tree heals itself, the remains are absorbed. Then the sacred tree becomes the new womb for their souls.", "selftext": "This is one of MANY elaborate burial traditions of the Torajan people, a tribe indigenous to Indonesia.  They're renowned for their complex and unique funeral rights. I'll definitely be posting more at some point. Among other things, they disinter many of their (adult) relatives every few years. They show them appreciation by changing their clothes, giving them presents, etc.  They also cut graves into cliff walls and caves.  I've been going down this rabbit hole all morning and it's fascinating.  \n​\n​\nhttps://www.amusingplanet.com/2015/03/the-peculiar-burial-rites-of-tana-toraja.html\nhttps://www.dailymail.co.uk/news/article-3270383/The-tree-graves-Indonesia-dead-babies-buried-inside-trunks-growing-plants-absorbed-nature.html", "media": null, "score": 68, "upvote_ratio": 0.98, "comment_count": 3, "over_18": true}, "10": {"id": "16ms6mm", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "StateSideSpoonZ", "link_flair_text": null, "time": 1695352197.626619, "created_utc": 1695132966.0, "url": "https://i.redd.it/isf0e12h08pb1.png", "title": "In 1880 a farmer named David Lang vanished into thin air in front of his wife, children, and two friends. Weeks later in the precise spot he had disappeared a 15' circle had appeared. The grass in this area turned yellow and stopped growing. Animals and insects refused to enter this patch of land.", "selftext": "", "media": null, "score": 19, "upvote_ratio": 0.92, "comment_count": 2, "over_18": true}, "11": {"id": "16mqr54", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "ladroos666", "link_flair_text": "Paranormal Investigation", "time": 1695352197.8269813, "created_utc": 1695129369.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/16mqr54/objects_that_pass_through_others_in_an/", "title": "Objects that pass through others in an implausible way", "selftext": "Small premise:\nA few days ago, shortly after getting out of bed in the late morning, I went to the kitchen to greet my parents.\nThey looked dazed, not scared, but almost used to accepting that inexplicable things can happen in life and that that's okay.  Ultimately nothing serious happened, but it was still something quite special.\nLet me start by saying that my parents are people without problems of any kind, they are a little old, but perfectly lucid and aligned with the concreteness of their life.  Furthermore, they are quite practical people, they are not particularly interested in strange phenomena (and then possibly exaggerate them).\nThe fact:\nAs soon as I entered the kitchen I noticed my mother busy finishing cleaning the floor which seemed to be dirty with grease.  I ask her what happened and she turns to me and says, \"The capers (salted capers) fell out of the jar.\"\nShe had a bit of a strange face, so I ask her:\n\"So? What's strange?\"\nAnd she replies:\n\"The jar is closed, and it is intact. It is not broken, punctured or open anywhere. And while I was holding it in my hand they all fell to the floor.\"\n-shows me the jar-\nAnd I'm like, newly woken up:\n \"No, well...\n But how?\"\n I look at my father who makes one of those movements with his shoulders, and a look as if to say \"what should we do?..\"\nAnd nothing else. I wanted to share this with you. I was wondering if anyone could give a name to this type of specific phenomenon. It reminds me a bit of that scene from Harry Potter, in which he involuntarily makes the glass that separates his cousin from the tub with a python disappear for an instant.", "media": null, "score": 134, "upvote_ratio": 0.94, "comment_count": 20, "over_18": false}, "12": {"id": "16libmf", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Scare_Country", "link_flair_text": null, "time": 1695352198.0806625, "created_utc": 1695001064.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/16libmf/i_was_almost_a_victim_of_a_killer/", "title": "I was almost a victim of a killer.", "selftext": "Over 4 years ago, I went to work at a warehouse in the small town that I'm from. I decided to leave after my health started to get worse physically and I was diagnosed with panic disorder and severe anxiety after the situation that I'm about to tell you. This changed the way that I developed friendships after that job; that's for certain.\nSo, I started this job on April Fools day of 2018 (which was odd to me) and I had no kind of high expectation of the job. All I wanted was to do my job, get paid, and go home as I had two children at home and many things that I could work on there. The job wasn't hard and it made pretty good money for all duties considered so, I really couldn't complain. I worked second shift for about 5 months and I went to dayshift.\nWhile working on second shift, I kept to myself mostly until, one day, I met someone from one of the lines after we struck up a conversation about gaming. For the sake of anonymity, we'll name him JF. Well JF was a pretty good guy and we had a lot of things in common. I went home that night and he popped up as a suggested friend on Facebook (again, another oddity) so, I decided to add him. When I did, we started talking more at work until he suggested that we should hang out so, we did hang out. Pretty frequently.\nWe were friends for a month at this point and one day, he decided that he was going to introduce me to his partner. She seemed decent at first: super nice, didn't seem to be a judgmental type so, I was cool with her. From then on, I would hang out with him when my kids were spending time with my mother. One time, we were talking at a restaurant and he started to vent to me. \"Dude, she's such a bitch sometimes. The other day, I forgot to take the trash out and she threatened to stab me if I didn't. I've never been in a relationship where someone's threatened me but, she's got good intentions, dude.\" When he said that to me, I was concerned but, of course, we had only been friends for a month so, I thought that maybe, he was being morbid jokingly so, I chuckled at him. He gave me a pretty serious look and said, \"I'm not joking. She really did.\" That concerned me.\nFast forward about 8 months: They're still together and we all hang out pretty regularly forgetting the things he told me then. One day, we were all talking and he seemed a little off that day so, I asked him what was wrong in front of her. He flashed a smirk and said, \"Nothing, dude. I'm just a little tired.\" He didn't have his eyes on me though. He had them on her when I asked that. When we went to work the next day, I asked him again. \"Do you promise to keep this between us?\" Of course, I agreed. He said that he was breaking up with her and she went a little crazy. He said that she grabbed her gun and pointed it at him and said, \"If I can't have you then, no one will.\" He said that he diffused the situation and is trying to look for a way out. Not really knowing what to say, I just said, \"You'll figure it out, man. If you need somewhere to go then, you can come stay with me until you get her out of the house.\" \nFast forward to another year: he finally decided to leave her. When he did, she flipped out again. This time, he told her over text. She said that she was going to find him and kill him and he was actually out of work that day with a vacation day. He sent me a text that said, \"Hey, let me know if she comes over to work looking for me.\" That struck me as odd because, I had no idea of the situation that was unfolding. She actually did come to our job and she asked me where he was and I said, \"I have no idea. I thought he was with you and you guys went out of town or something.\" All she did was roll up her window and drive off. I called him and told him that she came by and he called the police about it. They had found her up the road with a loaded gun in the car.\nTwo months later: he decided to talk to her again and when he did, he had something to tell me. When he called me, he asked if I had seen her around and I hadn't. He said, \"I would take some vacation days if I were you.\" Dumbfounded, I asked him why. He said to me, \"Because, she's out of jail and her cousins are in town trying to find the people she has personal vendettas with. You're one of them.\" At that point, I was terrified. I grabbed my kids and went out of town. Took two weeks off of work. Come to find out, that next day, her and her cousins went to the next town over and shot 3 people in an apartment and killed them. I got the news about it the day after it happened. The reason why he knew they were coming after me is because, they made a Facebook Messenger group that he was included in and sent a list of names. Everyone regarded it as spam and decided to disregard the message but he knew what it was. 3 of the names on that list were the people that they shot. The fourth name on that list... was mine. After they found the evidence and he decided to go public about the group and screenshots that he had, they were all charged with first degree murder.\nFrom then on, I was very careful about who I would stick my neck out for because, even though, he knew the context of that list and her intentions, he decided to not inform anyone else on it. Needless to say, we aren't friends anymore and I dodged a bullet. Literally. Sorry for the long post. I felt like it needed context. Stay safe, y'all.", "media": null, "score": 581, "upvote_ratio": 0.97, "comment_count": 36, "over_18": true}, "13": {"id": "16m2lle", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "dannydutch1", "link_flair_text": null, "time": 1695352198.3227174, "created_utc": 1695060294.0, "url": "https://i.redd.it/uz8rdb6i02pb1.jpg", "title": "The preserved body of John Torrington, one of the Franklin expedition mummies left behind after the crew was lost in the Canadian Arctic in 1845.", "selftext": "", "media": null, "score": 249, "upvote_ratio": 1.0, "comment_count": 7, "over_18": true}, "14": {"id": "16do2su", "locked": false, "subreddit": "crimescene", "stickied": false, "category": "Crime", "author": "vaughndag", "link_flair_text": "MURDER", "time": 1695352198.5831854, "created_utc": 1694211414.0, "url": "https://www.reddit.com/r/CrimeScene/comments/16do2su/removed_by_reddit/", "title": "[ Removed by Reddit ]", "selftext": "[ Removed by Reddit on account of violating the content policy. ]", "media": null, "score": 542, "upvote_ratio": 0.98, "comment_count": 52, "over_18": true}, "15": {"id": "16nob39", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "MaceKiller", "link_flair_text": null, "time": 1695352198.7893605, "created_utc": 1695224069.0, "url": "https://www.reddit.com/r/truecreepy/comments/16nob39/a_sub_dedicated_to_videos_of_detailed_gun_fire/", "title": "A sub dedicated to videos of detailed gun fire activities", "selftext": "Hey folks, r/TriggerTalks is where you can find real, unfiltered shootout videos. No glam, just raw footage and genuine discussions about firearm activity. If you're into understanding the serious side of this world, this is the place for you. Come share, learn, and engage with us.", "media": null, "score": 0, "upvote_ratio": 0.36, "comment_count": 1, "over_18": false}, "16": {"id": "16ivjw0", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "CamelIllustrations", "link_flair_text": null, "time": 1695352198.968824, "created_utc": 1694729331.0, "url": "https://www.reddit.com/r/threekings/comments/16ivjw0/how_risky_is_it_to_visit_anneliese_michels_grave/", "title": "How risky is it to visit Anneliese Michel's grave? What protections would you suggest I prepare? Is it risky to visit the graves of people who has association with the demonic in general?", "selftext": "I'm visiting Germany this winter as part of a Euro trip. One of my favorite movies of all time is The Exorcism of Emily Rose  So it should be obvious of how familiar I am with the Anneliese Michel case. To the point I didn't just read the book that by Felicitas Goodman that was used as the primary specific guide for the movie and watched Requiem, the German film treatment of the story, on top of currently reading German articles and books.\nSo this is a definitely on my to-do list. That should while I'm not religious, I'm open enough to believe that demons and other spirits exist so I'm also a bit nervous about visiting her grave. Since in her life she wasn't just associated with the demonic, she was a major magnet for evil entities (if you haven't read her wikipedia article yet, she was possessed by 6 demons simultaneously!), I am wondering if I'd be at a gigantic risk of opening door ways? I legitimately fear ofthe possibility a foul spirit following me home. So people here experienced with the supernatural, do I run the risk getting into trouble with the paranormal? What steps can I take to minimize the risk of an malevolent being getting entangled with me? Like what rituals or ingredients or other things can I prep for this pilgrimage visit?\nAs a bonus question, is visiting the grave sof people who were known to have gotten involved with demonic stuff during their life time a risky proposition to do? Like if I visit Alistair Crowley's grave in England or those of Ed and Lorraine Warren in Connecticut's  Stepney Cemetary, would this potentially be an invitation for an evil spirit's mischief?\nHonestly I'm looking for advice.", "media": null, "score": 3, "upvote_ratio": 0.55, "comment_count": 13, "over_18": false}, "17": {"id": "16n2n6s", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "YerMomsASherpa", "link_flair_text": null, "time": 1695352199.9973364, "created_utc": 1695158047.0, "url": "https://i.redd.it/1e6nwe573apb1.jpg", "title": "Grandpa that you? Mom’s birthday photo shows my grandfather.", "selftext": "The picture on the left is my grandpa. The photo on the right is a picture from my mom’s birthday party. She blew out her candles and said “I wish grandpa was here” and I snapped the picture.", "media": null, "score": 1353, "upvote_ratio": 0.88, "comment_count": 183, "over_18": false}, "18": {"id": "16l4anf", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "_man_of_meme_culture", "link_flair_text": "Glitch Vid", "time": 1695352200.4107938, "created_utc": 1694966197.0, "url": "https://v.redd.it/ba9nlm0q8uob1", "title": "3 persons in same position and same clothes ", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/ba9nlm0q8uob1/DASH_720.mp4?source=fallback", "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/ba9nlm0q8uob1/DASH_96.mp4", "dash_url": "https://v.redd.it/ba9nlm0q8uob1/DASHPlaylist.mpd?a=1697944200%2CYTA2ZjVlYTM4MDdlODE5ZGJkMTA1MDMwZDRiMTkyODc2ZTQ2OWZmODNiMThlYzYyMjZjMDJlZWI3Njc0OTExYQ%3D%3D&v=1&f=sd", "duration": 29, "hls_url": "https://v.redd.it/ba9nlm0q8uob1/HLSPlaylist.m3u8?a=1697944200%2CN2FkMjIwYjkzMGE2ZmJlMmY3NzMzMWVjZjdmOTdjOGI3OTA4YmQ0YzcxNWIzMWU1YjhhZTA2MmNhMTA3ZDdlZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 248, "upvote_ratio": 0.95, "comment_count": 13, "over_18": false}, "19": {"id": "16jhqot", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Hobbitsliketoparty", "link_flair_text": "humor", "time": 1695352201.9723341, "created_utc": 1694794759.0, "url": "https://i.redd.it/mlxi5m2l2gob1.jpg", "title": "Mexican government releases photo of actual Bigfoot body", "selftext": "", "media": null, "score": 1691, "upvote_ratio": 0.96, "comment_count": 163, "over_18": false}, "20": {"id": "16oc7ho", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "veronica_sweet", "link_flair_text": "Question", "time": 1695352203.6611087, "created_utc": 1695291732.0, "url": "https://i.redd.it/0mccqgop4lpb1.jpg", "title": "My grandma once described seeing rats with human faces when visiting a friend in Matamoros, Mexico. Any idea what she could have been referring to? (Random pic from google)", "selftext": "Apparently her friend said they would crawl up on the bed if you weren't careful. Everyone in the area acted like the creatures were normal. I've done a lot of online searches and can't find a single description of any similar animal.", "media": null, "score": 278, "upvote_ratio": 0.95, "comment_count": 82, "over_18": false}, "21": {"id": "16mxoj9", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "RedditCensorss", "link_flair_text": "Flying Humanoid", "time": 1695352203.860717, "created_utc": 1695146069.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/16mxoj9/me_and_my_brother_saw_a_humanoid_figure_in_the/", "title": "Me and my brother saw a humanoid figure in the sky but didn't acknowledge it till after it had passed", "selftext": "I'm in my early 30s now but this happened back when I was a teen and when tvs still had the big back portion to hide all the components. ( just to give some kind of time reference). \nAnyway this happened in a desert city in California, in what used to be a small town but it's grown so much since then. Me and my brother were in my mother's bedroom watching the TV and the TV was right in front of the window so we could see outside. All of a sudden this black humanoid thing came slowly drifting across the sky. The only reason I say it was humanoid is because I could see the shape of its legs and what's crazy is that even though it was in the sky, I could see the human shape it had. Like a man on a jetpack. The weird thing is that once it passed over the house into the distance is when I started to acknowledge what I saw. I didn't know if my brother had seen it to so without explaining anything at all to what I had seen I just turned to him and said \"did you just see that?\" And my brother said\" yeah wtf was that!\". I told him \"it looked like a man in the sky right?\" And he said \"yeah\". \n We never knew what it was only that it looked like a man slowly hovering and moving in the sky. It must have been a pretty tall figure for us to see the human shape it had while in the sky.", "media": null, "score": 247, "upvote_ratio": 0.96, "comment_count": 18, "over_18": false}, "22": {"id": "16jr5xd", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "tron_eclipse", "link_flair_text": null, "time": 1695352205.3202763, "created_utc": 1694817521.0, "url": "https://v.redd.it/jl3r7mkkyhob1", "title": "Think we saw something.", "selftext": "My friend and I go on regular walks at night and our topic of choice is usually paranormal shit. The other night I left him to go gym and he decided to walk back alone and he went the long spooky way and took some pictures as he was walking. We always take pictures of the stars and for our Instagram stories of randoms shit. I think it could just be a person but the silhouette and outline of this shape is really strange. At first we thought it was an animal but after he increased the exposure we could see something. I know it’s 100 percent unedited other than the exposure increase because I saw the original photograph on his phone and the time he took the picture on his iPhone. Any ideas of what it may be and any expert able to give us some tips? Today we went near the area again at night and heard noises as if we were being followed but we were to spooked to go into to the depths of the darkness.", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/jl3r7mkkyhob1/DASH_480.mp4?source=fallback", "height": 854, "width": 428, "scrubber_media_url": "https://v.redd.it/jl3r7mkkyhob1/DASH_96.mp4", "dash_url": "https://v.redd.it/jl3r7mkkyhob1/DASHPlaylist.mpd?a=1697944204%2CNTAzYTNiZTBiNWQ4YmEzNTc3ZjE1NDJjNWM3MWY3NWQ4NWQxOGVlOTRmZDk5MTllMjc5YzdhYjUwZWJmODEzZA%3D%3D&v=1&f=sd", "duration": 17, "hls_url": "https://v.redd.it/jl3r7mkkyhob1/HLSPlaylist.m3u8?a=1697944204%2CMThjZGU5ZmU4MmNkZTJiZjJhMDc5ZDRiNzhlZThlOGFhODkyMGZkODM1OWQ1MjYzMTM0ZDdmYjY0NzQ0NGQ5NQ%3D%3D&v=1&f=sd", "is_gif": true, "transcoding_status": "completed"}}, "score": 2406, "upvote_ratio": 0.97, "comment_count": 243, "over_18": false}, "23": {"id": "16l8k1h", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Splash", "link_flair_text": null, "time": 1695352207.1272752, "created_utc": 1694976174.0, "url": "https://i.redd.it/j0nvz2ga1vob1.png", "title": "Trump posing in front of pyramids with some happy looking humanoid aliens.", "selftext": "", "media": null, "score": 2276, "upvote_ratio": 0.85, "comment_count": 431, "over_18": false}, "24": {"id": "16jf1nh", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "wowwheredyafindthis", "link_flair_text": null, "time": 1695352208.0703897, "created_utc": 1694788425.0, "url": "https://i.redd.it/qjy5ix6vlaob1.jpg", "title": "What do you think this painting that ellen degeneres owns signifys? You cannot find this piece ANYWHERE online other than the 1 or 2 Twitter or reddit posts asking about it. People think it's a basquiat", "selftext": "", "media": null, "score": 4, "upvote_ratio": 0.7, "comment_count": 6, "over_18": false}, "25": {"id": "16kym3t", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "danielyomama", "link_flair_text": null, "time": 1695352209.863436, "created_utc": 1694951199.0, "url": "https://i.redd.it/7p1aoh840tob1.jpg", "title": "What is this?", "selftext": "Saw it yesterday in Heidelberg, Germany around 10 pm", "media": null, "score": 592, "upvote_ratio": 0.88, "comment_count": 266, "over_18": false}, "26": {"id": "16niqxp", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "VerbalCant", "link_flair_text": "Document/Research", "time": 1695352211.5475168, "created_utc": 1695208984.0, "url": "https://www.reddit.com/r/UFOs/comments/16niqxp/im_analyzing_the_alien_mummy_dna_so_you_dont_have/", "title": "I'm analyzing the \"alien mummy\" DNA so you don't have to.", "selftext": "EDIT BELOW\nContext: I'm a data scientist with some molecular biology and bioinformatics experience. I get paid to do data science, but not biology.\nPeru mummies: WTF.\nThere are lots of people talking about the anatomy side of things: the finger bones, the hips, etc. Which is great. The more smart people working on this, the better. I'm definitely not one of the people you want analyzing that.\nBut there were other claims made in that Mexican hearing. Specifically, claims about DNA. And I thought, well, that's something I know how to do. I've been inspired by Avi Loeb's \"we don't need to wait for them, we can do it ourselves\" approach. In that spirit, I'm not going to wait.\nAnother Redditor shared the links to three purported genetic sequences from the mummies. So now I'm going to analyze them and see what they tell us.\nFor those who are used to interacting with computers and having them respond quickly, genomics is a bit of a shock. Individual steps can take hours to run. Over the weekend I had steps that took 13 hours each. I've basically been building and running these pipelines since last week, inspecting the results manually at each step. I hope to have something useful to say about them, and to be able to share both the process and the results.\nI'm still working on data prep, but I'm hoping that's finished by tomorrow (right now it's running the alignments against the reference human genome) and I can start some of the analysis steps.\nScreenshot as a teaser. I'm running all of this locally, not in the cloud, but I'll share my pipeline and make all of the data available to the community.\nEdit 1, 21 Sep: \nOk folks, shout out the mods: the post is staying! I’m an idiot and have just figured out how to edit my post. For some reason i can only do it from my phone. 🤷🏼‍♀️ anyway, technology is great. The big news is: i’m now working with two other members of the sub, /u/Big_Tree_Fall_Hard and /u/flynnston, both PhDs with NGS experience. They’re both crushing it already, and we are now coordinating our work together. \nThere’s a github repo here, but it’s kind of a combination of notes and the commands you can run. I’ll work on cleaning this up.  https://github.com/VerbalCant/peru_mummy_pipeline\nIf you want to know where we are now, tl;dr is that we are running kraken2 and then trying a de novo assembly on the reads that are unaligned to the human genome for samples ancient0002 and ancient0004. we’ve also done some digging into the protocols and results that were posted by the Mexican researchers. I know this is a really technical and quick update, so I promise I’ll come back and explain in a way that’s easy to understand. (Especially if someone can tell me why i can’t figure out how to edit posts in the web interface but i can in the reddit app on my phone. i hate typing on my phone.)\nhttps://preview.redd.it/tbn3axjjaepb1.png?width=3688&format=png&auto=webp&s=6130b2b87dc0994f95ec55dfd046706531fa8e14", "media": null, "score": 5032, "upvote_ratio": 0.82, "comment_count": 1527, "over_18": false}, "27": {"id": "16o1b4n", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Streay", "link_flair_text": "Image 📷", "time": 1695352214.0058558, "created_utc": 1695255951.0, "url": "https://www.reddit.com/gallery/16o1b4n", "title": "Tomb Raiders alleged photos in the Nazca Caves", "selftext": "", "media": null, "score": 11840, "upvote_ratio": 0.69, "comment_count": 4188, "over_18": false}, "28": {"id": "16lj6fv", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "QElonMuscovite", "link_flair_text": null, "time": 1695352214.708641, "created_utc": 1695003517.0, "url": "https://www.reddit.com/r/UAP/comments/16lj6fv/possible_alien_signatures_found_on_k218b/", "title": "Possible Alien signatures found on K2-18b", "selftext": "Still confirming initial positive data.\nBio-signatures on K2-18b, waterplanet, in goldilocks zone.\nOnce (if) it is confirmed, this would add validity to the Drake equasion and put aside the nonsensical \"What if we alone\" line of thinking.\nhttps://www.youtube.com/watch?v=iC95VzD7ALs\n124 Light-years away. Not that far, even for our current tech in a chemical generation ship.", "media": null, "score": 98, "upvote_ratio": 0.83, "comment_count": 77, "over_18": false}, "29": {"id": "16mcfpk", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "stygeanhugh", "link_flair_text": "Murder", "time": 1695352215.4072168, "created_utc": 1695083690.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16mcfpk/delphi_update_suspect_claims_ritual_sacrifice/", "title": "Delphi Update. Suspect claims \"ritual sacrifice.\"", "selftext": "I shared this in another sub, but thought an updated was warranted here as well, although it's primarily considered a solved case. \nLibby and Abby were two young, bright, teens with their whole lives a head of them, tragically murdered on a popular walking trail in Delphi Indiana. Their case was all but cold for a while until a suspect was finally identified and detained. \nThe suspect in custody for the murder of the two girls claims they were sacrificed by pagans practicing Odinism. Furthermore, his defence is seeking to have evidence obtained during the search of the defendants home to be thrown out.\nAmong other claims, documents point to 4 other people involved in the crime whom have not been named by police, including the father of a son said to be dating one of the girls, as well as physical evidence; \"runes\" fashioned from sticks near the bodies and the letter \"F\" painted in blood on a tree. The defence team claims an \"Odin\" report, penned by an Indiana State Police Officer was ignored during the course of the investigation. Their primary piece of evidence against the suspect appears to be an unfired bullet found at the scene linked to a gun found in his home. \nThe article goes on to mention the the defendant, Richard Allen, has deteriorated mentally and physically during his incarceration, while pointing to mistreatment by guards and staff. \nhttps://www.wlfi.com/news/delphi-double-homicide-attorneys-say-victims-were-ritualistically-sacrificed/article_4da14f56-5620-11ee-8f5c-dfde21b1927e.html", "media": null, "score": 808, "upvote_ratio": 0.96, "comment_count": 703, "over_18": false}, "30": {"id": "16k0i1u", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "LadyRed6", "link_flair_text": null, "time": 1695352216.0664957, "created_utc": 1694846787.0, "url": "https://www.reddit.com/gallery/16k0i1u", "title": "Victims in WTC rubble", "selftext": "Pictures labeled and zoomed in to show picture details. Never Forget the evil that took almost 3,000 innocent lives that day. An evil act that is still claiming victims to this day.", "media": null, "score": 3415, "upvote_ratio": 0.95, "comment_count": 176, "over_18": true}, "31": {"id": "16kqvfc", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "jessicamshannon", "link_flair_text": null, "time": 1695352216.2703035, "created_utc": 1694923071.0, "url": "https://i.redd.it/l6yc0nrhoqob1.jpg", "title": "Doctors bow to honor a 17 year old organ donor. Her untimely death saved several lives and allowed someone to see again.", "selftext": "I found this on r/medizzy and the picture really moved me. If you are a U.S. cirizen and you haven't signed up to be an organ donor, here's how you can remedy that. I also encourage you to sign up to donate bone marrow through Be The Match. There's an outdated belief that bone marrow donation is painful. It used to be, but that is no longer the case. You could literally save a life. Don't wait to sign up. \nHere's the google translate version of the article on the young woman in the picture.\n https://www.chinadaily.com.cn/china/2012-11/23/content_15952137.htm\nBy ZHENG CAIXIONG in Guangzhou (China Daily)\nUpdated: 2012-11-23 01:52\nA 17-year-old girl's liver, two kidneys and two corneas were transplanted after her death to save others' lives at the General Hospital of Guangzhou Military Command in Guangdong province on Thursday evening.\nThe liver surgery was jointly conducted by Huang Jiefu, vice-minister of health, and Huo Feng, a senior surgeon at the hospital.\nWu Huajing, the organ donor, was a student from Shaoguan College of Medical Science. She had been in critical condition since she was seriously injured in a traffic accident in Shaoguan on November 9. Wu was declared dead on Wednesday afternoon. Her organs were removed on Thursday afternoon.\nBefore she died, Wu told her parents of her wish to donate her organs to help others and repay society.\n\"Wu's liver was successfully transplanted to a 41-year-old man from a local property management company. The man has had liver cancer for years and has been in very poor condition\", Huo Feng said at a news conference on Thursday night.\nBut Huo did not reveal details of the patients who received Wu's kidneys and corneas.\nVice-Minister Huang said he was deeply moved by Wu's gift.\n\"I think Wu would have been happy if she had known her organs have helped save others' lives,\" Huang said.\nOn Wednesday morning, Huang also acted as the operating surgeon for a 52-year-old woman surnamed Zhang who donated her liver, kidneys and corneas after she died of cerebral hemorrhage in Guangzhou.\nZhang's liver was transplanted to a man of a similar age. The man who had cirrhosis of the liver and liver cancer has waited for a liver transplant for more than two months.\nZhang's two kidneys were transplanted to another man and a woman, both in their 30s, who had urinaemia and had been on the hospital's waiting list for kidney transplants for many years.\nZhang's corneas were transplanted to a 5-month-old child from Zhuhai and a 65-year-old man from Shenzhen.\n\"Zhang's donation has helped save three lives and helped another two people recover their sight,\" Huang told media after the operations at the No 3 Hospital Affiliated to Sun Yat-sen University in Guangzhou on Wednesday.\nHuang said he paid homage the organ donor Zhang before starting the transplant operation.\nHuang is a well-known expert in liver transplants.\nChina has become the second-largest country in terms of organ transplants, Huang said.\nSince the country introduced a posthumous organ donation system in March 2010, China has completed organ transplant surgeries for 465 organ donors in 38 designated hospitals across the nation from March 2, 2010, to September 30.\nThe system was jointly implemented by the Red Cross Society of China and the Ministry of Health. It is aimed at encouraging more people to donate their organs after death to help people in need.\nA total of 1,279 organs have been donated for life-saving purposes in the past two and a half years, Huang said. Of the organ donors, more than 120 came from Guangdong.\nChina's reliance on organ transplants from condemned prisoners will end within two years as the donation system is proving successful, Huang said.", "media": null, "score": 48, "upvote_ratio": 0.93, "comment_count": 2, "over_18": true}, "32": {"id": "16lyddb", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "wetpipedreams", "link_flair_text": null, "time": 1695352216.4858112, "created_utc": 1695050369.0, "url": "https://www.reddit.com/r/UrbanMyths/comments/16lyddb/that_time_the_queen_kidnapped_10_native_children/", "title": "That time the Queen kidnapped 10 Native children and they were never heard or seen from ever again.", "selftext": "One quick Google search will turn up results from sources such as Reuters, usatoday or even Snopes stating that such an event never happened and that all claims stating as such are \"obviously\" false however to the trained eye who knows to look a little deeper past these publicity fronts used to brainwash the masses and convice them of their own \"truth\", a deeper, more sinister story lies in wait.\nThe day is October 10th, 1964. The location, a residential school located in Kamloops, Canada about a 5 hr drive from the American border. The Queen and Prince Philip had decided to come pay a visit to the lands first generational, youthful inhabitants for reasons to this day still unbeknownst. I introduce to you the only surviving member of a group of 3 boys who claim to have bare witnessed to the abduction of about 10 children whos grieving parents to this day still have no knowledge as to what became of them. William Coombes recounted that said group of 10 children were amoung the brightest in their classes and had left with the Queen and Prince Phillip on a \"Picnic\". \"In October, 1964 when I was 12 years old, I was an inmate at the Kamloops school and we were visited by the Queen of England and Prince Phillip. I remember it was strange because they came by themselves, no big fanfare or nothing. But I recognized them and the school principal told us it was the Queen and we all got given new clothes and good food for the first time in months the day before she arrived.The day the Queen got to the school, I was part of a group of kids that went on a picnic with her and her husband and some of the priests, down to a meadow near Dead Man’s Creek. I remember it was weird because we all had to bend down and kiss her foot, a white laced boot.After awhile, I saw the Queen leave the picnic with ten children from the school, and those kids never returned. We never heard anything more about them and never met them again even when we were older. They were all from around there but they all vanished.The group that disappeared was seven boys and three girls, in age from six to fourteen years old. They were all from the smart group in class. Two of the boys were brothers and they were Metis from Quesnel. Their last name was Arnuse or Arnold. I don’t remember the others, just an occasional first name like Cecilia and there was an Edward.What happened was also witnessed by my friend George Adolph, who was 11 years old at the time and a student there too. But he's dead now.\".\nWilliams was subject to multiple forms of abuse during his time at the school that included being tied down to a wooden rack where he had been physically assaulted by one of the Male members whos name was Brother Murphy of the Church who worked as staff at the time. In addition to this, Williams also stated to have seen the same male staff throw an eight year old girl to her death from a balcony aswell as bury another with another priest in the schools orchard late one night. Why am I including all of these extra details you may ask? It is indisputable that such horrors and tragedies occured at the Kamloops residential school as a mass grave site filled with children was just uncovered in recent years, what would it be for a group of 10 children to go missing and vanish into thin air\nFast forward now to 2013, An international court located in Brussels (ICLCJ) found Queen Elizabeth and Prince Phillip guilty for the disaperance of 10 native children from the catholic residential school in Kamloops B.C. The arrest warrant issued by six judges of the international common law court of Justice in Brussels had been issued however Canadian courts refused to her the case. From what I have been able to dig up, nothing ever became of that arrest warrant so I dont know how much weight this court in brussels held however I am sure arresting the Queen regardless of who indicts her isnt as easy as it sounds as far as an arrest process goes. So, what ever happened to William you might ask? He died suddenly in hospital shortly before he was to go public about the abduction and disapperance of his school mates. He was aged 59 and in good health, scheduled to be a primary witness at the opening session of the international Tribunal into Crimes of the Church and State on September 12th in London, England. A source close to William claimed that he had gone to the hospital and while there underwent \"testing\" despite the fact that William had always been of sound health and never had any adverse health events in his past. During this testing, Williams health began to deteriorate, \"I last saw William ten days ago, on the eve of my departure for a European speaking tour, and he looked better than i had seen him in years\" according to his partner Mae. His cause of death remains undisclosed. The vancouver coroners office refuses to comment on Williams death. The Kamloops school was closed in 1977 and the parents of the missing children have to this day been prevented from taking any such legal action in the court of law, all but being dismissed and from what i can tell, this was the reasoning for such matters to be brought to the attention of the international common law court in Brussels.\nKevin Annett is the name of the man who set out the \"Prima facie\" evidence for Queen Elizabeth and Prince Phillips personal involvement in the disapperance of the 10 native children who were abducted between the dates of October 5th-13th never to be seen or heard from again. Since 2008, Queen Elizabeth and the Canadian government have continuously denied requests by the ITCCS'S for excavation even though a mass grave site has been discovered moreso recently in the last few years.\nNow, with that being said regardless of wether or not you believe this event ever took place, you can be the judge of that but one irrefutable fact is that this school in Kamloops was one of over 130 schools of its kind operating in Canada between 1874 and 1977 with the last residential school all but having been closed in 1997 (Who was in charge of said school and why it was allowed to stay open is still a hot topic up for debate). This time in Canadas history portrays a very dark reality where Native children effectively had their identitys stripped away in an attempt to assimilate them to the ways of the Catholic church. Sexual, Physical, Emotional and Psychological abuse went on rampant for over a hundred years unchecked and the effects of these schools can still be seen in our countries native identifying members to this day. So with that being said, what are we thinking? Adrenochrome harvesting? Satanic rituals involving Child Sacrafice? Id love to know what you think in the comments.\nEdit: People are having a meltdown in the comments over a brief oversight I had when stating that this event happened when the Queen came to visit during the 100th anniversary of confederation which took place in 1967 and not when the events of said abduction of 10 native children took place in October of 1964. I have removed the line \"The Queen and Prince Philip had come to visit Canada to celebrate the 100th anniversary of Confederation\" and nothing more. Thanks!\n\"Source?.\" ---\nhttps://www.thestudentroom.co.uk/showthread.php?t=1669764\nhttps://westminsterorangeville.ca/kjs/1964-kamloops-residential-school-queen-elizabeth", "media": null, "score": 8, "upvote_ratio": 0.62, "comment_count": 15, "over_18": true}, "33": {"id": "16lqujh", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Low-Structure-6073", "link_flair_text": "Askreddit etc", "time": 1695352216.6916578, "created_utc": 1695029657.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/16lqujh/woman_appeared_in_the_middle_of_the_road/", "title": "Woman appeared in the middle of the road", "selftext": "When I was 12, my mother was driving me to the train station before school, at around 7am. Clear as day, in the middle of the road, I saw a slender woman dressed in a white gown, with long dark hair. I yelled out to my mother to stop as I was worried she would hit her. My mother didn't stop, and the woman just vanished. I asked my mother if she had saw the woman, and she didn't. \nIt's been 8 years now and I still remember the woman clearly. I never had an experience like this since. Any thoughts?", "media": null, "score": 74, "upvote_ratio": 0.97, "comment_count": 16, "over_18": false}, "34": {"id": "16kmu4f", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Reddit-892", "link_flair_text": null, "time": 1695352216.90082, "created_utc": 1694910658.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/16kmu4f/i_thought_i_was_alone_so_i_tried_to_sleep_i_was/", "title": "I thought I was alone so I tried to sleep. I was wrong.", "selftext": "This story is something that I think about from time to time and it creeps me out. So I am writing this to get it off my chest so anyways lets begin.\nTwo almost three years ago I was seventeen years old at this point I was accustomed to being in horrible situations, as all I had was my mother and she could not hold down a job for long because she had her own issues to tackle and so as I grew up we stayed in and out of roommates houses. We never really had our own place to stay except twice but that didn't last long either and we would be forced into a new environment with a snap of a finger. So when I was 17 we are lead into a situation where we are going to be homeless again and I was used to it at this point as I had slept in the street more than I'd like. The day comes when we have to leave our roommates house and my mom is able to stay at her boyfriends trailer. I had nowhere to go as I had no friends at this point as I halted my friendships because they were bad for my health and mental state and overall were toxic. My mom offered me to go with her but I didn't want to as I felt like getting between my Mom and her boyfriend was kind of weird plus I'm used to the street and I didn't think it was as bad as it was at the time.\nSo here we are I get dropped of at a McDonalds and I eat some burgers before I go off into the streets once more. Eventually the sun fled and darkness was all that remained and so I look for a place to sleep for the night. I went into many places that night trying to sleep but none of them were working because it was either too hot or the lights were too bright or the mosquitos were biting me. That's when I remember a house that I used to go into to chill in, this house was under construction and nearly finished so the doors all shut and the windows were all settled so there were no Mosquitos. I go through the back like always and I make my way upstairs. Eventually I settle in the bathroom because there is less debris on the floor. \nSo I lay there and I try to sleep. Eventually I hear some sounds down stairs but I didn't think anything of it. I figured it was the door that I came through swinging open and close or something.  Eventually after laying there for maybe a hour I open up my phone and I look at old photos of my life thinking about how messed up it was that I got to this point and how I lost everything. The noises were still happening this entire time but I paid no mind to it. Eventually for whatever reason I get up and I go to sit down on the back porch because I just couldn't sleep. \nI make my way down stairs and out the back door to the porch. I am messing around on my phone for maybe 5 minutes when it happens. I see movement to my left from the back door I just exited from. I glance over and time itself freezes. At first I think that it's a illusion but I was in fact wrong. I see a man shrouded in darkness peering past the wall inside to gaze at me. \nHis lower half of his figure was behind the wall entirely and I could not see anything but his upper body. The rest of his body has leaning to the left peaking behind this wall almost like the man was trying not to let me see his full body as it would make his presents known. The man was a pure black silhouette and I could not make out any features. After noticing him I just sat there and stared at him for what seemed like forever but was probably a minute or two. I expected him to come outside and talk to me because I normally talked to a lot of homeless people and I thought the man was just homeless.  He didn't come outside though, he had not moved at all actually. \nHe was as still as a statue, quiet as a mouse, maybe if I had not noticed him he would have stared at me the entire time. I eventually after staring at him got up and got my bicycle and made my way out of the property. As I am walking out of the backyard I peer into the window that is next to the door I saw the man in. The moonlight revealed the man was still there only now he was watching me walk out of the property. I could tell because the moonlight revealed the top of the mans head and I saw his left eye gazing at me. He was a white male who was very tall and had a jacket of some kind on. \nI could not make out many details because he was still cloaked in darkness. After seeing this I just move a little faster out of there. I got to the front of the house on the street and I looked inside to see if I could see him again. I could not. I got on my bicycle and waved goodbye to the house because I figured the man was still watching me. Then I drove away. For the rest of the night I could not sleep. I tried two different spots but both were no luck.\nThis is where the story ends I know I didn't have a crazy chase or fight to the death or anything but this was real life and its not the same as the movies or books. I don't know what the man was doing in there, I assume he was trying to sleep like I was but the way he was staring on me was very unnerving. It makes me wonder how long the man was in the house for and what would have happened if I actually fell asleep in the house. Would he have stared at me while I was asleep completely blinded to his presents? Or did he have other intentions? I will never know but now I don't go into houses like that anymore at all after this experience.\nSo, to the man shrouded in darkness, lets not meet again.\n​\nEdit 09/18/2023: Upon request I spaced out the block of text into paragraphs.", "media": null, "score": 131, "upvote_ratio": 0.96, "comment_count": 14, "over_18": true}, "35": {"id": "16k6cke", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "dannydutch1", "link_flair_text": null, "time": 1695352217.6295564, "created_utc": 1694867296.0, "url": "https://www.dannydutch.com/post/the-mad-monk-that-burnt-2000-people-at-the-stake", "title": "A frail 78-year-old Dominican monk died on this day in 1498...and thousands of people rejoiced. His name was Tomás de Torquemada and he was the first Grand Inquisitor of the Spanish Inquisition who was reportedly responsible for the deaths of 2,000 people", "selftext": "", "media": null, "score": 27, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "36": {"id": "16o763d", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Wiindigo", "link_flair_text": null, "time": 1695352219.040953, "created_utc": 1695273281.0, "url": "https://www.youtube.com/shorts/cUhxfMQwlCk", "title": "VID61748.MP4", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.24, "comment_count": 0, "over_18": false}, "37": {"id": "16mc061", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "spacebootyhunter", "link_flair_text": null, "time": 1695352222.0945818, "created_utc": 1695082542.0, "url": "https://i.redd.it/k59ivh9ou3pb1.jpg", "title": "This is my family’s infamous ghost photo", "selftext": "This picture is from sometime between the mid 80s to the very early 90s. I don’t have a scanner but I tried to keep the focus clear. \nFor added clarity, that is a glass door behind my uncle (rest in peace) that leads to my house’s garden which was empty at the time of the photo. I actually still live here and i find it interesting that this picture always gets lost no matter how meticulous we are in trying to keep track of it. Then again, could just be nothing. \nJust wanted to share!", "media": null, "score": 1001, "upvote_ratio": 0.88, "comment_count": 136, "over_18": false}, "38": {"id": "16md73r", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "OP_S99", "link_flair_text": "Glitch Pic", "time": 1695352223.5487075, "created_utc": 1695085781.0, "url": "https://i.redd.it/avusuiz844pb1.png", "title": "Obey", "selftext": "", "media": null, "score": 174, "upvote_ratio": 0.86, "comment_count": 21, "over_18": false}, "39": {"id": "16ma24o", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "kargethdownload", "link_flair_text": "photo", "time": 1695352224.8245454, "created_utc": 1695077531.0, "url": "https://www.reddit.com/gallery/16ma24o", "title": "the greatest bigfoot photos in my opinion", "selftext": "", "media": null, "score": 596, "upvote_ratio": 0.91, "comment_count": 185, "over_18": false}, "40": {"id": "16jf0hc", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1695352226.1060324, "created_utc": 1694788346.0, "url": "https://i.redd.it/gfx81njtjfob1.jpg", "title": "In 1928 Robert Aiken was stationed at Pearl Harbor in Hawaii when he saw a group of 40 foot (12m) long octopuses off the coast. All known octopuses in the region only grow to about half the length of the sighting. They were later sighted in 1950", "selftext": "", "media": null, "score": 204, "upvote_ratio": 0.98, "comment_count": 25, "over_18": false}, "41": {"id": "16jknzp", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "RelevantConsequence5", "link_flair_text": "Strange", "time": 1695352226.3026514, "created_utc": 1694801829.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/16jknzp/encounter_in_woods_seeking_answers/", "title": "Encounter in woods, seeking answers?", "selftext": "Location/Time : Sharpsburg, GA, United States\n (fall of 2008)\nSo, I am 19 (F) and this happened to me when I was ab 4/5 yrs old. I was with my older brother who was about 11/12 at the time. Most of the people in my life like friends/family, pretty much know ab this story as well. I think about this event a lot, probably everyday. This event has for sure left me very paranoid, esp around the woods. Yet, I am still pretty curious about it at the same time. \nAnyways, one morning my brother and I were heading to the car for school. It was still a bit dark outside, but you could see the sun coming up. I remember the sky having a sort of greenish tint. \nWe typically don’t use the front door ever, and usually just use the side door to the house. We have one large storm door, and then your typical glass door on the outside of it. \nAs we are heading to go outside, I reach for the handle and my brother stops me mid reach, and pulls me away from the door. (he can see outside as the door is glass). At the time, my house was also completely surrounded by woods. You cannot see it from the street either. \nMy brother points to what he sees and as I remember, it was incredibly tall. I was ofc very small at the time so you’d think oh maybe it just appeared larger to us bc we were kids. But I swear this shit was like 7 foot tall. \nThis thing looked almost solid white/grey and it had what looked like 3 dark circles or holes going down it’s body. We knew this thing was abnormally tall because of how slow and big it’s strides were. It almost looked like slow motion in a way. It was also just body and 2 legs. that’s all it looked like. I’m not even sure if there was a face or a head. It was walking at the edge of our woods and it seemed to be heading to the back yard. sorta minding its own business ig. \nI don’t have any memory of what happened after, but my mom has always said that right after it happened, we ran to her and my dad crying and panicked. She said she separated us and asked us separately what happened. We both described the same thing and told the same story. My mom said it freaked her out pretty bad as well. \nI remember my brother and I tried to guess what we saw and all we could think was that maybe it was a dying animal walking. Because it could have been bone that we saw. But, I remember it wasn’t limping or dragging any skin or anything. It was walking perfectly straight and upright. \nA few years after, we started hearing this horrible screaming at night. I know there’s foxes, owls, and all that other stuff that screams lol. But, this thing would run around the house. Like circle around the house in the middle of the night on and on. I would hear it in my sleep and it would make me have horrible nightmares of my family being eaten. This happened for a short period of time. My dad had finally had enough and he got a permit to shoot and take out whatever it was. As soon as he got the permit, it quit. Never heard that thing again and we have lived here for 13 years. \nI’m not sure if it’s related, but i struggled with terrible sleep paralysis for a few years and it was only at this house. I would wake up, unable to move and would have a man or woman screaming into my ear. I would finally be able to move and instantly cry bc of fear and ACTUAL pain in my ear. I would also sometimes be paralyzed and then feel my body going up. My body wasn’t going up , but i was? Whenever this would happen I would be fully conscious and aware. I could hear myself in my head and i just kept saying “ PUT ME DOWN . PUT ME DOWN IM NOT GOING UP “. and i would slowly go back down, but it would always take so long it felt like. \nThis used to scare me to the point that I was afraid to even fall asleep. Eventually, I talked to a few different mediums and they gave advice that helped. Anyways, I could go way more into that topic but that’s not what this post is about. I have a few true experiences with the supernatural/spiritual and I will prob post them on here as well. \nOverall, I am hoping someone could give some useful insight on this situation. Maybe it isn’t what I think it is and someone else has a better answer. \nMy heart rate has been going bonkers while typing this.", "media": null, "score": 78, "upvote_ratio": 0.95, "comment_count": 18, "over_18": false}, "42": {"id": "16m9bvv", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Stinkydadman", "link_flair_text": null, "time": 1695352227.3989103, "created_utc": 1695075766.0, "url": "https://i.redd.it/168h298ja3pb1.jpg", "title": "Bigfoot in Richmond VA ??", "selftext": "I saw this bumper sticker on a car in downtown Richmond. It’s the first Bigfoot sighting I’ve ever seen in the area.", "media": null, "score": 150, "upvote_ratio": 0.94, "comment_count": 9, "over_18": true}, "43": {"id": "16jldag", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "PepeLives00", "link_flair_text": null, "time": 1695352229.382951, "created_utc": 1694803552.0, "url": "https://i.imgur.com/OFpV6wS.jpg", "title": "So close to being self aware…..", "selftext": "", "media": null, "score": 1845, "upvote_ratio": 0.85, "comment_count": 540, "over_18": false}, "44": {"id": "16jjro5", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1695352230.2459977, "created_utc": 1694799610.0, "url": "https://i.redd.it/ilr43dilggob1.jpg", "title": "Do People Like You More When You Are Fake as Compared to Being Real? (Full Episode: https://youtube.com/live/62cNebuYpcM)", "selftext": "", "media": null, "score": 3, "upvote_ratio": 0.81, "comment_count": 1, "over_18": false}, "45": {"id": "16mv8mb", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Nightshade09", "link_flair_text": "Mainstream Media", "time": 1695352232.0826218, "created_utc": 1695140109.0, "url": "https://www.msn.com/en-us/news/other/doctors-x-ray-alien-corpses-and-find-no-evidence-of-assembly-or-manipulation/vi-AA1gVWOc?cvid=6d315671f32e40e48aa09d0d38f076fa&ei=25", "title": "Doctors x-ray 'alien corpses' and find 'no evidence of assembly or manipulation' | Watch", "selftext": "", "media": null, "score": 485, "upvote_ratio": 0.81, "comment_count": 378, "over_18": false}, "46": {"id": "16mqqnq", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "kenriko", "link_flair_text": "Classic Case", "time": 1695352233.9463215, "created_utc": 1695129336.0, "url": "https://v.redd.it/lcef87ysp7pb1", "title": "Does anyone have more information on this video?", "selftext": "Submission statement: \nI found this clip in a old video on daily motion about daylight sightings of UFOs in Europe. \nIn this particular clip the narrator just claimed that it was shot in Italy 🇮🇹 with no further context. \nDoes anyone know the origin of this case? Who shot the video, did people attempt to debunk it? ", "media": {"reddit_video": {"bitrate_kbps": 450, "fallback_url": "https://v.redd.it/lcef87ysp7pb1/DASH_270.mp4?source=fallback", "height": 270, "width": 360, "scrubber_media_url": "https://v.redd.it/lcef87ysp7pb1/DASH_96.mp4", "dash_url": "https://v.redd.it/lcef87ysp7pb1/DASHPlaylist.mpd?a=1697944232%2CNWUyOGE5OGRkNDA2MGQ5ZTI5YjcyYjA4NDA1ZDk5OTZhNDA1NDNjYzFkZmY1NDNmYWUxZDMwMTA1MjRhOTFmZg%3D%3D&v=1&f=sd", "duration": 44, "hls_url": "https://v.redd.it/lcef87ysp7pb1/HLSPlaylist.m3u8?a=1697944232%2CYzc5NjYzYmQ0NTk5MzNhOWVkOTljOWFkNTBiNmZiZDI2ZTc5NjFiOWRkMzQxYWRhYmE1ODE3ZDg4MTNjMDViOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3221, "upvote_ratio": 0.76, "comment_count": 1236, "over_18": false}, "47": {"id": "16ktqd9", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "imaginexus", "link_flair_text": "Evidence :upvote:", "time": 1695352235.883392, "created_utc": 1694933426.0, "url": "https://v.redd.it/p2moi79hirob1", "title": "CT-scan of “Josefina”", "selftext": "Source: https://www.the-alien-project.com/en/nasca-mummies-josefina/", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/p2moi79hirob1/DASH_720.mp4?source=fallback", "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/p2moi79hirob1/DASH_96.mp4", "dash_url": "https://v.redd.it/p2moi79hirob1/DASHPlaylist.mpd?a=1697944234%2CMGU4MWIzNzllODdmOTkwZWI5YTgzYmJmOTBmYzFlY2I4NjVmYWU1ZGMzMDg1YTM3YjZiZmI3Yjc4OTUxNjA0MA%3D%3D&v=1&f=sd", "duration": 136, "hls_url": "https://v.redd.it/p2moi79hirob1/HLSPlaylist.m3u8?a=1697944234%2CNmEyMmZlYjMxZjEwYWU4NjA2ZGIxMjhlNDg0ZWZjNmNkNjEwOGVlMTE5YmFkNjRjN2JlNGFiY2YxNDljY2VjNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2473, "upvote_ratio": 0.73, "comment_count": 1580, "over_18": false}, "48": {"id": "16jooq3", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Discussion", "time": 1695352236.410834, "created_utc": 1694811552.0, "url": "https://x.com/RepTimBurchett/status/1702781241827708982?s=20", "title": "[Rep. Tim Burchett] Look at the bottom paragraph. The IC IG office did nothing to look into the information they received from David Grusch on UAP crash retrieval programs? They have no information they can give to Congress??? Cover-up.", "selftext": "", "media": null, "score": 87, "upvote_ratio": 0.91, "comment_count": 18, "over_18": false}, "49": {"id": "16n6gzr", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "Speckled_Milk", "link_flair_text": "Murder", "time": 1695352237.1238637, "created_utc": 1695168047.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16n6gzr/republican_press_secretary_found_naked_and/", "title": "Republican Press Secretary Found Naked and Stabbed to Death in 1986, still unsolved.", "selftext": "35-year-old Sally Swisher Heet, the press secretary for then-Senator Daniel J. Evans, was found naked and stabbed to death at her apartment on Capitol Hill on Thursday morning, April 17th, 1986.\nHeet was last seen alive the previous evening about 8:30pm leaving the Senate Office Building in Washington DC and was found deceased by her stepbrother and a member of Senator Evans’ staff Thursday morning about 10:30 after she failed to show up for a press meeting.\nIt’s believed Ms. Heet was killed sometime Wednesday evening but neighbors didn’t report hearing anything unusual. Her mailbox in the lobby was found open with her mail still inside and her apartment didn’t show any other signs of a struggle.\nPolice were unable to produce any viable suspects or motives for her murder and her case remains #unsolved to this day.", "media": null, "score": 794, "upvote_ratio": 0.97, "comment_count": 104, "over_18": false}, "50": {"id": "16lcrch", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "Thedrunkenmastertyle", "link_flair_text": null, "time": 1695352237.6263824, "created_utc": 1694986165.0, "url": "https://www.reddit.com/gallery/16lcrch", "title": "Photos of war crimes by Arkan's Tigers in the city of Bijeljina during the War in Bosnia (1992-1995).", "selftext": "", "media": null, "score": 3368, "upvote_ratio": 0.98, "comment_count": 128, "over_18": true}, "51": {"id": "16n12x3", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "jessicamshannon", "link_flair_text": null, "time": 1695352237.8091855, "created_utc": 1695154360.0, "url": "https://reddit.com/r/AskMiddleEast/s/E87eVempRO", "title": "Bodies scatter the roads after Hurricane Daniel in Libya", "selftext": "", "media": null, "score": 11, "upvote_ratio": 0.71, "comment_count": 0, "over_18": true}, "52": {"id": "16owr5q", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "PrettyGreenEyes93", "link_flair_text": null, "time": 1695352238.4107077, "created_utc": 1695344120.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/16owr5q/the_stranger_inside_my_house_when_i_was_a_child/", "title": "The stranger inside my house when I was a child.", "selftext": "I grew up with my dad and brother, my mum died when I was 10. I was 13 at this point and my brother was 16 and was out with friends. \nI used to go out until late at night drinking on the park with friends. My dad was an alcoholic and always too drunk to know if I was at home or not, I had free reign and no rules or boundaries. My dad used to invite random alcoholic/drug using strangers into the house. Often, when I came home, these strangers and my dad would be passed out/asleep from too much alcohol. Or they would barely notice I was there and I’d go straight to my room. \nOne day I’d come back from being out with friends. It was the early hours. I walked through the living room to go upstairs to my room and my dad was asleep on the armchair. The guy he’d brought back was around mid 50s, I didn’t recognise him. He looked at me and something was off about him. He smiled and stared and tried to start a conversation with me but I was keen to get to my bedroom. \nI went upstairs and got my pyjamas on for bed and then dashed to use the bathroom. As I was walking to the bathroom, he said to me, “You look nice in those pyjamas” and he was smiling at me and creeping me out. I went back to my room instead of using the bathroom and I shut the door behind me. I had a lock on my bedroom door and I used that. He was then trying to open my bedroom door and I was so scared because I knew something was off and that he had bad intentions. I dragged my bed across my room to block the door for in case he barged it open and broke the lock. He’s knocking on the door, “I’m just trying to say hello, don’t be so rude, open the door”. I’m not responding. I’m shaking. I’m frightened to death. \nThe bed is blocking the door and it’s still locked and I can hear him pushing against the door, trying to get inside. \nI open my bedroom window and I scream again and again, “HELP! HELP! PLEASE!” at the top of my lungs. \nWhat I later found out was that my neighbour heard me and, knowing my dad was an alcoholic, was assuming something had happened to him. He came round. Must have seen that my dad is asleep. He comes up to my room and he’s knocking to get in and I can hear his voice, a voice of safety. Although I trusted my neighbour, I’m so shook up that I’m now just sat in the corner of my room in a ball crying and shaking and panicked. He knocks the door open and is pushing it open against the weight of the bed. He came in and checked on me assuming I must be hurt. He just holds me whilst I compose myself and try and explain what has happened. The man is gone. But I knew he could come back anytime in the future. \nThis was the final straw for social services and that’s the night I ended up in the care system.", "media": null, "score": 30, "upvote_ratio": 1.0, "comment_count": 3, "over_18": true}, "53": {"id": "16kvt7y", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "GeneralDavis87", "link_flair_text": null, "time": 1695352239.124518, "created_utc": 1694941496.0, "url": "https://youtu.be/__A3YyHL2Q4?si=qb5fkxo48gZjPmQT", "title": "1st Marine Division in Action at Bunker Hill North Korea", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "1st Marine Division in Action at Bunker Hill North Korea", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/__A3YyHL2Q4?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"1st Marine Division in Action at Bunker Hill North Korea\"></iframe>", "author_name": "The Federal File", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/__A3YyHL2Q4/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@TheFederalFile"}}, "score": 8, "upvote_ratio": 0.91, "comment_count": 0, "over_18": false}, "54": {"id": "16lh2tb", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Moist-Customer-1953", "link_flair_text": null, "time": 1695352243.6634862, "created_utc": 1694997477.0, "url": "https://www.reddit.com/r/Ghosts/comments/16lh2tb/toddler_says_shes_seeing_ghosts_after_an_accident/", "title": "Toddler says she’s seeing ghosts after an accident", "selftext": "I’m not sure if this is the right place to post, we’ve recently been in a car accident it was pretty knarly but we are all okay. My daughter 2.5 years old sustained an injury, and thankfully is okay. It’s been a few weeks, now she is saying that she sees ghosts. It is random usually she’ll point and say “ghost!” Sometimes she’s happy to see them, sometimes it’s a scary ghost. Has anyone else had something like this happen? Maybe it is a result of her injury but I’m just interested if anyone has had something similar happen", "media": null, "score": 532, "upvote_ratio": 0.94, "comment_count": 161, "over_18": false}, "55": {"id": "16k5dg0", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "GaminGoNEON", "link_flair_text": "Glitch Pic", "time": 1695352245.070955, "created_utc": 1694864371.0, "url": "https://i.redd.it/d531eivxtlob1.jpg", "title": "devs please fix this rendering issue", "selftext": "", "media": null, "score": 108, "upvote_ratio": 0.95, "comment_count": 11, "over_18": false}, "56": {"id": "16ogv7l", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "WoobiesWoobo", "link_flair_text": null, "time": 1695352246.615909, "created_utc": 1695305244.0, "url": "https://i.redd.it/r4r9p61w8mpb1.jpg", "title": "These two Jokers", "selftext": "I haven’t been in the group for too long so I would imagine this has been touched on but NOT WITH ME lol. If it was a hoax, there is absolutely no way these 2 had anything to do with it.", "media": null, "score": 523, "upvote_ratio": 0.93, "comment_count": 203, "over_18": false}, "57": {"id": "16ls8uz", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1695352247.8472972, "created_utc": 1695034363.0, "url": "https://i.redd.it/ijuv05obvzob1.png", "title": "Weird observation I had about the Si-Te-Cah of Nevada, the Nittaewo of Sri Lanka, and the Ebu Gogo of Flores. Different cultures around the world have a shared story of a cannibalistic race of hairy hominids being forced into a cave and burned to death by humans.", "selftext": "", "media": null, "score": 173, "upvote_ratio": 0.94, "comment_count": 38, "over_18": false}, "58": {"id": "16lvyea", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "patmarek", "link_flair_text": null, "time": 1695352249.3938472, "created_utc": 1695044599.0, "url": "https://i.redd.it/0vwh0umup0pb1.jpg", "title": "Mothman spotted over Riot Fest", "selftext": "Here’s a 8x8ft mural I did at last weekend’s Riot Fest in Chicago.", "media": null, "score": 144, "upvote_ratio": 0.98, "comment_count": 7, "over_18": false}, "59": {"id": "16lmdfr", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "humble_janitor", "link_flair_text": null, "time": 1695352251.259694, "created_utc": 1695013509.0, "url": "https://i.redd.it/kpwhlged5yob1.png", "title": "remember that brief glitch in time, when we were more united than ever?", "selftext": "", "media": null, "score": 1820, "upvote_ratio": 0.95, "comment_count": 195, "over_18": false}, "60": {"id": "16jf89b", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "real_politik_pod", "link_flair_text": null, "time": 1695352252.2018442, "created_utc": 1694788864.0, "url": "https://www.podchaser.com/podcasts/coast-to-coast-pm-4749189/episodes/ep-69-when-keepin-it-ouija-goe-185551975", "title": "When Keepin’ It Ouija Goes Wrong: AWOL Soldier Edition", "selftext": "", "media": null, "score": 3, "upvote_ratio": 0.72, "comment_count": 1, "over_18": false}, "61": {"id": "16ojzkp", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Alien_Element", "link_flair_text": null, "time": 1695352254.4038024, "created_utc": 1695312810.0, "url": "https://www.reddit.com/r/ufo/comments/16ojzkp/my_mind_has_changed_regarding_the_alien_bodies_in/", "title": "My mind has changed regarding the Alien Bodies in Mexico. I just watched the Livestream from 2 days ago. (video link)", "selftext": "https://www.youtube.com/watch?v=Eief8UMIwZI&t=795s\nI had no idea what to think before watching this. That's the video of them 2 days ago showing the entire exam process including CT scans, X-Rays, and MRIs. Click the video option under \"CC\" for translated subtitles.\nI thought it looked off when I first saw it, but it clearly has seamless musculature, organs, bone conjunction, and ligaments. \nThey're not making shit up. This might be serious. They're doing real science. The fact that they're opening a peer review study is highly indicative that they're confident in what they're seeing.", "media": null, "score": 419, "upvote_ratio": 0.77, "comment_count": 495, "over_18": false}, "62": {"id": "16oh4gk", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "A_MEDi94", "link_flair_text": "Video", "time": 1695352256.1092906, "created_utc": 1695305900.0, "url": "https://v.redd.it/f5txa4uqampb1", "title": "Triangle UFO over Disneyland August 11, 2023", "selftext": "I took this video when I was at Disneyland last month. It popped up out of nowhere when the show at small world started. It is interesting because during that show they have tons of lasers/lights that beam up into the sky. I know it’s not that insane of video just three lights pretty much but the recent triangle video reminded me lol ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/f5txa4uqampb1/DASH_1080.mp4?source=fallback", "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/f5txa4uqampb1/DASH_96.mp4", "dash_url": "https://v.redd.it/f5txa4uqampb1/DASHPlaylist.mpd?a=1697944255%2CMDMyNDIwNGY3NDRiNjIyYWMwOTZiMGFkMDgzZGQ4MTQ1OTMyM2MyMzg4MjQ1YzhiNGIyNmFkOTE3M2M2NDZiYQ%3D%3D&v=1&f=sd", "duration": 26, "hls_url": "https://v.redd.it/f5txa4uqampb1/HLSPlaylist.m3u8?a=1697944255%2CY2VlZjZjMDY1ZTkzYmY4MTA1MDhlZjU4Y2JkMDI1MTdiY2Q3MWE0Mzc2NGVkNTFhZWZlOWQ3MWE4MWU5ZWUzYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2920, "upvote_ratio": 0.86, "comment_count": 639, "over_18": false}, "63": {"id": "16m4m4v", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "gatofeo31", "link_flair_text": "Discussion :table:", "time": 1695352258.1585598, "created_utc": 1695064875.0, "url": "https://www.dailymail.co.uk/news/article-12530435/Alien-corpse-Peru-launches-criminal-probe-non-human-bodies-Mexican-congress.html", "title": "'Alien corpse' row deepens as Peru launches criminal investigation.", "selftext": "", "media": null, "score": 2217, "upvote_ratio": 0.93, "comment_count": 509, "over_18": false}, "64": {"id": "16ohorc", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "littlespacemochi", "link_flair_text": null, "time": 1695352258.8497574, "created_utc": 1695307321.0, "url": "https://i.redd.it/lra3dqrqempb1.jpg", "title": "🚨 URGENT: Call Representatives Now! 🚨", "selftext": "", "media": null, "score": 71, "upvote_ratio": 0.9, "comment_count": 13, "over_18": false}, "65": {"id": "16o69qc", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "MisterMysteriesYT", "link_flair_text": "Disappearance", "time": 1695352259.5791354, "created_utc": 1695270233.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16o69qc/in_1974_3_young_girls_disappeared_from_a_shopping/", "title": "In 1974, 3 young girls disappeared from a shopping mall in Forth Worth Texas. Despite decades of searching, the girls are yet to be found.", "selftext": "In Fort Worth, Texas, a city near Dallas, lived 3 girls: Mary Rachel Trlica, Lisa Renee Wilson, and Julie Ann Moseley, aged 17, 14 and 9. Rachel and Renee were students at Southwest High School, and the two were close friends; Julie was the younger sister of Renee’s boyfriend and neighbor Terry, which made them friends. Rachel lived close by Renee with her husband of 6 months, 23-year-old Tommy Trlica, as well as her 19-year-old sister Debra. All of the missing lived within a few blocks of each other.\nRenee’s boyfriend had just given her a promise ring, and Rachel was eager to pick up Christmas presents for her very young stepson, who would be with her and Tommy for Christmas Eve. She initially asked her sister Debra to come with her, but she turned down the offer, saying she was tired from playing Canasta until 4 AM the night before.\nWith Debra opting to sleep in, Rachel called Renee, and the two made plans to go to the mall. When Rachel arrived to Renee’s house, Julie asked to tag along, and the girls agreed as long as her mother said yes. Excited, Julie called her mother on the phone, and though she initially said no, Julie was persuasive, telling her mother she would have no one to play with otherwise. After much pleading, her mother finally agreed, telling the girl to be home by 6 PM. This was no problem, as Renee had plans to be at a party at 4 PM that day anyways.\nThe girls got inside Rachel’s Oldsmobile and headed out, stopping by an Army Surplus store first to pick up some items Rachel had put on layaway. After that, they rode to the Seminary South Shopping Center, a mall in Fort Worth with an array of stores and plenty of shoppers. The girls parked on the “Sears” upper-level parking lot and got out, never to see their families again. \nAfter they got out of the car, the girls went inside to shop. Around 6 PM, the girls hadn’t been home, so Rachel’s family went to the mall to look for them. Though they looked through all the stores and paged Rachel repeatedly, they couldn’t locate her. All they found was her car, still sitting in the Sears parking lot. It was full of presents, meaning the girls had definitely left the mall at some point. Unable to find their children, the involved families turned to the police.\nInitially, police considered the children to be runaways, not missing. This more optimistic outlook made a bit sense too: Debra, Rachel’s older sister, had herself run away before. The day after the girls disappeared, a letter, ostensibly written by Rachel, arrived to Tommy confirming that the girls had gone to Houston temporarily. However, the families of the involved didn’t believe the girls ran away, as the circumstances, and even the letter itself, were sketchy.\nTo start, the Arnolds (Rachel’s family) figured, even if she ran away, she wouldn’t take the 9-year-old Julie with her.\nFurthermore, they weren’t sure the letter actually came from Rachel for a variety of reasons. For example, the signature at the bottom looked misspelled, as if she initially wrote “Rachee” before chaning the last “e” to an “l.” The letter was also addressed to “Thomas,” a name by which Rachel never called her husband. Finally, the zip code on the envelope – 76083 – was blurred, and the final 3 was backwards. The letter’s quick arrival was also a mystery. For all of these reasons, the families believed the letter was a fake.\nPolice weren’t convinced the letter was real either. Over the years, the letter has been sent to the FBI alongside samples of Rachel’s handwriting to compare, and the results came back inconclusive. One theory states that Rachel indeed wrote the letter, but only because she was forced to.\nThe zip code on the letter could be “76088” if one read the backwards 3 as a faded 8; otherwise, it was “76083,” with the backwards 3 likely coming from a hand-loaded stamp. Those zip codes, at the time, were for Weatherford and Throckmorton, Texas – neither of which was on the way to Houston.\nWith the girls missing and the letter no help, the families awaited their returns and did what they could to find them.\nOn New Years Eve, a girl called the Wilson home saying that she was a friend of Renee’s, and that the girls would be arriving back to Fort Worth on a bus from Houston at 7:25 PM that day. The Wilsons quickly told the other families about it, and they all rushed down to the Greyhound bus station to see their girls. 7:25 came, as did a bus from Houston, but the girls weren’t on it. By 8:30, most of the families went home. Renee’s father Richard and Tommy stuck around until midnight before heading home to bring in the New Year without their girls.\nAftermath\nThe girl who called the Wilson household claiming to be a friend of Renee’s was a fake, as none of Renee’s friends recognized her name when asked by Renee’s mom Judy. Unfortunately, she would be just one of the many fake and hopeless leads the families of the missing children have had to put up with over the years.\nThe Arnold family quickly grew unsatisfied with the police investigation into their daughter’s disappearance, so they ended up hiring a couple of private investigators – Jon Swaim and Dan James. Swaim personally went to Port Lavaca, TX with at least 100 volunteers to investigate after he received a tip that the girls had been killed and taken there. This tip, however, proved fruitless. Over the next few years, Swaim would continue to investigate and push the police to do so as well. Unfortunately, Swaim died in 1979 from an apparent suicide, and before he died, he requested that all his case files be destroyed, including the Fort Worth Missing Trio. As a result, all his knowledge about the case is gone from the world.\nDan James, on the other hand, is alive and well, and he’s still investigating the case. His work has uncovered a few interesting details about the family, some bordering on rumor. For instance, Tommy was actually engaged to Debra before he met and married her younger sister Rachel, and James believes the two were having an affair at the time Rachel vanished. He believes Rachel was cheating on her husband as well. Additionally, he believes that Debra and Rachel had an altercation at a bowling alley the night before Rachel disappeared, and that Rachel knew criminals who were in town the day the girls went missing. For all these weird circumstances, however, James stresses that there is no proof Debra was in any way involved in her younger sister’s disappearance.\nThough James may accept her innocence, the families involved often don’t feel the same way. Rachel’s younger brother Rusty often holds her in enmity, believing she may have been involved. Debra herself has repeatedly defended herself against such claims. As she tells it, Rusty is fanatical and has a faulty memory, imposing negative feelings on her and good ones on their sister, such as his belief that Rachel taught him to play guitar; in reality, Debra says, she taught him, as Rachel was unable to play herself. In 2000, Debra told Fort Worth’s Star-Telegram newspaper that she “has nothing to hide.” Following the publication of those words, Rusty, Renee’s parents and Julie’s mother all signed the following letter asking her to “cooperate with the FBI” and “take a polygraph test.” Clearly, not everyone trusts her in this matter. Tommy is also often a subject of theories surrounding the girls’ disappearance.\nVarious witnesses have claimed to have seen the girls at the mall before they went missing, and most agree they got into a vehicle with someone else, though the details aren’t all a perfect match. One witness says it was a van, another a truck; one says there was one man, another multiple. One witness said the man told him not to get involved because it was a “family matter.” Another says the girls got into a car with a mall security guard and seemed happy, not afraid.\nTheories about the disappearance of the Fort Worth Missing Trio are as abundant as they are different. Some believe the girls were victims of sex trafficking aka “white slavery”; others believe they were killed, or that only Rachel is alive. One girl, suspicious of her own past, contacted Rusty one day saying she believed she was Julie Ann Moseley, and even Julie’s mother thought she looked just like her. However, a DNA test shut down the connection. As time presses on, the girls’ families continue searching for them to this very day, hoping that, one day, they will show themselves again. However, after almost 50 years, they still remain to be found.\nWhat are your thoughts? Could the girls still be alive? Was Rachel forced to write the letter sent to Tommy? Why were the presents in the car? Any thoughts or questions, please leave them below :)\nSources\nFort Worth missing trio - Wikipedia\nHere is what we know about the three Fort Worth girls that have been missing since 1974 | Fort Worth Star-Telegram\nMissing Person Case (namus.gov)\nFamily of woman missing since 1974 talks about living without her or answers | Fort Worth Star-Telegram\nMissing Trio cold case mystery continues in Dallas-Fort Worth | Fort Worth Star-Telegram\nVolunteer Diver to Drag Cars from Benbrook Lake Possibly Tied to Fort Worth Missing Trio – NBC 5 Dallas-Fort Worth (nbcdfw.com)\nTexas Far & Wide: The Tornado with Eyes, Gettysburgs Last Casualty, the ... - E.R. Bills - Google Books\nNearly 50 Years Later, Billboards Aim to Regenerate Tips in Fort Worth Missing Girls Cold Case – NBC 5 Dallas-Fort Worth (nbcdfw.com)\nThe Fort Worth Missing Trio: Vanished While Christmas Shopping - The CrimeWire\nPortrait of a True Crime Character - Fort Worth Weekly (fwweekly.com)\n'Missing Trio' case remains unsolved 44 years after young girls vanish from Texas mall (nbcnews.com)\nMelissa Highsmith case giving renewed hope in one of Fort Worth's biggest unsolved mysteries | wfaa.com\nFort Worth Missing Trio: Mary Rachel Trlica, Julie Moseley, Lisa Renee Wilson | Dean Marie Pyle Peters & Cold Cases (deaniepeters-missingangels.blogspot.com)\nResponse Letter From Rusty Arnold (archive.org)", "media": null, "score": 788, "upvote_ratio": 0.97, "comment_count": 194, "over_18": false}, "66": {"id": "16jqo0c", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "One-Pepper-6993", "link_flair_text": null, "time": 1695352260.2838588, "created_utc": 1694816261.0, "url": "https://lawandcrime.com/crime/firefighter-said-he-gets-something-like-a-runners-high-from-abusing-infant-son-after-being-triggered-by-crying-day-after-boy-returned-from-nicu-police/?fbclid=IwAR1C0jC-BBqouMiAJ-W5mLjasKtfLyvGmPAor2cy6yE4jWRQsajpad1yVt4_aem_AZYy-j55yav7W7ey-sd8ry6U_UyenvH3S7Jv48h4DtLwXWhlgAwJE9f8nnayGZsDMq4&mibextid=Zxz2cZ#lml5qc37dtn6h0m804i", "title": "Firefighter said he 'gets something like a runner's high' from abusing infant son: Police", "selftext": "A 39-year-old firefighter in Wisconsin was arrested this week after he allegedly admitted to repeatedly physically abusing his newborn son, telling police he felt something akin to a “runner’s high” when hurting the infant.\nMichael Ormond was taken into custody on Tuesday and charged with one count of child abuse — intentionally causing great bodily harm and one count of child abuse — intentionally causing harm, authorities confirmed to Law&Crime.\nAccording to a report from Green Bay, Wisconsin, ABC affiliate WBAY-TV, officers with the Oshkosh Police Department responded on Sept. 7 to a call from administrators at a local hospital in Neenah regarding a 2-month-old baby with a series of suspicious injuries, including bruising from head to toe and bleeding in the brain. Due to the severity of the child’s injuries, he was airlifted to Children’s Wisconsin in Milwaukee for more specialized treatment.\nDoctors said the infant — whose name is not included in the report — had been born premature and spent the first 47 days of his life in the neonatal intensive care unit (NICU) before being released nine days earlier.\nAccording to a probable cause affidavit obtained by Green Bay, Fox affiliate WLUK-TV, a nurse noted the child had bruising on the left side of his face near his upper jawbone and below his left ear.\n“His left arm had bruises from the inside of his armpit all the way up to his wrist. On his right calf, there were red marks that the nurses also believed to be bruises,” the affidavit states. “Inside his left thigh, coming down to the inside of his knee were three bruises. The left hip, extending all the way across his buttocks, was completely blue and yellow from bruising, and that extended past the small of [the victim’s] back.”\nMedical reports said the victim suffered a subdural hematoma, bruising on both sides of his face and eyelids, as well as his chest, scrotum, back, buttocks, and legs.\n“The entire retina had hemorrhages too numerous to count, which is a pattern consistent with abusive head trauma, police wrote. The victim also reportedly had blood in his spine from his second vertebrae down to his lower lumbar.\nIn an interview with Ormond, police said he admitted that he had been thinking about — and acting on — thoughts of physically harming his son since the day he and his wife brought the boy home from the NICU.\n“[Ormond] reported that after [the victim] came home from the NICU, he would hurt [the victim] when he was alone with him,” police wrote. “[Ormond] reported that it started the day after [the victim] was brought home from the NICU with pinching [the victim’s] toes when he was crying. It ultimately led to squeezing [the victim] legs, arms, neck and face.”\nWhen asked why he felt compelled to harm his newborn son, Ormond allegedly said that the child’s crying “triggers him.”\n“[Ormond] reported that when he hurts [the victim], he gets something like a ‘runner’s high,'” the affidavit states.\nOrmond also allegedly told police that he similarly abused his two daughters when they were infants, but reportedly claimed that he “only has issues with them being 0-9 months,” police said.\nAppearing in court on Tuesday, a judge set Ormond’s bond at $500,000 cash and ordered him to have no contact with his wife, children, or any minors should he be released. He is scheduled to appear in court again on Sept. 21.\nThe Oshkosh Fire Department, where Ormond was employed as a firefighter, said he was no longer working for the department as of Sept. 11, 2023.", "media": null, "score": 2620, "upvote_ratio": 0.98, "comment_count": 260, "over_18": true}, "67": {"id": "16n7qz3", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "GeneralDavis87", "link_flair_text": null, "time": 1695352261.8116972, "created_utc": 1695171614.0, "url": "https://youtu.be/KOoYUsEmrTE?si=6u4OM-9oaNmcHM0z", "title": "WWII Documentary - Here Is Germany (1945) Directed By Frank Capra", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "WWII Documentary - Here Is Germany (1945) Directed By Frank Capra", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/KOoYUsEmrTE?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"WWII Documentary - Here Is Germany (1945) Directed By Frank Capra\"></iframe>", "author_name": "Marvelous Movies", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/KOoYUsEmrTE/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@Marvelous_Movies"}}, "score": 9, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "68": {"id": "16ngbo2", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "The4leafclover1966", "link_flair_text": null, "time": 1695352265.9418359, "created_utc": 1695200212.0, "url": "https://www.reddit.com/r/Ghosts/comments/16ngbo2/im_a_grieving_mom_who_would_like_to_see_my/", "title": "I’m a Grieving Mom Who Would like To See My Daughter", "selftext": "Hi, all. I’m relatively new here. In January 2021 my husband and I lost our daughter (and our son lost his sister), who took her life during the pandemic. She was 34. \nOur devastation is beyond words…\nI’ve always been fairly intuitive and very open to the idea of paranormal. This may sound crazy, but I very much want to see my daughter…is there anything I can do to encourage a visit from her?\nEDIT: No longer reading or responding to comments\nHowever, I just want to thank everyone (well, most everyone) for all your lovely responses:\n•Some of you even disagreed with this, and yet you gave me polite warnings and other suggestions that were in no way rude or unkind, and I appreciate you more than you know.\n•For those who were nothing but lovely and supportive — my heart thanks you. \n•For those who have lost loved ones and seek answers as I do, my heart is with you.\n•For those who expressed empathy and kindness — you made my heart smile.\n•Those who have suggestions — whether you agree with my stance or not, I thank you and will seriously take in all the advice.\n•For those who “diagnosed” me from their keyboards by telling me I need “help”, “therapy”, “meds” (one person called me an “idiot”) — shame on you. Seriously. You know nothing of my grief journey and how I conduct myself on a day to day basis. I hope you never lose a child. I wouldn’t wish it on anyone.\nYou don’t deserve anymore of my time or words.\n•I won’t be responding to anymore comments, kind, unkind or otherwise. I don’t know how to turn off the comments, but I’m exhausted from reading and typing. 😂\nHowever, please allow me to say you all came through — you showed up for this stranger with caring support and in mass abundance, and I am so heartfeltly appreciative and grateful to each of you who took the time to share your stories and to reach out to me.❤️\nLove and light to you and yours.\nThank you. 🙏🏻", "media": null, "score": 473, "upvote_ratio": 0.91, "comment_count": 372, "over_18": false}, "69": {"id": "16lkz6b", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Mcgwizz", "link_flair_text": "Glitch Pic", "time": 1695352267.5689821, "created_utc": 1695009015.0, "url": "https://i.redd.it/mdmvzzkivwob1.png", "title": "When your doppelganger shows up in the same outfit...", "selftext": "", "media": null, "score": 69, "upvote_ratio": 0.9, "comment_count": 6, "over_18": false}, "70": {"id": "16j3b7e", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Yohoho-ABottleOfRum", "link_flair_text": "encounter story", "time": 1695352268.722552, "created_utc": 1694751209.0, "url": "https://www.reddit.com/r/bigfoot/comments/16j3b7e/know_what_i_saw_but_still_dont_believe_it/", "title": "Know what I saw but still don't believe it.", "selftext": "Staying up in the mountains in a small southwest North Carolina town since this past Sunday. Have gone to town to socialize and have a drink/dinner and came back between 10:30-11pm every night. \nBefore anyone says anything about me being drunk or having too many, it's been a single beer which was drank when I first got there, meaning it's been 3-4 hours since I had it by the time I have been getting back.\nHonestly it's been unnerving getting out of my car at night. It's literally pitch black. The sounds of the animals are super intense since it's so quiet. Mostly bugs and crickets or whatever but I kept feeling on alert like I was being watched. Didn't think anything of it, just thought I was paranoid because of the darkness and bolted down the driveway and into the house.\nMonday and Tuesday night same thing...kept having a weird feeling of being watched even tho I didn't see anything.\nThen Wednesday night will be a night I will never forget. I was driving back again and it was a little after 11pm. I turned off the main road onto this little gravel road that kind of goes around a bend with thick woods on the left and a cornfield on the right and of course I had my high beams on since there are no lights anywhere around. \nI come around the bend onto a stretch of straight road and I see this massive creature standing in the road. I slammed the brakes on and immediately just felt panic because I didn't know what I was looking at. It was HUGE...like 7-8 feet tall and hairy. As I sat there frozen looking at it, it slowly turned toward me and looked for a second, then kind of fast walked/jogged back into the woods on the left side of the road and was gone. However, the way it moved was weird. I can't really describe it...didn't look normal to me.\nI know what I saw but I still don't believe I saw it. I am an analytical person by nature, a software engineer who was raised by  scientists that taught me to question everything but always demand proof before you believe it. As such, I never really believed in bigfoot, per se, as I didn't see proof, but now it's kind of shaken my foundation of how I view reality to the core.\nI have seen a black bear. I've seen a black bear standing up. It was NOT a black bear. It looked like a giant gorilla mixed with a Wookie but dark colored. Unless a giant gorilla just escaped from a local zoo, I don't have an explanation for what I saw. I'm still shook by it even a day later and I haven't really slept since because all I can do when I close my eyes is see a replay of that over and over again in my mind and I honestly don't want to remember it, I just want to pretend I never saw it so I can go back to my own view of reality again.\nAlso noticed as I drove past where it was there was a strong smell of what I can only describe as exceedingly strong BO like if a person didn't take a shower for a year times 10. Didn't have the windows down but had the vent going because for whatever reason the windshield constantly wants to fog up so I need to blast the air on it while driving to prevent it.\nHonestly I don't even know why I am posting this. I guess it's because I need to get this off my chest and tell SOMEONE, and it's better to tell a random group of strangers online than to tell my friends or family who will all think I am crazy and will talk behind my back.\nI saw what I can only describe as a bigfoot and I kinda feel like I've been being watched by them since I have been here. Maybe the watching part has all been in my imagination but every time I get out of the car at night I have a huge adrenaline burst and I get a knot in the pit of my stomach and I just want to run as fast as I can to get in the house.\nI've been researching all day and reading everything I can find because I need to understand this more. I am not a person that can have something like this happen and just go on about their life. I need to know more about this now. What it is, why it's here, how it got here, where did it come from, etc.\nI am sure people will tell me I am full of it and I saw something else, but I know what I saw and I know there is nothing else it could have been.\nFINAL UPDATE:\nLeft the place this morning and am now back home but had another weird situation occur on the way out. Well, I think it was weird, perhaps it was just dumb chance but I guess I will explain.\nGot back around 8pm yesterday right around when it was dusky...not completely dark but almost dark. Thankfully didn't see anything. Decided I would load the car up before going to bed since I was leaving early this morning(left at around 4:30 AM).\nHas the same weird feeling again like I was being watched but quickly loaded the car and went back inside and went to bed.\nWoke up this morning, got to the car and got in to start driving. Going down the mountain road with all the switchbacks and turns, got to the end of the road I was on to turn into the main road(it forms a T) and about 15 feet prior to the end of the road was a large rock sitting in the middle of the road.\nThat rock was not there at 8pm. I go hiking a lot in an area where rock slides happen at times and usually of that happens the rocks end up by the side of the road, not in the middle of it. It honestly looked like it was placed there by someone or something in order to force someone to get out of their car and move it. \nI got the same unnerving feeling as if I was being watched and I almost started panicking. No way in hell I was getting out, so I very carefully drove a little off the side of the road on one side and managed to get around it.\nI sped out of there pretty quick after that. I honestly got the feeling I was being fucked with by them as if they noticed me loading the car and figure out I would be leaving early so they made it more difficult or wanted to play a trick on me.\nI have no proof of this at all and maybe it's just me being over imaginitive but I find it difficult to believe this rock could have randomly ended up where it did in the timeframe between when I drove past that area at 8pm and 4:30am. It's not like there is a ton of traffic on the road and I didn't see a place where a rock would have came from although it's possible rocks fall down from there...\nHonestly have gone from being shook to kind of being pissed not only that I have had my version of reality ripped from me unwantingly but now that they seemingly were fucking with me too and I imagine laughing at me the whole time.", "media": null, "score": 267, "upvote_ratio": 0.96, "comment_count": 164, "over_18": false}, "71": {"id": "16n6irp", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Geoconyxdiablus", "link_flair_text": null, "time": 1695352269.836911, "created_utc": 1695168176.0, "url": "https://i.redd.it/zajg78sowapb1.jpg", "title": "Muuntain man \"Grizzly\" Adams once saw an unknown creature he described as a hedgehog with the face and claws of a bear, but because sighting was so brief he had no further details. It was most likely a bear with a skin condition however (\"art\" by me)", "selftext": "", "media": null, "score": 168, "upvote_ratio": 0.96, "comment_count": 20, "over_18": false}, "72": {"id": "16ogque", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": null, "time": 1695352271.4987378, "created_utc": 1695304942.0, "url": "https://i.redd.it/tndef9jz7mpb1.jpg", "title": "The devil monkey is a cryptid from the United States and Canada, described as a primate with a baboon like muzzle. They're often said to be aggressive and ferocious, in one encounter it charged at a car and left deep scratch marks in it.", "selftext": "", "media": null, "score": 134, "upvote_ratio": 0.98, "comment_count": 36, "over_18": false}, "73": {"id": "16jhqgp", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Orangutan", "link_flair_text": null, "time": 1695352273.2391558, "created_utc": 1694794743.0, "url": "https://i.redd.it/pd8qr83qvdob1.jpg", "title": "Greta getting arrested in Malmo.", "selftext": "", "media": null, "score": 1777, "upvote_ratio": 0.82, "comment_count": 665, "over_18": false}, "74": {"id": "16m3mno", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1695352273.66223, "created_utc": 1695062672.0, "url": "https://youtube.com/live/k43jW4vCDMI?feature=share", "title": "This is twice that the UFO hearing in Mexico lied to us about Aliens", "selftext": "", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "75": {"id": "16lay17", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Independent_Ad4273", "link_flair_text": "Twitter", "time": 1695352275.5656636, "created_utc": 1694981878.0, "url": "https://twitter.com/QuanticaScience/status/1703497067623051698", "title": "Jaime Maussan has just announced, in a live broadcast on his official Youtube channel, that tomorrow evening, the ancient mummies will be X-rayed and meticulously scanned live for all to witness!🛸add caption English", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/QuanticaScience/status/1703497067623051698", "author_name": "Quantica", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">Jaime Maussan has just announced, in a live broadcast on his official Youtube channel, that tomorrow evening, the ancient mummies will be X-rayed and meticulously scanned live for all to witness!🛸add caption English <a href=\"https://twitter.com/hashtag/UFO?src=hash&amp;ref_src=twsrc%5Etfw\">#UFO</a> <a href=\"https://twitter.com/hashtag/UFOs?src=hash&amp;ref_src=twsrc%5Etfw\">#UFOs</a> <a href=\"https://twitter.com/hashtag/ufotwiter?src=hash&amp;ref_src=twsrc%5Etfw\">#ufotwiter</a> <a href=\"https://twitter.com/hashtag/USA?src=hash&amp;ref_src=twsrc%5Etfw\">#USA</a> <a href=\"https://twitter.com/hashtag/UFOSightings?src=hash&amp;ref_src=twsrc%5Etfw\">#UFOSightings</a> <a href=\"https://twitter.com/hashtag/UFOTuesday?src=hash&amp;ref_src=twsrc%5Etfw\">#UFOTuesday</a> <a href=\"https://twitter.com/hashtag/Aliens?src=hash&amp;ref_src=twsrc%5Etfw\">#Aliens</a>… <a href=\"https://t.co/1Mjhw4ZpgT\">pic.twitter.com/1Mjhw4ZpgT</a></p>&mdash; Quantica (@QuanticaScience) <a href=\"https://twitter.com/QuanticaScience/status/1703497067623051698?ref_src=twsrc%5Etfw\">September 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n", "author_url": "https://twitter.com/QuanticaScience", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 242, "upvote_ratio": 0.87, "comment_count": 155, "over_18": false}, "76": {"id": "16j452s", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "4StarCustoms", "link_flair_text": "Discussion", "time": 1695352277.736073, "created_utc": 1694753966.0, "url": "https://www.reddit.com/r/UFOs/comments/16j452s/do_i_have_this_right_regarding_nasa/", "title": "Do I have this right regarding NASA?", "selftext": "David Grusch testifies to congress on the existence of recovered UFOs and non-human biologics. This Information came from folks high up in the military. Grusch was ready to name names and facilities where this exists to Congress in closed doors sessions. \nThe Department of Defense stepped in and denied Congress the opportunity to get this information.\nToday, NASA announces they are forming a UAP (UFO) task force. In their briefing, they pledged they would be transparent and followed that up by saying they couldn’t name the person they appointed to the task force. \nNASA then went on to say they would work to destigmatize the topic of UFOs and then the Director went on to call people asking about Roswell “kooks” and referred to Grusch as someone he saw “on the nightly news”.\nNASA discussed how they needed more funding for sensors and AI to look for evidence.\nSo…. NASA needs money to find evidence of UFOs despite Grusch having the information on where to look. \nThen, NASA finally revealed who is leading their UFO task force - it’s a former rep of the Department of Defense. \nSo, to summarize, the agency that wants money to find answers just put a person in charge who worked for the group that is blocking answers.\nDo I have this right?", "media": null, "score": 2262, "upvote_ratio": 0.93, "comment_count": 447, "over_18": false}, "77": {"id": "16jis90", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Adventurous-Debt-866", "link_flair_text": "Discussion :table:", "time": 1695352279.7706723, "created_utc": 1694797319.0, "url": "https://www.reddit.com/r/aliens/comments/16jis90/if_aliens_are_ever_confirmed_real_with_undeniable/", "title": "If aliens are ever confirmed real, with undeniable proof, this sub/community will claim”I told you so” without realizing they’re a broken clock.", "selftext": "Generalizing of course, there’s a loud group I’m mostly referring to, but anyways: this sub and other ones have been coming up in my recommended quite a bit the past few days, like for many, and it’s hilarious to see how much people latch on to the nothingness that was the Mexican scenario. Naysayers were downvoted and ridiculed when pointing out obvious problems with the whole scenario. And now there is talk of this whole thing being a “psyop?” Give me a break.\nIf we’re ever going to get real proof of aliens, this is going to be the most insufferable community to deal with when you’re all feeling high and mighty despite who consistently wrong you have been in the past.", "media": null, "score": 2163, "upvote_ratio": 0.88, "comment_count": 431, "over_18": false}, "78": {"id": "16lv1bf", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "disclosurediaries", "link_flair_text": null, "time": 1695352280.4698427, "created_utc": 1695042341.0, "url": "https://www.reddit.com/r/UAP/comments/16lv1bf/a_summary_of_all_the_relevant_disclosure_updates/", "title": "A summary of all the relevant Disclosure updates from Sep 11-17", "selftext": "This past week in Disclosure:\nSeptember 12th – Mexican lawmakers heard testimony that \"we are not alone\" in the universe and saw alleged remains of non-human beings that remain unconfirmed\nA hearing on UAP/NHI is held in Mexican congress. While the event did reveal previously unseen footage of UAP, the event most notably included the unveiling of alleged non-human/alien bodies. These bodies have been mired in controversy since their original unveiling some years ago. A peer-reviewed study of the body composition is not yet available.\nRyan Graves, who was in attendance, regarded the event as a significant step backwards in the UAP issue.\n​\nSeptember 14th – NASA shares the UAP Independent Study Report and hosts an accompanying public press conference\nNASA hosts a UAP press conference to discuss the findings of its UAP Independent Study Report. The independent study team’s overall recommendation for NASA from its report is that the agency can play a prominent role in the government’s effort to understand UAP by furthering the study and data collection of UAP.\nNASA appointed Mark McInerney as its new director of UAP research. McInerney previously served as NASA’s liaison to the Department of Defense covering limited UAP activities for the agency.\n“The top takeaway from the study is that there is a lot more to learn. The NASA study did not find any evidence that UAP have an extraterrestrial origin, but we don’t know what these UAP are.” said NASA Administrator Bill Nelson.\n​\nSeptember 14th – Rep. Anna Paulina Luna confirms there will be more public UAP hearings in the near future, while a Select Committee remains out of reach\n“Just got word that we will not be getting the UAP select committee. However, we will be getting another hearing. @ timburchett is working on dates. Also, we are still working on SCIF for Grusch.\" reads a message Rep. Luna tweeted on Sep 14.\n​\nSeptember 15th – IC IG Thomas Monheim responds to Members of Congress regarding their questions on David Grusch's whistleblower claims\nIC IG Thomas Monheim provided this letter in response to the request submitted in August by Members of Congress.\nThe letter specifically states the IC IG has not conducted any \"audit, inspection, evaluation, or review\" of alleged UAP programs. Notably – this specific phrasing correlates precisely to the IC IG's official taxonomy and divisional structure, with one glaring omission: investigation.\nRep. Burchett was not pleased with what he viewed to be a complete non-answer to his questions, and saw it as more evidence of a 'cover-up'. If the IC IG were in the midst of an active investigation into these alleged UAP programs however, he would be justified in keeping details to a minimum until the investigation is concluded.\n​\nSeptember 16th – Oversight Chair Comer on UAP Select Committee: \"If it was voted on today, I would vote for it\"\nSeemingly at odds with statements made by Reps. Burchett and Luna earlier this week, Oversight Chair Comer tells Matt Laslo the following:\n\nhe understands there's a large demand for a UAP Select Committee to independently dig into the veracity of UAP whistleblower claims\nhe'd vote for a UAP Select Committee if such a vote happened today\nhe believes it should be under the House Committee on Science, Space and Tech\n\n---\nThings to look out for in the near future:\nSeptember\n\nFollowing the UAP hearing on the 26th of July, Members of Congress continue to call for a select committee with subpoena authority, to “go about the task of collecting information from the Pentagon and elsewhere” on unidentified flying objects.\nSteven Spielberg's production company will launch a 4 part docu-series covering UAP/UFO Encounters on Netflix on September 27th (Link)\n\nNovember\n\nThe SOL Foundation is holding its first annual conference at Stanford University on November 17-19, 2023. Covering everything from the scientific study of UAP data to philosophical questions raised by it to related global security issues, the meeting brings together Avi Loeb, Charles McCullough, Cristopher Mellon, Garry Nolan, Jacques Vallée, and other leading academic and government voices on UAP.\n\nBeyond/currently unknown\n\nWhile the US Senate passed the NDAA for FY24 – which included the UAP Disclosure Act of 2023 as an amendment – the coming months will still require Senators and Members of Congress to reconcile the two chambers’ versions of the NDAA and produce a final compromise bill. Most commentators don't expect this to happen before December 2023.\nAccording to Senator Gillibrand – an updated UAP report from AARO can be expected by January 2024. This update was originally expected in August 2023, but faced delays.\nReps. Moskowitz, Luna, and Burchett have repeatedly stated their intent to hold field hearings to overcome stonewalling from the Pentagon and military establishment – \"I think we [Congress] should try to get into one of these places [housing UAP evidence]...and if they won't let us in I think we should have a field hearing right outside the building...and the military will have to explain why that is.\" – Rep. Moskowitz (D). It is currently unknown when we might expect that to occur.\nSeveral journalists have indicated that first-hand witnesses of the alleged UAP legacy programs are in the process of providing testimony/evidence to the relevant authorities (e.g. the IC IG) and/or are on the verge of making public statements in the near future (Example 1, example 2, example 3)\n\n----\nCredits (def. missing some...):\n\nRonak P\nu/Schadensfall\nu/aryelbcn\nDrDisclosure89\nRoss\nDefense Scoop\nGood trouble show\nAskapol\n", "media": null, "score": 68, "upvote_ratio": 0.9, "comment_count": 14, "over_18": false}, "79": {"id": "16km3zg", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "2000outsider", "link_flair_text": "Murder", "time": 1695352281.2524853, "created_utc": 1694908633.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16km3zg/who_killed_rachel_runyan_in_late_august_1982/", "title": "Who killed Rachel Runyan in late August 1982?", "selftext": "Rachel Runyan was a three-year-old girl living in Sunset, Utah, who got abducted from a playground and murdered by an unknown individual, on August 26, 1982.\nOn August 26, 1982, Rachel's mother, Elaine Runyan was making Sloppy Joe's for lunch for Rachel and her two brothers. 5 year old Justin & 3 year old Rachel were outside playing with a 10 year old boy, at a park that was 15 feet from the family's backyard fence. As they were playing, a man approached them. He was described as an African American man, between the ages of 25 & 30, he was 6 feet tall with a medium build, and he had a mustache. He talked to the children for about 15 minutes, and then he asked them if they would like to go for some bubble gum and ice cream. Rachel agreed and she started to walk away with the man.\nWhen her brother realized that a stranger was leading her away, he yelled for her to come back. She turned to walk back, and that's when the man grabbed her, and ran to a blur car with wood paneling. The 2 boys ran to the Runyan's house, screaming that someone had grabbed Rachel. The police responded as quickly as they could for 1982, but by the time they got to the park, Rachel and her kidnapper were gone. Sadly, her naked body, with her hands tied behind her back, was found 24 days later, less than 20 miles away from where she was kidnapped.\nThe murder shocked the small city of Sunset, but no one was arrested in the aftermath of the brutal crime. And then strange things started to happen. First, on 2 separate occasions, Rachel's father found a black rose at her gravesite. Next about 2 & a half years after Rachel was kidnapped, the police were called to a 24-hour laundromat. On a stall door in the washroom, in marker, someone wrote **\"Beware. I'm still at large. I killed the little Runyan girl! Remember Beware!\" **Then below the message, there was an inverted cross, and then there was three 6's, one at the head of the cross, and the other two at the arms of the cross.\nThe police aren't sure if the killer left the roses, or wrote the message, but a psychologist who worked on the case said it was possible. Some people believe that the black roses, and the inverted cross, surrounded by \"6 6 6\", indicated that the murder was occult in nature. The police have had about 100 suspects in the murder, but they have yet to charge anyone. In the years since her daughter's death. Rachel's mother has been an advocate for kidnapped and missing children. In August 2016, the park where Rachel was kidnapped, was renamed the \"Rachel Runyan Memorial Park\".\nSources: https://www.deseret.com/2012/2/27/20499133/does-arrest-offer-new-lead-in-30-year-old-rachael-runyan-case#in-this-august-26-2007-file-photo-maureen-benson-davis-county-sheriff-lieutenant-and-kelly-kent-salt-lake-city-sgt-listen-during-a-news-conference-regarding-rachael-runyan-who-was-abducted-and-murdered-in-1982-to-the-right-is-a-drawing-of-racheal-runyan\nhttps://www.abc4.com/news/the-justice-files-rachel-runyon-murder-now-investigated-by-ags-cold-case-unit/", "media": null, "score": 579, "upvote_ratio": 0.97, "comment_count": 164, "over_18": false}, "80": {"id": "16oh7nl", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "brickwallscrumble", "link_flair_text": null, "time": 1695352281.8573568, "created_utc": 1695306130.0, "url": "https://metro.co.uk/2023/09/18/infant-remains-found-at-incest-house-in-northern-poland-19517069/", "title": "‘Incest house of horrors’ Father arrested after being accused of murdering his 3 babies, all born to his own daughter. Father also accused of raping his other daughter. He would chase his mentally disabled son out of the home when he wanted to have sex with his daughter.", "selftext": "", "media": null, "score": 2065, "upvote_ratio": 0.99, "comment_count": 122, "over_18": true}, "81": {"id": "16kcqhr", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "im_a_scallywag", "link_flair_text": null, "time": 1695352283.4100072, "created_utc": 1694884439.0, "url": "https://paulschumann.substack.com/p/what-the-devil-told-the-doctor-ii", "title": "Vaughn Bateson’s Harrowing Account of Serving in Gallipoli During WWI", "selftext": "This is a link to my SubStack article transcribing Vaughn Bateson’s memoir, What the Devil Told the Doctor. But fear not, I’ll be posting all the sections you’d be interested by in the comments.", "media": null, "score": 7, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "82": {"id": "16mkfcx", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Accomplished-Mood661", "link_flair_text": null, "time": 1695352288.2261646, "created_utc": 1695108442.0, "url": "https://www.reddit.com/r/Ghosts/comments/16mkfcx/sub_is_turning_into_a_joke_with_how_many_useless/", "title": "Sub is turning into a joke with how many useless photos are posted", "selftext": "Why do so many people post the most obvious camera faults and claim them as ghosts. Bugs on in home cameras are instantly orbs. Im 50/50 on ghosts existing but come on a lens flare from a fire is clearly just a lens flare and nothing more. It feels like some in the sub dont think before posting photos and just posts them without any self analysis or attempts at interpretation. 90% of the time, if these people checked their photo it would lead to them disproving whatever their paranormal explaination is. Tldr; stop posting photos that are obviously just cameras malfunctioning", "media": null, "score": 247, "upvote_ratio": 0.92, "comment_count": 72, "over_18": false}, "83": {"id": "16noqua", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "segovirtep", "link_flair_text": "Glitch Vid", "time": 1695352289.1027908, "created_utc": 1695225108.0, "url": "https://v.redd.it/eddctv0hmfpb1", "title": "Waterrise", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/eddctv0hmfpb1/DASH_360.mp4?source=fallback", "height": 626, "width": 360, "scrubber_media_url": "https://v.redd.it/eddctv0hmfpb1/DASH_96.mp4", "dash_url": "https://v.redd.it/eddctv0hmfpb1/DASHPlaylist.mpd?a=1697944288%2COTgxZTQ5M2FkODRjMTUwM2ZiMTBhZTU3ZDMyMzdkMmJiNjA3MjkwYjQ5YjA2NzE2NmFlMTcyMjJmN2VhM2Q5YQ%3D%3D&v=1&f=sd", "duration": 44, "hls_url": "https://v.redd.it/eddctv0hmfpb1/HLSPlaylist.m3u8?a=1697944288%2CODhkYjU5MTY5MWMwMjQ4NjQ0MTdhYmExYzJhZTM5ZWJkOTU2YzIxMzY5NjBjZjgyMDNhNDViMTliOGI4ZTJlNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 51, "upvote_ratio": 0.9, "comment_count": 4, "over_18": false}, "84": {"id": "16ntprt", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "korb88wayne", "link_flair_text": null, "time": 1695352290.6046925, "created_utc": 1695237132.0, "url": "https://www.reddit.com/gallery/16ntprt", "title": "The Foot morphology of the Patterson Gimlin Film .", "selftext": "Foot Morphology, locomotion and flexibility.", "media": null, "score": 242, "upvote_ratio": 0.95, "comment_count": 115, "over_18": false}, "85": {"id": "16la5c0", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1695352292.080719, "created_utc": 1694979947.0, "url": "https://i.redd.it/bfzozfcldvob1.jpg", "title": "Many people know about the U-28 sea monster, where an alleged giant reptilian was launched into the air after the sinking of a ship. But there are actually three other similar stories, one taking place on the UB-85, one on the U-108, and one on a yet-unidentified ship", "selftext": "", "media": null, "score": 127, "upvote_ratio": 0.99, "comment_count": 19, "over_18": false}, "86": {"id": "16l78le", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "_karoux_", "link_flair_text": null, "time": 1695352292.9209292, "created_utc": 1694973072.0, "url": "https://i.redd.it/crdxpdjoymob1.jpg", "title": "Yucca Men 🏜️✨", "selftext": "", "media": null, "score": 106, "upvote_ratio": 0.97, "comment_count": 4, "over_18": false}}}