{"_default": {"1": {"id": "1adg526", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "illegaltolive", "link_flair_text": "Discussion", "time": 1706952359.1363354, "created_utc": 1706483621.0, "url": "https://www.reddit.com/r/ufo/comments/1adg526/my_brother_died_at_area_51_with_no_body_under_now/", "title": "My brother died at Area 51 with no body under now declassified circumstances", "permalink": "/r/ufo/comments/1adg526/my_brother_died_at_area_51_with_no_body_under_now/", "selftext": "Deleted due to the post harassing and bullying me about my brother's death.\n​\n​\nI am the youngest half-sister of Michael A Izold, Kate Kovach. A simple search with your puny brains will turn up 50,000 sub-threads and articles about my brother. Shame on you people. Living in your mother's basement, nothing better to do than harp on me over my dead brother.\nYou guys beat him into my head this morning, thank you. I hope anyone who did not have anything helpful or nice to say rots in hell. Take good notice at what you all said. It will come back to you 13x. ", "media": null, "score": 774, "upvote_ratio": 0.81, "comment_count": 201, "over_18": false}, "2": {"id": "1agbl93", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Old_Breakfast8775", "link_flair_text": "Discussion", "time": 1706952360.336346, "created_utc": 1706795901.0, "url": "https://v.redd.it/8n9d8kdhczfc1", "title": "UAP does change of direction. ", "permalink": "/r/UFOs/comments/1agbl93/uap_does_change_of_direction/", "selftext": "They removed my previous video. So resubmitted as requested by the bot lords. I did not record this video so I have zero information on the equipment used or where this place was. The video shows birds, airplane, and satellites before the object in question does anomalous movment. In the previous post people were saying its a bat with 100 percent certainty, I very much dislike that, its purely your opinion if it's a bat. I only ask you frame your comments that way because all of this is opinion. Lately we have been getting very bad videos of stationary lights and its causing lots of vitriol attitudes in the sub. Try to be respectful even tho you have no obligation to. ", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/8n9d8kdhczfc1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 960, "scrubber_media_url": "https://v.redd.it/8n9d8kdhczfc1/DASH_96.mp4", "dash_url": "https://v.redd.it/8n9d8kdhczfc1/DASHPlaylist.mpd?a=1709544359%2CNzkxNDgzYzZmNmE4NjYxYzg4MTFlNjMxNzk2NDgzZDZjM2I5ZDRmODk1MGM3NmMwMDcxNzllNTNjZDczOGIwMg%3D%3D&v=1&f=sd", "duration": 40, "hls_url": "https://v.redd.it/8n9d8kdhczfc1/HLSPlaylist.m3u8?a=1709544359%2CYTUwMjExYmZjY2Q3ZmIzMzg1YTE4OTJjYjM5NTRjYTk5YmM5NGE3ZjUxMjUyYzU0MzY5MGMzOTRmNmY4YTU2OA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3588, "upvote_ratio": 0.9, "comment_count": 799, "over_18": false}, "3": {"id": "1ags8kg", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Dont_Messup", "link_flair_text": "Discussion :table:", "time": 1706952362.2102675, "created_utc": 1706839007.0, "url": "https://v.redd.it/fp5n01qow2gc1", "title": "1979 NFL game halted due to unknown objects above the sky.", "permalink": "/r/aliens/comments/1ags8kg/1979_nfl_game_halted_due_to_unknown_objects_above/", "selftext": "This is located in Minnesota, Three Rivers Stadium. I was viewing NFL crazy moments and seen this clip from 1979. I’m trying to understand what this object is, as they’re in a pair.\nMy first impression was jellyfish UAP, but this seems very spherical, rather than a blob object. Why hasn’t this been shared?\nThoughts on this as there’s no drones or video altering software?", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/fp5n01qow2gc1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 644, "scrubber_media_url": "https://v.redd.it/fp5n01qow2gc1/DASH_96.mp4", "dash_url": "https://v.redd.it/fp5n01qow2gc1/DASHPlaylist.mpd?a=1709544360%2CNzQ4ZTRiZWMyYTkwYzBmYzhjNTQ4NThiOWUyZWE4YmUxMGQyZjY0YmYxODU5MzIyYzZkMjZjZjMxZDU1OWRjMg%3D%3D&v=1&f=sd", "duration": 63, "hls_url": "https://v.redd.it/fp5n01qow2gc1/HLSPlaylist.m3u8?a=1709544360%2CZWM3ZWVhMDdlYTZlZDc0NDUxMDAzYjQ5YjU4MGRkMDUyY2VmZTNkNWJjOTQ1M2JhNTJmNmQ5NzI3NzM5NGViZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4556, "upvote_ratio": 0.85, "comment_count": 799, "over_18": false}, "4": {"id": "1ag71m0", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Dmans99", "link_flair_text": "Discussion", "time": 1706952362.7137594, "created_utc": 1706779316.0, "url": "/r/abovethenormnews/comments/1ag717m/john_podesta_back_in_the_white_house_this_could/", "title": "John Podesta Back In The White House. This could be good news for Disclosure.", "permalink": "/r/UAP/comments/1ag71m0/john_podesta_back_in_the_white_house_this_could/", "selftext": "", "media": null, "score": 165, "upvote_ratio": 0.8, "comment_count": 119, "over_18": false}, "5": {"id": "1ad5awj", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "None", "link_flair_text": null, "time": 1706952363.6864104, "created_utc": 1706456265.0, "url": "https://i.redd.it/h7fxiyhla7fc1.jpeg", "title": "Human hunting lodge: The Black Forest", "permalink": "/r/conspiracy/comments/1ad5awj/human_hunting_lodge_the_black_forest/", "selftext": "The Rothschilds Mansion is one location where these events take place. J. Czebotar explained how these events are carried out in great detail.\nThese masks are what they wear when hunting the children. \nIt was said that the rapes are not just about the pedosadism. They use hunts, rituals, and daily life to train children to use the physical abuse to access the spiritual realm. \nThe man who owned the estate used sexual intimacy and sex Magik as a means to relate and connect himself and his grandson with spiritual beings ie demons. \nThis is what Michael Aquino was doing in the underground tunnels when trying to access certain gateways through the sexual abuse of children. \nBecause a certain frequency the kids carry that is cut off from Satanist because they are not pure. The innocence is what opens up the portals.\nThe film \"Ready Or Not\" that came out in 2019 gave you a glimpse into this world. All you have to do is watch that film and replace the adults with children. \nDo you all remember when troves of items from the Rothschilds estate when up for auction a few months ago? You can thank the EOs (13818)  signed by D. Trump as that property assets were frozen due to \"Crimes against humanity\"", "media": null, "score": 1800, "upvote_ratio": 0.92, "comment_count": 293, "over_18": false}, "6": {"id": "1ag8akj", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Activist4Truth", "link_flair_text": null, "time": 1706952364.0302172, "created_utc": 1706784691.0, "url": "https://i.redd.it/s11lrk48dyfc1.jpeg", "title": "WEF wants to lobotomise the human race to 6G antennas", "permalink": "/r/conspiracyfact/comments/1ag8akj/wef_wants_to_lobotomise_the_human_race_to_6g/", "selftext": "", "media": null, "score": 4, "upvote_ratio": 0.62, "comment_count": 1, "over_18": false}, "7": {"id": "1aeryl0", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Emoje775", "link_flair_text": "question", "time": 1706952364.8448749, "created_utc": 1706630910.0, "url": "https://i.redd.it/phdz8eowplfc1.jpeg", "title": "What do u guys think about this channel on this sub?", "permalink": "/r/bigfoot/comments/1aeryl0/what_do_u_guys_think_about_this_channel_on_this/", "selftext": "", "media": null, "score": 319, "upvote_ratio": 0.94, "comment_count": 181, "over_18": false}, "8": {"id": "1adxjdw", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1706952365.4496741, "created_utc": 1706541056.0, "url": "https://i.redd.it/yr9m3gqpaefc1.jpeg", "title": "The sawtooth dolphin was a strange cetacean seen by fisherman Jeremy Wade in the Amazon Basin. It was described as having strangely evenly spaced spikes. Most locals didn't believe Wade's report, but one said it was called the holadeira. Some believe it was damaged by a boat", "permalink": "/r/Cryptozoology/comments/1adxjdw/the_sawtooth_dolphin_was_a_strange_cetacean_seen/", "selftext": "", "media": null, "score": 208, "upvote_ratio": 0.99, "comment_count": 38, "over_18": false}, "9": {"id": "1acitvh", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "ItsHellBoy", "link_flair_text": "Just plain weird", "time": 1706952365.6150563, "created_utc": 1706383858.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1acitvh/in_1973_two_witnesses_had_one_of_the_most_bizarre/", "title": "In 1973, Two witnesses had one of the most bizarre encounters of all time. They claimed to have met a creature who called himself All Colors Sam. He was described as a humanoid cross between a clown, a robot and an alien...", "permalink": "/r/Humanoidencounters/comments/1acitvh/in_1973_two_witnesses_had_one_of_the_most_bizarre/", "selftext": "This may be one of England's strangest stories ever. All Colors Sam aka The Sandown Clown was only spotted once but the encounter lasted for over a half an hour. The whole account comes from the retelling of a story from a man named Mr. Y who was allegedly the father of one of the witnesses; Mr. Y himself also having some weird experiences in the past with UFOs.\nThis is one of the funniest, weirdest stories I've ever heard and I wanted to share it with y'all so I made this video! What do you guys think about All Colors Sam? Real or kid's imaginations run wild?\nhttps://youtu.be/7qH1w1o1EHY", "media": null, "score": 94, "upvote_ratio": 0.95, "comment_count": 22, "over_18": false}, "10": {"id": "1afzcy2", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Vivid-Marionberry577", "link_flair_text": null, "time": 1706952366.0884857, "created_utc": 1706752514.0, "url": "https://i.redd.it/zfmzp5vhrvfc1.jpeg", "title": "Quick someone name this creature!!", "permalink": "/r/cryptids/comments/1afzcy2/quick_someone_name_this_creature/", "selftext": "", "media": null, "score": 441, "upvote_ratio": 0.98, "comment_count": 486, "over_18": false}, "11": {"id": "1agre3e", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Overall_Designer7060", "link_flair_text": null, "time": 1706952366.243437, "created_utc": 1706836561.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1agre3e/something_happened_after_my_dad_passed_away/", "title": "Something happened after my Dad passed away.", "permalink": "/r/Thetruthishere/comments/1agre3e/something_happened_after_my_dad_passed_away/", "selftext": "This was back in 1994 and I was 7 at the time. My dad had just passed away a few days ago from a car accident. He had to drive to Atlanta for work and sadly didn't make it. I think it was the third night alone with just my mom and my sister when I woke up to my mom standing at the edge of the stairs calling my dad's name as if she thought he or someone was trying to get into the house. This happened around the time my dad normally got home. He would get home around 4 to 6 am depending on the shift. What made this event stick with me all these years is what happened shortly after she started calling out. Theres a security keypad to the alarm at the back door that led to the garage and it started beeping in a manner that suggested someone was trying to enter the disarm code. After that my mom started freaking out. I began to climb out of bed and walk to my door when the bullhorn alarm started going off. The house was locked down and the garage closed and no one was supposed to be there. When I got to my door my mom was running and grabbed me she then took me to my sister's room across the hall and hid us both in the closet and locked us in my sister's room and I heard her calling the police. The cops showed up and searched the area for nearly an hour and found nothing. I remember I left the closet when the police showed up and watched them walk around our whole house and checked the surrounding woods. Too this day my mom thinks it was my dad's ghost coming home from work like he usually did. It's stayed with me all these years. Every door was locked but it sounded like someone came home and tried to turn the alarm off. Thanks for reading. Glad to get this off my chest after so many years. \nPlease don't delete my post just because I was young at the time. My family went through a lot during this time and we all remember this day vividly.", "media": null, "score": 229, "upvote_ratio": 0.98, "comment_count": 8, "over_18": false}, "12": {"id": "1afua4s", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "dalmatianmom", "link_flair_text": null, "time": 1706952366.381019, "created_utc": 1706739018.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1afua4s/the_creepy_hotel_owner_who_thought_he_could/", "title": "The creepy hotel owner who thought he could", "permalink": "/r/LetsNotMeet/comments/1afua4s/the_creepy_hotel_owner_who_thought_he_could/", "selftext": "After reading many of the stories in this subreddit, it reminded me that I have one I thought I had forgotten. \nI'm a South American woman, but have been living in the States for about 11 years now. I first moved to Colorado when I was 21, to the small mountain town of Silverthorne. I was recruited by an exchange student program for college students in South America to come to the USA, work and travel during summer break in the South. Up to that point, I had never seen snow in my life, so I was extremely excited to be living in a cold, snowy place for once. I was going to be working at a very popular hotel in the town of Frisco, not too far from the hostel I was living in. The hostel itself had its own creepy stories, but I won't talk about them in details at the moment (that will be for later, perhaps). So far, I didn't know exactly what kind of job I would be doing in the hotel. All I knew is that I was supposed to show up there on a certain date and time to talk to the owner, an Ukrainian-American guy that was probably in his mid 40s back then. So I show up, introduce myself –with the basic English I had at the time– and tell him I'm excited to start working there. He gives me a weird, long stare, almost as if he was analyzing me. He was a tall man with very pronounced (?) eyebrows, so that kind of creeped me out for a second. He then showed me to the restaurant and said I would be working there as hostess, besides delivering room service orders. I really didn't think my English was that good to be in close contact with the public back then (I thought I would be working back of the house or housekeeping), but he insisted. For those who are familiar with the area, this part of Colorado is not too far from Vail, so it's needless to say they get very, very busy there during ski season and I was dealing with customers from all over the world. That's when I also started helping out as a server during breakfast, and of course would get lots of orders wrong by my lack of English, which made the owner very mad. I remember one time that my coworker and friend was taking a little bit longer to wipe down one of the tables when we had guests waiting to be seated, so he grabbed the towel from her hand, yelled at both of us to get out of his and stop being so damn useless and then proceeded to throw the towel at her face. Let me just make a small note here to say that this girl was also an immigrant like me, with fantastic English and living in the country for years, but he would always try and find ways to show us how slow, dumb, or inferior we were compared to him, an American citizen. Then at night, after the place had slowed down, he would then act all apologetic and buy us drinks at the bar, make forward comments about my appearance and even caress (yep) my legs. I was starting to feel uncomfortable around him and would always try to not be in the same room as he was. During work hours, I would be focused on customers or talking to my coworkers, and I would never make eye contact with him if he was present. \nOn New Year's Eve that year, there was a big incident in the hostel I lived at. I was out that night with a few coworkers, but learned later that one of the residents had gotten way too high on who knows which drug and started chasing down one of my friends (also from South America) inside the hostel, while pointing a gun at him, yelling racist slurs and making death threats. He got arrested, but it was easy to say that most of the students living there no longer felt safe. While telling about the incident to one my coworkers the next day, the big boss overheard the conversation and immediately came to check on me and make sure I was ok. I thought he was being very nice and thanked him for checking. He said I should not be staying at the hostel anymore given the circumstances and invited me to stay in one of the hotel rooms, free of charge for the next 2 weeks, while I looked for a new place. That seemed very generous of him, especially given the fact the hotel would be completely booked often since it was the peak of ski season. I accepted his offer and 'moved in' the next day. I was so overwhelmed with happiness for finally having some privacy (I was sharing a room with 5 other girls in the hostel) and for getting some extra sleep before working my breakfast shift, since I was now literally living at work, lol. \n​\nThat was until one night later that week where I felt extremely exhausted after being slammed in the restaurant all day and delivering orders to several rooms. I was ready to get cozy in my hotel room and go to sleep (I was off the next day). I think it was around 2 in the morning when I woke up completely groggy and noticed that my door room was open. I could see the lights in the hallway. Then I noticed the silhouette of a tall person, standing inside my room and watching me sleep. I couldn't see a face, but could definitely tell it was a man. As I start realizing what's going on, I hear a metal clanking noise, as if he was getting ready to take his belt off. WTF?! I yelled. \nThat person quickly got out of my bedroom. The next day I asked management and my coworkers and said there was definitely someone in my room the night before. They said I was probably dreaming or someone from housekeeping must have gotten into the wrong room. Wrong room? At 2 in the morning? Housekeeping? The owner didn't comment on the case, and stopped talking to me or even acknowledging my presence after that. To my relief, of course. \nNothing else happened. I moved on, got a new job, a new apartment to live in, etc. About a year after my little incident, while checking the local Summit Daily News, who do I see on the front page? Him. The owner. \nHe had been arrested the night before after getting two female hotel guests way too drunk at the bar and 'letting himself' into their rooms once they had crashed for the night. They woke up and there he was, standing in the room, staring at them, while getting ready to make his next move. \nThey screamed bloody murder and called the police immediately. \nWas it him in my room that night? I'm 99% sure it was, but kind of relived I didn't get to find that out. What creeps me out the most about this situation is that, what about those nights I completely crashed after one too many drinks? You know how the altitude can affect your alcohol tolerance, and oh man, it really did it for me. I'm from the sea level and not a big drinker, but a few times I woke up with zero memories from the night before. So, the unsettling question is: was that the first time someone got in my room? And how many more guests at this hotel had this happen to them without even realizing it? ", "media": null, "score": 123, "upvote_ratio": 0.98, "comment_count": 12, "over_18": true}, "13": {"id": "192j6rs", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Sanskirt90", "link_flair_text": null, "time": 1706952366.477214, "created_utc": 1704818958.0, "url": "https://i.redd.it/mim5oqtw1gbc1.jpeg", "title": "The last photo taken by Daylenn Pua before he disappeared. Can you notice the man following him?", "permalink": "/r/truecreepy/comments/192j6rs/the_last_photo_taken_by_daylenn_pua_before_he/", "selftext": "", "media": null, "score": 224, "upvote_ratio": 0.96, "comment_count": 24, "over_18": false}, "14": {"id": "1acouzz", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "somethingspeaks", "link_flair_text": null, "time": 1706952366.5774498, "created_utc": 1706399920.0, "url": "https://www.reddit.com/r/threekings/comments/1acouzz/three_kings_ritual_experiences/", "title": "Three Kings Ritual Experiences?", "permalink": "/r/threekings/comments/1acouzz/three_kings_ritual_experiences/", "selftext": "Hi! I'm researching this topic for my upcoming podcast and I'd love some real experiences from people that have played/ attempted this ritual! \nI'd be more than happy to credit you! Please send me a DM if you're interested!", "media": null, "score": 4, "upvote_ratio": 0.84, "comment_count": 2, "over_18": false}, "15": {"id": "1aduvtl", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "JosieTheCrohnie", "link_flair_text": null, "time": 1706952367.1741123, "created_utc": 1706533607.0, "url": "https://www.reddit.com/r/Ghosts/comments/1aduvtl/they_saved_my_aunts_life_that_night_whoever_they/", "title": "They saved my aunt’s life that night… whoever they are", "permalink": "/r/Ghosts/comments/1aduvtl/they_saved_my_aunts_life_that_night_whoever_they/", "selftext": "Back in the day, when my aunt was a newborn and my dad was a toddler, they lived in a haunted apartment for a short while. My grandma is the one who told me this story. She noticed a lot of weird things going on but never felt threatened or scared. One night, everyone was fast asleep when my grandma heard her name being called. My grandfather wasn’t home and my dad & aunt were the only other ones there so she shrugged it off. But then she heard her name being called again, louder. The second time, the voice also said “check the baby”. She went to go check on my aunt and she had wrapped her blanket around her neck and was starting to choke. This was back in the late ‘60s before anyone knew that blankets were causing infant deaths. They saved my aunt’s life that night… whoever “they” are.", "media": null, "score": 860, "upvote_ratio": 0.97, "comment_count": 80, "over_18": false}, "16": {"id": "1acjj7p", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "loorat", "link_flair_text": "Glitch Pic", "time": 1706952367.2814236, "created_utc": 1706385698.0, "url": "https://i.redd.it/i8fkzfbrg1fc1.jpeg", "title": "A perfect line of clouds in the sky", "permalink": "/r/GlitchInTheMatrix/comments/1acjj7p/a_perfect_line_of_clouds_in_the_sky/", "selftext": "", "media": null, "score": 44, "upvote_ratio": 0.92, "comment_count": 4, "over_18": false}, "17": {"id": "1aepj4u", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "yoyohelpmee", "link_flair_text": null, "time": 1706952368.4483569, "created_utc": 1706624495.0, "url": "https://www.reddit.com/gallery/1aepj4u", "title": "Structure spotted on the moon?", "permalink": "/r/ufo/comments/1aepj4u/structure_spotted_on_the_moon/", "selftext": "Just saw this on Instagram, there is what looks like a tall structure with a long shadow in the 3rd and 5th photos, what do ya'll think?", "media": null, "score": 712, "upvote_ratio": 0.85, "comment_count": 299, "over_18": false}, "18": {"id": "1agcf17", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "Discussion", "time": 1706952369.6374812, "created_utc": 1706798129.0, "url": "https://twitter.com/MvonRen/status/1752794373807563188", "title": "Senate Majority Leader Chuck Schumer - “The US government has gathered a great deal of information about UAPs OVER MANY DECADES but has refused to share it with the American people. That is wrong and additionally it breeds mistrust.”", "permalink": "/r/UFOs/comments/1agcf17/senate_majority_leader_chuck_schumer_the_us/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/MvonRen/status/1752794373807563188", "author_name": "MarikvR", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">“The [U.S.] government has gathered a great deal of information about UAPs *over many decades* but has refused to share it with the American people. <br><br>“That is wrong and additionally [it] breeds mistrust.”<br><br>-Senate Majority Leader Chuck Schumer (D-N.Y.)<a href=\"https://t.co/HQABthqswp\">https://t.co/HQABthqswp</a></p>&mdash; MarikvR (@MvonRen) <a href=\"https://twitter.com/MvonRen/status/1752794373807563188?ref_src=twsrc%5Etfw\">January 31, 2024</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n", "author_url": "https://twitter.com/MvonRen", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 2215, "upvote_ratio": 0.94, "comment_count": 218, "over_18": false}, "19": {"id": "1ad4ioe", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "SagansCandle", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1706952371.1458986, "created_utc": 1706454118.0, "url": "https://i.redd.it/4h74z2vv37fc1.jpeg", "title": "Prepare for a new wave of Mandela effects", "permalink": "/r/aliens/comments/1ad4ioe/prepare_for_a_new_wave_of_mandela_effects/", "selftext": "", "media": null, "score": 2764, "upvote_ratio": 0.94, "comment_count": 197, "over_18": false}, "20": {"id": "1agl2zo", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Article", "time": 1706952371.6278608, "created_utc": 1706820156.0, "url": "https://thedebrief.org/the-pentagons-former-chief-ufo-hunter-speaks-out-but-some-of-his-arguments-dont-hit-the-mark/", "title": "[The Debrief] The Pentagon’s Former Chief UFO Hunter Speaks Out, But Some of His Arguments Don’t Hit the Mark", "permalink": "/r/UAP/comments/1agl2zo/the_debrief_the_pentagons_former_chief_ufo_hunter/", "selftext": "", "media": null, "score": 120, "upvote_ratio": 0.93, "comment_count": 25, "over_18": false}, "21": {"id": "1adn7zw", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Ttv_Sur4man3", "link_flair_text": null, "time": 1706952372.6249287, "created_utc": 1706504574.0, "url": "https://i.redd.it/y2jpl209abfc1.jpeg", "title": "This is very interesting", "permalink": "/r/conspiracy/comments/1adn7zw/this_is_very_interesting/", "selftext": "", "media": null, "score": 1580, "upvote_ratio": 0.85, "comment_count": 302, "over_18": false}, "22": {"id": "1agqgux", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1706952372.9471567, "created_utc": 1706833960.0, "url": "https://youtube.com/live/wslC9mB5BkI?feature=share", "title": "Do you subscribe to the idea of the Mandela Effect?", "permalink": "/r/conspiracyfact/comments/1agqgux/do_you_subscribe_to_the_idea_of_the_mandela_effect/", "selftext": "", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "23": {"id": "1aegg2k", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "m2argue", "link_flair_text": "art", "time": 1706952373.911822, "created_utc": 1706590882.0, "url": "https://i.redd.it/8od1g8hveifc1.jpeg", "title": "Look at the pillow my Mom made me 😂", "permalink": "/r/bigfoot/comments/1aegg2k/look_at_the_pillow_my_mom_made_me/", "selftext": "", "media": null, "score": 255, "upvote_ratio": 0.99, "comment_count": 20, "over_18": false}, "24": {"id": "1acwtx1", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Sprout-spud", "link_flair_text": null, "time": 1706952374.5654793, "created_utc": 1706425555.0, "url": "https://www.reddit.com/gallery/1acwtx1", "title": "Mothman sculpture:)", "permalink": "/r/Cryptozoology/comments/1acwtx1/mothman_sculpture/", "selftext": "Need ideas what to put on the base thz 🖤", "media": null, "score": 127, "upvote_ratio": 0.97, "comment_count": 11, "over_18": false}, "25": {"id": "1acn1bt", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Vivid_Plastic_741", "link_flair_text": "Flying Humanoid", "time": 1706952374.7553103, "created_utc": 1706395050.0, "url": "https://www.reddit.com/gallery/1acn1bt", "title": "The Bizarre Case of the Man Flying in a Box, Castelleale, Italy, 1974", "permalink": "/r/Humanoidencounters/comments/1acn1bt/the_bizarre_case_of_the_man_flying_in_a_box/", "selftext": "In 1974, Castelleale, Italy, during 17:30.pm, The witness, a woman named Signorina Giovanna Sensoli was attending to the animals in the farmyard beside the house, when she was struck by their strange behavior. Chickens and rabbits were running about as though terrified and hiding in any corner they could find. She looked around to see what was going on and noticed some of the fowls were looking upwards. Son instinctively she did the same, and to her great astonishment, she saw hanging in the air above the house, at roof-top height, and about four meters from her, a “man” who was seated on a box that was swinging to and fro and who was looking around as though seeking something.\n“He was big about 2 meters in height and dressed in a very shining one-piece garment with green, red, and white markings, and in a pair of skiing boots with square toes and square heels.\n“His features seemed to be dark, but a helmet with visor covered his face, and I only managed to see his eyes, more or less like ours, and to tell you the truth we gazed at each other for a brief instant.\n“Well this man was hanging there in the air above the house and rocking to and fro, with one foot stretched down towards the roof as though he wanted to support himself on it. From the “box” (which was about 50 centimeters Deep and about the same width---I don’t know how long---) there was a rod sticking up, a rod with colored stripes. It must have been the control-handle for the motor, and it gave out a sharp hum that I could hear very clearly.\n“A bit disconcerted at the sight, I shouted several times to my mother, but she didn’t reply at once. Meanwhile, maybe because of my shouts, the man had moved away slowly eastwards across our threshing-floor area, which is 20 meters wide. I went over in the same direction to which the man was looking, I saw a very vivid light, as big as the full moon, coming from the north and also slowly moving eastwards.\n“As soon as I caught sight of it, I was overcome by a wave of heat. And, although there was a bit of mist at the time, the whole place around, the house and the threshing-floor, were lit up vividly for a few second like bright daylight.\n“After passing across the threshing floor area, the man halted above a flat-topped hayrick, as though going to land on it. I approached him once more, puzzled by his incomprehensible gestures and once more we were staring at one another, this time at a distance of about three meters (this being the height of the hayrick).\n“A few instants later, he departed, heading eastwards, with that light following at a distance, behind him.\n“At a bit over a kilometer or so in that direction lays the small cemetery of San Clemente, located on a hill.I watched the two objects-the man and the light-circle several times around the cemetery, and halt for a few seconds over it. Meanwhile, my mother had finally come out, and I showed her where to look, but she, not knowing what had happened, simply said, “It must be a parachutist!” She was merely able to make out something in the distance, but unfortunately without being able to discern any actual details that might confirm my testimony.\n“I did not see the light again, but the man must surely have dropped down into the cemetery and have spent the night there.\n“The whole thing lasted about fifteen minutes.”\nSource: Gianfranco Lollino, Alieni in Italia (Moreno Tambellini)\nFun fact: There are rumors that Sensoli was interviewed but I couldn't find any information about it.", "media": null, "score": 78, "upvote_ratio": 0.95, "comment_count": 16, "over_18": false}, "26": {"id": "1af7ugj", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "ABucketofBeetles", "link_flair_text": null, "time": 1706952375.1737874, "created_utc": 1706671278.0, "url": "https://i.redd.it/bv7ezgyx1pfc1.jpeg", "title": "My doodle during class today!", "permalink": "/r/cryptids/comments/1af7ugj/my_doodle_during_class_today/", "selftext": "", "media": null, "score": 127, "upvote_ratio": 0.95, "comment_count": 13, "over_18": false}, "27": {"id": "1aex4to", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Ill_Funny_5052", "link_flair_text": null, "time": 1706952375.3136718, "created_utc": 1706643313.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1aex4to/saw_my_neighbors_eyes_for_the_first_time/", "title": "Saw my neighbor's eyes for the first time...", "permalink": "/r/Thetruthishere/comments/1aex4to/saw_my_neighbors_eyes_for_the_first_time/", "selftext": "I[27f] have interacted for the last year and half with my neighbor and her husband but mostly her. I met the wife first as I used to take my son outside to play and she would always come outside to have a small conversation. I did stop interactions with them both as they started asking for too many favors that I no longer wanted to do. Well today after not seeing or hearing from either of them in like 3 weeks she asked me for toilet paper and a ride to the bank which I refused as my car is currently not working and was going to decline either way. I did offer some toilet paper and as I handed it to her I looked her straight in the eyes and her pupils were slit. Now I've made eye contact with her in the past but never noticed this until today. This also isn't my first encounter with someone with slit pupils.\nBack in high school when I was a junior and this was about 11 years ago. I went up to my gym teacher to let him know I wouldn't be in class the next day as I would be attending a funeral. He was wearing sunglasses and he took them off as I was telling him and low and behold he had slit pupils. What's even weirder when I look back, I noticed all the gym teachers would wear sunglasses indoors. So yeah 2nd time in an 11 year span I've seen two people  with these types of pupils and I know I wasn't seeing things. Anyone else have a similar story.", "media": null, "score": 187, "upvote_ratio": 0.86, "comment_count": 49, "over_18": false}, "28": {"id": "1aecr9k", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "cloud_pleaser", "link_flair_text": null, "time": 1706952375.4598022, "created_utc": 1706579646.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1aecr9k/armed_men_outside_my_front_door/", "title": "Armed men outside my front door", "permalink": "/r/LetsNotMeet/comments/1aecr9k/armed_men_outside_my_front_door/", "selftext": "I have been a long-time reader of this subreddit, so it is honestly kind of surreal that I now find myself writing about an experience I had very recently \n​\nIt was a Friday night and I had gone to bed early, as I had work on Saturday morning. After reading in bed for a bit, I drifted off at around 10:30 PM, only to wake up about an hour later to loud screams and people yelling profanities. I thought my girlfriend was watching a movie with the volume way up, and I went out into the loungeroom to ask her to turn it down a little. Instead, the TV was off, and my girlfriend was staring at the front door, with her eyes wide. Our apartment is on the ground floor of the building, and so our front door opens directly out into the lobby of the builidng. The voices in question were coming directly from the lobby- I could not make out specifics (In my defense, I was half asleep and the language of the country I live in is not my first language), but there was a lot of swearing involved. My first thought was that it was some kind of domestic dispute, but after listening I realised it was a group of men that sounded extremely aggressive. \n​\nI looked at the WhatsApp group chat for my apartment building, and to my horror saw a message from one of the people in it that there were armed men in the building, and that we should not leave our flats. The country I live in is experiencing a marked uptick in crime, and I had heard stories of armed groups of men robbing entire apartment blocks - but these had seemed fairly apocryphal to me. However, that was my first thought- that these men would kick down our door and rob us. One of my dogs started to growl at the commotion outside- I shushed him and thankfully he obeyed. \n​\nI heard a commotion in the apartment above me and went out to my patio to see what was happening. I heard what sounded like a large piece of furniture being knocked over, and women and children screaming in terror. At this point I had no idea what was going on, but I knew that by now they would have robbed us already, if that is what they had planned to do. My girlfriend and I decided to hide in a small shed at the end of our patio, monitoring the group chat on our phones. Our bigger dog silently stood watch outside the door of the shed, his eyes locked on the sliding door at the end of the patio. I would find my smaller dog later, cowering between the washing machine and the dryer.\n​\nAfter ten extremely tense minutes, I heard the screeching of tires- signalling what I hoped was the perpetrators fleeing the scene. Eventually, someone in the group chat said the police had arrived, and breathing a huge sigh of relief, I came out of hiding and opened the front door. \n​\nAlarmingly, on the floor of the lobby there were zipties that had been cut, and the security guard was talking to one of the tenants. The man was bleeding from a large gash on his face, and looked extremely shaken. \n​\nOver the next few hours the story would unfold. \n​\nThe man I saw, with the gash on his face, was the tenant in the upstairs apartment- the one that I had heard the commotion coming from. He was the owner of an import/export business and for whatever reason, had a sizable sum of money - in cash - hidden in his apartment. Someone had obviously found out about it, and planned out the robbery that woke me from my sleep on Friday night. A group of eight men had followed him into the apartment building's garage and ambushed him as he got out of his car, and judging from the gash on his face, roughed him up a bit. Some of the group of eight had gone to the lobby, surprised the security guard and ziptied him. The remainder of the group had gone up to the apartment, robbed it, and then fled the scene. \n​\nIt is fairly chilling to think that armed men were mere meters from my front door.  So, to the armed men that stormed my apartment building to steal my neighbour's cash- let's not meet. ", "media": null, "score": 122, "upvote_ratio": 0.97, "comment_count": 23, "over_18": true}, "29": {"id": "1agflaa", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Dan_Theman_003", "link_flair_text": null, "time": 1706952375.6595237, "created_utc": 1706806439.0, "url": "https://www.reddit.com/r/threekings/comments/1agflaa/11_miles/", "title": "11 Miles", "permalink": "/r/threekings/comments/1agflaa/11_miles/", "selftext": "Does the 11 mile ritual have to be done by myself or can it be done with a friend. I see videos on it all the time but those are probably fake. I am curious because I know someone who wants to do it with me", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "30": {"id": "1acm8m8", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "topherphoto", "link_flair_text": "EVP", "time": 1706952376.3448002, "created_utc": 1706392918.0, "url": "https://v.redd.it/mr3592f822fc1", "title": "Edinburgh Manor In Iowa. Haunted manor out in the middle of nowhere.", "permalink": "/r/Ghosts/comments/1acm8m8/edinburgh_manor_in_iowa_haunted_manor_out_in_the/", "selftext": "I have investigated the manor several times. This particular video we caught voices. The manor has a safe house outback. It has a nice kitchen, bathroom etc. On or second night we setup the wyze cams and licked the building up and went to the house to get some rest. Capture these voices during that time. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/mr3592f822fc1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/mr3592f822fc1/DASH_96.mp4", "dash_url": "https://v.redd.it/mr3592f822fc1/DASHPlaylist.mpd?a=1709544375%2CYjQ5OGEyN2QzMTc2MGQ1YmM5NmI3MzZhY2NlNTNlZmU0MWU5MTYzM2VmOGIzZDgyZGEyOWEwYmYzMWNmMWQ2YQ%3D%3D&v=1&f=sd", "duration": 29, "hls_url": "https://v.redd.it/mr3592f822fc1/HLSPlaylist.m3u8?a=1709544375%2CNWQ1YTc2OTdiNWVhZjY0NjFjYjAxNDNiZDlkMjEzNzNlODhkYzIzNzEyNTZkYTkzYWM1Mjc0NjY2YWI4YmUyNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 662, "upvote_ratio": 0.87, "comment_count": 154, "over_18": false}, "31": {"id": "1ag2jgx", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "NOTdouglasupton", "link_flair_text": null, "time": 1706952377.5275204, "created_utc": 1706762057.0, "url": "https://www.reddit.com/r/ufo/comments/1ag2jgx/dr_amy_eskridge_antigravity_researcher_dead/", "title": "Dr. Amy Eskridge, Anti-Gravity Researcher - DEAD", "permalink": "/r/ufo/comments/1ag2jgx/dr_amy_eskridge_antigravity_researcher_dead/", "selftext": "...Dr. Ning Ling, Redstone Arsenal, had also died suspiciously...husband died after witnessing her death (hit and run)...\nDr. Eskridge predicts her death in this interview:\nhttps://www.youtube.com/watch?v=l0O4cEIkUZc&t=212s\nAnti-Gravity research is a tough business to be in?\nhttps://www.hal5.org/PDF/HAL5-Dec2018-Talk-AntiGravity.pdf\nRedstone Arsenals and Huntsville, Alabama - Home of Disclosure\nInteresting names mentioned:\nBill Dent, friend of Teller...Maybe this is his son? William dent https://www.linkedin.com/in/william-dent-a63719104/\n8 forces mentioned:\n4th force Gravity\n5th force Higgs \n6th force anti gravity\n7th force energy into matter back into energy (portal) download yourself through a portal\n8th force negative energy?? Couldn't understand.\nWho knows about Anti-Gravity?\nKen wheeler\nTesla found it\nEugene https://en.wikipedia.org/wiki/Eugene_Podkletnov\nDane Cooper\nAmy Eskridge's Dad (RH Eskridge) https://ntrs.nasa.gov/api/citations/20205010911/downloads/NASA_TM_20205010911.pdf\nBuckle up, ya'll - our lives our changing...", "media": null, "score": 446, "upvote_ratio": 0.91, "comment_count": 225, "over_18": false}, "32": {"id": "1agjkrd", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Aggressive_Issue3505", "link_flair_text": "Discussion", "time": 1706952378.7481422, "created_utc": 1706816399.0, "url": "https://v.redd.it/hsuleyeg11gc1", "title": "Jellyfish UFO?", "permalink": "/r/UFOs/comments/1agjkrd/jellyfish_ufo/", "selftext": "Don’t know if this has already been shared but though I’d post for those who might not have seen it. Came across this video on my Instagram feed. At one point it looks eerily similar to the jellyfish ufo. Thoughts?", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/hsuleyeg11gc1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 822, "width": 720, "scrubber_media_url": "https://v.redd.it/hsuleyeg11gc1/DASH_96.mp4", "dash_url": "https://v.redd.it/hsuleyeg11gc1/DASHPlaylist.mpd?a=1709544377%2CNzcwZTUxMzg1MmRiM2QzMThmM2ZhYmYxNGQ4ZWExY2YyOWJiNjI3MDgxMGY3MDIwNThjNDI4YTAwYWFlNTNjMQ%3D%3D&v=1&f=sd", "duration": 36, "hls_url": "https://v.redd.it/hsuleyeg11gc1/HLSPlaylist.m3u8?a=1709544377%2COTQ0OTI3ZWUzZTA3ZjRjNzQ5YWYwMWRlZmRjNjFlYjM2NzM1MzRjOTMyZjZmZDAyMDI0MDVjYzk4ZmIwNmFhMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1954, "upvote_ratio": 0.9, "comment_count": 492, "over_18": false}, "33": {"id": "1afttbr", "locked": true, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "littlespacemochi", "link_flair_text": "News :illuminati:", "time": 1706952380.2988336, "created_utc": 1706737881.0, "url": "https://v.redd.it/3jm8m1zujufc1", "title": "Donald Trump met with Robert Bigelow on Monday, who pledged $20 million to his presidential campaign.", "permalink": "/r/aliens/comments/1afttbr/donald_trump_met_with_robert_bigelow_on_monday/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/3jm8m1zujufc1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 466, "width": 854, "scrubber_media_url": "https://v.redd.it/3jm8m1zujufc1/DASH_96.mp4", "dash_url": "https://v.redd.it/3jm8m1zujufc1/DASHPlaylist.mpd?a=1709544379%2CYjIyNzQzYzI0Nzg5MTg3MTU3OGQzMDg3ZjE5ZjExNjU2YWMyMzA4MDI2MzNkNDdlYzdjNWE3YWVmYWY5OWJkNg%3D%3D&v=1&f=sd", "duration": 84, "hls_url": "https://v.redd.it/3jm8m1zujufc1/HLSPlaylist.m3u8?a=1709544379%2CNWRlYTE4ZjdhNmRjN2FmN2MyNjIzYmMxZDRiZWJiNzMyZjk1OTBhOWRiMzEzMTk3Yjc1OTQ2NmM0NDY0ZTBiNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1741, "upvote_ratio": 0.7, "comment_count": 1101, "over_18": false}, "34": {"id": "1ag1y1t", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Discussion", "time": 1706952381.0720801, "created_utc": 1706760165.0, "url": "https://i.redd.it/vk9dzgvrbwfc1.jpeg", "title": "Chris Sharp has received confirmation that Dr. Sean Kirkpatrick remains an unpaid consultant to AARO despite stepping down as Director last December.", "permalink": "/r/UAP/comments/1ag1y1t/chris_sharp_has_received_confirmation_that_dr/", "selftext": "", "media": null, "score": 112, "upvote_ratio": 0.98, "comment_count": 25, "over_18": false}, "35": {"id": "1adsmid", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "gringoswag20", "link_flair_text": null, "time": 1706952382.0601852, "created_utc": 1706525709.0, "url": "https://www.reddit.com/gallery/1adsmid", "title": "Honest Reaction to WW3", "permalink": "/r/conspiracy/comments/1adsmid/honest_reaction_to_ww3/", "selftext": "", "media": null, "score": 1531, "upvote_ratio": 0.91, "comment_count": 290, "over_18": false}, "36": {"id": "1ag0zl2", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1706952382.362744, "created_utc": 1706757251.0, "url": "https://youtu.be/DWy3cR3C1Q0", "title": "Decoding The Mandela Effect", "permalink": "/r/conspiracyfact/comments/1ag0zl2/decoding_the_mandela_effect/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Decoding The Mandela Effect", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/DWy3cR3C1Q0?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Decoding The Mandela Effect\"></iframe>", "author_name": "Paranormal Highway", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/DWy3cR3C1Q0/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@ParanormalHighway"}}, "score": 3, "upvote_ratio": 0.81, "comment_count": 2, "over_18": false}, "37": {"id": "1aflfqv", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Theferael_me", "link_flair_text": "audio", "time": 1706952383.3607945, "created_utc": 1706717556.0, "url": "https://v.redd.it/qfbqyj82vsfc1", "title": "Ron Morehead talks about the 9/11 call - one of my favourite pieces of evidence", "permalink": "/r/bigfoot/comments/1aflfqv/ron_morehead_talks_about_the_911_call_one_of_my/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/qfbqyj82vsfc1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 490, "scrubber_media_url": "https://v.redd.it/qfbqyj82vsfc1/DASH_96.mp4", "dash_url": "https://v.redd.it/qfbqyj82vsfc1/DASHPlaylist.mpd?a=1709544382%2CZjE5YWY0MjYwOWFlODI4ZjZmMWI3YmZkMWNiYTRjZmZkOTliNWFmZDE5MmQ4ZGM0MTZlMjFkNmZmZDE5NWVkZQ%3D%3D&v=1&f=sd", "duration": 335, "hls_url": "https://v.redd.it/qfbqyj82vsfc1/HLSPlaylist.m3u8?a=1709544382%2CNzYzOWZmNGZjMjBjMTRiZDBhZmYxZTI1YzFmODNiMWMwM2U2YmMyYzI2MzViYTE3MjY0MmViYWMzODU1YzI0Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 227, "upvote_ratio": 0.97, "comment_count": 54, "over_18": false}, "38": {"id": "1ae5q9j", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1706952384.0232048, "created_utc": 1706561174.0, "url": "https://i.redd.it/ky4dwrijyffc1.png", "title": "The Guide to Cryptid Horses", "permalink": "/r/Cryptozoology/comments/1ae5q9j/the_guide_to_cryptid_horses/", "selftext": "", "media": null, "score": 103, "upvote_ratio": 0.97, "comment_count": 24, "over_18": false}, "39": {"id": "1agt6n7", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Apprehensive-Ruin455", "link_flair_text": "Personal", "time": 1706952384.2061334, "created_utc": 1706841761.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1agt6n7/encounter_with_rake_like_creature/", "title": "Encounter with rake like creature", "permalink": "/r/Humanoidencounters/comments/1agt6n7/encounter_with_rake_like_creature/", "selftext": "So about a year ago I was camping north of Winston NM. I was like three other people, my dad, my grandpa, and a family friend. At like 10pm I was getting ready for bed and decided to tinkle before hand. \nThere was a designated toilet area about 50 feet away from my tent. I had a head lamp on and as I was doing my business I spotted a figure ahead of me peeking out from behind a bush. \nGo thing I had my pants off because I was terrified! The figure was humanoid, skinny, and pale. \nIt’s eyes were glowing and it seemed to be observing me. I wiped and ran away! \nPlease tell me your thoughts in the comments.", "media": null, "score": 47, "upvote_ratio": 0.86, "comment_count": 14, "over_18": false}, "40": {"id": "1acpkd5", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Old-Hat-2169", "link_flair_text": null, "time": 1706952384.7245612, "created_utc": 1706401892.0, "url": "https://i.redd.it/1jubqqtws2fc1.jpeg", "title": "Baba Yaga Tattoo", "permalink": "/r/cryptids/comments/1acpkd5/baba_yaga_tattoo/", "selftext": "I just added on to my cryptid/\"creepy-cute\" patchwork sleeve with Baba Yaga's house.", "media": null, "score": 80, "upvote_ratio": 0.93, "comment_count": 18, "over_18": false}, "41": {"id": "1ad9bw9", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "PMmeconfusingpics", "link_flair_text": null, "time": 1706952384.879076, "created_utc": 1706466565.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1ad9bw9/green_wireframe_shape_in_sky/", "title": "Green wireframe shape in sky", "permalink": "/r/Thetruthishere/comments/1ad9bw9/green_wireframe_shape_in_sky/", "selftext": "This came up in conversation during the week.... \nMyself and a sibling were in the car in around 2006. It was night time, totally dark. We were looking out at a wooded hill. Out of nowhere, a glowing green wireframe faded into view, it was like a 3D wireframe of a diamond, which was 'joined' with small balls. It was huge, though I can't give an estimate in size because it wasn't somewhere I could get a relative reference. I appeared for 2 seconds, fading in, increasing is light intensity, before quickly fading again. It was large enough and bright enough that the surrounding land was lit up too.\nHonestly I wrote this off as a false memory, or a dream or something until they brought it up. It's worth saying that they are as skeptical as they come. Alway wondere what this was. I'm aware of the 'green flash' which can occur at sunset, however it was dark already and well past sunset. It wouldn't be the northern lights, as this was in the south of England at a time solar activity was even more unheard of than now. \nAlways been curious what it could be. Do let me know if there are any UFO sightings along these lines", "media": null, "score": 19, "upvote_ratio": 0.89, "comment_count": 6, "over_18": false}, "42": {"id": "1aevyeu", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "SimulationErr0r", "link_flair_text": null, "time": 1706952385.0554008, "created_utc": 1706640512.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1aevyeu/joey_crack/", "title": "Joey Crack", "permalink": "/r/LetsNotMeet/comments/1aevyeu/joey_crack/", "selftext": "This happened while in my early 20s my best friend was always getting into risky shit. While she did various drugs I was always more of a pot head. When they said pot was a gateway drug I believe it’s true to a certain extent with those who have addictive personalities. She definitely developed an addiction issue later on. My friend her name was KK was always down to meet people. She used to friend random people on facebook or instagram. She would ask me to hang out so that way when she met people I was the buffer just incase they didn’t like each other. \nOne day she came over to my house unannounced and was like hey let’s go to my uncles house, cause her aunt was there and her aunt had some goods. Her aunts happened to be down the road. Her aunt and her uncle were known as dealers in the area. So we went. When we got there she was like hey I met this guy online he goes by Joey Crack. Then she shows her aunts his pictures and wide set man, with a red goofy  face, cornrow braids, face tattoos and a gold grill. I laughed,  and said wow K you really know how to pick em. \nShe had already invited him over, so upon his arrival he then comes out of no where just walks right up and gives K a hug and everyone else there a kiss on the cheek. This part of town there was nothing around just houses, a school, and woods. Closest store was about 20min, so it struck me as odd that he walked here. So it was me, K, her aunt, and the aunts friend. We sit and get 3 joints in rotation. By this time both aunts are high as a kite on coke, they take a few puffs then go inside the house. Leaving me, K and Joey crack outside. Joey then starts asking us questions like how we know each other, what we do for a living etc. It was getting late so I was telling her I was going to go home. She was like no don’t go yet. I told her I was tired and that Joey is weird, and he kept low key hitting on me. \nShe then tells me he asked to sleep with her and he wanted to asked her to ask if I was down. I laughed it off and said ya crazy. And after a while of silence, I deflected and heard some noise that’s was in the darkness. “Ya heard that?”.  After a bit of small talk between him and K he then learned that neither one of us was interested it was just a hang out. This then turns the mood you can feel it. It was suddenly eerie quite. He got reserved and shifty eyed. I sat down for a while just to please K. At one point I turned to Joey (knowing he walked here and it was dark by now) what you bouta do? Cause im bouta go home and K’s coming with me. He was like “I just texted my boy he’s bouta come get me”. When he was texting K was right behind him watching him texted. Her eyes grew wide and she looked at me. That was silent girl code for “bitch wtf”.\nK broke the silence and was like hey come help me get his thing from inside to bring it out. So I did, we went inside and she was like ima call my uncle so he can take us to your place. And I was like why? My house was like a 10 minute walk. She said cause when she was looking at Joey text. He sent to whoever was coming to pick him up the information of all of us here. He noted that her aunts were high on coke, as us along with our age. He was telling his boy to come over to basically to rob and rape us. And called dibs on the blonde one. I was the blonde one. Every hair stood up on my body with the thought of some gross goon tryna have his way with me. I was mad, cause she got me into this shit. \nWe came back out and continued our conversation with him so he wouldn’t get suspicious of us. She mentions out loud that her uncle was on his way home. As he pulls in a sigh of relief comes over me. They speak briefly and Joey then departs into the darkness before his ride even shows up. K and I get a ride from her uncle to my house on the ride we noted how weird Joey was. Later that night as I was going to bed I check my Facebook and I have a friend request from Joey and a message. “You’re so pretty I would love some alone time with you without your friend.” The message ended with his number. I never blocked someone so fast. After this K didn’t learn her lesson but that’s another story for another time. A week later Joey was in the news he was wanted for SA, robbery and drug possession . A bullet well missed on my part. Joey Crack let’s never meet again.", "media": null, "score": 79, "upvote_ratio": 0.95, "comment_count": 15, "over_18": true}, "43": {"id": "1agrpnn", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Overall_Designer7060", "link_flair_text": null, "time": 1706952385.9115365, "created_utc": 1706837473.0, "url": "https://www.reddit.com/r/Ghosts/comments/1agrpnn/something_happened_after_my_dad_passed_away/", "title": "Something happened after my Dad passed away", "permalink": "/r/Ghosts/comments/1agrpnn/something_happened_after_my_dad_passed_away/", "selftext": "This was back in 1994 and I was 7 at the time. My dad had just passed away a few days ago from a car accident. He had to drive to Atlanta for work and sadly didn't make it. I think it was the third night alone with just my mom and my sister when I woke up to my mom standing at the edge of the stairs calling my dad's name as if she thought he or someone was trying to get into the house. This happened around the time my dad normally got home. He would get home around 4 to 6 am depending on the shift. What made this event stick with me all these years is what happened shortly after she started calling out. Theres a security keypad to the alarm at the back door that led to the garage and it started beeping in a manner that suggested someone was trying to enter the disarm code. After that my mom started freaking out. I began to climb out of bed and walk to my door when the bullhorn alarm started going off. The house was locked down and the garage closed and no one was supposed to be there. When I got to my door my mom was running and grabbed me she then took me to my sister's room across the hall and hid us both in the closet and locked us in my sister's room and I heard her calling the police. The cops showed up and searched the area for nearly an hour and found nothing. I remember I left the closet when the police showed up and watched them walk around our whole house and checked the surrounding woods. Too this day my mom thinks it was my dad's ghost coming home from work like he usually did. It's stayed with me all these years. Every door was locked but it sounded like someone came home and tried to turn the alarm off. Thanks for reading. Glad to get this off my chest after so many years.  \nPlease don't delete my post just because I was young at the time. I have a right to share my history and trauma as anyone else would. My family and I went through a lot and we all remember this vividly.", "media": null, "score": 664, "upvote_ratio": 0.96, "comment_count": 85, "over_18": false}, "44": {"id": "1aectz1", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Glanton4455", "link_flair_text": null, "time": 1706952387.1948588, "created_utc": 1706579859.0, "url": "https://i.redd.it/v7vyt8w3ihfc1.jpeg", "title": "Diana Walsh Pasulka on Joe Rogan", "permalink": "/r/ufo/comments/1aectz1/diana_walsh_pasulka_on_joe_rogan/", "selftext": "Was anyone else struck by the discussion about the pineal gland, where Joe discussed DMT? Joe’s discussion of the DMT experience reminded me of this excerpt from John G. Niehardt’s “Black Elk Speaks,” discussing how Crazy Horse went on a vision quest to discover his name.  Could the Native Americans have tapped into this?", "media": null, "score": 371, "upvote_ratio": 0.88, "comment_count": 127, "over_18": false}, "45": {"id": "1aco95t", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Specialist_Delay_407", "link_flair_text": "Discussion", "time": 1706952388.3849325, "created_utc": 1706398249.0, "url": "https://i.redd.it/gdkm9v63i2fc1.jpeg", "title": "Within hours of her appearance on Joe Rogan, Diana Pasulka sells out of hardcover copies of her book, 'Encounters'.", "permalink": "/r/UFOs/comments/1aco95t/within_hours_of_her_appearance_on_joe_rogan_diana/", "selftext": "How do we discern the authenticity of these individuals, such as Diana Pasulka in an era where public interest in this subject is high and financial motives are inherent? How does the need for financial sustainability intersect with the pursuit of genuine contributions? As respectful skeptics, let’s discuss the nuanced approach in balancing open-mindedness with critical validation. Do you believe that Diana's stories are true? Join the discussion and share your thoughts.", "media": null, "score": 1943, "upvote_ratio": 0.82, "comment_count": 733, "over_18": false}, "46": {"id": "1afvxfj", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Any-Sea-6592", "link_flair_text": "Discussion :table:", "time": 1706952389.9612293, "created_utc": 1706743118.0, "url": "https://v.redd.it/q1kttcrazufc1", "title": "Leah Haley talks about her UFO experience. This is why i think we will not get true disclosure and what we are seeing at the moment is a controlled and planned one. Because man this is wild.", "permalink": "/r/aliens/comments/1afvxfj/leah_haley_talks_about_her_ufo_experience_this_is/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/q1kttcrazufc1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/q1kttcrazufc1/DASH_96.mp4", "dash_url": "https://v.redd.it/q1kttcrazufc1/DASHPlaylist.mpd?a=1709544388%2CMmJlZmUxZmRjZjgwMTU4NzM4NDI4YTQ3ZmRiYzM2MjUyN2MwMjY2ZDk1M2M3YTJiODhlYjQ4MWZlMmMxZGNjMA%3D%3D&v=1&f=sd", "duration": 898, "hls_url": "https://v.redd.it/q1kttcrazufc1/HLSPlaylist.m3u8?a=1709544388%2CMzk2MDI0ZTU4YzVlNjc5YmQxNTljYzI0Mzk1YjkwOTRkZGJiY2NiNmNlYjc2OGZkZjcyMTc5OWMwMjBlMzBjOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1480, "upvote_ratio": 0.95, "comment_count": 371, "over_18": false}, "47": {"id": "1aft52w", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Article", "time": 1706952390.429667, "created_utc": 1706736230.0, "url": "https://www.ctvnews.ca/sci-tech/ufos-listen-as-pilots-describe-bizarre-lights-and-triangle-formation-over-canadian-prairies-1.6748300?cid=sm%3Atrueanthem%3A%7B%7Bcampaignname%7D%7D%3Atwitterpost%E2%80%8B&taid=65ba38a29c509f00013148c7&utm_campaign=trueAnthem%3A+Trending+Content&utm_medium=trueAnthem&utm_source=twitter", "title": "Pilots describe 'bizarre' lights and 'triangles' over Canada in air traffic control audio", "permalink": "/r/UAP/comments/1aft52w/pilots_describe_bizarre_lights_and_triangles_over/", "selftext": "", "media": null, "score": 92, "upvote_ratio": 0.98, "comment_count": 5, "over_18": false}, "48": {"id": "1aesfly", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Stimul8ed", "link_flair_text": null, "time": 1706952391.406386, "created_utc": 1706632078.0, "url": "https://i.redd.it/ysihz937tlfc1.jpeg", "title": "Photo from a meeting last night regarding Iran. Notice all the name placards on the table are facing Biden so he doesn't forget the names of his own cabinet when addressing them, including Vice President Harris.", "permalink": "/r/conspiracy/comments/1aesfly/photo_from_a_meeting_last_night_regarding_iran/", "selftext": "", "media": null, "score": 1506, "upvote_ratio": 0.78, "comment_count": 466, "over_18": false}, "49": {"id": "1aco8yu", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1706952391.7128296, "created_utc": 1706398233.0, "url": "https://youtu.be/nRK5ckNZSPc", "title": "The Unidentified: Lonnie Zamora Socorro's UFO Encounter", "permalink": "/r/conspiracyfact/comments/1aco8yu/the_unidentified_lonnie_zamora_socorros_ufo/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Unidentified: Lonnie Zamora Socorro's UFO Encounter", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/nRK5ckNZSPc?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The Unidentified: Lonnie Zamora Socorro&#39;s UFO Encounter\"></iframe>", "author_name": "Paranormal Highway", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/nRK5ckNZSPc/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@ParanormalHighway"}}, "score": 3, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "50": {"id": "1acg3g4", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "W00KIEL0VER", "link_flair_text": "art", "time": 1706952392.4086, "created_utc": 1706376758.0, "url": "https://i.redd.it/4n6o0xm6q0fc1.jpeg", "title": "I have a slight obsession with painting Bigfoot", "permalink": "/r/bigfoot/comments/1acg3g4/i_have_a_slight_obsession_with_painting_bigfoot/", "selftext": "I take commissions as well as sell canvas prints with hand painted detail. My link to my shop is in my bio 🙂", "media": null, "score": 211, "upvote_ratio": 0.94, "comment_count": 37, "over_18": true}, "51": {"id": "1aghsm6", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "diaperfeast", "link_flair_text": null, "time": 1706952393.0635722, "created_utc": 1706811953.0, "url": "https://www.reddit.com/gallery/1aghsm6", "title": "Frogman (found footage indie horror)", "permalink": "/r/Cryptozoology/comments/1aghsm6/frogman_found_footage_indie_horror/", "selftext": "Frogman (found footage indie horror)\nI had the privilege of creating the cover for for a new found-footage film about the Loveland Frogman and it’s getting a VHS release. Thought this sub might be interested!", "media": null, "score": 91, "upvote_ratio": 0.95, "comment_count": 17, "over_18": false}, "52": {"id": "1ahlspf", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Ufonauter", "link_flair_text": "Reptilian", "time": 1706952393.2493653, "created_utc": 1706928756.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1ahlspf/in_2005_on_the_banks_of_the_dnieper_river_a_woman/", "title": "In 2005, on the banks of the Dnieper river, a woman would have a melancholic chat with a reptilian beachgoer.", "permalink": "/r/Humanoidencounters/comments/1ahlspf/in_2005_on_the_banks_of_the_dnieper_river_a_woman/", "selftext": "Location. Poltava region, Ukraine Date: summer 2005 Time: daytime\nA young woman named Irina B, was living in a countryside cottage and was visiting\na secluded beach on the banks of the Dnieper River. She frequented the area\noften and knew it well. Her favorite area was an isolated small inlet covered with\nsandy beaches and bushes, the area had numerous gaping holes or crevices all\naround, some of them quite large, and possibly artificially made by locals. On this\nday she was lying by the beach sunning herself, and dozing off when she suddenly\nawoke with the feeling that someone staring at her. She opened her eyes and was\nterrified to see a huge bipedal lizard-like being about 2-meters in height and covered\nwith greenish scales standing very close to her. \nTerrified she wasn’t able to scream\nand waited for the worse to happen. But suddenly she heard a voice inside her head,\n“Don’t be afraid, my rations do not include albumen (protein) I am not going to eat\nyou”. The witness was not sure if the mysterious voice spoke in Russian but she\ndistinctly understood everything that was said; the voice seemed to have correctly\nanticipated her apprehension. “How is this possible?” was her only thought,\nand the voice answered her immediately, “Nothing unusual, simple\ntelepathy”. She sat on her towel looking at the huge lizard-like being looming over\nher. \nThe voice inside her head once again reacted to her thoughts and said, “You are\nafraid of my appearance. That can be corrected”. Then in a blink of an eye she saw\nthe most beautiful young man she had ever seen in her life. “How did you do that?”\nshe asked in amazement, now feeling more curious than afraid, in a moment she\nreceived the answer, “Easily. You see what you want to see. I simply compel you to\nsee what you want”. They both began communicating by using telepathically. The\nlizard being told an amazing story, apparently he was a ‘criminal’ on his planet and\nother species on his planet had wanted to punish him, but he had\nsucceeded in escaping and had been wandering all over the Galaxy for a long time,\nhiding from “bounty hunters” that were chasing him. For some time now one of\nthese holes at the beach had become his shelter. But he was now tiring of hiding and\nwanted to be found and “punished”. He had evidently been observing her every\ntime she had come to beach for a while. She reminded him of his home planet\nwhere the creatures also liked the sun and the water. He just wanted to chat with\nher since he had been an outcast from his planet for so long. At the end of the \nconversation the “lizard man” told Irina that he would erase her memory, or her\nbrain would not sustain such huge volumes of new information and would\n“explode”. \nHe promised that it wouldn’t be painful, suddenly everything around her\nwas encased in a bluish light, and horrified she watched the body of the lizard being\ndissolved into nothingness. And next she lost consciousness. She was briefly reported\nmissing and a search was organized to find her, her parents and neighbors found\nher the next day on the beach. She was found lying on the sand bleeding from her\nnose and one ear. The doctors at the hospital were puzzled thinking that she might\nhave had a brain hemorrhage. She was considered to be alive only by a miracle. The\nwitness insists that she did not invent the story even though she is aware that it\nsounds like the ravings of a lunatic.\nSource: Letter from the witness in: “Interesnaya Gazeta” (Interesting Newspaper) D block, Kiev Ukraine # 4, March 2006 (sent from Anton Anfalov to Albert Rosales)\nI have requested the original transcript from Anton Anfalov after receiving his email from Albert Rosales (Anton Anfalov stated this was basically the encounter as is) but if there is any more information regarding this that wasn't sent over I will update it.", "media": null, "score": 25, "upvote_ratio": 0.96, "comment_count": 5, "over_18": false}, "53": {"id": "1ad7p82", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Old-Hat-2169", "link_flair_text": null, "time": 1706952393.7220714, "created_utc": 1706462502.0, "url": "https://i.redd.it/9ena7kf4t7fc1.jpeg", "title": "Also my Mothman tattoo", "permalink": "/r/cryptids/comments/1ad7p82/also_my_mothman_tattoo/", "selftext": "Posted my Baba Yaga tattoo earlier, so I thought y'all cryptid lovers might enjoy Mothman, too. \nSame artist: Patrick at Arcadium Tattoo in Lake Crystal, MN", "media": null, "score": 50, "upvote_ratio": 0.92, "comment_count": 3, "over_18": false}, "54": {"id": "1ad5jx4", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "jedainz", "link_flair_text": null, "time": 1706952393.8676345, "created_utc": 1706456939.0, "url": "/r/Ghosts/comments/1acwnrs/husband_had_night_terror_and_saw_a_mayan_ghost/", "title": "Husband had night terror and saw a Mayan ghost while in Cancun", "permalink": "/r/Thetruthishere/comments/1ad5jx4/husband_had_night_terror_and_saw_a_mayan_ghost/", "selftext": "", "media": null, "score": 9, "upvote_ratio": 0.76, "comment_count": 1, "over_18": false}, "55": {"id": "1ad33gy", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "its_just_dally", "link_flair_text": null, "time": 1706952394.0047324, "created_utc": 1706449902.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ad33gy/harassed_chased_down_by_a_car_while_walking_with/", "title": "Harassed (chased down?) by a car while walking with my mom", "permalink": "/r/LetsNotMeet/comments/1ad33gy/harassed_chased_down_by_a_car_while_walking_with/", "selftext": "\n\nSkip down if you do not care for context (Edited the story to add the proper ending, I wrote this kind of fast originally)\n\n\nOkay so for context for this story, I live in a pretty rural area. We live on the outskirts of our town which already is small compared to the populations of the other towns in California - we're about 15 minutes from the small town and 40 minutes from the main city. We live down a dirt road with some neighbors, our house has no other fences attached to ours and on two sides of the house is only fields and dirt roads, one side having a single house in the field. The other two sides have a couple neighbors down other roads and nobody really interacts out here except my dad talking to two of them sometimes. \nI was probably 12 when this happened - I had low self esteem and I wanted to start exercising more. I had been enrolled in a charter school due to bullying (yes, that played into my self esteem but let's get on with the story.), so I didn't really have many ways of exercise besides a treadmill that we owned. I wanted to start getting fresh air too so my mom suggested that since we live out here that it would be peaceful to take walks down the back dirt road. I agreed even though I was stubborn about it half the time, but we began walking and usually would go in the mid to late afternoon when it would start cooling down outside but was still light - in case it got dark we took our flashlight too. \nBeing out here, it was notorious for stray dogs to sometimes make their way out here and we would carry pepper spray and a mini bat just in case one got vicious - however a dog will play into this story. One day me and my mom decided to go on a walk in the later afternoon. So me and my mom took off and started walking down the road. When you walk about a quarter of a mile down the road, you start to come towards a little cross section. There's a road going left to the highway, a road going right to the neighbor's house, or the road goes straight down to a utility road. Me and my mom discussed walking down the utility road to get a good walk in since it went on for a while. \nWhen we started getting to the cross road this dog came out of literally nowhere. We were looking at it and it was in the center of the roads, staring at us. Me and my mom looked at it and my mom said that she got this feeling in her stomach that we needed to turn around and walk home. So she grabbed my arm and started leading me back home and then let go so that we could walk. We were in the midst of walking when she looks ahead and stops to stare at something. \n\n\nStart here if you do not care about context\n\n\nI ask what she's looking at and she points. A white car pulled up to our fence and quickly backed up and shot down the road on the side of our house. Mind you nobody ever goes down this road except one old man that we know - anyone else who does usually is scoping out my dad's tools to steal. My mom said she felt a bit uneasy because of it and pulled me to the edge of the dirt road, almost into the field. The car had driven to the highway and left, or so we thought. \nWe continued walking back to our house when this car comes back and drives down the road we were walking alongside. I caught a glimpse and it was this smaller white car with black tinted windows that you couldn't see through. My mom instantly got a feeling of impending doom and pulled me into the field, not too far but far enough. We kept walking through the field towards our house, getting closer now, when this car comes back down the road. My mom stops me in my tracks to see what the car is doing, and it drives back to our house and starts driving around it super fast (for context, we have a random road and area that goes around our yard on our property.)\nMy mom waits until the car drives back down the side road and she tells me we need to start running, so that's what we did. We started running through the field, getting to one of the little sections near my yard. The car comes back and drives down the road trying to cut us off. Me and my mom are panicking at this point and have no idea who this is and why they're acting like this. The car circles around again and my mom drags me to further to the (right? I think.) of where we were and told me we're going to run down into the ditch. We get down in the ditch and the car comes back around and pulls to the edge of the ditch where we were. \nThe front of the car was facing us and all I could think about was if it drove down, it would hit me and my mom and probably kill us. My mom quickly put her arm in front of me and stood dead still while I was literally horrified and dropped our flashlight and I think my water bottle. The car was getting ready to drive down where we were and then suddenly they backed up and drove around the yard, going back down the side road to the highway. \nMe and my mom felt like our souls left and she tells me to run, don't look back, and get to the front gate. I run up the ditch, feeling my heart pounding. I run around the yard and towards the front gate, flinging I open and I started running towards the front door. I did not hear my mom behind me - I was running to the door to open it right when I looked over and saw the car coming back down the side road. I ran into the house, trying to catch my breath. I saw the car drive down the road and I didn't see my mom, so I was panicking. \nI ran towards the sliding glass door and suddenly my mom comes running towards it and flings it open, running in and locking it. She tells me to go lock the front door while I try to catch my breath and tell her I was scared because I had no idea where she was. She went to chug some water from the fridge and told me that when I was running, she was trying to shut the front gate when she noticed the car coming back down the road. She said she knew she wouldn't have time to follow me to the door so she ran behind my sisters car to stay out of view of the car, and when it drove back down the road she took the opportunity to run to the back door since it was closer to my sister's car.\nIt's crazy to think that if we hadn't seen that dog standing there in the road and decided to turn back, that we may of been run down. Fortunately we haven't seen the car again and think it may of just been some crazy person or druggie who just so happened to come down our road that day. ", "media": null, "score": 42, "upvote_ratio": 0.86, "comment_count": 10, "over_18": true}, "56": {"id": "1afpivu", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "SiteTall", "link_flair_text": null, "time": 1706952394.9370844, "created_utc": 1706727505.0, "url": "https://i.redd.it/ifi6puakotfc1.jpeg", "title": "What a chance of befriending a ghost or just offering one a home!", "permalink": "/r/Ghosts/comments/1afpivu/what_a_chance_of_befriending_a_ghost_or_just/", "selftext": "", "media": null, "score": 488, "upvote_ratio": 0.97, "comment_count": 69, "over_18": false}, "57": {"id": "1aetkx2", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Awstun_", "link_flair_text": "Mainstream Media", "time": 1706952396.1329017, "created_utc": 1706634800.0, "url": "https://thehill.com/opinion/technology/4432225-what-has-happened-to-the-pentagons-former-ufo-hunter/", "title": "“Kirkpatrick appears to be muddying the waters” | THE HILL", "permalink": "/r/ufo/comments/1aetkx2/kirkpatrick_appears_to_be_muddying_the_waters_the/", "selftext": "Let’s take Kirkpatrick’s central claim at face value- that a core group of individuals with a “religious belief” in UFOs have duped Congress into investigating something that only exists through a circular reporting scheme. \nMy question for SK- What is the end goal of said group? One would think an investigation into something that apparently doesn’t exist would result in an almost immediate consensus. \nThat’s because “there is something there.”Those were the words uttered by Dr. Kirkpatrick during a closed-door briefing with the NASA UAP advisory panel last June. \nDuring that meeting, one of the scientists on NASA’s panel said to Kirkpatrick: “Come on. You gotta give us something, right? You guys are telling us there’s something here, but you won’t give us any data.” \nAnd he [Kirkpatrick] says to them, “Look. I will tell you this: There is something there.”", "media": null, "score": 262, "upvote_ratio": 0.96, "comment_count": 106, "over_18": false}, "58": {"id": "1aglk7v", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "SleuthyMcSleuthINTJ", "link_flair_text": "Witness/Sighting", "time": 1706952397.5582635, "created_utc": 1706821339.0, "url": "https://v.redd.it/gw3v0su4g1gc1", "title": "Slow-mo 1080p 240fps caught a thing zipping through sky", "permalink": "/r/UFOs/comments/1aglk7v/slowmo_1080p_240fps_caught_a_thing_zipping/", "selftext": "1-29-24 at 355pm\nLos Angeles (Boyle Heights) CA\nThere were very bizarre things in my peripheral vision while sitting on my porch so I decided to record the sky with my iPhone (using slow mo). Though I caught other odd things that I’m still trying to first identify before posting here, but this one has me stumped.\nWhen I zoomed in, I noticed that this thing is not winged, appears metallic, is a bizarre shape, has a luminescence about it, and is accompanied by a white orb at times.\nI slowed down even more and zoomed in to compile this video.\nAny ideas? I thought maybe drone but I’m told “nah”. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/gw3v0su4g1gc1/DASH_1080.mp4?source=fallback", "has_audio": false, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/gw3v0su4g1gc1/DASH_96.mp4", "dash_url": "https://v.redd.it/gw3v0su4g1gc1/DASHPlaylist.mpd?a=1709544396%2COWU2NTU2N2IzNzcwYjI2ODlmODJkYWVhZjE1NGUxNWM1MmJmY2Y0Y2RlNWM2YjQ5ODZhYmEwZTIzMzFjYTNkOQ%3D%3D&v=1&f=sd", "duration": 40, "hls_url": "https://v.redd.it/gw3v0su4g1gc1/HLSPlaylist.m3u8?a=1709544396%2CNDNhZWYyZDI4MWViMDYxNjBhZGU4YThlMDVjNTBlMDE4M2JhMjZiZDAxOTFjMjc3NWExZWM4Mzc0YTNmMTY3Yw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1611, "upvote_ratio": 0.92, "comment_count": 451, "over_18": false}, "59": {"id": "1adb4di", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "lilmayo", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1706952399.1672153, "created_utc": 1706470972.0, "url": "https://www.reddit.com/gallery/1adb4di", "title": "she told me she needed “space”", "permalink": "/r/aliens/comments/1adb4di/she_told_me_she_needed_space/", "selftext": "", "media": null, "score": 1462, "upvote_ratio": 0.91, "comment_count": 138, "over_18": false}, "60": {"id": "1agq010", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "talhaak", "link_flair_text": "Discussion", "time": 1706952399.6128063, "created_utc": 1706832674.0, "url": "https://www.reddit.com/r/UAP/comments/1agq010/is_jacques_vallee_credible/", "title": "Is Jacques Vallee Credible?", "permalink": "/r/UAP/comments/1agq010/is_jacques_vallee_credible/", "selftext": "I've seen a lot of mentions about this guy both from this group here and from other prominent people in the UAP community.\nInstinct has told me to stay away from wilder UAP theories so I've stayed out of the loop with Vallee's work but the amount of times he's being mentioned nowadays may mean I have to give him at least a cursory view.\nWhat are your comments about him? Also, I know this group has had a recent surge of uhh more extreme \"believers\" so I would appreciate as many people's views as possible so I can have a solid foundation to start looking into this from.", "media": null, "score": 67, "upvote_ratio": 0.71, "comment_count": 134, "over_18": false}, "61": {"id": "1aetwbv", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Stimul8ed", "link_flair_text": null, "time": 1706952400.5149064, "created_utc": 1706635557.0, "url": "https://i.redd.it/z7oy7db02mfc1.jpeg", "title": "On December 5 1988, the CIA went to examine the ark of the covenant. The viewers notes mention “ghosts” “spirits”, “death”, “resurrection”, “protection”. Link to FOIA in submission statement", "permalink": "/r/conspiracy/comments/1aetwbv/on_december_5_1988_the_cia_went_to_examine_the/", "selftext": "", "media": null, "score": 1479, "upvote_ratio": 0.9, "comment_count": 245, "over_18": false}, "62": {"id": "1ahfl4r", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnunnakiGod05", "link_flair_text": null, "time": 1706952400.817297, "created_utc": 1706911360.0, "url": "https://youtu.be/Ulo5q92s8ss", "title": "In 1943, German Navy Grand Admiral Karl Doenitz stated that the German submarine fleet had “built for the Führer an impregnable fortress at the other end of the world,” in the region of Queen Maude’s Land, Antarctica, later renamed Neuschwabenland.", "permalink": "/r/conspiracyfact/comments/1ahfl4r/in_1943_german_navy_grand_admiral_karl_doenitz/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Hollow Earth - The Forbidden Land Of Agartha And The Thule Secret Society", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/Ulo5q92s8ss?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Hollow Earth - The Forbidden Land Of Agartha And The Thule Secret Society\"></iframe>", "author_name": "What We Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/Ulo5q92s8ss/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@whatweknow"}}, "score": 2, "upvote_ratio": 0.67, "comment_count": 0, "over_18": false}, "63": {"id": "1ae02c8", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Louiedipalma67", "link_flair_text": "PGF", "time": 1706952401.7210839, "created_utc": 1706547493.0, "url": "https://i.redd.it/06cvw9cvtefc1.jpeg", "title": "Critical picture showing Bigfoot footage is no hoax", "permalink": "/r/bigfoot/comments/1ae02c8/critical_picture_showing_bigfoot_footage_is_no/", "selftext": "Many leading forensic experts have indicated that these images which show the animals fur with different colorations is a leading factor in the belief this is true footage of a Sasquatch.  would have been impossible to randomly add these type of differences in a gorilla suit built for fooling people.  The people who took the film were far too dumb to have pulled this type of thing off and I mean that with all due respect for their contributions", "media": null, "score": 207, "upvote_ratio": 0.76, "comment_count": 245, "over_18": false}, "64": {"id": "1af8sor", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Evidence", "time": 1706952402.2987533, "created_utc": 1706674171.0, "url": "https://www.reddit.com/gallery/1af8sor", "title": "A collection of various cryptid evidence I was recently sent", "permalink": "/r/Cryptozoology/comments/1af8sor/a_collection_of_various_cryptid_evidence_i_was/", "selftext": "", "media": null, "score": 87, "upvote_ratio": 0.82, "comment_count": 61, "over_18": false}, "65": {"id": "1afv5ry", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Ufonauter", "link_flair_text": "Alien", "time": 1706952402.460231, "created_utc": 1706741191.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1afv5ry/a_collection_of_reports_from_the_60s_to_the_late/", "title": "A collection of reports from the 60's to the late 90's, relaying what can only be described as little greenish men, the majority of these encounters would take place in Puerto Rico & Brazil", "permalink": "/r/Humanoidencounters/comments/1afv5ry/a_collection_of_reports_from_the_60s_to_the_late/", "selftext": "There is often a mocking tone given to the term \"little green men\" usually meant to disparage those with a supposed alien encounter. For many people however, especially within Puerto Rico and Brazil, this one is not an inaccurate statement of sarcasm, but is an accurate depiction to their specific encounters. The following experiences are brought together through Alberto Rosales's 'humanoid encounters' series, as well as some individual finds associated with the attached image links.\nLocation. Entre Rios de Oeste, Parana, Brazil Date: 1962 Time: various\n\nLocals reported encountering strange short humanoids about 1 meter in height,\nwith large round eyes, oval shaped heads, large pointy ears, and luminous bodies.\nThey had short stocky legs and long dangling arms that ended in claws.\nSource: Antonio Faleiro, Brazil\n\nhttps://i.imgur.com/247Rxds.jpeg\nLocation: Desterro Minas Gerais Brazil Date: 1962 Time: night\n\nA witness, E. V. was returning to his ranch in his car when he suddenly came upon\ntwo strange creatures illuminated by the car headlights. The creature’s eyes seem to\nreflect light and their faces resembled that of rats or bats. They had very large ears,\nand short curved arms. Terrified the witness accelerated and attempted to run down\nthe creatures. At that instant both creatures jumped out of sight into the darkness.\nAnother motorist reported seeing an object with some bright lights flying low over the\nsame road.\nSource: Revista Brasileira de Ufologia\n\nLocation. Lima, Peru Date: August 19 1965 Time: night\n\nA young man, Alberto San Roman, reported going up to the terrace on the roof of his\nhouse and encountering a strange greenish dwarf-like being, with very wrinkled skin and\nabout 90cm in height. It had large slanted eyes, and oval-shaped head and large pointy ears. It\nwalked over the roof in a strange ‘duck-like gait’. It came very close to the terrified witness\nwho was able to further see that the creature had short stubby legs and long dangling arms.\nThe creature’s skin seemed to emit dim flashes of light and apparently attempted to\ncommunicate with San Roman using friendly gestures. Apparently since the attempt of\ncommunication was unsuccessful it climbed a nearby antenna tower and entered a hovering\nround object that emitted bright reddish light. Once this was done the craft left at high speed.\nSource: SBEDV 55-59 quoting Instituto Peruano de Relaciones Interplanetarias (IPRI)\n\nhttps://i.imgur.com/w6AxCbm.jpeg\nLocation: Barro Quebradas, puerto rico, December, 1971\n\n\"Efrain Albino saw in a wooded area behind his house a pyramid shaped object on three leg-like supports on the ground. A door opened on its side and a small ramp was lowered to the ground. Three creatures carrying a long tube-like object then emerged down the ramp. The beings were of different heights, one tall, one medium, and one short. A bright light was emitted from the long tube like object partly blinding the witness. The beings were described as thin, with a little larger than normal heads, and large pointy ears. They all had large black eyes, very small noses, and mouths. All wore tight fitting silvery outfits. Albino became frightened and ran back into his house. The next day he found scorched marks at the side of the landing and noticed an unpleasant odor in the area. Other locals had apparently seen the object landing.\nSource: Jorge Martin, Evidencia OVNI # 20\n\nLocation. El Verde Puerto Rico Date: late October 1973 Time: night\n\nAna Dominguez and Jose Alemar accompanied by their daughter and others were visiting\nan area near where their youngest son Jose Jr. had mysteriously disappeared 3 months\nbefore. While Jose was in a nearby ranch house, Ana and her daughter stayed in the car,\nwhich was parked near the road waiting for his return. Suddenly from the left side of the car,\nthey both heard what they thought was Jose’s voice, saying loud and clear; “Negra open the\ncar door, I’m back.” The voice repeated the same thing again, and suddenly the girl pointed at\nsomething outside the car. Ana Dominguez then saw a terrifying looking being standing\noutside the car, leaning on the windshield and looking in. The creature was described as tall,\nthin, with a huge egg shaped head, long pointy ears, and two huge black oval shaped eyes.\nThe being was leaning on the windshield and had placed a “hand” on it. The hand was long\nand skinny, with three long thin fingers, somehow resembling those of a chicken claw. No\nother facial features could be seen, since it was dark outside. Both witnesses now in a panic\nbegan screaming and pushing on the car horn. When Mr. Alemar and the rest arrived the\nstrange being had disappeared. To this date, both mother and daughter are convinced that\nthe voice they heard had been that of Jose Alemar; however they are not so sure if it was\naudible or telepathic.\nSource: Jorge Martin, Evidencia OVNI # 7\n\nhttps://i.imgur.com/V8TZBcM.jpeg\nLocation: El Yunque Puerto Rico Date: late June 1977 Time: 11:00 a.m.\n\nA Mrs. Maldonado had gone to visit the tropical rain forest with her family and was staying\nin a camping ground area. While her husband, Angel Luis, and her children were bathing in a\nnearby river, Mrs. Maldonado decided to some relaxing exercises. Suddenly she became\napprehensive and felt that hundreds of eyes were watching her. She felt numerous presences in\nthe forest around her. Looking closely at the trees she noticed numerous strange beings\nstanding around the fields and behind the trees looking at her. She felt as if the beings were\nattempting to dominate her mind. She felt helpless and could not move at all. The beings were\nthin, dark, and almost human shaped with large elongated heads, hole-like mouths, and small\npointy ears. She did not notice a nose. The beings were about 4-feet tall, with long thin dangling\narms to their knees. She felt a warming and numbing sensation throughout her body; she fought\nthe feeling and was suddenly able to move. She immediately ran towards her husband and\nchildren. They too had felt a strange sensation and saw figures quickly running among the trees.\nThe family quickly picked up their belongings and left the area.\nSource: Jorge Martin\n\nhttps://i.imgur.com/Wnws8bf.jpeg\nLocation: Miramar, San Juan, Puerto Rico, August 26th 1977\n\n\"Nancy Maria Barbosa Ortiz a young secretary at a commercial firm located in the Caribbean\nTowers complex in the metropolitan capital area was busy working on her desk when suddenly\nshe heard a strange sound resembling that of an AM-FM radio located in the adjacent room\nbeing tuned up. Surprised, she went to investigate and as she looked in the door she was\nstunned to see two little men, about 3 feet in height that were standing in the room apparently\nobserving a map of Puerto Rico that had been placed on the wall. When she screamed in terror\nthe two strange beings ran to the back of the room, climbed on top of some chairs and jumped\nout an open window. A client, 27-year old Abraham Almodovar, arrived at the same time to see\nthe two little men ‘flying’ out the window. He got a good look at them, but was too terrified to\napproach. He had arrived at the same time to see Barbosa running down the hall; she looked at\nhim and told him to go in the room to see what she had seen.\nThe secretary was treaty for shock after the incident. Almodovar added that as he walked\nslowly into the room he was paralyzed with fear as he saw one of the little men go flying out the\nopened window, the little man had been standing on top of a chair and was seen to push on it\nwith his feet in order to propel himself outside the window. He further described the entities as\nabout 3 feet tall, with long arms, and short legs. Their heads were large and flattened on the\nback, with two large pointy ears very close to the sides of their heads. A very peculiar detail was\nthat on their foreheads each had what appeared to be protruding antennas. Their feet were\nsmall and appeared to be bare. Their clothing was transparent, resembling plastic, one-piece,\nshiny green in color. Their skin appeared to have scales “like fish”. They did not make a sound.\nAccording to Almodovar, he observed another very curious detail, on the top part of their chest\nhe saw a strange emblem resembling 3 sixes (666). Only when the exited the window was a very\nloud sound heard of undetermined source.\"\nSource: Sebastian Robiou Lamarche, Manifesto Ovni en Puerto RicoSanto Domingo Y Cuba pp 403-404\n\nhttps://i.imgur.com/r5L0yiO.jpeg\nLocation: Mediania Alta, lorza, Puerto Rico, August 31st 1977\n\n\"Ms. Olga Iglesias Fuentes, accompanied by an unidentified friend were both sitting on the\nsteps at the rear of Olga’s home when they spotted an object shaped like a disc flying above a\nnearby palm grove. The craft suddenly stopped in mid-air. And on the bottom they could see a\nlarge white light and two smaller ones, one green and the other blue which blinked in unison.\nAlong the side of the object they could see numerous lighted windows or portholes. The lights\non the object extinguished one by one until the object completely disappeared, as this\nhappened the nearby street lights seemed to increase in intensity. Very excited both girls ran\ninto the house and began notifying the family. Later that same night as they talked about their\nsighting they heard some screams coming from their neighbor Lydia’s house. Running over to\nher she was yelling hysterically, “There were four, there were four, there were four little men\nwearing silvery clothing!”\nAccording to Mrs. Lydia Cruz Rivera, she had gone outside to her patio in order to empty\nsome lard in the bin, when she spotted 4 little men wearing silvery clothing standing next to an\noutside water spigot. Upon seeing the little men she ran to get her husband. However when her\nhusband stepped outside the little men had already vanished. According to Lydia the little men\nhad small antennas, large eyes, with high eyebrows, large pointy ears and didn’t have any hair.\nShe also remembers that they had small mouths, thin long necks, but was unable to see any\ndetails on the nose. Strangely they all had their arms crossed on their chest area.\"\nSource: Sebastian Robiou Lamarche, Manifesto Ovni en Puerto RicoSanto Domingo Y Cuba\n\nLocation. Abra Centro Corozal Puerto Rico Date: September 16 1977 Time: 01:00 a.m.\n\nThe witness, 82-year old Flores Rivera was sleeping in his small home when suddenly he was\nawakened by the appearance of a strange figure standing at the foot of his bed, startled he\nwatched as another similar figure appeared. One of the figures approached Mr. Rivera and this\none, protecting himself flung the figure against the wall, he then heard the other one say, “Do\nnot leave we want to remove your pants” (!). However both figures then seemed to run away\nand disappear into nothingness. Rivera added that as he flung the first entity against the wall it\nfelt as if did not “weigh an ounce” it was very light. He further described the entities as human-\nlike but very short, one had thin facial features, the other more rounded, and both had large\nround eyes and large pointy ears. The first one wore a sort loose fitting sweater, but Rivera\ncould not see any details on the pants. The other entity wore a very tight-fitting shirt. Both were\nno more than 3 feet tall.\nThe first entity had blondish yellow hair and the 2nd one black hair, but according to Rivera it\ncould have been a ‘helmet’, both had ‘ugly mouths’, with protruding thick lips. Several months\nbefore Rivera and his wife had seen a red-colored sphere that emitting a sort of ‘raking’ noise,\nflying low over the fields.\nSource: Sebastian Robiou Lamarche, Manifesto Ovni en Puerto Rico Santo Domingo Y Cuba\n\nLocation. Rios dos Indios, Rio Grande do Sul, Brazil Date: December 1978 Time: night\n\nThree girls, Mercedes, Fatima & Neusa were returning from school along an isolated path when they\nobserved an intriguing creature about 1 meter in height, huge pointed ears, wearing a red & black outfit\nand with what appeared to be two small antennas on the top of its head. It was walking silently down a\nwooded path. No other information.\nSource: Revista Brasileira Ovni\n\nhttps://i.imgur.com/85O50Te.jpeg\nLocation. Aguadilla Puerto Rico Date: March 23 1980 Time: 01:30 a.m.\n\nA security guard making his rounds on the grounds of the local hospital encountered a\nstrange four-foot tall being wearing a gray outfit with headgear, it wore two bright medallions\non its chest and it had gray skin. It had large slightly slanted deep-set eyes, a flat nose and a\nlarge wide mouth; it also had large pointy ears. The witness also noticed black hair under the\nhead cover. The guard pointed his revolver at the little man and suddenly this one spoke in a\nguttural voice and yelled “Life!” The guard fired his weapon anyway with no apparent effect\nand then he fainted. When he came to the little man had disappeared.\nSource: Jorge Martin, Enigma # 1\n\nLocation. Aguadilla, Puerto Rico Date: March 24 1980 Time: night\n\nThe day after a security guard had encountered a bizarre creature on the grounds of the\nlocal hospital, a nurse and a female visitor to the pediatric wing of said hospital saw a strange\nfemale being, with pointed ears and large eyes, wearing a tight fitting gray outfit. Upon being\nseen the creature ran from the area and disappeared. The reason both witnesses could tell\nthat it was a female is that the outline of breasts could be seen on its tight fitting outfit.\nSource: Jorge Martin, Milenio X # 1\n\nhttps://i.imgur.com/SPMeVaE.jpeg\nLocation: Lguna Cartagena, Puerto Rico August 31st, 1990\n\nMr. Miguel Figueroa was going to his place of business, and arriving there found that there\nwere about a dozen cars parked there. Given the unwonted hour he was astonished, and he\nasked what was going on. The entire group of people seemed to be highly excited---especially\none woman who was screaming that she had just seen some children or strange little men,\npassing by, who had huge heads and huge eyes. They had passed in front of the cars, and the\npeople were still parked there and talking about it, “because the things were still there”. Mr.\nFigueroa replied that no doubt somebody had want it to play a trick on them by dressing up, or\nsomething of the sort. But his curiosity aroused he drove on in the direction of the road towards\nBoqueron which was whither the little men had gone. And to his immense surprise, he saw,\nbeside the highway, five most strange little beings---two of them taller than the rest, about 4 ft\nwhile the others were about 3ft. \nHe said, “Their clothing or something---I don’t know whether it\nwas clothing or their own skin---because they were all gray, was from head to feet. But at the\nknees and elbows they had what looked like “sections that passed one into the other”. Their\nheads were big and egg-shaped. Compared to their bodies, the heads were large, and their eyes\nwere big and shining. He noticed also that their ears were long and pointed, just as the people at\nhis place of work had said. He said that on their feet they had only three large toes, and on their\nhands only three large fingers. As he drew closer to them, his headlights lit them up. Then one\nof them, turned around towards him, and he noticed that it had large slanted eyes emitting a\nvery brilliant white light. He could also see that for noses they had merely tiny holes, almost no\nnoses at all, and their mouths were extremely thin and tiny, as though with no lips at all. \nTheir chins were very small and very pointed. And then the rest of them all turned around too and\nbecame enveloped in a very bright light. It was a very powerful light like a welder’s torch that\nblotted out the headlights of the car. Figueroa became frightened, and seeking to cover himself\nreversed the car and backed away from them a bit. And when he pulled off to a distance, they\nturned away again and continued walking on again along the road just as though nothing had\nhappened. However, Figueroa still followed them at a distance. A bit further on, he saw that\nwhen on the road they came to a little bridge over a ravine, they jumped down, one after the\nother, and went off towards the left along the edge of the ravine and vanished there, while\nFigueroa remained sitting in his car petrified with fear.\nSource: Magdalena Del Amo Freixedo, FSR Vol. 36 # 4\n\nLocation. Mini Mini Puerto Rico Date: May 14 1991 Time: afternoon\n\nTwo young men playing in an isolated field encountered a small circular silvery metallic\nobject on the ground. It was very shiny and had a small dome-like sphere on its top. The boys\napproached the object and began touching it. Suddenly a small hatch opened on the bottom of\nthe craft and a long thin green arm came out grabbing one of the boys by his leg. As the boy\nstruggled to get away a second thin arm emerged and grabbed him by his arm. The boy grabbed\na piece of wood and began striking one of the creature’s arms. He managed to cut off one of the\nfingers and the creature let go. The finger fell to the ground oozing a green liquid. The witnesses\nattempted to retrieve the severed finger but dropped it during the panic. They both fled but\nlater returned to find both the object and its occupant gone.\nSource: Jorge Martin, Enigma # 42\n\nLocation. Mini Mini Puerto Rico Date: May 14 1991 Time: night\n\nAn adult witness was looking out his bedroom window when he briefly saw a short green\nskinned figure with large pointy ears, a pear-shaped head, and large red oval shaped eyes. The\nfigure quickly scurried away into the brush.\nSource: Jorge Martin, Enigma # 42\n\nhttps://i.imgur.com/A7NAZyS.png\nLocation. Mini Mini Puerto Rico Date: May 15 1991 Time: 1530\n\nNear the same spot of a previous encounter, two boys were playing near the woods when\nthey heard a noise and saw a strange being emerge from the woods. The being was described as\nshort and bright green in color, with an oval shaped head, large almond shaped eyes and huge\npointed ears. It was thin with very long arms with three digit hands, the being stood looking at\nthe witnesses emitting a strange “chatter” like noise. The witnesses threw fruits at it then\nchased it, but it ran quickly and disappeared down a drain aqueduct. At one point the being\ngrabbed one of the boys by the foot making him fall.\nSource: Jorge Martin, Enigma # 42\n\nLocation. Carolina Puerto Rico Date: late November 1991 Time: 2100\n\nThe witness was en route to a store on a roadway along a rural area when he heard some\nnoises coming from the nearby brush. He looked in the direction of the noises and saw two\nstrange looking short creatures. They were 3-foot tall and were wearing a tight fitting silvery\noutfit that was very shiny. Their heads were large and they had large pointed ears, they also had\nlarge bright white eyes. The witness did not notice a mouth or a nose. Both of the creatures\nwere encased in a mild glow. The beings were collecting plant and rock samples and putting\nthem in a small vase-like container. The beings suddenly noticed the witness and ran through\nthe brush, quickly disappearing from sight.\nSource: Jose Perez, Jorge Martin, Jorge Berrios, Enigma # 49\n\nhttps://i.imgur.com/uHJLmwB.jpeg\nLocation. Colinas Del Yunque, Puerto Rico Date: middle of August 1992 Time: 1700\n\nAt least six independent witnesses including three children saw in broad daylight two short\nbeings walking side by side on the middle of the roadway. The beings were described as four-\nfoot tall with shiny light-green skin, very thin long arms, and heads somewhat larger than\nnormal and covered with a stringy light-brown hair. They appeared to be only wearing a pair of\nwhite shorts with a red stripe on the side. The children followed the short beings for a short\ndistance until they entered a wooded slope and disappeared. One of the witnesses claims that\none of the beings gave her the two finger “peace” sign as he walked by.\nSource: Jorge Martin, Enigma # 60\n\nLocation. La Mina Cascada, El Yunque Puerto Rico Date: March 1993 Time: afternoon\n\nTwo men, Nelson Berrios, and Joaquin Ruiz were photographing the scenery in the area and\nhad made their way up to a local waterfall when Berrios decided to take some snapshots of the\nplace. The next day, when they called to pick their developed film, they were astounded to hear\nfrom the technician that had developed it that several of the photos showed an entity, in\nprecisely the same spot, peering out from behind a rock. Ruiz saw nothing while taking the\nphotos. The entity was described as being about the size of a child, bald headed, with oval\nshaped eyes, pretty deeply set, and wrinkled sort of features as though old.\nSource: Jorge Martin, Flying Saucer Review\n\nLocation. La Playa Guayanilla, Puerto Rico Date: December 15 1994 Time: 03:00 a.m.\n\nMiss Myrna Rodriguez had been in a deep sleep, when she suddenly had the sensation that her\nbody was lifting up, apparently floating away from the bed. She wakes up with a start\nand finds herself unable to move. When she looked around, she found herself\nsurrounded by four short humanoids, 2 on each side of her body, who were apparently\nsomehow holding her up in mid-air without any means that she could see. The beings\nwere short & thin, with huge round hairless heads, small pointed ears, & huge dark\nslanted eyes. They had what appeared to be mole-like marks under their eyes & their\nnoses & mouths were almost indistinguishable. They had thin bodies with long skinny\narms. They all wore dull silvery uniforms. With their delicate hands the beings began\ntouching the witness all around her stomach and chest area, at the same time talking to\nthemselves in a low murmur like chatter. The witness was then startled to see that the\nbeings had somehow opened her chest area, without her feeling any pain or discomfort,\nthey seemed to be checking her internal organs, including the heart, which she saw it\nmove as it pumped blood to her body. During the whole experience she felt a sense of\njoy and peace, and was convinced that the beings were benevolent and were here to\nhelp. Soon she floated gently back to her bed where she was able to move and\nimmediately checked her stomach & chest area for any scars and found none. The\nbeings had disappeared.\nSource: Jorge Martin in Evidencia OVNI # 5\n\nLocation. Anones Naranjito Puerto Rico Date: September 22 1995 Time: 1730\n\nRosa Jimenez was out in a field gathering her cows when she noticed a short child-like figure\ncrouching behind some nearby weeds. The being had a large head, with a wide\nforehead. It had beautiful slanted eyes, with red pupils, a flattened nose with rosy\ncheeks and small pointed ears. It had a thin mouth and a pointed chin. The being’s skin\ntone seemed to change from gray to gold-beige in color. His hair was light in color and\nseemed to be sticking straight up. The beings wore a light tunic that covered him from\nhis neck down to his feet. The being stared at the witness and smiled at her, he then\nslightly turned his head and ran into to the woods. A week later she saw the same being\nhiding behind a tree trunk. She spoke to him but did not receive an answer.\nSource: Jorge Martin Evidencia OVNI # 8\n\nLocation. Rio Lajas, Dorado, Puerto Rico Date: October 1995 Time: night\n\nOn various occasions the Mojica & Cartagena family that lived isolated ranches have seen\ndifferent types of humanoid creatures in the area. One creature was described as short\nhuman-like, with a child-like body, with gray-blue skin, a head slightly larger than\nnormal, with pointed ears, & sparse hair, with large almond shaped eyes & a very small\nnose. This creature seemed to have a slight smile & was wearing a very tight fitting gray\ncolored outfit that covered him completely up to the neck. Another type of beings seen\nwas described as about six feet tall with very similar features to the small child like\ncreature, wearing the same type of outfit. This one has been seen in conjunction with\nthe “Chupacabra” type creatures that he seems to be “keeping an eye on”. On one\noccasion the witnesses saw 14 Chupacabra type creatures of different sizes walking\nsingle file up the side of a hill. Others in the area have seen unknown aircraft and lights\nover the fields.\nSource: Jorge Martin Evidencia OVNI # 10\n\nLocation. Guanica, Puerto Rico Date: October 20 1995 Time: late night\n\nThe 5-year-old witness woke up hearing a noise. He then noticed a shadow next to the door that\nseemed to be running back and forth. Afraid he hid under the covers, but could still see\nthe shadowy figure. He then got up and saw a short dwarf like figure outside the room,\ndescribed as thin, with a wide face, with large pointed ears, huge dark eyes, and light\ngray wrinkled skin. The dwarf made some hand gestures and showed him something\nresembling a cross and a piece of paper. The witness then looked outside and saw a\nmetallic object with several bright lights hovering close to the ground. A beam of light\ncame out of the object and retracted the dwarf-like creature inside. The object then left.\nSource: Jose Martinez Puerto Rico Research Group\n\nLocation. Guanica, Puerto Rico Date: October 21 1995 Time: late night\n\nA young boy (involved in the previous encounter) was sleeping when a powerful light entered\nhis bedroom. The brightness of the light woke him up. He then saw a small reddish\nsphere come in through the window and fall to the floor. When it hit the ground, it\ntransformed itself into a short dwarf-like creature, with long pointed ears, and huge oval\nshaped eyes. Screaming he ran to the closet. His grandfather who had noticed the bright\nlight in the boy’s room now came inside to see what had happened. Upon entering the\nroom he saw the bizarre creature. He tried to hit the creature with a bat, but the\ncreature suddenly transformed itself into a ball of light and shot out the window.\nLooking out the window he then saw a landed metallic object on the patio resting on\nseveral legs. It had several lighted windows and lights. Suddenly the object shot up into\nthe sky at very high speed.\nSource: Jose Martinez, Puerto Rico Research Group\n\nhttps://i.imgur.com/f3I9LjI.jpeg\nLocation: Santa Terezinha, Piracicaba, Sao Paolo, Brazil August 27th, 1996\n\nA luminous object measuring four meter sin diameter, flew over the area late at night and then landed in an empty plot of land. The phenomenon, according to local residents, was witnessed by ore than a hundred people. Witnesses said they saw it when it flew over the Santa Terezinha neighborhood at a low altitude. According to the witnesses, the ship was very bright, and did not emit any type of sound.\nThat same night, Joao Galvao Coelho and his wife Ivanete were returning home on their motorcycle, when they saw a luminous object, that was flying overhead at a low altitude. At first, Joao thought it was an airplane, but after observing it better, he concluded that the maneuvers carried out by the strange object were unconventional. According to Coelho the object, the object was approximately four meters in diameter and had dozens of colored lights surrounding it. \nAfter a few minutes, the UFO made a sudden turn and began to descend diagonally. Joao and Ivanete thought the object was going to crash and decided to follow it to make sure it was something unexplained. When they arrived near a vacant lot, they now realized that the object was hovering about 60cm above the ground. Joao stopped his motorcycle at approximately eight meters from the location and began flashing his headlights at the craft.\nAt that moment, Ivanete was able to observe a kind of ramp that began to descend from the bottom of the UFO. The ramp had the same shades of light that shone around the object, that is, red, yellow and green. Then, according to the witnesses, three small beings, approximately 50cm tall, with large heads disproportionate to their bodies, descended on this ramp. “It looked as if they were wearing helmets, they had huge ears and on the top of their heads, an antenna from which red lights were flashing,” declared Joao. The three creatures each carried an object similar to a pen in their right hands.\nThe beings then went towards the couple, but the frightened couple drove away in a panic. Upon arriving at their house, they found that several neighbors had also observed the same phenomenon.\nUfologists at the site reported finding three symmetrical perforations on the ground, which formed a triangle, and in the center a fourth hole. Experts took samples of the vegetation to check whether there had been any chemical changes with the plants.\nSource: UFO Genesis, UFO landing in the interior of São Paulo https://ufo.com.br/artigos/aterrissagem-de-ufo-no-interior-de-sao-paulo.html (defunct source) also Claudeir Covo (INFA), & Diario do Povo newspaper – September 4 1996, & Eduardo and Osvaldo Mondini, CEPEX.\n\nLocation. Penuelas, Puerto Rico Date: September 26 1997 Time: 2200\n\nIvan Rivero Morales and several other witnesses watched an object flying around a nearby\nmountaintop for about an hour and then land on the summit. The intensity of its light dwindled\nto a soft amber glow, which it retained during the duration of its landing. To the witnesses\nsurprise that were watching the object with binoculars and telescopes, a number of tall beings,\ndescribed as greenish with large oval shaped heads, black eyes, pointed ears and a protruding\nbelly descended from the object and walked around the summit for one hour. After this length\nof time had elapsed, the beings re-entered the craft and its brilliance increased to previous\nlevels, it then vanished in a matter of seconds.\nSource: Federico Alvarez Frank\n\nLocation. Penuelas, Puerto Rico Date: September 27 1997 Time: night\n\nLocal residents again watched an object land on the summit of a nearby mountain, but this\ntime it was accompanied by another, smaller object. The large object landed on the same spot it\nhad occupied on the previous evening, and its tall greenish occupants descended once more\nfrom within. On this occasion, the beings, described again as having protruding bellies, long thin\narms, large oval shaped heads, with pointed ears, remained outside for two hours, while the\nsmaller object remained motionless over the location. After two hours both objects rose into\nthe air and vanished from the location. The only means of access to the mountain top is by\nhelicopter.\nSource: Federico Alvarez Frank\n\nLocation. Lima, Peru Date: 1999 Time: late night\n\nA family was woken up by the sound of something falling on their roof and then footsteps.\nLooking out the window they saw a short humanoid figure, described as having a greenish head,\nwith pointy ears and a brown body that had apparently jumped from the roof to their patio. The\nentity scurried away in a peculiar sideways fashion and was quickly lost from sight. \nno source given\n\nLocation. Not given Date: June 18 1999 Time: late night\n\nAdam Clark woke up in a cold sweat and heard a high pitch humming sound coming from\noutside. Deciding to investigate he walked outside and saw a large triangular shaped object with\nan orange light on each corner and a pink light in the middle hovering over the yard. As he\nstared at the object he suddenly found himself in a cold dark room sitting on a cold metal “iron\nboard.” There were two “little green men” with pointy ears, and long arms that went down to\ntheir knees. He heard a telepathic message from one of the humanoids telling him that they\nwere going to give him an implant. He screamed and remembers the little men walking towards\nhim. His next memory was of standing in the yard and looking up and the object disappeared\nback up into the sky. He has no further memories.\nSource: Starbuck’s UFO Abduction Page\n", "media": null, "score": 13, "upvote_ratio": 0.89, "comment_count": 2, "over_18": false}, "66": {"id": "1aggc6h", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "dre_the_brazilian", "link_flair_text": null, "time": 1706952402.9315197, "created_utc": 1706808279.0, "url": "https://i.redd.it/zjcjehgbd0gc1.jpeg", "title": "What are your thoughts on the sewer gators?", "permalink": "/r/cryptids/comments/1aggc6h/what_are_your_thoughts_on_the_sewer_gators/", "selftext": "", "media": null, "score": 48, "upvote_ratio": 0.94, "comment_count": 34, "over_18": false}, "67": {"id": "1ahnm6o", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "SYPFTW_16", "link_flair_text": null, "time": 1706952403.222107, "created_utc": 1706934584.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ahnm6o/man_with_a_briefcase_asks_me_to_call_a_taxi_for/", "title": "Man with a briefcase asks me to call a taxi for him", "permalink": "/r/LetsNotMeet/comments/1ahnm6o/man_with_a_briefcase_asks_me_to_call_a_taxi_for/", "selftext": "This happened seven years ago when I was in my early twenties.\nMy boyfriend at the time and I both worked but were very poor so I went to the Department of social services to apply for food stamps.\nWhen I pulled into the parking lot I noticed the lot  was empty except for an older man with a briefcase.\nThe man looked out of place but I rolled down my window slightly and asked if the office was open. He told me it was closed due to it being a holiday.\nI told him thank you and went to leave when I realized he was walking up to my car.\nHe put his hand on the window and leaned into the open part of the window (maybe about 3 inches of my window was open).\nHe had a terrifying aura and I immediately felt afraid but being a polite person who doesn’t like to assume I smiled at him and asked if there was something I could help him with.\nHe said yes and pulled his phone out of his pocket and told me that he needed me to call a taxi for him because he had tried many times but they could not understand his accent.\nI thought it was a weird request but I obliged. \nIt was cold and I assumed (probably wrongly) that he had walked all the way up to the SS office only to find it closed and wasn’t getting the help he needed.\nHe typed in a number, dialed it and handed me his phone.\nThe phone rang and went to voicemail that was in a foreign language and he told me to leave a voicemail asking the “taxi company” to come pick him up at the SS office which I did.\nI handed him his phone back and during the hand off he grabbed my face with his other hand and kissed my cheek while forcing his other hand into the car. \nI pushed the phone at him, pushed him away from me and sped off.\nWhen I got home I noticed that there were handprints both on the window where he was gripping while I made the call and on my door handle. \nMy boyfriend at the time drove out to the SS office immediately (which was stupid) but he was so angry and wanted to do something. He never found the man with the briefcase.", "media": null, "score": 14, "upvote_ratio": 0.89, "comment_count": 1, "over_18": true}, "68": {"id": "1ahmrip", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Tehgheyboi", "link_flair_text": null, "time": 1706952404.0827072, "created_utc": 1706931822.0, "url": "https://www.reddit.com/r/Ghosts/comments/1ahmrip/my_husbands_encounter_in_hospital_when_he_almost/", "title": "My husbands encounter in hospital when he almost died.", "permalink": "/r/Ghosts/comments/1ahmrip/my_husbands_encounter_in_hospital_when_he_almost/", "selftext": "My husband had a history of his heart rate dropping into the low 40s. This morning it started happening again and he collapsed once got up and said I needed to call 911. He said something was different this time. By the time the paramedics got him to the hospital his heart rate was down to 20. He was surrounded by a team of nurses and doctors trying everything to bring his heart rate up. This was when things got weird.\nThey started to shock his heart to get it into a normal  rhythm. Each shock he said was extremely painful. During these shocks my husband looks up in the room full of drs and nurses and sees an older lady in normal clothing, no badge on, approach him. This furring all the chaos of multiple medical staff trying save his life. The older women reaches him and whispers in his ear. She tells him not to worry everything will be ok. As she was speaking to him an incredible warmth filled his body and any fear he had went away and he felt calm. The woman walks away. The Drs determine he needs an emergency pacemaker installed. He has the surgery and then things get weirder.\nIn ICU recovering he shares the story with me about the lady in the ER. While sharing this story with me he is very emotional and crying. I ask the nurse if their would have been anyone in the ER that would have approached him like the old lady inn street clothes did and she said no way.ok this is definitely getting weirder. For context my husband is a 43 year old, pretty much an atheist who doesn’t believe in ghosts or angels.  After a few days he is released from hospital. He goes home and I post this amazing story on Facebook.  A couple days pass and our take on reality is shook to our core.\nI am sleeping on his third day home when I hear him screaming and crying. Oh my god it’s her! It’s her omg! I run to the room his is in and he is balling. I ask what’s wrong and he shows me a picture on his phone. It’s an obituary featuring a picture of an old lady. It’s her he cries. The obituary was text to him from a close friend of ours. She had saw my post about his ER experience and did a search of the people who had died in the hospital the same day hee was in the ER. The lady I was looking at had died around the same time he was in the ER. Wtf!", "media": null, "score": 480, "upvote_ratio": 0.94, "comment_count": 68, "over_18": false}}}