{"_default": {"1": {"id": "17ejrv6", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "ClockworkSkyy", "link_flair_text": null, "time": 1698460527.9696136, "created_utc": 1698065890.0, "url": "https://www.reddit.com/r/conspiracy/comments/17ejrv6/people_are_different_since_the_pandemic/", "title": "People Are Different Since The Pandemic", "permalink": "/r/conspiracy/comments/17ejrv6/people_are_different_since_the_pandemic/", "selftext": "Is it just me? \nPeople seem different, I absolutely loathe retail shopping now. Rude, selfish and inconsiderate people are everywhere that give you the death stare. It feels like they're in their own world and nothing else outside of it matters. Same goes for driving, I love driving but now I loathe that too. \nIt's like people have very short fuses, always reacting to things that should never be a problem in the first place. Everyone I speak too has constant brain fog and it's like they're in a trance.\nI used to enjoy being out in the city. Now I don't, its very much a different vibe.\nEDIT 1: Wow, it's quite clear that I'm not alone here. Maybe us that see things outside of the consortium can clearly see things going down hill.\nEDIT 2: Did not expect it to blow up with so many like-minded individuals. I guess now is the time to form strong communities within the areas we live. ", "media": null, "score": 2969, "upvote_ratio": 0.89, "comment_count": 1189, "over_18": false}, "2": {"id": "17fkkm0", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1698460528.3035731, "created_utc": 1698174445.0, "url": "https://youtube.com/live/5vdwG4dlRiA", "title": "Did Aliens Drop Bigfoot On Earth?", "permalink": "/r/conspiracyfact/comments/17fkkm0/did_aliens_drop_bigfoot_on_earth/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.63, "comment_count": 7, "over_18": false}, "3": {"id": "17h6x67", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "GlobalUfoChannel", "link_flair_text": "Discussion", "time": 1698460530.1795435, "created_utc": 1698355015.0, "url": "https://v.redd.it/uoy2wxgb5mwb1", "title": "Triangular shaped UFO caught on doorbell camera in England. What are your thoguhts?", "permalink": "/r/ufo/comments/17h6x67/triangular_shaped_ufo_caught_on_doorbell_camera/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/uoy2wxgb5mwb1/DASH_1080.mp4?source=fallback", "has_audio": false, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/uoy2wxgb5mwb1/DASH_96.mp4", "dash_url": "https://v.redd.it/uoy2wxgb5mwb1/DASHPlaylist.mpd?a=1701052528%2CYjg4OTFiNzg1MzYyYmNiZDliZTk4NzhiNzkzMzgxNjg5OTc4MzVhYzg2ZTI4OWY5MDMyYjhkYTQ1ZmFjNjIwNg%3D%3D&v=1&f=sd", "duration": 55, "hls_url": "https://v.redd.it/uoy2wxgb5mwb1/HLSPlaylist.m3u8?a=1701052528%2CMWNhYjg4MDgwYzNmZThlYjdkM2JiMjI0ODIxOTRmNzMxN2QwZDBiMjNhMWNmNTk2ZTBjMGMxNWYwMzJmMTcxNw%3D%3D&v=1&f=sd", "is_gif": true, "transcoding_status": "completed"}}, "score": 1180, "upvote_ratio": 0.89, "comment_count": 370, "over_18": false}, "4": {"id": "17h7ror", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "skywalker3819r", "link_flair_text": "News", "time": 1698460531.3136501, "created_utc": 1698357233.0, "url": "https://twitter.com/ask_a_pol/status/1717658130610323545?t=Rn3W_29Mhrw6xz42j04X1A&s=19", "title": "NEWS: \"What it appears to be is somebody has discovered something—some advanced form of propulsion or technology—that may actually change all of our lives,\" Rep. Eric Burlison told reporters upon leaving a classified UAP briefing this morning. 🛸", "permalink": "/r/UFOs/comments/17h7ror/news_what_it_appears_to_be_is_somebody_has/", "selftext": "NEWS: \n\"What it appears to be is somebody has discovered something—some advanced form of propulsion or technology—that may actually change all of our lives,\" @RepEricBurlison told reporters upon leaving a classified UAP briefing this morning.  🛸", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/ask_a_pol/status/1717658130610323545", "author_name": "@askapol", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">NEWS: <br><br>&quot;What it appears to be is somebody has discovered something—some advanced form of propulsion or technology—that may actually change all of our lives,&quot; <a href=\"https://twitter.com/RepEricBurlison?ref_src=twsrc%5Etfw\">@RepEricBurlison</a> told reporters upon leaving a classified UAP briefing this morning. <a href=\"https://t.co/eVr7z0058F\">https://t.co/eVr7z0058F</a> <a href=\"https://t.co/Wrgrx3nhpA\">pic.twitter.com/Wrgrx3nhpA</a></p>&mdash; @askapol (@ask_a_pol) <a href=\"https://twitter.com/ask_a_pol/status/1717658130610323545?ref_src=twsrc%5Etfw\">October 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n", "author_url": "https://twitter.com/ask_a_pol", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 4339, "upvote_ratio": 0.86, "comment_count": 1218, "over_18": false}, "5": {"id": "17f3g2g", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "JJescapes", "link_flair_text": "Video", "time": 1698460532.7718763, "created_utc": 1698118377.0, "url": "https://v.redd.it/04m0nw9ql2wb1", "title": "2,000 year old Nazca Lines in the desert that can only be seen from a plane - could ancient humans have drawn this without help?", "permalink": "/r/aliens/comments/17f3g2g/2000_year_old_nazca_lines_in_the_desert_that_can/", "selftext": "Took a flight over the Nazca Lines in my recent trip to Peru. How is it possible for people 2000 years ago to draw these, and for what purpose since they couldn’t see the entire drawings themselves?", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/04m0nw9ql2wb1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/04m0nw9ql2wb1/DASH_96.mp4", "dash_url": "https://v.redd.it/04m0nw9ql2wb1/DASHPlaylist.mpd?a=1701052531%2CMmRiYjJmN2M5YTVhZWY2NmQ1YjkxZWJlOTBkOGNmNDVlNmY0NzdlYzliY2FjZWRjYzBlN2I4OTk5MjNlYmE0Mg%3D%3D&v=1&f=sd", "duration": 40, "hls_url": "https://v.redd.it/04m0nw9ql2wb1/HLSPlaylist.m3u8?a=1701052531%2CNjRjMTg5ZjYwMTg1YTZkMDVjY2FkM2JjNThmYTExODZjMTczNTYwOGUyYThlZmFiZDU5NmJmOTIxNjE0YTAzMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 5750, "upvote_ratio": 0.77, "comment_count": 1541, "over_18": false}, "6": {"id": "17eda26", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Video", "time": 1698460533.1900635, "created_utc": 1698039664.0, "url": "https://v.redd.it/j97si37e3wvb1", "title": "New clip from David Grusch's NN interview, \"It's obvious IC disrespect to the legislative branch... I had one agency say, [we'll grant you access], and then [they wouldn't return any inquiries from myself or the UAPTF]. In one case, they tried to kill all my security clearances... a show of force.\"", "permalink": "/r/UAP/comments/17eda26/new_clip_from_david_gruschs_nn_interview_its/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/j97si37e3wvb1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/j97si37e3wvb1/DASH_96.mp4", "dash_url": "https://v.redd.it/j97si37e3wvb1/DASHPlaylist.mpd?a=1701052532%2COWVhYWFkNzc1YTVmYzQ0ZmQ1MjRhYmQwOTY0MjhlOTgxNGUzODA4MWNkMDZjNWUyMDA2M2U1ZWYxOGQ1MDI4ZA%3D%3D&v=1&f=sd", "duration": 72, "hls_url": "https://v.redd.it/j97si37e3wvb1/HLSPlaylist.m3u8?a=1701052532%2CMjBhOTliMmJjMDEwYjVlYmU4ZWUyODFmN2ZlYjY4ZjczNzYyYjZhMTA4ZGJiMTk3MGQ5MDRiOTUxYjY0MjlhNA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 629, "upvote_ratio": 0.94, "comment_count": 76, "over_18": false}, "7": {"id": "17er4uw", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "moondog151", "link_flair_text": "Murder", "time": 1698460533.6188853, "created_utc": 1698085125.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/17er4uw/three_teenagers_were_found_stabbed_and_beaten_to/", "title": "Three teenagers were found stabbed and beaten to death in their tents by a lakeside while camping. 44-years-later the only survivor would be put on trial only to be acquitted.", "permalink": "/r/UnresolvedMysteries/comments/17er4uw/three_teenagers_were_found_stabbed_and_beaten_to/", "selftext": "Seppo Antero Boisman and Nils Wilhelm Gustafsson had both been inseparably close friends since they were 12 years old and often spent the nights at each other's houses and both became electricians after graduating from school. In May of 1960, Seppo now 18, began dating a girl, 15-year-old Anja Tuulikki Mäki. Around the same time, Nils began dating another 15-year-old named Maila Irmeli Björklund.\nTwo weeks after Nils's birthday, the four decided to go camping near Lake Bodom outside of Espoo located in Finland's Uusimaa Region. Maila was excited for the upcoming holidays and her first summer without having to care for her younger brothers. Although Seppo and Nils's parents saw them as reliable and trusted them, Maila and Anja's parents were reluctant to let them go camping alone as they saw it was unsafe and only agreed after relentless begging.\nThe campsite was a 30-minute drive from their home in Helsinki. They arrived on June 4, 1960, and Seppo got to work borrowing a canvas tent, brought fishing gear, a few knives, pliers, two bottles of strong liquor and a dozen light beers from home. Nils bought bread, sausages and snacks. In the afternoon the Seppo and Nils borrowed two motorcycles which they used to drive them and Anja and Maila to the campsite. The four set up on the south shore of the lake where they found a satisfactory camping spot on a small peninsula. Only a few steps away from the beach. Their camping spot was noted for being in a safe and private location.\nSeppo and Nils not long after, dropped off their backpacks and reboarded their motorcycles and drove back to the campsite canteen one kilometer away from their campsite. They purchased a few packs of chewing gum and bottles of soda to mix with wine. By the time they returned to the campsite, it was already 7:15 p.m. and thus not many people were outside anymore. The last thing known about what they were doing was how they set up their single tent which could barely fit all four people leaving it quite crowded.\nEarly the next morning on June 5, two young people were going for a stroll alongside the south shore of Lake Bodom. It was nearly 6:00 a.m. when they heard the sound of someone moving and found higher ground to try and locate the source of the sound. There, the two found two motorcycles leaning against a birch tree. They also found a partially collapsed tent. On the tent was a man lying on the tent. His face could not be clearly seen and could only note that he was wearing dark trousers. Later, they saw another man walking away from the tent and into the woods. The two again, couldn't make out his face and only saw that he was wearing a light-coloured shirt. The man entered the woods and later disappeared. The two wanted to get a closer look at the motorcycles but left so as to not disturb their fellow campers.\nAround the same time a 14-year-old boy named Olavi Kivilahti, was sitting by the rocks near the lake waiting for those he was fishing with to return. While waiting he noticed a young man about 20 years old of average height, with brown hair combed back, wearing a light-coloured shirt and dark trousers walking out of the forest. He then walked southward and disappeared from his view.\nBy 10:00 a.m. more and more campers were waking up leading to the tent being noticed by many more. A group of teenagers swimming in the lake nearby to the campsite saw the tent collapsed with a man lying on top of it. They assumed there was a fight going on between campers and decided they didn't want to get involved. At 11:15 a.m. a passerby saw the same man lying on the tent and he would be the one to finally take action. He ran towards a nearby construction site to use a public phone to call the police.\nThe local police accompanied by detectives arrived. The man lying on top of the tent was Nils. Nils had been heavily beaten as his face was swollen including his eyes swollen shut. Nils also suffered several fractures to the left side of his jaw, cheekbone and temple. Other injuries consisted of stab wounds to his left forearm and right face, and a stab wound to his cheek that completely cut through the muscle exposing his teeth.\nThe police looked inside the tent and found the other three campers. Seppo was lying on the edge of the tent near the entrance with his hands placed on his chest. He had been struck several times on the chin and face with a blunt object with several fractures to his skull. Furthermore, he had been stabbed multiple times through the tent canvas with two fatal wounds to his neck and chest. Anja was found curled up, face down with her shirt pulled up over her head. She had suffered several blunt force wounds to her head resulting in skull fractures. Lastly, Maila was lying near the tent of the curtain her left leg was parallel to Anja's back, and her right leg was bent on Anja's head. Maila's shirt was pulled up to her shoulders and her jeans pulled down toward her knees. She had suffered three blunt force wounds to her head resulting in fractures to her skull and jaw causing severe brain swelling and intracranial bleeding. Lastly, she had suffered 15 stab wounds to her neck and shoulders. Nils was miraculously still alive and rushed to hospital.\nThe police believed that the killer first cut the drawstring and left the canvas of the tent alone so he could easily see the heads of the campers to strike with them being trapped and unable to escape under the tent and that they wouldn't be able to see their attacker. The police collected all of their items from the crime scene consisting of clothes, bags, cigarettes, cosmetics and a lyrics book belonging to Anja. Police also found four knives but none of them were the murder weapons. Two of their bottles of alcohol were left behind with one containing an unknown fingerprint not belonging to any of the four.\nSeveral other items, however, were missing consisting of their wallets and ID cards, a knife, Seppo's leather jacket, two male watches, shoes and the keys to the motorcycles. Over the next few days, police alongside several volunteers  and even soldiers conducted various searches of the campground. The police used metal detectors and dogs, as well as searching the lake and using divers to go to the bottom of Lake Bodom with every single item recovered from the bottom of the lake being recovered. On the side of the road 500 meters away from the crime scene, the police found a pair of worn-out brown leather shoes under a stone with several blood stains on them and another pair of shoes in the bushes across from the road. The first pair of shoes belonged to Nils while the other pair were Seppo's.\nDue to the violent nature of the crime, it was made the police's main priority. The police appealed to the public for information and asked them to come forward if they had any information on the killer. After this appeal, the police had to deal with dozens of false leads including people being reported to police for no other reason aside from being out late. None of those reported to police had any evidence indicating guilt and every single suspect was released.\nThe police's investigation reached a dead end for the time being as they had no suspects. While the police were chasing leads the locals had their own suspect, a 51-year-old man named Karl Valdemar Gyllström. Karl owned a Truck Stop and Kiosk nearby to the canteen and campsite so many campers would often visit his establishment to purchase various items. Karl was known for his violent temper which seemed to come and go. Karl would hide razor blades inside the apples growing on trees near his property to stop and punish the Children picking them and was known as a heavy drinker who despised campers at the lake.\nKarl was also known for attacking others. A local resident saw Karl illegally hunting on his land and when he asked Karl to leave he raised his shotgun and shot the man. While the wounds were not fatal the man had to go to the hospital to have shrapnel surgically removed. Karl also held an obsession with the right of way on the road. One time a truck was driving near his business which led to Karl shattering the glass and nearly causing an accident. Karl defended his actions to the police by saying he was trying to scare him off for driving too fast and honking his horn too loudly. Karl always kept a hunting knife and steal pipe on his person at all times and would wooden strips with nails sticking out on the roads to puncture the tires of passing cars and would trespass onto the campsite to cut and vandalize unoccupied tents.\nOn June 4, Nils and Seppo had visited his truckstop truck stop and purchased some items before leaving. Karl wasn't working at the time so they conducted their transaction with his wife. After making their purchase they drove past Karl's house on their way to the campsite and Karl's wife admitted to her husband that there were four camping nearby. The morning after Karl was informed of the murders by a local and he reacted to this news very nonchalantly. Karl had just installed a well on his property which only made locals more suspicious, suspecting that Karl disposed of their belongings and the murder weapon at the bottom of the well. Their Nils and Seppo's shoes were also found on the road leading to his truck stop and home.\nKarl and his wife were questioned by police. Both Karl and his wife said they were sleeping the night of the murder with Karl staying in the living room and his wife sleeping upstairs with the couple's children. His wife did admit that the door was open but she didn't hear Karl leave. The police searched Karl's home but left after finding nothing of note. This search left the locals very dissatisfied since they viewed it as lacklustre and were especially disappointed with how they ignored the well and didn't search it.\nOn June 9, Nils woke up in the hospital but in severe pain and didn't know where he was. The police wanted to question him but Nils could barely speak often just moaning in pain and whenever he did speak he said that he didn't remember what happened. The police waited again until June 23 when he was discharged from the hospital and left through a backdoor to the police station to give a statement to the police.\nAccording to Nils, on June 4 he and Seppo set up their tent at 7:30 p.m. and hung up and spent time until 9:30 p.m. when they finally went to sleep. A few hours later, Nils woke up to the sound of Seppo outside the tent looking for fishing gear. Nils decided to accompany him and later wanted to go for a late swim anyway with Nils estimating that this was at 3:00 a.m. This testimony was considered accurate as Anja had written in her Lyric book \"Seppo and Nils were drunk\"; \"got up at two o'clock in the middle of the night\"; \"Seppo was fishing\" When the police pressed him for what happened next he said that his next memory was waking up in the hospital. The police brought him back to the crime scene in hopes that it could trigger some repressed memories but Nils still couldn't tell them what happened afterwards.\nThe police now saw only one option left. They went to the University of Helsinki and requested that a professor specializing in psychiatry put him under hypnosis to dredge up Nils's memories, something this profession had success with with other patients. From July 2-July 5 Nils, was put under hypnosis three times with each session lasting one hour. Nils finally described how he and the others were attacked by a man with a knife and blunt object assumed to be a steel pipe.\nWhen asked if he could describe this man he said he could. Based on his description the police ruled that the man was 20–30 years old, 173–174 cm tall; had an ordinary body type, round face; long blond hair combed back; normal non-protruding ears. A high forehead: high forehead with uneven horizontal wrinkles, Thick lips, a strong jaw; slightly protruding cheekbones; short neck; white teeth,  thick and large fingers, pimples on the forehead and cheeks and lastly he was wearing, a thick fabric checkered dark blouse with small black buttons. Based on this description a composite sketch was made and released to the media. Police received 50 tips based on this sketch and arrested 9 suspects with one suspect being of particular interest.\nOn June 6, 36-year-old German National Hans Assmann arrived at The Helsinki Surgical Hospital by ambulance with red stains on his hands and overalls. His wife accompanied him to the hospital and said that Hans passed out after experiencing a bout of stomach pain. During their routine tests, a doctor poked Hans's side and in reaction, he let out a little chuckle which alerted hospital staff to the fact that he was likely unconscious. After he was caught in this lie Hans showed no remorse and threatened hospital staff, demanding immediate treatment. This prompted an intern and several other hospital workers to keep a close eye on Hans.\nDuring his stay in the hospital, a woman who wasn't his wife visited him at the hospital and they would whisper to each other although nobody knew what they were talking about. Hans would spend hours upon hours washing his hands to try and erase the red stains on his hands. When talking to hospital staff he told police he was a guard at Auschwitz but became disillusioned with Nazism after falling in love with a Jewish girl. He was reassigned and ended up being captured by the Red Army in 1943.  After two years in a POW camp, he fully defected and joined the KGB. He was discharged from the hospital after a few days but continued to return for further treatment and to make the staff more uncomfortable. He once showed a surgeon an article from a German magazine about a cold case and joked that both he and the surgeon were good with a knife but that unlike the surgeon he didn't save anyone with a knife.\nBy July the hospital staff grew more and more suspicious of Hans and later suspected him of being responsible for the Lake Bodom Murders. After seeing the sketch in the newspaper they only became more suspicious. They called the police and even collected Hans's bloody clothing to hand off to the police. Hans was, however, never actually arrested and his clothing wasn't tested. According to police, Hans had an airtight alibi but the police never released it to the public.\nOther suspects that came to the police's attention were a man named Pauli Luoma. Pauli was a bicycle thief who was seen in the area wearing a backpack that seemed similar to the one stolen from the campers and wearing what appeared to be a bloodied shirt. This man was quickly identified as Pauli but he had an airtight alibi and was seen by numerous witnesses at Otaniemi during the time of the murder.\nAnother was 15-year-old Pentti Soininen. Despite his young age, Pentti had committed several violent crimes. In 1969, at 24 years old he was arrested and confessed to many crimes and told police that he was at Lake Bodom during the time of the murder after running away from school. Since he couldn't tell the police any details that wouldn't be gleaned from reading newspapers, no evidence linking him to the crime and Pentti was known for lying to try and build up a reputation the police gave little weight to his confession. Pentti hanged himself at a railway station during a prisoner transport.\nThe last suspect we know the least about and the police seem to consider them POIs as opposed to real suspects. Two young men were seen fishing at the lake the night of the murder and would've witnessed the crime and possibly have valuable testimony. But instead, they left their fishing equipment on the rocks by the lake and left. They never returned to collect their equipment, were never identified and despite numerous appeals by the police, they never came forward. The police gradually ran out of leads and slowly and slowly updates in the investigation stopped being published in the newspapers. Eventually, the police ran out of leads to investigate and the case went cold.\nIn the years that followed the locals continued to suspect Karl as the main suspect. Although Karl looked nothing like the sketch his behaviour was still enough as alongside his violent behaviour he sealed up that well of his only a few days after the murder. In the late 60s, his wife was diagnosed with breast cancer and when in the hospital she confessed to a friend that she believed Karl to be the murderer and gave a false alibi to the police out of fear over what Karl would do to her. The police, who were said to have an 80-page case file on Karl by this point visited the hospital to question Karl's wife who retracted her statement. Because she wouldn't make a statement and they had no evidence linking Karl to the murder they officially stopped all investigations of him in September of 1969.\nPrior to the closing of the investigation, Karl was sitting and drinking with a neighbour before Karl grew suddenly angered and saddened for no discernible reason. When the neighbour asked what the issue was Karl said \"Don't you realize it yet? I am the murderer behind the Lake Bodom Massacre.\" the neighbour said \"If that's true then go to the lake and drown yourself immediately. Otherwise, you will be locked up in a cell for the rest of your life.\" On August 2, 1969, the police found Karl's body floating in Lake Bodom with the cause of death ruled as likely suicide. As there were no independent witnesses to this alleged confession and on account of Karl being intoxicated and mentally unwell and topped off with a lack of evidence the police did not consider this enough to close the investigation and deem Karl the killer.\nAs for Hans, In 1997 he was interviewed by a reporter and when asked if he was the murderer, rather than denying any involvement he said \"I can't disclose the details.\" which was believed to be a confession. One of the doctors who treated Hans also wrote three books about the case and how Hans was the likely killer. They even tried linking Hans to other unsolved cases such as the murder of Kyllikki Saari (he was in Germany at the time) and even the death of a Finnish parliament and minister named Penna Tervo (he died in a car accident but others think it might be foul play). Hans passed away on June 19, 1998, at a hospital in Sweeden\nIn 2005 the police finally declassified what info they had on Hans. In 1960 after the hospital called police, Hans was interrogated but they quickly learnt that he had a strong alibi. At the time of the murder, he was staying with his mistress at their apartment in Helsinki as he was having an extramarital affair. He was seen by the landlord, landlady, her mistress's sister and her husband. It was impossible for him to leave without being noticed by anyone and he woke up and made coffee from 6:00-9:00 a.m. the next morning. Which by then would've put him in the clear. The blood on his clothing was red paint, his strange behaviour was due to intoxication and the reason for his hospitalization was stomach pain as his wife had said. The police had Hans's fingerprints on file and in 1978 reopened the investigation to compare them to unknown fingerprints found on soda cans at the crime scene and they weren't a match.\nThe public was still unsatisfied and continued believing that Hans was the killer based on his resemblance to the sketch. Many also noticed in pictures at the memorial service taken on June 13, 1960, that there was a man amongst the mourners who looked like the man in the sketch with many believing Hans attended the funeral to relive the experience of the murder. The police, on the other hand, stopped putting much faith in the sketch. It was found that hypnosis could also induce false memories. Olavi was also put under hypnosis and described a similar man but that was 6 years after the fact when the first sketch was already known. There was another reason the sketch was disregarded though, and that being that Nils may have been lying.\nIn 2003 with many advancements in DNA testing and forensic technology made in the 43 years since, the case was reopened. All the evidence that had blood stains on them was tested and on March 29, 2004, the police arrested Nils Wilhelm Gustafsson who was now a 62-year-old semi-retired truck driver and pensioner. The DNA tests showed that the victim's blood was found on Nils's shoes but not his own.\nThe police believed that on the night of the murder Nils, heavily intoxicated prepared a pack of condoms and attempted to have sex with Maila who rejected him leading to Nils getting angry and Seppo stepping between Nils and the two girls and was told to leave the tent. Fueled by alcohol, rage and adrenaline, Nils waited until all three were asleep before cutting the tent ropes to trap everyone inside.\nNils knew where everyone was in the tent and started his attack. He picked up a rock off the ground and started hitting Seppo on the head with it. Seppo resisted and kept kicking eventually hitting Nils in the jaw through the tent. This caused a fracture which further enraged Nils who took out his knife and began stabbing him several times through the tent fabric in the chest and neck. Afterwards, Anja attempted to leave the tent. Nils saw this and began hitting her on the head with a rock over and over again until she stopped moving. He finished the attack with Maila repeatedly hitting her head with a rock before stabbing her 15 times.\nAfter killing the three he collected all the aforementioned items and left the campsite to hide them with the man witnessed leaving the campsite being Nils himself. After he was done he returned to the campsite to cut open and collapse the tent in order to make the crime scene appear more \"chaotic\" and pulled down Maila's pants to make the crime look like an attempted rape and finished by lying on top of the collapsed tent and waited for someone to discover the crime scene.\nThe next day the press got wind of the arrest and published Nils's name in the newspaper a 61-year-old woman came forward with a statement. She told police that back in 1960 she was 17 years old and camping with her friends when she saw Nils arguing with others and that this was after the murder. She later saw two men who weren't police officers carrying Nils away. When pressed for more details she was unable to name or describe these other men and possible accomplices.  Nils denied any involvement and accused this woman of lying as he had never seen her and Anja's lyric book with the entries further proved his innocence as they made no reference to an argument and there were no signs of erasing or pages being torn.\nThe police handed the case over to the prosecutor who charged Nils with three counts of murder. On April 2, 2004, The Espoo District Court felt there was enough to bring the case to trial. The Trial began on August 4, 2005, with Nils pleading not guilty and the prosecutor was Heikki Lampela (who has had future legal troubles himself) demanded a life sentence. The prosecution repeated the same theory as the police and said that Nils only suffered a minor concussion and accused him of lying about his amnesia to avoid implicating himself. For the trial, the tent was restored and displayed for the court. This ended up playing a crucial role in proving Nils's innocence.\nNils's two attorneys Riitta Leppiniemi and Heikki Uotila began their arguments. They disputed the idea that it was Nils who threw his and Seppo's shoes in the bushes as in that case he would've walked back to the campsite all by himself either barefoot or just in socks. This was an issue because both the soles of his feet and socks were clean and showed no signs of walking that long distance.\nThe prosecutor claimed that the tent was cut and stabbed through after the murders to contaminate the crime scene. Thanks to the restored tent Nils's attorneys were able to poke holes in his theory. Based on the blood stains on the tent all located alongside the location of the stab wounds strongly indicated that the victims were stabbed through the tent. The police also pointed out how the prosecutor and police in their theory of how the crime took place also included Nils stabbing them through the tent.\nNils had sustained many non-self-inflicted stab wounds which contradicted the police and prosecution's theory that all that happened was Seppo kicking his jaw through the tent. Only blood stains from the four victims were found at the scene and the prosecution didn't believe others were involved in the crime. The defence refuted this claim, only 20 blood samples taken from 11 locations had been tested which meant the police and prosecutors had no way for sure to rule out the existence of a 5th individual. The DNA by that point had also been degrading for 45 years and even if the results were accurate, if the murderer was adequately prepared and attacked from outside the tent, they may not have shed a single drop of blood. The defence also turned the DNA results against them and pointed out how Nils's blood was found in the location where he claimed to be sleeping. They argued that if he was the killer his blood should not have been inside the tent. The defence also relied on eyewitnesses who saw others walking away from the tent at the same time Nils was lying unconscious on top of it.\nLastly, while the prosecution called upon neurological experts to testify and they stated that Nils only suffered a minor concussion the defence and their experts thought this was laughable. He had been unconscious for nearly 5 days, suffered permanent brain damage and memory loss and was unable to maintain his balance for weeks after waking up and had to use a cane. The prosecutor and police also never explained where his severe injuries came from.\nAs a last-ditch effort, a police officer guarding Nils's cell during his pre-trial detention was made to testify about an alleged confession made by Nils. The officer said that Nils said \"What does it matter?, What's done is done. The worst case scenario is that I will be sentenced to 15 years.\" which they felt amounted to a confession. There was no written statements or recordings of him saying this and Nils himself, denied ever uttering such words. The context of him making this statement was also never stated so the court had any testimony on this disregarded and that it wasn't a valid confession assuming it even happened.\nOn October 7, 2005, the six-judge panel reached their verdict. Based on his blood found inside the tent, the impossibility of disposing and hiding evidence with his injuries and a lack of evidence and exonerating witness testimony they found Nils not guilty with the acquittal being unanimous. As the prosecutor didn't appeal the verdict within the allotted 7 days Nils was released and given 44,900 euros in compensation.\nDue to the media reporting heavily on the case and labelling Nils as a murderer he stayed inside his house and rarely ever left to avoid anyone confronting him on the street. After his acquittal he attempted to seek compensation from the media and newspapers for defamation but withdrew the lawsuit after he could find any lawyers to take the case. No new suspects ever came forward his acquittal.\n63 years later the case remains unsolved.\nSources\nhttps://web.archive.org/web/20081210112643/http://www2.hs.fi/english/archive/news.asp?id=20040405IE7\nhttps://ermakvagus.com/Europe/Finland/lake-bodom-murders.htm\nhttps://yle.fi/a/3-5744609\nhttps://web.archive.org/web/20061216183708/http://www.iltasanomat.fi/uutiset/erikoissivut.asp?k=1038765\nhttps://web.archive.org/web/20060501025544/http://www.yle.fi/uutiset/kotimaa/taustat/id15657.html\nhttps://yle.fi/aihe/artikkeli/2011/12/09/bodominjarven-synkka-salaisuus\nhttps://web.archive.org/web/20110820092012/http://www.nyrkkirauta.kalsarit.net/\\~mb5196/waldemar/alibi80.htm\nhttps://www.lansivayla.fi/paikalliset/1740609\nhttps://www.kaleva.fi/bodom-jutun-uutisoinnista-ei-syytteita/2364256\nhttps://yle.fi/a/3-11614144", "media": null, "score": 1886, "upvote_ratio": 0.98, "comment_count": 192, "over_18": false}, "8": {"id": "17eoheq", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "tayamackenzie", "link_flair_text": null, "time": 1698460534.1729796, "created_utc": 1698078338.0, "url": "https://www.reddit.com/gallery/17eoheq", "title": "Found on Find A Grave", "permalink": "/r/MorbidReality/comments/17eoheq/found_on_find_a_grave/", "selftext": "Usually a hard egg to crack, this broke me", "media": null, "score": 1945, "upvote_ratio": 0.94, "comment_count": 140, "over_18": true}, "9": {"id": "1783omq", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "chubachus", "link_flair_text": "Medical", "time": 1698460534.284246, "created_utc": 1697331225.0, "url": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Salvarsan_treatment_kit_for_syphilis%2C_Germany%2C_1909-1912_Wellcome_L0057814.jpg", "title": "Salvarsan treatment kit for syphilis, c. 1909-1912.", "permalink": "/r/Jessicamshannon/comments/1783omq/salvarsan_treatment_kit_for_syphilis_c_19091912/", "selftext": "", "media": null, "score": 37, "upvote_ratio": 0.94, "comment_count": 1, "over_18": true}, "10": {"id": "17hh1hq", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "Commercial-Way-7493", "link_flair_text": null, "time": 1698460534.410191, "created_utc": 1698387145.0, "url": "https://i.redd.it/vuukzomysowb1.jpg", "title": "RIP r/eyeblech", "permalink": "/r/UrbanMyths/comments/17hh1hq/rip_reyeblech/", "selftext": "Such a fucked up place to go to, but definitely shocked it took that long for it to get taken down. \nThey had EVERYTHING shock related. EVERYTHING!!!!!!! \nYou could get links to anything. People would save files they found on the dark web and upload them to here. It was scary.\nIt was a wild place.", "media": null, "score": 5, "upvote_ratio": 0.69, "comment_count": 0, "over_18": true}, "11": {"id": "17dr0fh", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Goth_Ophelia", "link_flair_text": "Discussion/Advice", "time": 1698460534.6033113, "created_utc": 1697973471.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/17dr0fh/what_is_the_creepiestor_most_unexplainable_thing/", "title": "What is the creepiest/or most unexplainable thing you have witnessed or experienced that still gives you the chills.", "permalink": "/r/Thetruthishere/comments/17dr0fh/what_is_the_creepiestor_most_unexplainable_thing/", "selftext": "Since it’s almost Halloween, I would love to hear about your creepiest experiences!", "media": null, "score": 789, "upvote_ratio": 0.99, "comment_count": 598, "over_18": false}, "12": {"id": "17eqxga", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Firec0in", "link_flair_text": null, "time": 1698460534.7511635, "created_utc": 1698084613.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/17eqxga/this_woman_on_the_train/", "title": "This woman on the train", "permalink": "/r/LetsNotMeet/comments/17eqxga/this_woman_on_the_train/", "selftext": "This happened last week, and while she didn't seem malicious, the things she said was creepy. I (19M) was going home from university, and to  get home, I have to use the train. As I got on, a lot of the seats were occupied. In my country, the seats are put in a way so that four people can talk and sit in front of each other, and they are kinda close, perfect for talking, even with strangers, sadly.\nI see that there is a free space in front of this girl, who one or two years younger me, but you can never know. I go there, and I ask her if I can sit down. \"Of course\", she replied, and looked at me in a strange, intense way. I pulled out my phone to distract myself from her. She also had a chocolate in her hand, that's gonna be important for later.\nShe asked me \"Where do you live?\" and I was like 'Why do you have to know?\", so she asked when I'm gonna get off the train. I told her the place, and she told me that she's getting off the next one.\nShe started singing, then said \"Oh, sometimes I sing. I'm a silly girl\", then did it AGAIN. Whenever she said something, she looked at me like she was waiting a response, so I replied \"it's okay to be silly\", because I just didn't want to talk to her.\nThen, she told me that \"You're pretty\", and when I asked \"What?\" she asked if she's pretty. In my language, the second one is an extension of the first (\"Szép vagy\" turned to \"Szép vagyok?\"), so it seemed like she corrected herself. Then she asked if she had chocolate on her face, she did. I also got the chocolate in her offered to me, but I declined.\nShe also told me about her piercing that came off, and she put it on in the middle of the train. I told her that she should get it fixed where she got it, and she said \"In Germany? Will you go there with me?\" but obviously, I told her no.\nWhile she tried to put on her piercing back in (her mouth-piercing), she told me that she's in love with me. I told her that I have a girlfriend (I don't, but the university I attend has much prettier girls than her) and that \"the pacing is too fast for me\", and she told me that she will beat my girlfriend.\nHer \"I love you\" started escalating into \"I'll kidnap you\" and \"Strip for me\". She asked me if I'll go with her, and if she could go with me home.\nThen, when the train arrived at my destination, she asked me \"Are you going, love?\", I told her yes, and went on my way. Luckily she didn't follow me home.\nShe also asked me when we are going to meet again. Hopefully never.", "media": null, "score": 223, "upvote_ratio": 0.94, "comment_count": 35, "over_18": true}, "13": {"id": "17gvr6d", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "dannydutch1", "link_flair_text": null, "time": 1698460534.8806775, "created_utc": 1698324515.0, "url": "https://www.dannydutch.com/post/franz-reichelt-the-man-that-died-while-testing-his-homemade-flying-suit", "title": "In 1912 Franz Reichelt tested his homemade flying suit by jumping off the Eiffel Tower. His death didn't come as a great surprise to those watching, it likely did to Reichelt himself though. Pathe filmed it (think before you click/watch it)", "permalink": "/r/MorbidHistory/comments/17gvr6d/in_1912_franz_reichelt_tested_his_homemade_flying/", "selftext": "", "media": null, "score": 15, "upvote_ratio": 0.94, "comment_count": 0, "over_18": false}, "14": {"id": "17gcbk1", "locked": false, "subreddit": "crimescene", "stickied": false, "category": "Crime", "author": "GoreGirl89", "link_flair_text": "Cartel", "time": 1698460535.069422, "created_utc": 1698260572.0, "url": "https://www.reddit.com/gallery/17gcbk1", "title": "Mexico City deployed 300 National Guard members", "permalink": "/r/CrimeScene/comments/17gcbk1/mexico_city_deployed_300_national_guard_members/", "selftext": "", "media": null, "score": 1578, "upvote_ratio": 0.99, "comment_count": 147, "over_18": true}, "15": {"id": "17d4mr5", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Artistic_Web_6785", "link_flair_text": null, "time": 1698460535.2383294, "created_utc": 1697900814.0, "url": "https://www.youtube.com/watch?v=jmT3aOiVfGg", "title": "Re-creation of the stairs in the woods from the Search and Rescue series.", "permalink": "/r/truecreepy/comments/17d4mr5/recreation_of_the_stairs_in_the_woods_from_the/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "stairs in the woods.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/jmT3aOiVfGg?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"stairs in the woods.\"></iframe>", "author_name": "peter pongó", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/jmT3aOiVfGg/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@xaes___"}}, "score": 15, "upvote_ratio": 0.89, "comment_count": 1, "over_18": false}, "16": {"id": "17hzq2d", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "ac1dk1tty", "link_flair_text": null, "time": 1698460535.365966, "created_utc": 1698446812.0, "url": "https://www.reddit.com/r/threekings/comments/17hzq2d/is_the_old_lady_ritual_safeokay_to_do/", "title": "is the old lady ritual safe/okay to do?", "permalink": "/r/threekings/comments/17hzq2d/is_the_old_lady_ritual_safeokay_to_do/", "selftext": "i'm kinda weirdly paranoid abt stuff so i just wanted to ask if anyone knows since most of the posts on the ritual are 2-3 years old and the people who made them or answered questions are no longer active. i'm just worried that it could possibly be something posing as a good spirit and that there would b more consequences to doing it but everyone who has had experiences doing it say that she's a good spirit and that she always delivers your wish.\n​\nthe ritual: old lady ritual . \n(also sorry if this is written weird idk i've never posted anything on reddit before so i apologize if i did smth wrong)", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "17": {"id": "17f03ac", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Whiplash11X", "link_flair_text": null, "time": 1698460536.2299054, "created_utc": 1698108428.0, "url": "https://i.redd.it/ukkibkv6s1wb1.jpg", "title": "Picture is kinda freaking us out, no kids or pets", "permalink": "/r/Ghosts/comments/17f03ac/picture_is_kinda_freaking_us_out_no_kids_or_pets/", "selftext": "A little backstory: basically the power went out and me and wife were talking and she said “snap some pictures and see if anything pops up” so I did, we have no kids or pets. I seen this and was like WTF?? It could be my shadow? Maybe something else? I’m open to anything to explain it.", "media": null, "score": 2420, "upvote_ratio": 0.93, "comment_count": 462, "over_18": false}, "18": {"id": "17gvfm8", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "the-real-jacob", "link_flair_text": "Glitch Vid", "time": 1698460536.50131, "created_utc": 1698323510.0, "url": "https://v.redd.it/08c18deqjjwb1", "title": "freaky radio message", "permalink": "/r/GlitchInTheMatrix/comments/17gvfm8/freaky_radio_message/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/08c18deqjjwb1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/08c18deqjjwb1/DASH_96.mp4", "dash_url": "https://v.redd.it/08c18deqjjwb1/DASHPlaylist.mpd?a=1701052536%2CYWQ5OWU1OWJiNjJhNjY0OTgxMzRjMGZjNzYwNzQ5Y2NlMTExZTM1OWFlZTRkZTUwZGNlN2YxMDM3NWI0NjkyZQ%3D%3D&v=1&f=sd", "duration": 16, "hls_url": "https://v.redd.it/08c18deqjjwb1/HLSPlaylist.m3u8?a=1701052536%2COTA3Y2QxMTg4YmU1MTI5NTkzNGMyOWEwZGEyZmJhMjMwNDU2M2MwYWQ0OGMxZjVmZTkzZmI3N2IwNGQ3YmIwOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 188, "upvote_ratio": 0.97, "comment_count": 23, "over_18": false}, "19": {"id": "17du68h", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "BakerNew6764", "link_flair_text": "hoax!", "time": 1698460537.1733284, "created_utc": 1697983919.0, "url": "https://v.redd.it/rduptyxrhrvb1", "title": "Carcass of a pig ripped in half and big footprints. Queensland Australia", "permalink": "/r/bigfoot/comments/17du68h/carcass_of_a_pig_ripped_in_half_and_big/", "selftext": "Title", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/rduptyxrhrvb1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 474, "scrubber_media_url": "https://v.redd.it/rduptyxrhrvb1/DASH_96.mp4", "dash_url": "https://v.redd.it/rduptyxrhrvb1/DASHPlaylist.mpd?a=1701052536%2CMTBmZDRlNzliY2ZjNmNkZmM0NTE3MGVjNjg0ODcxNTFkM2UwMjQwMjhkMTUyNWY0Y2UyNDBjYzc2YTVlMWQ1Yg%3D%3D&v=1&f=sd", "duration": 59, "hls_url": "https://v.redd.it/rduptyxrhrvb1/HLSPlaylist.m3u8?a=1701052536%2CYjQ2ZmY4YmM4YWE4MzAxMmFkZDQzMTc5ZDhjZjYwNTRjYzFjMTQ3ZmVhNzljNzM5NWI3MThjOTllNTkzNWNlOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 860, "upvote_ratio": 0.85, "comment_count": 222, "over_18": true}, "20": {"id": "17fv5ej", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "justa-human", "link_flair_text": "Discussion ", "time": 1698460537.7556279, "created_utc": 1698203079.0, "url": "https://i.redd.it/esg60jwml9wb1.jpg", "title": "What are your thoughts on prehistoric cryptids", "permalink": "/r/Cryptozoology/comments/17fv5ej/what_are_your_thoughts_on_prehistoric_cryptids/", "selftext": "Cause me personally while they are cool I think most of them are cap", "media": null, "score": 248, "upvote_ratio": 0.97, "comment_count": 82, "over_18": false}, "21": {"id": "17e1xom", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "thealterry", "link_flair_text": "Question", "time": 1698460537.881219, "created_utc": 1698005093.0, "url": "https://i.redd.it/wqgaxbfp8tvb1.jpg", "title": "Has anyone here ever seen Krampus or a humanoid/creature with a similar appearance?", "permalink": "/r/Humanoidencounters/comments/17e1xom/has_anyone_here_ever_seen_krampus_or_a/", "selftext": "", "media": null, "score": 982, "upvote_ratio": 0.96, "comment_count": 222, "over_18": false}, "22": {"id": "17fzn5c", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "WelcomeFormer", "link_flair_text": null, "time": 1698460538.6866553, "created_utc": 1698220628.0, "url": "https://v.redd.it/gadsyxet1bwb1", "title": "Sorry for the commentary I was smoking out back", "permalink": "/r/cryptids/comments/17fzn5c/sorry_for_the_commentary_i_was_smoking_out_back/", "selftext": "It starts with me coming back inside so I could start my camera without being attacked.  I originally saw 3, one off to the left we never see.  The two you see on the right go more to the right and higher, I can only guess a bear jumping up a tree while it's bending.  At first I thought you only saw one eye when it was moving because it was a side profile but then they kept closing one eye when they were looking at me.  I'm going to guess what was them were fighting a minute earlier kind of far away so they move fast.   It sounded like a cat maybe but they'd have to be huge pumas judging by the size, there's no way that big though.  I know it sounds crazy but I know where the tree line is and I heard them in the leaves a couple times, the eyes were like 8-9 inches across.  Maybe they were like 6 or 7 and I misjudged and it's a few huge bobcats?  I'm in Fishkill area ny on the Hudson\nThe end is me trying to see the one on the left again but realizing it's a metal part on my shed lol I can only guess maybe bears but I don't think fathers stay around.", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/gadsyxet1bwb1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/gadsyxet1bwb1/DASH_96.mp4", "dash_url": "https://v.redd.it/gadsyxet1bwb1/DASHPlaylist.mpd?a=1701052538%2CNjYyZDU4MzIwMWRmOTQ5ZjYxOWI2MjEzNDA4MDMwMDU5YjkwNGQwNzYxYjE4YTgxYzc1MDM0YWVkZDBlNzRiMA%3D%3D&v=1&f=sd", "duration": 137, "hls_url": "https://v.redd.it/gadsyxet1bwb1/HLSPlaylist.m3u8?a=1701052538%2CMzI0ZTVkMzRmOTg0YjdiYTc3NzUyYWE5MDUzMWY4ZTE4OWI2NWFmYmM3ZGYwOWY3YjUzNTE2YzdjNWQ1OWRkYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 57, "upvote_ratio": 0.86, "comment_count": 17, "over_18": false}, "23": {"id": "17d3xul", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "efernen", "link_flair_text": null, "time": 1698460539.8030825, "created_utc": 1697898875.0, "url": "https://i.redd.it/284qxp03hkvb1.jpg", "title": "Interesting?", "permalink": "/r/conspiracy/comments/17d3xul/interesting/", "selftext": "", "media": null, "score": 2366, "upvote_ratio": 0.84, "comment_count": 364, "over_18": false}, "24": {"id": "17dclyu", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "HiddenAmuraKa369", "link_flair_text": null, "time": 1698460540.065053, "created_utc": 1697922845.0, "url": "https://youtu.be/_Gtiqi81bek", "title": "The Ultimate Truth on Reality: All is the Mind", "permalink": "/r/conspiracyfact/comments/17dclyu/the_ultimate_truth_on_reality_all_is_the_mind/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Ultimate Truth on Reality: All is the Mind", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/_Gtiqi81bek?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The Ultimate Truth on Reality: All is the Mind\"></iframe>", "author_name": "Hidden AmuraKa: Thrice Greatest", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/_Gtiqi81bek/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@hiddenamuraka"}}, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "25": {"id": "17f1iag", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Awstun_", "link_flair_text": null, "time": 1698460541.8292494, "created_utc": 1698112545.0, "url": "https://i.redd.it/c2x0o3sf42wb1.jpg", "title": "This picture makes me want to storm Area 51.", "permalink": "/r/ufo/comments/17f1iag/this_picture_makes_me_want_to_storm_area_51/", "selftext": "", "media": null, "score": 756, "upvote_ratio": 0.93, "comment_count": 183, "over_18": false}, "26": {"id": "17gzz2p", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "shogun2909", "link_flair_text": "News", "time": 1698460542.9096208, "created_utc": 1698336572.0, "url": "https://v.redd.it/7gynk2rhmkwb1", "title": "Representatives Moskowitz and Luna comments on the SCIF briefing", "permalink": "/r/UFOs/comments/17gzz2p/representatives_moskowitz_and_luna_comments_on/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/7gynk2rhmkwb1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/7gynk2rhmkwb1/DASH_96.mp4", "dash_url": "https://v.redd.it/7gynk2rhmkwb1/DASHPlaylist.mpd?a=1701052542%2CZWE1YTUxNjJlYjA2ZGViYjc0NDg2ZDRjYTBlZGJhY2ZlYWNiZjg3OGQwYTc0MTkzOTg2Y2U4OGNmNzQ1ZGVkOQ%3D%3D&v=1&f=sd", "duration": 41, "hls_url": "https://v.redd.it/7gynk2rhmkwb1/HLSPlaylist.m3u8?a=1701052542%2CZGU5OWQzZjIyMDE0MzZiMmMwYzYzNzhlNzQ2MmQ4NWExMzk4MzMyMjU0YjM1ZGZiNDhlZDFhOTRmODExY2ZmZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2244, "upvote_ratio": 0.87, "comment_count": 733, "over_18": false}, "27": {"id": "17gh7j3", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "LateralSpy90", "link_flair_text": "Discussion :table:", "time": 1698460544.6517856, "created_utc": 1698273219.0, "url": "https://i.redd.it/f7ql7777efwb1.png", "title": "The truth", "permalink": "/r/aliens/comments/17gh7j3/the_truth/", "selftext": "", "media": null, "score": 2419, "upvote_ratio": 0.73, "comment_count": 672, "over_18": false}, "28": {"id": "17eu6he", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "onlyaseeker", "link_flair_text": null, "time": 1698460545.0497065, "created_utc": 1698092815.0, "url": "https://www.youtube.com/live/UZaCB3pHvc8", "title": "David Schindele (US Air Force Nuclear Control) on Sean Kirkpatrick/AARO: \"not people I want to talk to again.\" 30 min phone interview had \"atmosphere of disinterest,\" no questions. Rejected AARO's incomplete incident report; AARO reply: we're \"volunteers that have to leave family & friends\" to work", "permalink": "/r/UAP/comments/17eu6he/david_schindele_us_air_force_nuclear_control_on/", "selftext": "", "media": null, "score": 224, "upvote_ratio": 0.97, "comment_count": 30, "over_18": false}, "29": {"id": "17fn506", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "TaraCalicosBike", "link_flair_text": "Update", "time": 1698460545.4597268, "created_utc": 1698181040.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/17fn506/update_man_linked_to_alicia_navarro_case_has_now/", "title": "Update: Man linked to Alicia Navarro case has now been arrested.", "permalink": "/r/UnresolvedMysteries/comments/17fn506/update_man_linked_to_alicia_navarro_case_has_now/", "selftext": "Warning: disturbing.\nMan linked to Alicia Navarro case has been arrested on child pornography charges. \nFrom NBC News: \n“The man who authorities describe as the boyfriend of Alicia Navarro — the teenage girl who walked into a Montana police station four years after she vanished in Arizona — was arrested on charges of child sexual abuse after explicit images were found on his cellphone, officials said Tuesday.\nThe photos were found on a phone allegedly belonging to Edmund Davis, 36, while investigators searched his Havre, Montana, apartment in July for evidence in the Alicia Navarro case, according to the Montana Attorney General's Office. Navarro was 14 when she disappeared from her mother's home on Sept. 15, 2019.\nIn July, an 18-year-old Navarro went to a police station in the small Montana town of Havre and identified herself as the missing girl. The charges against Davis are not related to Navarro, a spokesperson for the attorney general’s office said.\nThe phone contained images of a \"child or children 12 years of age or younger engaged in sexual conduct actual or simulated,\" according to charging documents in the case. The documents list another victim who was under the age of 16.\nHe was charged with two felony counts of sexual abuse of children. \nInvestigators said they found over 80 images on Davis' phone, according to court documents filed Oct. 16 seeking Davis' arrest.\nHe was taken into custody Monday in Chinook, Montana, by the Montana Department of Justice’s Division of Criminal Investigation and the Blaine County Sheriff’s Department. He remains jailed at the Hill County Detention Center on a $1 million bond.\nAttorney information was not available for Davis.\nAuthorities said nine of the images received a \"maturity rating\" from Phoenix Children's Hospital and it was determined that seven of the pictures were rated as children under the age of 13 and two contained children under the age of five, the documents state.\nThe documents describe graphic images investigators said they found on Davis' cellphone as well as a laptop. The victims are described as being \"prepubescent\" females and \"an apparent young boy,\" according to the documents.\nAn agent also noted \"the presence of other images of infants and toddlers,\" the documents state.\nThe attorney general's office said Davis, who is described in the court documents as being Navarro's boyfriend, tried to discard his cellphone during the search at his home.\nAuthorities said when officers arrived at the apartment Navarro and Davis shared together on July 26, Navarro initially said no one was home but police saw Davis in the kitchen \"throwing a cellphone into the trash and placing items on top of said phone.\"\nAuthorities have not said how Navarro ended up in Montana or how long she had been there. Jose Santiago, a spokesman for Glendale police, previously said that when Navarro went to the Montana police station she \"basically asked for help to clear her off of a missing juvenile list.\" In video released by authorities, she was heard telling detectives that no one had hurt her.\nAn agent also noted \"the presence of other images of infants and toddlers,\" the documents state.\nThe attorney general's office said Davis, who is described in the court documents as being Navarro's boyfriend, tried to discard his cellphone during the search at his home.\nAuthorities said when officers arrived at the apartment Navarro and Davis shared together on July 26, Navarro initially said no one was home but police saw Davis in the kitchen \"throwing a cellphone into the trash and placing items on top of said phone.\"\nAuthorities have not said how Navarro ended up in Montana or how long she had been there. Jose Santiago, a spokesman for Glendale police, previously said that when Navarro went to the Montana police station she \"basically asked for help to clear her off of a missing juvenile list.\" In video released by authorities, she was heard telling detectives that no one had hurt her.\nAn agent also noted \"the presence of other images of infants and toddlers,\" the documents state.\nThe attorney general's office said Davis, who is described in the court documents as being Navarro's boyfriend, tried to discard his cellphone during the search at his home.\nAuthorities said when officers arrived at the apartment Navarro and Davis shared together on July 26, Navarro initially said no one was home but police saw Davis in the kitchen \"throwing a cellphone into the trash and placing items on top of said phone.\"\nAuthorities have not said how Navarro ended up in Montana or how long she had been there. Jose Santiago, a spokesman for Glendale police, previously said that when Navarro went to the Montana police station she \"basically asked for help to clear her off of a missing juvenile list.\" In video released by authorities, she was heard telling detectives that no one had hurt her.”\nNBC News\nNew York post", "media": null, "score": 1471, "upvote_ratio": 0.96, "comment_count": 230, "over_18": false}, "30": {"id": "17eh27g", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "KingKillKannon", "link_flair_text": null, "time": 1698460545.9190748, "created_utc": 1698056477.0, "url": "https://www.reddit.com/r/MorbidReality/comments/17eh27g/football_coach_gets_shot_by_parent_in_front_of/", "title": "Football Coach gets shot by parent in front of children", "permalink": "/r/MorbidReality/comments/17eh27g/football_coach_gets_shot_by_parent_in_front_of/", "selftext": "Source: https://globalnews.ca/news/10038844/football-coach-shot-playing-time-st-louis/\nIn St. Louis, a 30 year old man who coaches youth football was shot 4 times by a parent, after a disagreement about their son's playing time.\nThe shooting occured in front of a team of 9 & 10 year old children. \nThe coach survived and is recovering at home. \nThe rest of the season was cancelled. ", "media": null, "score": 1670, "upvote_ratio": 0.97, "comment_count": 207, "over_18": true}, "31": {"id": "17gx2ri", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "happypants69", "link_flair_text": null, "time": 1698460546.1464934, "created_utc": 1698328461.0, "url": "https://ring.com/pages/ring-million-dollar-sighting", "title": "Ring is awarding $1 million for capturing extraterrestrial activity on a Ring device", "permalink": "/r/UrbanMyths/comments/17gx2ri/ring_is_awarding_1_million_for_capturing/", "selftext": "", "media": null, "score": 6, "upvote_ratio": 1.0, "comment_count": 1, "over_18": true}, "32": {"id": "17dzr88", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Jhbeanco", "link_flair_text": "Strange Sounds", "time": 1698460546.3275914, "created_utc": 1697999152.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/17dzr88/one_of_my_many_strange_experiences_in_the_woods/", "title": "One of my many strange experiences in the woods of Appalachia", "permalink": "/r/Thetruthishere/comments/17dzr88/one_of_my_many_strange_experiences_in_the_woods/", "selftext": "When I was in high school, about 15 years ago, a group of friends and I were hanging out at our friend Dale's house.\nFor some back story, we lived way out in the country (also technically part of Appalachia) and the kind of middle of nowhere where the nearest neighbors are a few miles up the road.  Dale happened to have a cave near his property that we liked to explore and be dumb teenagers in. To get to the cave you had to walk roughly a mile through dense woods and cross a big field. We had yet to find the end of the cave system despite exploring for hours at a time multiple times.\nOne day we had spent the better part of the afternoon exploring the caves and it had gotten dark by the time we emerged. We already had flashlights so that was no big deal.\nMy memory is a little fuzzy on the exact details, but for some reason, our friend Sam decided to go back to the house a little earlier. I want to say we had ordered pizza or something and he went to meet the driver.\nThe rest of us started making our way back through the woods to Dale's house when we started hearing voices in the woods. We were asking each other if we heard that, and where it came from, but we each had a different direction of where we thought it was coming from. It was a childlike voice, and it sounded like talking or whispering but you couldn't make out what was being said.\nAt this point we thought one of our friends was messing with us and started to talk back to it. It sounded like a child giggling and then our flashlights started to flicker and die. We had one dim light left to get the rest of the way back. We were all thoroughly freaked out, prank or not, and hightailed it back to the house, adrenaline pumping.\nWe all got in the house, shut the door, and I felt a sense of safety for a split second before the crucifix on the wall literally came off the wall and broke on the floor. It literally seems like something out of a bad horror movie, but we all watched it legitimately come off the wall and crash the the ground with for no apparent reason. Before that moment, I hadn't been convinced it wasn't our other friend Sam that was messing with us, even though he really wasn't the type.\nWe all started word vomiting at Sam trying to explain what had just happened and question if he had something to do with it, but he genuinely seemed freaked out and confused. He actually said that on his way back to the house earlier he kept hearing weird things and seeing lights in the woods and he thought it was us trying to play a prank on him.\nI don't know what it was, maybe our friend is a great actor, but I honestly don't think it was a prank. The feeling I got in the woods...like every hair was standing on end, goosebumps on my goosebumps and every fiber of my being screaming to run...I have never felt like that again and never want to.", "media": null, "score": 159, "upvote_ratio": 0.99, "comment_count": 23, "over_18": false}, "33": {"id": "17dk14r", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "underpantsbandit", "link_flair_text": null, "time": 1698460546.490945, "created_utc": 1697944947.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/17dk14r/the_burglar_who_nearly_killed_me/", "title": "The burglar who nearly killed me", "permalink": "/r/LetsNotMeet/comments/17dk14r/the_burglar_who_nearly_killed_me/", "selftext": "So this was May 2017. My husband Jim and I own a 5 floor, hundred year old building which has our business in it- an antique mall- our apartment upstairs, and various other tenants. \nWe’d had several back-to-back burglaries in the prior years and had reinforced the front doors of the business pretty intensely. Aggressive steel bars, more cameras, etc. \nAnyway, at 3AM we were sound asleep upstairs, as one is, but then we got a call from Sonitrol, our security company. We had a motion detect in an unusual location- not the main floor where 90% of the jewelry is, but downstairs. \nThat sort of thing is usually a spider on the camera, or a mouse or some shit. \nSo we ran out less than prepared.\nI was only wearing a tank top, undies and flip flops.* Jim did not grab his baseball bat, but at least had pants. \nI went one way to check the front door, which was intact, and Jim went the other to check around back. \nSuddenly he called me and said “Someone’s inside,” so I fumbled with my phone trying to call 911- in that situation, your monkey brain is in the driver’s seat, and the phone is the black monolith from 2001. Finally I managed it, and rounded the backside of the building, narrating to the 911 operator. \nBroken glass, broken window.\nI said- as I later heard during the run up to the trial- “Oh my god they’re in there, please come NOW”. Then there was an unholy crash. It sounded like everything inside was being smashed to bits. \nThe feeling of listening to someone busy destroying your livelihood is something I can’t quite capture. Who was in there? How many? What path of destruction was being wreaked? I could only yell down the phone at a faceless voice, begging for help that I knew was still minutes away. \nBear in mind I was freshly awoken into a horrible situation, barely clothed** and it was escalating by the second. \nAs it turned out the burglar, Troy, had come face to face with Jim, trying to exit the building out the broken window, before I’d arrived. They locked eyes and Troy said “Oh shit” and reversed direction, back to the depths of the building. \nThen he dropped his backpack with stolen merch, flung himself bodily over a giant iron gate, smashed through the restaurant tenant’s door, and then subsequently out their main door. \nhttps://imgur.com/a/2HTv1V5\nAt that point he’d caught a lot of glass to the face and body, and was bleeding pretty good. \nJim caught him on the exit and fucking pounced on him. Full body slam to the cement. Then he pinned Troy. \nAdrenaline is wild. I was not crying but urgently begging the operator to hurry, hurry, hurry- I was terrified I was going to see my husband die before my eyes. And then I ran right into the fray because, again, adrenaline. It gets right up on you, and you just do the stupidest shit. \nThey were in the middle of the street, dimly orange lit by the streetlights and it was hard to parse what was going on.\nFucking thank sweet baby jeebus, Troy did not have a weapon and was wildly unprepared to have a madman tackle him in the dark; as it turned out, he had done hundreds of burglaries and never been caught. Jim had the upper hand and had him fully pinned down, and Troy was wisely playing possum. \nSuddenly we heard a roaring engine and someone laying rubber. \nApparently I started screaming. Yeah, it was Troy’s getaway driver, his wife Kelsey. She leaned out her window and yelled “Get the fuck off him or I’m gonna kill the bitch”. (That was me, the bitch c'est moi.) Clearly captured on audio, but I don’t remember it. \nNot willing to wait, she then tried to run me over.\nI vaguely remember realizing things were going horribly wrong, but desperately trying to read the license plate into the phone with an idiotic laser focus. It was out of state and I struggled to read it. That’s all. \nMy brain deleted how close she’d come to turning me into a bloody smear- within maybe a foot of me, fast, while I dodge like a badly clothed matador, clutching my phone. \nWe had to listen to the 911 recording a year later in the prosecutor’s office, synched with the video. The video was from a nearby business, with really good exterior cameras. Jim started crying; he had no idea what a close call it was. \nThe engine revving overwhelmed my screaming at a certain point. My voice was blown out, I was trying to chant the license number like an incantation but you can’t hear it because the engine roar and squealing tires. \nJim let Troy go, of course. Troy jumped into the car and they tore off down the street. The police showed up maybe a minute later, but they were gone. \nAnyway, Troy had bled all over Jim from the door glass. Jim freaked out so hard later. We figured Troy was likely using IV drugs (correctly, as it turned out) and I had to inspect Jim for cuts, using a flashlight to make sure I missed nothing. He still got tested. \nUnlike a number of other incidents, this one was taken pretty seriously, due to the amount of evidence as well as violence and, you know, the attempted murder. \nSeveral months later, they arrested Troy and Kelsey. They had Troy’s DNA from the bloody clothes Jim was wearing and all over the car they’d been driving, which had been stolen but ditched. \nIt turned out they were wanted in five counties for hundreds of commercial burglaries over several years, to support their oxy habits. (Back before the age of fetty!)  We were the only fuck up they made- they didn’t know we lived on the premises. \nKelsey, the wife, flipped on Troy. They accepted a plea for her- much to my displeasure since she was the one that tried to kill me. At least she ratted him out six ways to Sunday. \nHe refused a plea. He wanted a trial. I would not wish a trial on my worst enemy. \nYou get interviewed, alone, by the defense team. Did you know they can lie? They sure can! They won’t in front of the jury, but one-on-one they’ll eat your soul and pick their teeth with the shards.  You don’t get a lawyer- you’re on Team Prosecution. Theoretically I can understand it… but it’s still utterly maddening. \nThey took me first. They played the 911 tape, second time I’d heard it. They insisted that because I kept saying “they’re inside”, that I was lying and there was someone else, not Troy or Kelsey. Sorry, I just use it as a nongendered pronoun, guys. I hadn’t yet seen the person, so they were a “they”. Which is what I told them, adamantly. \nThen they took Jim. They told Jim that I admitted I’d lied and there was another person inside the building. He luckily laughed and was like “absolutely the fuck not, she didn’t.”\nFinally the day before trial, Troy accepted a plea. Thank god. I had been having the stupidest meltdown ever- do I dye my hair something other than purple? (I’d just spent $700 on it!) What shoes do I wear? I don’t have conservative shoes! How can I cover my tattoos? Basically the most pointless shit I could control because that train was rolling on, without me. \nKelsey got off with probation. Troy was in prison from 2017-2020, until he got released early, adjacent to Covid. \nKelsey seems to be clean and living a normal life, remarried with kids and looks happy. I watch her on FB. I really hope so. (I do occasionally wish she has a raging case of hemorrhoids or something tho, I’m not a saint.)\nNOTE: you’re welcome to DM me if you think you know me, but I’d appreciate if you don’t post it! It’s not wildly important or I wouldn’t put this up, but, yeah be cool please. \n*Not where my username comes from, just a weird coincidence \n Fuck the towel, know where your shoes are at night. This is critical. In the immortal words of Kate McKinnon, who cares if your pink pocket and stink rocket are on full display- you best be able to run. I cannot emphasize this enough.", "media": null, "score": 152, "upvote_ratio": 0.97, "comment_count": 18, "over_18": true}, "34": {"id": "17era37", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "dannydutch1", "link_flair_text": null, "time": 1698460546.6204576, "created_utc": 1698085490.0, "url": "https://www.dannydutch.com/post/the-murder-of-dr-barnett-slepian-by-anti-abortion-extremist", "title": "On this day in 1998, Dr.Barnett Slepian was shot and killed in his Upstate New York home. Slepian was murdered by James Charles Kopp, an anti-abortion extremist. Kopp managed to escape and ended up on the FBI's 'Most Wanted' list until his eventual capture in France.", "permalink": "/r/MorbidHistory/comments/17era37/on_this_day_in_1998_drbarnett_slepian_was_shot/", "selftext": "", "media": null, "score": 11, "upvote_ratio": 0.93, "comment_count": 0, "over_18": false}, "35": {"id": "17hfphb", "locked": false, "subreddit": "crimescene", "stickied": false, "category": "Crime", "author": "vaughndag", "link_flair_text": null, "time": 1698460546.785926, "created_utc": 1698381798.0, "url": "https://www.reddit.com/gallery/17hfphb", "title": "Domestic Tragedy in Mexico", "permalink": "/r/CrimeScene/comments/17hfphb/domestic_tragedy_in_mexico/", "selftext": "", "media": null, "score": 591, "upvote_ratio": 0.98, "comment_count": 45, "over_18": true}, "36": {"id": "17fr8w5", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "internetgrrll", "link_flair_text": null, "time": 1698460546.9621203, "created_utc": 1698191559.0, "url": "https://www.reddit.com/r/truecreepy/comments/17fr8w5/footprintsfingerprints/", "title": "Footprints/Fingerprints", "permalink": "/r/truecreepy/comments/17fr8w5/footprintsfingerprints/", "selftext": "hii I don't really know where to put this but I really need to get this out there. edit: I'm sorry if this doesn't fit the theme I got banned off a subreddit last I posted this\nso I (16f) live with my best friend julius (16) in their moms house. usually we stay up late at night watching true crime and scary paranormal videos, and this night was just like any other (sunday from the day I'm writing this). we were watching a paranormal video when we heard something on the big ac unit outside (idk what it'd actually called), we just assumed it was a cat or something since we had outside cats, and brushed it off. a few moments later we heard something drag and move and then tap tap tap ... tap tap tap. someone tapping with their fingers, wanting to be let in. we slightly freak out but try to find the most logical thought, which was a branch. we fell asleep soon after and the next morning, julius' mom comes in asking if we heard anything weird because the wired fence around her garden was torn up, huge holes in it and it was torn up out of the ground. we told her what had happened and she looked at the ac unit and saw 1 footprint and some tools(? Idk what they are) moved. that truly freaked me and my friend out so we refused to go outside the whole day. now today, we went outside to look around and we found what we think to be a thumbprint, two large boot prints and two possible fingerprints on the window. I'm not sure what's going on, but this is really freaky. we're deciding to set up cameras.\nI have a video of the footprints if anyone wants it.\nedit: hi I posted the vid on r/scaryshit you can see it here", "media": null, "score": 10, "upvote_ratio": 0.82, "comment_count": 4, "over_18": false}, "37": {"id": "17ggxz7", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Jealous-Toe-6316", "link_flair_text": null, "time": 1698460547.092438, "created_utc": 1698272516.0, "url": "https://www.reddit.com/r/threekings/comments/17ggxz7/djinn_summoning_process_wish_granting_if_anyone/", "title": "Djinn summoning process ( wish granting) ..if anyone wants to know..", "permalink": "/r/threekings/comments/17ggxz7/djinn_summoning_process_wish_granting_if_anyone/", "selftext": "( https://archive.org/details/DjinnSummoning/mode/1up ) .. ask me if you have any advice or questions.. thanks ..", "media": null, "score": 2, "upvote_ratio": 0.62, "comment_count": 8, "over_18": false}, "38": {"id": "17gc30b", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "JohnnyCasanovaRMP", "link_flair_text": null, "time": 1698460547.845859, "created_utc": 1698259950.0, "url": "https://v.redd.it/ra2x0isqaewb1", "title": "If ghosts aren’t real explain this (Stolen from IG)", "permalink": "/r/Ghosts/comments/17gc30b/if_ghosts_arent_real_explain_this_stolen_from_ig/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/ra2x0isqaewb1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 348, "width": 640, "scrubber_media_url": "https://v.redd.it/ra2x0isqaewb1/DASH_96.mp4", "dash_url": "https://v.redd.it/ra2x0isqaewb1/DASHPlaylist.mpd?a=1701052547%2CZTUyYzA4ZmNkZDBkMDg0MmJhMDM2ZTc0NWZjOTUzZmY2OWU3OTIwMTE0NTBmY2RlY2E4NTc4Mzc3OGNjMjlhNA%3D%3D&v=1&f=sd", "duration": 5, "hls_url": "https://v.redd.it/ra2x0isqaewb1/HLSPlaylist.m3u8?a=1701052547%2CNGE0MmYyNGFlNzIxMmI0OTYyZDk2NjdmY2FlN2E4OTkzNzVlNGIyZmFiOTZkOWY0ZWQxODk3YjVkNjNiODA2Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2254, "upvote_ratio": 0.95, "comment_count": 70, "over_18": false}, "39": {"id": "17fz6co", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "aut0asfixiacion", "link_flair_text": "Glitch Pic", "time": 1698460548.154515, "created_utc": 1698218484.0, "url": "https://i.redd.it/5m4gyvufvawb1.png", "title": "Pigeons standing on an apartment building wall is not normal, correct?", "permalink": "/r/GlitchInTheMatrix/comments/17fz6co/pigeons_standing_on_an_apartment_building_wall_is/", "selftext": "", "media": null, "score": 96, "upvote_ratio": 0.85, "comment_count": 42, "over_18": false}, "40": {"id": "17g8oab", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Junglejinks", "link_flair_text": "repost", "time": 1698460548.8175933, "created_utc": 1698251012.0, "url": "https://v.redd.it/nqqhomx5kdwb1", "title": "Bigfoot Parkour", "permalink": "/r/bigfoot/comments/17g8oab/bigfoot_parkour/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/nqqhomx5kdwb1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/nqqhomx5kdwb1/DASH_96.mp4", "dash_url": "https://v.redd.it/nqqhomx5kdwb1/DASHPlaylist.mpd?a=1701052548%2CMjA5YWQyYmU3N2M4NDQxNTI2YjFmMTI5MWRlNzU1MmZhZmZkNGMxOTcwZDU3MDZkN2FhNmY4N2RmYWI1ZWQyZA%3D%3D&v=1&f=sd", "duration": 15, "hls_url": "https://v.redd.it/nqqhomx5kdwb1/HLSPlaylist.m3u8?a=1701052548%2CZGI0NWZhZjViMGNhMjFkNjcwYWI2MzM1OTIwZjYyNGUzMTE3ZDk1ZWFhM2QwZTViZGM1M2FhN2Q2OTZkZmUwOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 308, "upvote_ratio": 0.79, "comment_count": 49, "over_18": false}, "41": {"id": "17gvfrq", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "MrGoldenEra", "link_flair_text": "Discussion ", "time": 1698460549.581719, "created_utc": 1698323524.0, "url": "https://i.redd.it/mpskhd9sjjwb1.jpg", "title": "Thylacines Still Roaming About?", "permalink": "/r/Cryptozoology/comments/17gvfrq/thylacines_still_roaming_about/", "selftext": "Hey guys! Back here with another discussion post. \nThe Thylacine aka the Tasmanian Tiger was thought to be extinct back in late 1960’s. The last known recorded sighting of the Thylacine in captivity was filmed at the Beaumaris Zoo in Hobart, Tasmania, 1936. It died tragically due to exposure, however many farmers in Tasmania and other areas near the countryside reported seeing small groups or even individual Thylacines running about to this day. Some even killing their livestock. \n\nThe Photo Above Mentioned in the Note Below Stood Out To Me and Seemed The Most Credible Out of All the Ones I Have Seen Researching\n\n• Farmer Peter Groves spotted what possibly may be a Tasmanian Tiger near his farm in Clifton Springs, Victoria. He mentioned the animal could’ve been a mangy fox however stated that “it seems to be bigger than a fox and it’s not shy”. This was the second time Peter had seen the creature in a period of two weeks. This was around 2019 when the sightings occurred. \n• From what I can tell the appearance does match the Thylacine’s characteristics. From its stumpy and medium length tail with what looks like stripes, to the color of its fur and facial structure. \n• I firmly believe that the Thylacine adapted to the current state of the Tasmanian elements and successfully bred to have more dense populations. What do you guys think? \n• If the Coelacanth survived all these years, why couldn’t a marsupial such as the Thylacine fight off extinction and thrive to this day? \nHave a great day guys!", "media": null, "score": 215, "upvote_ratio": 0.96, "comment_count": 39, "over_18": false}, "42": {"id": "17fia0f", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "thebrothermanbill", "link_flair_text": null, "time": 1698460550.863284, "created_utc": 1698168633.0, "url": "https://i.redd.it/0d5s5ou6r6wb1.jpg", "title": "Did a Sketch of the Loveland Frogman", "permalink": "/r/cryptids/comments/17fia0f/did_a_sketch_of_the_loveland_frogman/", "selftext": "", "media": null, "score": 50, "upvote_ratio": 0.96, "comment_count": 3, "over_18": false}, "43": {"id": "17gkvc9", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Rusnan", "link_flair_text": null, "time": 1698460551.900464, "created_utc": 1698283458.0, "url": "https://www.reddit.com/gallery/17gkvc9", "title": "Active shooter in Lewiston, Maine", "permalink": "/r/conspiracy/comments/17gkvc9/active_shooter_in_lewiston_maine/", "selftext": "https://twitter.com/MEStatePolice/status/1717332516569243796\nI've read reports of over 60 shot at three different locations with 16 dead, currently.", "media": null, "score": 2328, "upvote_ratio": 0.88, "comment_count": 2644, "over_18": false}, "44": {"id": "17hz00b", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "astralrocker2001", "link_flair_text": null, "time": 1698460552.194311, "created_utc": 1698444786.0, "url": "https://i.redd.it/7jmcomnremub1.jpg", "title": "They are REAL. They attach to your LOWER CHAKRAS and harvest LOOSH ENERGY from you. They hate humans and see them as cattle to be enslaved, exploited, and disposed.", "permalink": "/r/conspiracyfact/comments/17hz00b/they_are_real_they_attach_to_your_lower_chakras/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 0.67, "comment_count": 2, "over_18": false}, "45": {"id": "17d76s1", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Local-Weekend7451", "link_flair_text": "Discussion", "time": 1698460554.240535, "created_utc": 1697907826.0, "url": "https://i.redd.it/erk3hpvo7lvb1.jpg", "title": "Saucer near Area 51 and S4 on Google maps", "permalink": "/r/ufo/comments/17d76s1/saucer_near_area_51_and_s4_on_google_maps/", "selftext": "Anyone seen this? Coordinates 37.3055577, -116.4726674", "media": null, "score": 548, "upvote_ratio": 0.8, "comment_count": 271, "over_18": false}, "46": {"id": "17e4aw9", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "disclosurediaries", "link_flair_text": "Video", "time": 1698460555.4105048, "created_utc": 1698011344.0, "url": "https://v.redd.it/93bs0bq7rtvb1", "title": "Dr. Kirkpatrick secretly set up a counsel of advisors to AARO, comprising gatekeepers of the alleged gatekeepers of the UAP legacy programs – bold new allegations from Matt Ford", "permalink": "/r/UFOs/comments/17e4aw9/dr_kirkpatrick_secretly_set_up_a_counsel_of/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/93bs0bq7rtvb1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/93bs0bq7rtvb1/DASH_96.mp4", "dash_url": "https://v.redd.it/93bs0bq7rtvb1/DASHPlaylist.mpd?a=1701052554%2CMDM5NmI2ZDg1MmU4ZTNhZDJkYzBmODEzMWIxMWZkOTc0MjY0NDZiNDQzZTk0ZTRhOGM1ODRkYWIxMmE4NjYzMg%3D%3D&v=1&f=sd", "duration": 115, "hls_url": "https://v.redd.it/93bs0bq7rtvb1/HLSPlaylist.m3u8?a=1701052554%2CZjZmYWNkMDZhYTUxMTU5OTEwNzFjZTc3NGYxMDM0OGUzY2RjNzc2MDg1NzNjMjAzODdkZDU5M2FlMzFkZjgyNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1839, "upvote_ratio": 0.89, "comment_count": 311, "over_18": false}, "47": {"id": "17ds1pq", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "SignalInvestigator39", "link_flair_text": "LMAO :snoo_trollface:", "time": 1698460556.9627807, "created_utc": 1697977329.0, "url": "https://i.redd.it/1zhr271dyqvb1.jpg", "title": "This why aliens are not visiting earth again.", "permalink": "/r/aliens/comments/17ds1pq/this_why_aliens_are_not_visiting_earth_again/", "selftext": "", "media": null, "score": 2331, "upvote_ratio": 0.95, "comment_count": 112, "over_18": false}, "48": {"id": "17fykgu", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "my_jefycu", "link_flair_text": null, "time": 1698460557.3445027, "created_utc": 1698215779.0, "url": "https://www.reddit.com/r/UAP/comments/17fykgu/jacques_vallee_in_the_analysis_of_the_modern_ufo/", "title": "Jacques Vallee: \"...in the analysis of the modern UFO myth, you will see human beings under the control of a strange force that is bending them in absurd ways, forcing them to play a role in a bizarre game of deception\"", "permalink": "/r/UAP/comments/17fykgu/jacques_vallee_in_the_analysis_of_the_modern_ufo/", "selftext": "A quote from \"Messengers of Deception\"(1979) by Jacques Vallee \n\n\nI believe there is a machinery of mass manipulation behind the UFO phenomenon. It aims at social and political goals by diverting attention from some human problems and by providing a potential release for tensions caused by others. The contactees are a part of that machinery. They are helping to create a new form of belief: an expectation of actual contact among large parts of the public. In turn this expectation makes millions of people hope for the imminent realization of that age-old dream: salvation from above, surrender to the greater power of some wise navigators of the cosmos.\nWith the release of popular UFO movies, many people who previously were skeptics have begun to jump on this bandwagon from outer space. I wish them bon voyage. However, if you take the trouble to join me in the analysis of the modern UFO myth, you will see human beings under the control of a strange force that is bending them in absurd ways, forcing them to play a role in a bizarre game of deception. This role may be very important if changing social conditions make it desirable to focus the attention of the public on the distant stars while obsolete human institutions are wiped out and rebuilt in new ways. Are the manipulators, in the final analysis, nothing more than a group of humans who have mastered a very advanced form of power?\nLet me summarize my conclusions thus far. UFOs are real. They are physical devices used to affect human consciousness. They may not be from outer space. Their purpose may be to achieve social changes on this planet, through a belief system that uses systematic manipulation of witnesses and contactees; covert use of various sects and cults; control of the channels through which the alleged “space messages” can make an impact on the public.\n\n", "media": null, "score": 185, "upvote_ratio": 0.91, "comment_count": 53, "over_18": false}, "49": {"id": "17hdl89", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "MrsLisaOliver", "link_flair_text": null, "time": 1698460557.7781725, "created_utc": 1698374409.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/17hdl89/do_you_know_anything_about_this_green_curtain/", "title": "DO YOU KNOW ANYTHING ABOUT THIS GREEN CURTAIN MADE FROM A BEDSPREAD / BLANKET?", "permalink": "/r/UnresolvedMysteries/comments/17hdl89/do_you_know_anything_about_this_green_curtain/", "selftext": "I was watching a NEW Dateline the other day and they were talking about a cold case.  It was a little girl who was killed in Ohio in 1989.  There had been many news articles and programs about her.   Her name is Amy Mihaljevic and she was lured to a shopping mall after school under the guise of helping a man buy a gift for her mom.  He told her it was a surprise for her mom, so it was a secret.  They later found her body in a field, along with a green curtain that looked like it had been made out of a bedspread or blanket.  Her DNA and her dog's DNA were on the blanket.  THEY NEED TO KNOW IF ANYBODY REMEMBERS SEEING THIS AVOCADO GREEN CURTAIN THAT WAS SWEN TOGETHER FROM A BEDSPREAD OR BLANKET.  IT IS UNUSUAL AND IS A KEY PIECE OF EVIDENCE.  There's a 50K REWARD if anyone has info.  I tried to post a pic of the poster but wasn't able to do it.  Here are a couple of links:\nhttps://www.reddit.com/r/TrueCrimeDiscussion/comments/17hd1gc/50000_reward_do_you_recognize_this_curtain/\nhttps://www.sportskeeda.com/pop-culture/amy-mihaljevic-s-murder-5-key-details-case\nedit:  took out the old link because everybody thought there was no new info.  Included the reward poster in the cross-post", "media": null, "score": 800, "upvote_ratio": 0.92, "comment_count": 144, "over_18": false}, "50": {"id": "17gx1if", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "Cyc68", "link_flair_text": null, "time": 1698460558.2156403, "created_utc": 1698328359.0, "url": "https://m.independent.ie/irish-news/man-61-lay-dead-and-undiscovered-in-cork-property-for-22-years-inquest-hears/a1706840099.html", "title": "Man (61) lay dead and undiscovered in Cork property for 22 years, inquest hears", "permalink": "/r/MorbidReality/comments/17gx1if/man_61_lay_dead_and_undiscovered_in_cork_property/", "selftext": "I've read a few similar stories but 22 years has to be some kind of record", "media": null, "score": 1341, "upvote_ratio": 0.98, "comment_count": 72, "over_18": true}, "51": {"id": "17fbeqx", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "According_Abroad_998", "link_flair_text": "Premonitions", "time": 1698460558.6226497, "created_utc": 1698149888.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/17fbeqx/coincidencepremonition_story/", "title": "Coincidence/Premonition Story", "permalink": "/r/Thetruthishere/comments/17fbeqx/coincidencepremonition_story/", "selftext": "TW: mentions of death, car accident.\nI wanted to share this story about this white turtle neck I owned when I was 14.\nThis is probably the most bizarre coincidence to happen, as it shares a connection between my mother and I, who is a practising medium/psychic. This happened before she was aware of those certain abilities and we grew up strictly catholic and didn't speak much about all of that 'stuff'.\nI was getting ready one night to see my friend . I thought of a great outfit that included this white turtle neck. I went through my entire wardrobe, back and forth, and could not find it. Normally I would just move on, but I was insistent on finding it as I really wanted to wear this outfit. I went as far as to go through my drawers, pulling everything out. I even went to the top of my wardrobe and took everything out. To note, I hadn't wore it in a while so I knew it couldn't have been in the wash.\nI went to my mom and asked her if she had seen it and I remember she was really rude and said no bluntly. My mom is the type to get up and look for it with me but she told me she didnt know and to find something else. I was like cool, ok. I gave up, picked another outfit and left the house.\nAnyway, months passed and my mom comes into my room and gives me the white turtle neck. I had forgotten all about it and I was like Mom where tf was that turtle neck?\nShe told me that a couple nights before, she had a graphic dream that I got hit by a car and died. She said I was wearing that white turtle neck and it was covered in blood and that it really shook her up and she cried. She went into my wardrobe and took it out. My mom explained that when I approached her asking for it, like specifically persistent in finding it, she was really scared. She knew if she gave in I probably would have laughed maybe and tried to wear it anyway.\nTill this day we talk about it and how odd of a coincidence that I looked for it 2 days after that dream! I ended up throwing it out but I also felt uncomfortable from that point. Like maybe I wore it a couple times after that but every time I put it on I kept thinking about dying in it....\nDefinitely my sleeping beauty moment with her inclination to prick her finger on the spinning wheel.\nI also think about those final destination movies, if you have someone interfere with your death, you avoid it. It just irks me that if she didn't remove it, and I wore it those couple days later, would I truly be dead? It's just so weird.\ni would love to hear anyone elses stories on this topic!", "media": null, "score": 17, "upvote_ratio": 0.88, "comment_count": 2, "over_18": false}, "52": {"id": "17ht5uz", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Think_Complaint2632", "link_flair_text": null, "time": 1698460558.7879457, "created_utc": 1698428815.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/17ht5uz/strange_man_entered_my_house_and_watched_me_sleep/", "title": "strange man entered my house and watched me sleep", "permalink": "/r/LetsNotMeet/comments/17ht5uz/strange_man_entered_my_house_and_watched_me_sleep/", "selftext": "to preface, i live in a college town with 6 other young girls in our 20s. the city we live in is not that nice and has a huge homeless/drug problem where break-ins are not unusual. however, what happened last saturday was defintely strange. my roomates and i, as well as some of our boyfriends, were hanging out and drinking in our house, while 2 of the girls opted to go out to a bar. by around 1am, the 2 girls came home from the bar and everyone was tired so we all went to our own respective rooms.\nlater in the night i was awoken by someone opening my door and standing in my room, staring at me. in my head, i thought that it was one of my roomate's boyfriends trying to see if my boyfriend and i were still awake to continue to party. since i was tired, i pretended to be asleep to avoid being bugged. after a bit, the person closes my door and proceeds to pace back and forth in the hallway. they then begin to attempt to open my roomate's door whose room is right next to mine. luckily, her door was locked and she also had her boyfriend with her. the person then proceeds to go into our utensils drawer and grabs a knife to attempt to pick her lock. after gaining some courage, her boyfriend shouts \"who the f*** is that?!\" which startles the man who then sprints up the stairs and out the door.\nthe police were called and did a search and obviously didn't find anything. they told us break-ins were normal, which we knew. however, what makes this whole scenario creepier is that he didn't steal anything. my phone, alcohol, and $600 shoes were untouched. we also suspect that this person was not on drugs or alcohol as he moved very quietly and deliberately. he was able to get in because the 2 girls who came home from the bar did not lock the door behind them.\ni am not sure what this man's intent was, but i am forever grateful that i happened to have my boyfriend with me (which is not often as he lives 3 hours away) and pretended to be asleep. it gives me chills thinking that a strange man was in my room, and what could have happened to me if i was alone.", "media": null, "score": 28, "upvote_ratio": 0.95, "comment_count": 6, "over_18": true}, "53": {"id": "17g3qlo", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "dannydutch1", "link_flair_text": null, "time": 1698460558.9233506, "created_utc": 1698237325.0, "url": "https://www.dannydutch.com/post/klaus-barbie-the-life-and-crimes-of-the-butcher-of-lyon", "title": "Born on this day in 1913, Klaus Barbie, the \"Butcher of Lyon,\" the head of the Gestapo in France during WW2 and was responsible for the torture and death of thousands of innocent people. With the help of the US, he escaped to Bolivia after the war. This was a guy that REALLY enjoyed his work.", "permalink": "/r/MorbidHistory/comments/17g3qlo/born_on_this_day_in_1913_klaus_barbie_the_butcher/", "selftext": "", "media": null, "score": 7, "upvote_ratio": 0.82, "comment_count": 0, "over_18": false}, "54": {"id": "17i0qwl", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "intothetigerpatch", "link_flair_text": null, "time": 1698460559.2949834, "created_utc": 1698449818.0, "url": "https://youtu.be/xGgr0mA16B8?si=lMQGf-01FpLq7DE2", "title": "\"KNOCK\" psychological horror short - a man is dumbfounded by a recurring knock in his wall", "permalink": "/r/truecreepy/comments/17i0qwl/knock_psychological_horror_short_a_man_is/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "KNOCK (Psychological Thriller Short Film by Bobby Huotari)", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/xGgr0mA16B8?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"KNOCK (Psychological Thriller Short Film by Bobby Huotari)\"></iframe>", "author_name": "Bobby Huotari", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/xGgr0mA16B8/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@BobbyHuotari"}}, "score": 6, "upvote_ratio": 0.88, "comment_count": 0, "over_18": false}, "55": {"id": "17etlov", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "catalie_nurren", "link_flair_text": null, "time": 1698460560.2802536, "created_utc": 1698091379.0, "url": "https://www.reddit.com/gallery/17etlov", "title": "Potential ghost picture in Louisiana? Thoughts?", "permalink": "/r/Ghosts/comments/17etlov/potential_ghost_picture_in_louisiana_thoughts/", "selftext": "Pic taken after a major storm knocked down a tree on a military base in Louisiana. No one was in the street. No one was wearing a uniform like the person in the photo. Could totally be a reflection, but the outfit is throwing me for a loop since it looks old. Other people on base are always talking about their houses being haunted and having paranormal encounters almost daily", "media": null, "score": 2046, "upvote_ratio": 0.88, "comment_count": 428, "over_18": false}, "56": {"id": "17ha9f8", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Prince100001", "link_flair_text": "Glitch Vid", "time": 1698460560.520244, "created_utc": 1698364112.0, "url": "https://v.redd.it/so2kgf8rpkwb1", "title": "Just wow", "permalink": "/r/GlitchInTheMatrix/comments/17ha9f8/just_wow/", "selftext": "", "media": null, "score": 57, "upvote_ratio": 0.91, "comment_count": 2, "over_18": false}, "57": {"id": "17dveyd", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Wobuffets", "link_flair_text": "what is it?", "time": 1698460561.251747, "created_utc": 1697987389.0, "url": "https://v.redd.it/s813whscqrvb1", "title": "Someone posted a pig ripped in half, This video is from the same area.", "permalink": "/r/bigfoot/comments/17dveyd/someone_posted_a_pig_ripped_in_half_this_video_is/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/s813whscqrvb1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 626, "scrubber_media_url": "https://v.redd.it/s813whscqrvb1/DASH_96.mp4", "dash_url": "https://v.redd.it/s813whscqrvb1/DASHPlaylist.mpd?a=1701052560%2CZDkyNTUwNjNmMDZmODBlYWVjN2U5ODllNzM0ZjkwZjRlYWE0MzUzZDhiYWI3ZjhlMDZkY2Y1MjI2ZmY2MjhlZQ%3D%3D&v=1&f=sd", "duration": 22, "hls_url": "https://v.redd.it/s813whscqrvb1/HLSPlaylist.m3u8?a=1701052560%2CYzAyMDFmMjIwMzRlOTYwOGY0ZDJiOGIxOWU4ZDQ2ZTU3NTAyYjVlZDRkODQzOTUzNGUxY2IzMDk1ODc2ZTUwMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 258, "upvote_ratio": 0.82, "comment_count": 123, "over_18": false}, "58": {"id": "17f9vek", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Question", "time": 1698460561.755647, "created_utc": 1698144504.0, "url": "https://i.redd.it/8mz7u76gr4wb1.jpg", "title": "What's your favorite \"alternative\" theory in cryptozoology? Like the theory that plesiosaur sightings are just long necked seals, or that some bigfoot sightings are living ground sloths or short faced bears", "permalink": "/r/Cryptozoology/comments/17f9vek/whats_your_favorite_alternative_theory_in/", "selftext": "", "media": null, "score": 163, "upvote_ratio": 0.97, "comment_count": 74, "over_18": false}, "59": {"id": "17cttbw", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "thebrothermanbill", "link_flair_text": null, "time": 1698460562.65953, "created_utc": 1697860475.0, "url": "https://i.redd.it/ow8vuclvahvb1.jpg", "title": "Sketched my version of “the batsquatch”", "permalink": "/r/cryptids/comments/17cttbw/sketched_my_version_of_the_batsquatch/", "selftext": "", "media": null, "score": 40, "upvote_ratio": 0.97, "comment_count": 6, "over_18": false}, "60": {"id": "17dw5o7", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Frosty_Value5767", "link_flair_text": null, "time": 1698460563.9131665, "created_utc": 1697989353.0, "url": "https://i.redd.it/agmerhppxrvb1.jpg", "title": "Help To Identify a Logo. In the background, you will see a Cross with a diagonal line through it that also contains 2 circles. Can anyone identify this.", "permalink": "/r/conspiracy/comments/17dw5o7/help_to_identify_a_logo_in_the_background_you/", "selftext": "", "media": null, "score": 1962, "upvote_ratio": 0.84, "comment_count": 1115, "over_18": false}, "61": {"id": "17htuus", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1698460564.2645967, "created_utc": 1698430664.0, "url": "https://youtube.com/live/plbiGghOmfQ", "title": "Beware! Who Can You Trust Out There", "permalink": "/r/conspiracyfact/comments/17htuus/beware_who_can_you_trust_out_there/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "62": {"id": "17h2be8", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "CommissionEarly7389", "link_flair_text": null, "time": 1698460565.8845277, "created_utc": 1698342881.0, "url": "https://tiblur.com/post/230440356802773501242694", "title": "Elected officials told by Department of Defense they do not have the clearance to learn about UFO programs. Who is really running the United States? Aliens?", "permalink": "/r/ufo/comments/17h2be8/elected_officials_told_by_department_of_defense/", "selftext": "", "media": null, "score": 496, "upvote_ratio": 0.96, "comment_count": 149, "over_18": false}, "63": {"id": "17d48oh", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Desperate_Response88", "link_flair_text": "Video", "time": 1698460567.0119088, "created_utc": 1697899737.0, "url": "https://v.redd.it/ddjy6kwmckvb1", "title": "Who is JAMES LACATSKI, the government official who claimed that the US government is in possession of a craft of unknown origin.", "permalink": "/r/UFOs/comments/17d48oh/who_is_james_lacatski_the_government_official_who/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/ddjy6kwmckvb1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/ddjy6kwmckvb1/DASH_96.mp4", "dash_url": "https://v.redd.it/ddjy6kwmckvb1/DASHPlaylist.mpd?a=1701052566%2CMzljZDMzMzdmYzQ2NmJlNGJjYjEyOGMzNzQ4NWRhMDA2MjA1MjZmNTEyOWViY2MyMzI1MzkxNWEzZGI5ZmY1Yw%3D%3D&v=1&f=sd", "duration": 141, "hls_url": "https://v.redd.it/ddjy6kwmckvb1/HLSPlaylist.m3u8?a=1701052566%2CNDUxN2NjZTg5N2Q5NjMzMjU1MjQwNzJiZmFkMGFmZmFmYWVmNWEwMjQxODBiM2E3YWNiNGQ2ZGNlMzdhMWRlYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1808, "upvote_ratio": 0.88, "comment_count": 404, "over_18": false}, "64": {"id": "17h98os", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "GlobalUfoChannel", "link_flair_text": "Video", "time": 1698460568.8710518, "created_utc": 1698361206.0, "url": "https://v.redd.it/j7m5wm8pnmwb1", "title": "\"Triangular shaped\" UFO caught on doorbell camera in England. What are your thoughts?", "permalink": "/r/aliens/comments/17h98os/triangular_shaped_ufo_caught_on_doorbell_camera/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/j7m5wm8pnmwb1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/j7m5wm8pnmwb1/DASH_96.mp4", "dash_url": "https://v.redd.it/j7m5wm8pnmwb1/DASHPlaylist.mpd?a=1701052567%2COWZjODlmZjU4MTgwZTllM2Q1YTJkY2I3NDBlMDM1MDA5MGE0YzFhZjg0NzE1MzZkMWQ4NGFlNjAwY2EyNTc3NA%3D%3D&v=1&f=sd", "duration": 55, "hls_url": "https://v.redd.it/j7m5wm8pnmwb1/HLSPlaylist.m3u8?a=1701052567%2CNDFjY2I4M2M2Y2VjYmM0NTQ5YTViOWNjZjgyYWQ1MThhNGFhZTg0YjVmNzI1MzVhYjdkMjdjMTRiMmU1MDZkNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1958, "upvote_ratio": 0.88, "comment_count": 349, "over_18": false}, "65": {"id": "17hjlej", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Video", "time": 1698460569.2612555, "created_utc": 1698398607.0, "url": "https://v.redd.it/n6ilyxiuqpwb1", "title": "Betty Hill describes her and her husband's famous NHI abduction case from 1961 in her own words.", "permalink": "/r/UAP/comments/17hjlej/betty_hill_describes_her_and_her_husbands_famous/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/n6ilyxiuqpwb1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/n6ilyxiuqpwb1/DASH_96.mp4", "dash_url": "https://v.redd.it/n6ilyxiuqpwb1/DASHPlaylist.mpd?a=1701052569%2CYTY4YmY0NzE0Y2ZjNTM3YWIzMTFkZmRiNTJiYmZlYzAxYmQ2ODc0NWJjMDg1NTUzZWZiMDVhNGEzNDg0YjMyYQ%3D%3D&v=1&f=sd", "duration": 208, "hls_url": "https://v.redd.it/n6ilyxiuqpwb1/HLSPlaylist.m3u8?a=1701052569%2CMTU4ODgzMTJmNjYyZjNmMjA5ZTc4OWZhZGIxYjlhMDI3ZTY0MzY5NDkyOGFjMTYxMGM1NDZkMGM1YTZlYWU5OQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 178, "upvote_ratio": 0.96, "comment_count": 21, "over_18": false}, "66": {"id": "17dff20", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "Black_Cat_Just_That", "link_flair_text": "Murder", "time": 1698460569.6787834, "created_utc": 1697930500.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/17dff20/solved_lindy_sue_biechlers_murderer_identified/", "title": "SOLVED: Lindy Sue Biechler's murderer identified through genetic genealogy!", "permalink": "/r/UnresolvedMysteries/comments/17dff20/solved_lindy_sue_biechlers_murderer_identified/", "selftext": "https://www.fox43.com/article/news/local/lancaster-county/david-sinopoli-guilty-plea-sentencing-murder-lindy-sue-biechler-lancaster-cold-case/521-a24c55a1-dede-4311-845e-c7864b3ab47b\n\"A Lancaster man charged in the county's oldest cold case will serve up to 50 years in prison after pleading guilty on Thursday to third-degree murder and other offenses connected to the death of Lindy Sue Biechler in 1975.\nDavid Sinopoli, of the 300 block of Faulkner Drive, was arrested in July 2022 and charged with murdering the 19-year-old Biechler nearly 48 years ago.\nIn addition to third-degree homicide, Sinopoli pleaded guilty to a second-degree felony count of aggravated assault and a third-degree felony count of burglary in a hearing before Lancaster County Judge David L. Ashworth Thursday afternoon.\nAs part of a plea arrangement governed by laws in 1975 (before sentencing guidelines existed), Sinopoli was immediately sentenced to an aggregate prison term of 25 to 50 years in a state correctional facility. He waived a pre-sentence investigation.\nConsidering Sinopoli's age, Judge Ashworth said it's essentially a life sentence.\"\nThe article has quite a few more details - I just wanted to convey the most important bits about his sentencing here. \nFor a more detailed description of the case, visit\nhttps://www.truecrimeedition.com/post/lindy-biechler", "media": null, "score": 711, "upvote_ratio": 0.99, "comment_count": 54, "over_18": false}, "67": {"id": "17h5spd", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "Scared-Cheesecake-70", "link_flair_text": null, "time": 1698460570.1798272, "created_utc": 1698352051.0, "url": "https://www.reddit.com/r/MorbidReality/comments/17h5spd/another_mass_shooting_at_least_18_dead/", "title": "Another mass shooting. At least 18 dead", "permalink": "/r/MorbidReality/comments/17h5spd/another_mass_shooting_at_least_18_dead/", "selftext": "https://www.nbcnews.com/news/amp/live-blog/rcna122270", "media": null, "score": 1303, "upvote_ratio": 0.9, "comment_count": 358, "over_18": true}, "68": {"id": "17h74lo", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Spirited-Ambition-20", "link_flair_text": "Paranormal Investigation", "time": 1698460570.5912325, "created_utc": 1698355549.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/17h74lo/an_invisible_owl_jumped_off_my_shoulders/", "title": "An invisible owl jumped off my shoulders", "permalink": "/r/Thetruthishere/comments/17h74lo/an_invisible_owl_jumped_off_my_shoulders/", "selftext": "So last year I had a psychotic episode and many strange things happened. I made a mess in my home, neighbour called police because I threatened him, I then spend 7 days without sleep homeless travelling around Greece with bus and train - Reality was completely shifted- I won't get into much detail but I thought I was god and that I created everything -Typical schizo stuff.\nA little bit before everything ended and I jumped off a bridge this happened. It was night and I was invisible in a Town full of black magic occult guys . I was the one who would bring utopia and they didn't want that. I did a mistake and suddenly everyone knew I was there and everyone was about to search for me and kill me . Then I walked to hide trying to remain invisible again - I was walking 40 minute's straight under their noses invisible lol, It was so scary - My andrenaline levels were too high. I managed to get to a safe place and then my owl spirit animal told me to follow her instructions. She told me to go back in the town again were they were searching me and don't fear anything,as long as you are with me you can stay invisible - I love her to the death and The connection was real so I did It. She told me to follow my Head movements and always follow that road.\nI was walking 45 minutes in a neighborhood where all of this dark occult guys lived-She told me we are leaving our energetic print to cast a spell.Then she told me you are getting close- As soon as I hit the end of the road and Left that neighborhood s Bird jumped from My shoulders and heard feathers and owl sound I was beyond amazed - She told me now you are safe- Go sit at that bench. I go sit at that bench turn my Head and see a pizza shop with bright Red neon saying: Μαγεία (Greek word meaning sorcery). The only Pizza shop called Sorcery in The world and I stood next to It after All that happened. What are The chances? LOL", "media": null, "score": 8, "upvote_ratio": 0.68, "comment_count": 3, "over_18": false}, "69": {"id": "17gzvbx", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "GeneralDavis87", "link_flair_text": null, "time": 1698460570.8883805, "created_utc": 1698336285.0, "url": "https://youtu.be/pGAzQL09P4E?si=Oqe8iCKIdPyOelLN", "title": "Meuse-Argonne Offensive (1918) 77th Division WWI", "permalink": "/r/MorbidHistory/comments/17gzvbx/meuseargonne_offensive_1918_77th_division_wwi/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Meuse-Argonne Offensive (1918) 77th Division WWI", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/pGAzQL09P4E?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Meuse-Argonne Offensive (1918) 77th Division WWI\"></iframe>", "author_name": "Marvelous Movies", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/pGAzQL09P4E/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@Marvelous_Movies"}}, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "70": {"id": "17h2vtm", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Throwayforasickmind", "link_flair_text": null, "time": 1698460571.2519798, "created_utc": 1698344418.0, "url": "https://youtube.com/watch?v=CZrMnT-S-jw&si=X812pZzl4KWYZmiY", "title": "The Man-Eating Skinwalker", "permalink": "/r/truecreepy/comments/17h2vtm/the_maneating_skinwalker/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Man-Eating Skinwalker [analog horror, tiktok, skinwalker disguised as dog #fyp]", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/CZrMnT-S-jw?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The Man-Eating Skinwalker [analog horror, tiktok, skinwalker disguised as dog #fyp]\"></iframe>", "author_name": "A YouTube Account", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/CZrMnT-S-jw/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@SATANS_SPHYNX"}}, "score": 0, "upvote_ratio": 0.5, "comment_count": 0, "over_18": false}, "71": {"id": "17de2ko", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "AmbitiousCarCrash", "link_flair_text": null, "time": 1698460572.5364885, "created_utc": 1697926730.0, "url": "https://www.reddit.com/gallery/17de2ko", "title": "Update Post regarding the furniture set I posted before", "permalink": "/r/Ghosts/comments/17de2ko/update_post_regarding_the_furniture_set_i_posted/", "selftext": "Sorry for the late update. I was going to go over the day after and frankly, couldn’t muster up the courage to do so. I’ve been needing to get the furniture out of there so I could get that rental back on the market anyways. After talking with a childhood friend about that post kind of blowing up & needing to get it out of there, he volunteered to come visit and give me a hand. \nTo start, nothing “out of the ordinary” necessarily happened when I went to get it. I will say, it still gives me the eeriest feeling ever just being around it and I can feel my body temperature drop. That cold feeling is unlike any other. My friend who is a big fan of paranormal stuff in general said, and I quote “bro, there’s something evil trapped in this, I can feel it!”. From the moment I got in the presence of this furniture again, I just felt an unrest that was unshakable. \nI got a ton of good suggestions and I pulled the set apart to look for any additional “trap door” stuff or anything stored away. I did find a photo that also gives me the absolute creeps under the bottom drawer in the dresser (I’ll include a pic). I don’t think there’s really a way to get any information as to who the family is, but I’m going to try and find a sub or a forum or something where I can post a pic and get any info, I’ll keep you all updated. \nThere’s no universe where I could imagine my wife or daughters going back around this stuff, as they were the ones so deeply affected after being in its presence. I didn’t even fill them in that I was going to be around it. When I got home, my youngest daughter gave me the strangest look and asked “daddy, are you ok?” I said I was fine. She doubled down and asked “are you sure?”. While that doesn’t seem “crazy” per say, it just is not a normal question from her… definitely thought it was weird. \nI still don’t really know what to do with this furniture. There was probably over 100 people that reached out wanting to buy it. I just don’t think I’m comfortable with giving this to just anyone. It needs to end up somewhere where the person truly understands what this is and what having this could mean. I know there are plenty of skeptics, but this set truly has a weird effect on people, all people, in one way or another. I wish I could explain it away, I just can’t. I really operate day to day with common sense and practicality… it all goes out the window with this, and I hate the feeling. \nAnyways, just wanted to give you all an update. I honestly can’t get rid of this stuff fast enough, and never look back. I guess the moral of the story is, no matter how many times your wife asks for the creepy furniture set she found online, and even if you manage to wiggle $2k off the price so “it’s such a good deal, I guess I kinda have to at this point”, and you think it will make you husband of the year….. DON’T DO IT. Go to IKEA, Ashley, ANYWHERE… just stay away from the furniture with the creepy ladies on it. \nAlso, I was asked by several people to show the dovetails, so that’s why I’m including a random pic of the side of the drawer pulled out.", "media": null, "score": 1960, "upvote_ratio": 0.98, "comment_count": 392, "over_18": false}, "72": {"id": "17hnm6s", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "MejTieOfficial", "link_flair_text": "Glitch Pic", "time": 1698460572.8269494, "created_utc": 1698413445.0, "url": "https://i.redd.it/vrn6n1t5zqwb1.jpg", "title": "Cola thinks it’s too good for physics", "permalink": "/r/GlitchInTheMatrix/comments/17hnm6s/cola_thinks_its_too_good_for_physics/", "selftext": "", "media": null, "score": 46, "upvote_ratio": 0.95, "comment_count": 3, "over_18": false}, "73": {"id": "17euq30", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Acepitcher4", "link_flair_text": "hoax?", "time": 1698460573.4849277, "created_utc": 1698094178.0, "url": "https://v.redd.it/mrn8dghkl0wb1", "title": "vid I found on YouTube", "permalink": "/r/bigfoot/comments/17euq30/vid_i_found_on_youtube/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/mrn8dghkl0wb1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/mrn8dghkl0wb1/DASH_96.mp4", "dash_url": "https://v.redd.it/mrn8dghkl0wb1/DASHPlaylist.mpd?a=1701052573%2CZWVkMWY1MWU3MmY3N2MwY2U0NDhiZDgwYTE1NWM0ZDNiZjBiOTEzZGFhZjMxODVlMTc2ZmUzY2Q1YjEyOWQwOA%3D%3D&v=1&f=sd", "duration": 71, "hls_url": "https://v.redd.it/mrn8dghkl0wb1/HLSPlaylist.m3u8?a=1701052573%2CZDVmNzcxYTA0MmM3M2RhYTZlOGI1ZGM2Mzk3NThlYmI2NTU3YzM2ODczY2Q5MmYzZTQyNjBjOTUyYjRjY2JlYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 212, "upvote_ratio": 0.73, "comment_count": 151, "over_18": false}, "74": {"id": "17es30x", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "justa-human", "link_flair_text": "Discussion ", "time": 1698460573.9780695, "created_utc": 1698087543.0, "url": "https://i.redd.it/9325nr9320wb1.jpg", "title": "What truly counts as a cryptid and what doesn’t", "permalink": "/r/Cryptozoology/comments/17es30x/what_truly_counts_as_a_cryptid_and_what_doesnt/", "selftext": "", "media": null, "score": 150, "upvote_ratio": 0.94, "comment_count": 36, "over_18": false}, "75": {"id": "17f14bb", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "DestinySurreal", "link_flair_text": null, "time": 1698460574.920737, "created_utc": 1698111402.0, "url": "https://i.redd.it/f6vxor8112wb1.png", "title": "Spellcasting Wampus ✨🕯️", "permalink": "/r/cryptids/comments/17f14bb/spellcasting_wampus/", "selftext": "Thought I would share my version of my home state of Tennessee's cryptid. The Wampus Cat. I put so much love into this. 🌹", "media": null, "score": 27, "upvote_ratio": 0.91, "comment_count": 3, "over_18": false}, "76": {"id": "17g2jpx", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Own-Landscape-8586", "link_flair_text": null, "time": 1698460575.8930955, "created_utc": 1698233234.0, "url": "https://i.redd.it/v4pw8zia3cwb1.jpg", "title": "And we pay for their free health care and education, why?! Why do Americans care so much about Israel??", "permalink": "/r/conspiracy/comments/17g2jpx/and_we_pay_for_their_free_health_care_and/", "selftext": "", "media": null, "score": 1903, "upvote_ratio": 0.81, "comment_count": 516, "over_18": false}, "77": {"id": "17er0dz", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1698460576.210062, "created_utc": 1698084815.0, "url": "https://youtube.com/live/2jpuKusV-k8", "title": "Is There Something Spiritual Out There Beyond Our Understanding?", "permalink": "/r/conspiracyfact/comments/17er0dz/is_there_something_spiritual_out_there_beyond_our/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 0.67, "comment_count": 4, "over_18": false}, "78": {"id": "17fpb0i", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Scary_Risk_5120", "link_flair_text": null, "time": 1698460577.8676176, "created_utc": 1698186283.0, "url": "https://www.reddit.com/r/ufo/comments/17fpb0i/my_ufo_encounter_as_a_police_officer/", "title": "My UFO encounter as a police officer", "permalink": "/r/ufo/comments/17fpb0i/my_ufo_encounter_as_a_police_officer/", "selftext": "In July of 2013 (almost ten years ago), I was a police officer and working for a Art Museum in Indianapolis. We would have to check a museum property that was located in a neighborhood across the street. \nMy partner and I took separate routes to the house and met at a 3 way stop intersection. \nThere we saw two roughly 5’ wide saucer shaped craft sitting on a lawn just hovering about a foot off the ground about 25’ away. While trying to figure out what was holding them in place (I was coming to the conclusion a balloon with a string I couldn’t see this was a wealthy neighborhood and very artistic), they started floating away like someone cut the string. \nThey then rose slowly to about ten feet and stoped for maybe 5 or 10 seconds, and then the bottoms lit up. \nNow I could see the craft. The bottom looked like burnt wood framing in parchment paper, with the light coming from within the paper, or the paper was the light. \nOnce the lights came on, they stated gyrating or dancing around each other and flying down the street. \nSlow at first and picking up speed. \nMy partner and I jumped back in our cars and went after them. \nThey were slowly raising up and reached a top height of about 20-25’. \nWhen they got to the light after a short distance they went left. By the time I got to the light they had gained a significant distance, and were quickly gone over a hill. A few seconds later I watched as two small balls of light took off into outer space miles away from my location. \nWe did radio to museum dispatch what we saw. We were also told our run was maybe 20-25 min long, and should have been a quick 5 min drive by. So no substantial time loss. I do strongly feel as though I had a conversation with these craft, but obviously not something I can wrap my head around as solid. Because that would be crazy right. A conversation with flying saucers. \nWhile it could be completely unrelated, a Representative that chaired a senate select committee on UAPs within the last few years lives two houses down from my encounter. I had met this person several times previously, and actually walked him through the door the day he filed to run for the senate.\nEdit:  To add some background to this sighting. Prior to Law Enforcement, I served in the US Navy as a Boatswains Mate. I was trained as an expert lookout and also trained other expert lookouts. In this role I was trained on being able to spot and identify a number of ships, aircraft, satellites, and weather balloons. \nAlso we are talking a distance of about 25’.  On the ground. It was such a clear night we didn’t even need a spotlight.\nI am plagued by nightmares/out of body experiences/sleep paralysis. What ever you want to call it. \nI wake up between 3-4 every morning. Like clockwork. I haven’t used an alarm clock for years. \nI have suffered very strange health abnormalities since. \nI am a completely different person since. The person I was is dead and gone.  My life and path are completely different from ten years ago and I am so grateful for that. I have been gifted with the knowledge that we are not alone, and knowing that as fact and having it as the forefront of every decision you make, every emotion that you feel.  Life takes on new meaning, new purpose. You care about the things others don’t seem to, and not about whatever everyone is currently pointing at. Lots of time is spent in self reflection. \nI do not seek fame, recognition, or money. I’m not looking to have anyone including myself profit from this so I do not authorize it for fictional use or to be dramatized on television.  But I am also not some anonymous source “LARPing” some fantasy to make my life more enjoyable. \nMy name is Casey Hammond. I was born and mostly raised here in central Indiana. I try to always make myself available for discussion on this topic, but I’m not buying whatever you are selling. You have your own story I’m happy to listen, but I’m not interested in what you “know” to be fact about what is going on, I want actual facts. \nI am also not a fan of circular jerks and stroking each other’s ego about being special. I’m not looking for arm chair therapy. \nEdit 2: No one ever asks about my partner. While we don’t speak over philosophical differences, last I heard he is alive and well. He’s also offered up his information to any legitimate reporter. ", "media": null, "score": 454, "upvote_ratio": 0.93, "comment_count": 213, "over_18": false}, "79": {"id": "17emo74", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "notaninvestor633", "link_flair_text": "Discussion", "time": 1698460579.016901, "created_utc": 1698073842.0, "url": "https://www.change.org/p/demand-the-removal-of-dr-sean-kirkpatrick-director-of-aaro", "title": "Petition to Remove Kirkpatrick from AARO", "permalink": "/r/UFOs/comments/17emo74/petition_to_remove_kirkpatrick_from_aaro/", "selftext": "This is a petition to call for the immediate removal Dr. Sean Kirkpatrick. Dr. Kirkpatrick is the director of the Department of Defense’s All-domain Anomaly Resolution Office (AARO). Dr Kirkpatrick MUST RESIGN. There is a secret committee which directs the Department of Defense’s All-domain Anomaly Resolution Office (AARO)’s actions and public statements. This committee comprises unelected officials who are directly involved with the legacy UAP/UFO crash retrieval and reverse engineering programs. Allegedly, these are the gatekeepers of the UFO/UAP secrets.\nDr. Kirkpatrick has repeatedly lied to the American people about a lack of evidence concerning UFOs/UAPs. There is no doubt that he will continue to do so!\nThis undercover committee runs the \"dog and pony show\" that is AARO. The names of these individuals have been provided to members of Congress with the appropriate clearances. It is now up to our elected representatives to haul these individuals before Congress and the American people to demand an explanation.", "media": null, "score": 1792, "upvote_ratio": 0.89, "comment_count": 293, "over_18": false}, "80": {"id": "17deklu", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Trueboey", "link_flair_text": "Discussion :table:", "time": 1698460580.5828204, "created_utc": 1697928115.0, "url": "https://twitter.com/Unexplained2020/status/1715466043710206041", "title": "Ret. CIA Officer John Ramirez: “I give credence to fact that Roswell actually happened... bodies were recovered & .. their DNA was examined...same sequences found human genome", "permalink": "/r/aliens/comments/17deklu/ret_cia_officer_john_ramirez_i_give_credence_to/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/Unexplained2020/status/1715466043710206041", "author_name": "Vicky Verma", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">Ret. CIA Officer John Ramirez: “I give credence to fact that Roswell actually happened... bodies were recovered &amp; .. their DNA was examined...same sequences found human genome<a href=\"https://twitter.com/hashtag/UFOtwitter?src=hash&amp;ref_src=twsrc%5Etfw\">#UFOtwitter</a> <a href=\"https://twitter.com/hashtag/UAPtwitter?src=hash&amp;ref_src=twsrc%5Etfw\">#UAPtwitter</a> <a href=\"https://twitter.com/hashtag/UAPs?src=hash&amp;ref_src=twsrc%5Etfw\">#UAPs</a> <a href=\"https://twitter.com/hashtag/UAP?src=hash&amp;ref_src=twsrc%5Etfw\">#UAP</a> <a href=\"https://twitter.com/hashtag/UFOX?src=hash&amp;ref_src=twsrc%5Etfw\">#UFOX</a> <a href=\"https://twitter.com/hashtag/uapX?src=hash&amp;ref_src=twsrc%5Etfw\">#uapX</a> <a href=\"https://t.co/WytGNRkAOg\">https://t.co/WytGNRkAOg</a></p>&mdash; Vicky Verma (@Unexplained2020) <a href=\"https://twitter.com/Unexplained2020/status/1715466043710206041?ref_src=twsrc%5Etfw\">October 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n", "author_url": "https://twitter.com/Unexplained2020", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 1515, "upvote_ratio": 0.86, "comment_count": 550, "over_18": false}, "81": {"id": "17ctjbf", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Inishmore12", "link_flair_text": null, "time": 1698460581.0263667, "created_utc": 1697859487.0, "url": "https://www.reddit.com/r/UAP/comments/17ctjbf/merged_podcasts/", "title": "Merged podcasts", "permalink": "/r/UAP/comments/17ctjbf/merged_podcasts/", "selftext": "As someone who has taken a deep dive head-first into all things UAP over the past several months, I’ll admit it has been a difficult task trying to separate the wheat from the chaff. There is a plethora of documentaries, tv programs, books, newspaper and magazine articles, self-proclaimed experts, debunkers, tin-foil hat wearing zealots, interviews, FOIA documents, videos, UAP journalists and \nnumerous Reddit boards - enough to make my head spin. I found it all to be overwhelming and confusing. \nI just finished listening to all of Ryan Graves “Merged” podcasts. I wish I had stumbled upon them first in my quest for UAP info. Merged consists of level-headed, scientifically-based interviews with credentialed individuals at the top of their fields. No woo. No outlandish claims. Truly a breath of fresh air.", "media": null, "score": 60, "upvote_ratio": 1.0, "comment_count": 23, "over_18": false}, "82": {"id": "17ef629", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "StarlightDown", "link_flair_text": "Cryptid", "time": 1698460581.4807127, "created_utc": 1698048074.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/17ef629/millions_of_years_ago_a_cancer_in_a_jellyfish_may/", "title": "Millions of years ago, a cancer in a jellyfish may have become infectious, jumped to other species, and evolved into a group of strange parasites known as Myxozoa. What's the true origin of Myxozoa, which live inside fish, worms, and mammals, and have a genome unlike any other creature on Earth?", "permalink": "/r/UnresolvedMysteries/comments/17ef629/millions_of_years_ago_a_cancer_in_a_jellyfish_may/", "selftext": "Time for a zoology mystery! Myxozoans threw scientists in for a spin. Discovered by the German biologist J. Müller in 1838, they were thought for 150 years to be protists—one of the six traditional kingdoms of life, made up almost entirely of tiny single-celled organisms. The scientists of old couldn't be blamed for this mistake; myxozoans are as small as 0.0085 millimeters, much smaller than even the smallest animals. Link, link\nScientists eventually realized that they had discovered a very strange parasite.\n\nMyxozoans turned out to be small multicellular organisms, not single-celled, putting them in a minority of protists.\nBiologists discovered a wide variety of Myxozoa species which infect a range of fish and annelids, and in some cases even birds and mammals. Infections in fish can cause death from severe developmental and neurological problems. The diverse list of animals susceptible to this parasite is highly unusual. What does a fish have in common with a worm? Link, link\nMany of the individual species in fish and worms were found to be duplicates of the same species. Myxosporeans spend part of their life cycle in fish and another part in worms, changing appearance dramatically as they mature.\nMyxosporeans don't just insert themselves into their hosts; they insert themselves into their cells. This is a very strange kind of parasitism. Link\n\nThe fifth and biggest surprise came in 1995, from a team of scientists at the Virginia Institute of Marine Science. Genetic sequencing revealed that myxozoans are animals, not protists. They're by far the smallest animals known to exist, yet they are cnidarians and related to jellyfish. Link\nThe mystery goes beyond just their physical size—Myxozoa species have extremely small genomes, and are missing so many critical genes that it should be impossible for them to exist as animals or even multicellular organisms. Myxosporeans lost their tumor-suppressing genes, which isn't seen in any other parasitic species. However, this is a common hallmark of cancer. Cells which lose their tumor-suppressing genes are unable to control their growth and grow into a tumor.\nThe SCANDAL hypothesis\nA SCANDAL (speciated by cancer development animal) is what the investigators of a controversial 2019 Biology Direct paper call myxosporeans, and other lifeforms like it. Myxosporeans are a biological scandal: they are the absurd result of a cancer in a jellyfish-like creature that became infectious, jumped to other species, and evolved into a new multicellular species. Link, link\nStep one: can a cancer really be infectious?\n\nDevil facial tumor disease (DFTD) has become notorious as a transmissible cancer devastating Tasmanian devils, who transmit it to one another in their bites. More common but perhaps less famous is canine transmissible venereal tumor (CTVT), a sexually transmitted disease among dogs that, according to a recent analysis by Elizabeth Murchison of the University of Cambridge and her colleagues, has been evolving as a transmissible cancer for as long as 8,500 years. Transmissible cancers are not confined to mammals; they have also been found in mollusks. There’s no reason to think it would be impossible for transmissible tumors to arise in a cnidarian too. Cnidarians certainly aren’t immune to cancers in general.\n\nStep two: how could it be transmitted between species?\n\nAthena Aktipis, an assistant professor at Arizona State University. Aktipis, who specializes in the evolution of cancer, points to cases such as that of a man with HIV who was discovered to be infected with tumor cells from a tapeworm. Such worm cancers have turned up repeatedly among people with compromised immune systems. \"Maybe we should also consider the possibility that things that were cancer or cancerlike sometimes, in the right conditions, could become parasites on other species,” she said.\n\nScary! Step three—the evolution of a transmitted cancer into a multicellular organism—is the biggest roadblock in the hypothesis, since we have no idea if it's ever happened. Some biologists raised doubts about whether a cancer could ever create the complex life cycle of myxosporeans.\nMany scientists say that SCANDALs probably don't exist. The chance of any of the above happening is tiny, and even though two out of three did happen, the chance of all of them happening together to give birth to a SCANDAL is pretty much zero. On the other side, it's important to remember that animal life has existed for hundreds of millions of years, and has given birth to a vast, miraculous array of life we're only just now beginning to understand. Who knows, maybe life had a SCANDAL too.\n(X-post from r/nonmurdermysteries )", "media": null, "score": 653, "upvote_ratio": 0.97, "comment_count": 34, "over_18": false}, "83": {"id": "17hlc1g", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "andenayu", "link_flair_text": null, "time": 1698460581.9585614, "created_utc": 1698405763.0, "url": "https://www.reddit.com/gallery/17hlc1g", "title": "Cigarette packaging in Indonesia", "permalink": "/r/MorbidReality/comments/17hlc1g/cigarette_packaging_in_indonesia/", "selftext": "Just bought a 10 pack cigarettes and wanna share you guys the picture on the packaging.", "media": null, "score": 1298, "upvote_ratio": 0.93, "comment_count": 294, "over_18": true}, "84": {"id": "17ebv10", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Platomik", "link_flair_text": "Askreddit etc", "time": 1698460582.3765512, "created_utc": 1698034293.0, "url": "/r/AskReddit/comments/17dvre6/serious_people_of_reddit_have_you_ever/", "title": "[Serious] People of Reddit, have you ever experienced anything paranormal or unexplainable? What happened?", "permalink": "/r/Thetruthishere/comments/17ebv10/serious_people_of_reddit_have_you_ever/", "selftext": "", "media": null, "score": 9, "upvote_ratio": 1.0, "comment_count": 4, "over_18": false}, "85": {"id": "17e7xto", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "eleventhjam1969", "link_flair_text": null, "time": 1698460582.6599376, "created_utc": 1698021765.0, "url": "https://i.redd.it/gt04bbjhmuvb1.jpg", "title": "A captured American soldier lies dead with his hands bound behind his back. The soldier, apart of the doomed “Task Force Smith,” was sent to delay the NK army’s advance south in the opening days of the Korean war. The ill-prepared men of Task Force Smith were forced to retreat. 1950.", "permalink": "/r/MorbidHistory/comments/17e7xto/a_captured_american_soldier_lies_dead_with_his/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 0, "over_18": true}, "86": {"id": "17f0y3m", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "TheSamiG", "link_flair_text": null, "time": 1698460583.0710723, "created_utc": 1698110903.0, "url": "https://www.youtube.com/watch?v=qpzQGpfwmR4", "title": "Exposing the evil education system, and how some students escaped the shackles of schoo", "permalink": "/r/truecreepy/comments/17f0y3m/exposing_the_evil_education_system_and_how_some/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The School Escapists – How Suffering Students Escaped an Evil Institution", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/qpzQGpfwmR4?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The School Escapists – How Suffering Students Escaped an Evil Institution\"></iframe>", "author_name": "TheSamiG", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/qpzQGpfwmR4/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@TheSamiG"}}, "score": 0, "upvote_ratio": 0.32, "comment_count": 2, "over_18": false}, "87": {"id": "17dp5nb", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Achaeminuz", "link_flair_text": null, "time": 1698460584.0524662, "created_utc": 1697965655.0, "url": "https://i.redd.it/0utce4inzpvb1.jpg", "title": "(OC - reupload) Got this pic a few years ago in an abandoned house and found this surprise.", "permalink": "/r/Ghosts/comments/17dp5nb/oc_reupload_got_this_pic_a_few_years_ago_in_an/", "selftext": "", "media": null, "score": 1492, "upvote_ratio": 0.95, "comment_count": 387, "over_18": false}, "88": {"id": "17e4lnf", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "dreifussbees", "link_flair_text": "Glitch Vid", "time": 1698460584.3503177, "created_utc": 1698012131.0, "url": "https://v.redd.it/gqt29xvsttvb1", "title": "This creepy picture that comes up after trying to put on any YouTube video…? Error message 30 seconds later ", "permalink": "/r/GlitchInTheMatrix/comments/17e4lnf/this_creepy_picture_that_comes_up_after_trying_to/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/gqt29xvsttvb1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1202, "width": 720, "scrubber_media_url": "https://v.redd.it/gqt29xvsttvb1/DASH_96.mp4", "dash_url": "https://v.redd.it/gqt29xvsttvb1/DASHPlaylist.mpd?a=1701052584%2CZWY0NzdmMzc4ZTRiYjYzY2U0NTg3NzA4MjRlNmM4ZDdhMTA0NDUwOWUwZGNjYjliMDk3Y2MwNmRiYmI2ZjM2OQ%3D%3D&v=1&f=sd", "duration": 17, "hls_url": "https://v.redd.it/gqt29xvsttvb1/HLSPlaylist.m3u8?a=1701052584%2CMjlkMmYwNDBhOGZmYzIyNTgzZjEwMDhjZDZkNjQxNzliZjE0NWUyN2NhMDQwNjAzNzkzN2I0NmRhN2E4ZjRkZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 35, "upvote_ratio": 0.75, "comment_count": 8, "over_18": false}, "89": {"id": "17dr1ld", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Razeal_102", "link_flair_text": "encounter story", "time": 1698460585.0120533, "created_utc": 1697973601.0, "url": "https://www.reddit.com/r/bigfoot/comments/17dr1ld/the_face_of_a_gugwe_aka_the_faceeater_sasquatch/", "title": "The face of a Gugwe, a.k.a. The Face-eater Sasquatch.", "permalink": "/r/bigfoot/comments/17dr1ld/the_face_of_a_gugwe_aka_the_faceeater_sasquatch/", "selftext": "I’m posting my two encounters with what can only be the Gugwe Sasquatch. I am an Algonquin / Cree First Nations man, and this happened when I was about 35 or 36 yrs old. I’ve been hunting since I was a child and I know every animal in my region.  This absolutely could not be a misidentification on my part.  I’ve been hunting all my life and I can identify all animals here.  For a mental picture and some reference, you can look at the picture of a Wendigo from World Bigfoot Radio.  I don’t endorse that YT channel, nor have I told any platform other than Reddit.   The following two encounters which I experienced in two subsequent years, in the exact same location, and is as follows.  \nEncounter #1:  I was out solo hunting for moose in the fall.  I parked my truck at a gravel pit, and walked 1.5-2kms to a nearby lake at approximately 2-3pm.  On my way to the lake, I came across a very large pile of trees that was blocking the path.   Looking back and reflecting, this should have been a very clear warning something was amiss, but please remember, I did not believe in Sasquatch at this point in time.  By this time, I had spotted a bull moose in the lake and that’s what I was focussed on.  I noticed the bull was eating plants from the bottom of the lake.  I can’t recall the name of the plant the moose eat off the bottom of the lake, but I know it visually, and it’s supposed to be super nutritious for them. I was able to see the moose clearly as the game trail goes down from the pit to the lake below.  Anyways, I sling my 30.06 semi-auto rifle over my shoulder and begin crawling over the fallen trees.  The pile of green fresh trees were very sappy, and was piled about 10 feet high.  I didn’t go around because the sides were really thick underbrush, and I would’ve gotten tangled in it.  So I climb over it, at the apex of the pile I notice a square hole about 1-1.5 feet wide.  I thought, hmmm, that’s weird and went over to it and looked down in the hole.  Now I’m looking down and I see a head, I think wtf.  I look closer, and then i clearly see a greyish black face staring at me, there it is, its lip curled up and it’s showing me these yellow-stained teeth much like a shark.  I’m thinking that can’t be real, no way this is real.  I close my eyes a second and give my head a shake and look again.  This thing is still there almost grinning.   Well that scared the absolute crap out of me.  I stand up, unsling my rifle and throw it to the bottom of the pile.  I take a few steps and jump down beside the rifle.  Then I hear it, “Ouuu-wah.”  Ouuu-wah.  The tree pile begins to move, I picked up my gun ( a gift from our Chief on my birthday), and run for my truck.  All the way up the hill I hear this thing matching my steps, step for step.  While this is happening, I hear many strange vocals and trees being snapped.  I was too scared to look back, I kid you not.  Off in the distance, behind me and this thing, I hear even more trees being broken.  I finally get to my truck, hop in and drive home pretty much on auto-pilot in record time, all the while watching my side and rear view mirrors.  To be clear, I did not see its body.  THAT didn’t happen until encounter number 2, the following year. Man, oh man, let me tell you, the second time in the same spot was even scarier!  I went back the following year thinking no way do i see a Sabe twice, especially in the same area.  As luck or fate would have it, yes, you guessed it, I saw it again face to face in broad daylight on a game trail.  ** I will have to put the second, better encounter down on a separate post, as I’ve got to get to work.  But the 2nd time, I got a full view of its head and body.  So:  ‘to be continued.’", "media": null, "score": 196, "upvote_ratio": 0.92, "comment_count": 80, "over_18": false}, "90": {"id": "17egx03", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "MrGoldenEra", "link_flair_text": "Discussion ", "time": 1698460585.5040176, "created_utc": 1698055899.0, "url": "https://i.redd.it/vpgo5nuzfxvb1.jpg", "title": "The Nandi Bear of East Africa", "permalink": "/r/Cryptozoology/comments/17egx03/the_nandi_bear_of_east_africa/", "selftext": "One of the lesser known cryptids that always peaked my interest is none more than the Nandi Bear located just west of Africa near the highlands of Kenya. \nAlso known as the Chemosit by the locals, the Nandi Bear was first reported back in 1910 by journalist C.W. Hobbley in The Journal of the East Africa and Uganda Natural History Society.\nHobbley described the beast as follows “Low to the ground, long hair, heavy set”. \nDutch travelers at the time who had been in Kenya also seen the beast with their track dogs. They had said the subject in question was low to the ground, heavy set like a bear, long hair like a mane and  emitted a “peculiar moaning cry” then ran into the brush before they had gotten a shot off. \nTo this day the Nandi Bear has yet to be officially catalogued in the wildlife database. From my research I believe that it could be a potential descendant or even surviving isolated species of Dinopithecus or Pachycrocuta. Dinopithecus were a genus of large primates similar to baboons that had lived in South Africa and Ethiopia during the Pilocene and Pleistocene epoch. Pachycrocuta are a genus of giant hyenas that dominated the Miocene era about 0.5 million years ago, they looked like todays hyenas however much larger in size and with a shorter snout. \nJust from the reports and descriptions of the creature alone is eerily similar to the traits of Dinopithecus. \nWhat do you guys think? Have you heard of the Nandi Bear before? What other cryptids/unknown species in Africa are you interested in?", "media": null, "score": 113, "upvote_ratio": 0.94, "comment_count": 25, "over_18": false}, "91": {"id": "17gm6z1", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Codega-DreamWalker", "link_flair_text": null, "time": 1698460586.6521268, "created_utc": 1698287481.0, "url": "https://www.reddit.com/r/cryptids/comments/17gm6z1/which_cryptid_drew_you_into_this_world_of_high/", "title": "Which Cryptid drew you into this world of high strangeness? And why?", "permalink": "/r/cryptids/comments/17gm6z1/which_cryptid_drew_you_into_this_world_of_high/", "selftext": "Ever since I was a kid I was always intrigued by Nessie, AKA The Loch Ness Monster.  I could not get enough information on it, and I just wanted to know more and more.  I remember watching a terrible movie in the 80s called \"The Quest\" where they were searching for a creature in the lake, it ended up being a crane, but it left off still not being sure.....   But back to the story I have been into Nessie, but now it's Bigfoot, and Dogman.", "media": null, "score": 28, "upvote_ratio": 0.95, "comment_count": 41, "over_18": false}}}