{"_default": {"1": {"id": "1cpnz4p", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Awstun_", "link_flair_text": null, "time": 1715649662.840891, "created_utc": 1715452414.0, "url": "https://i.redd.it/gz6rs9prcuzc1.jpeg", "title": "Brandon Fugal gave a confidential briefing to the SSCI in 2018. His paralegal discreetly took this photo. But wasn’t discreet enough apparently.", "permalink": "/r/ufo/comments/1cpnz4p/brandon_fugal_gave_a_confidential_briefing_to_the/", "selftext": "", "media": null, "score": 438, "upvote_ratio": 0.97, "comment_count": 112, "over_18": false}, "2": {"id": "1cqcnxt", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "AltKeyblade", "link_flair_text": "Video", "time": 1715649664.1791148, "created_utc": 1715533803.0, "url": "https://v.redd.it/4wt5ksfr210d1", "title": "Video evidence of a real UAP cloaking itself and only visible through infared (FLIR).", "permalink": "/r/UFOs/comments/1cqcnxt/video_evidence_of_a_real_uap_cloaking_itself_and/", "selftext": "\"Videos taken with multiple government forward-looking infared systems (FLIRs). This video compilation shows a comparison of normal objects seen in the air and the UFO seen in Jacksonville, Florida on 12-8-2016. In the beginning of the UFO video, I am centering it in to the reticle.\"\nJax UFO\nSource: https://youtu.be/iLj6xuRUoAs?si=CPGDcfxG49ngsA02", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/4wt5ksfr210d1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 640, "scrubber_media_url": "https://v.redd.it/4wt5ksfr210d1/DASH_96.mp4", "dash_url": "https://v.redd.it/4wt5ksfr210d1/DASHPlaylist.mpd?a=1718241663%2CNWY3ZDhlYmU3ODVhOTI4ODI5NWRlM2ZjN2M2ZDUwOWYzZGU1NmUzZmQ4Y2E1ODJkYjE0MmUwNmQxYzdkMjY2NQ%3D%3D&v=1&f=sd", "duration": 176, "hls_url": "https://v.redd.it/4wt5ksfr210d1/HLSPlaylist.m3u8?a=1718241663%2COTMwYmNmNDZhZDhkOGUyOTVlMDQ1NTI4MjQxZGY5NzBhZGQ0YmU2YjJjOWExNGIyNTBmZjdhZjRjMzViMmRhOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 5454, "upvote_ratio": 0.86, "comment_count": 534, "over_18": false}, "3": {"id": "1coq7k0", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "anty328", "link_flair_text": "Discussion :table:", "time": 1715649665.6529372, "created_utc": 1715349510.0, "url": "https://i.redd.it/ntbc50wrulzc1.jpeg", "title": "Why do the Greys look like that?", "permalink": "/r/aliens/comments/1coq7k0/why_do_the_greys_look_like_that/", "selftext": "There are many theories about the Greys and their origins so I wanted to hear everyone’s theories on their reasons for their physical appearance. \nWhy the grey skin and big eyes? \nAre they genetically augmented beings? \nAre they the inevitable evolution of all bipedal creatures? \nAre they demons from another dimension here to harvest strawberry ice cream? 🍦", "media": null, "score": 3643, "upvote_ratio": 0.86, "comment_count": 1137, "over_18": false}, "4": {"id": "1cmdtlv", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Few-Try-2056", "link_flair_text": null, "time": 1715649665.9128013, "created_utc": 1715093624.0, "url": "https://www.reddit.com/r/UAP/comments/1cmdtlv/astronaut_tim_peake_says_alien_life_definitely/", "title": "Astronaut Tim Peake says alien life definitely exists", "permalink": "/r/UAP/comments/1cmdtlv/astronaut_tim_peake_says_alien_life_definitely/", "selftext": "\"Absolutely, there is alien life out there.\" The British astronaut is certain that we are not alone, both in relation to microbial life and intelligent beings, and predicts that the discovery of extraterrestrial bacterial life will be made within five years..  \nhttps://www.ovniologia.com.br/2024/05/o-astronauta-tim-peake-afirma-que-com-certeza-existe-vida-alienigena.html?m=1", "media": null, "score": 139, "upvote_ratio": 0.95, "comment_count": 15, "over_18": false}, "5": {"id": "1cmm1qw", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "TheForce122", "link_flair_text": null, "time": 1715649666.9270213, "created_utc": 1715114375.0, "url": "https://i.redd.it/jld711ulf2zc1.jpeg", "title": "who cares dat was like 4 years ago amirite ", "permalink": "/r/conspiracy/comments/1cmm1qw/who_cares_dat_was_like_4_years_ago_amirite/", "selftext": "", "media": null, "score": 2782, "upvote_ratio": 0.79, "comment_count": 346, "over_18": false}, "6": {"id": "1coyprq", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Novel_Finger2370", "link_flair_text": null, "time": 1715649667.1242206, "created_utc": 1715371409.0, "url": "https://i.redd.it/8i1juv3n7fzc1.jpeg", "title": "100% Unconstitutional.", "permalink": "/r/conspiracyfact/comments/1coyprq/100_unconstitutional/", "selftext": "", "media": null, "score": 11, "upvote_ratio": 0.92, "comment_count": 5, "over_18": false}, "7": {"id": "1co5a3k", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "garyt1957", "link_flair_text": "facebook", "time": 1715649667.6927316, "created_utc": 1715281920.0, "url": "https://i.redd.it/0xyhj0nr9gzc1.jpeg", "title": "Bigfoot hand chewed by Cougar?", "permalink": "/r/bigfoot/comments/1co5a3k/bigfoot_hand_chewed_by_cougar/", "selftext": "", "media": null, "score": 599, "upvote_ratio": 0.93, "comment_count": 164, "over_18": false}, "8": {"id": "1cmmi7z", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "obscuresignal", "link_flair_text": "Meme", "time": 1715649668.2433715, "created_utc": 1715115488.0, "url": "https://i.redd.it/wf08w6vwi2zc1.png", "title": "PSA", "permalink": "/r/Cryptozoology/comments/1cmmi7z/psa/", "selftext": "", "media": null, "score": 565, "upvote_ratio": 0.92, "comment_count": 87, "over_18": false}, "9": {"id": "1cmb6pv", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "emilos260", "link_flair_text": "Strange", "time": 1715649668.4930685, "created_utc": 1715086367.0, "url": "https://i.redd.it/ecvhmq9540zc1.jpeg", "title": "Hooded figures seen inside a transparent UFO, Valdessus, Jura, France. June 20, 1986. (full story in the comments)", "permalink": "/r/Humanoidencounters/comments/1cmb6pv/hooded_figures_seen_inside_a_transparent_ufo/", "selftext": "", "media": null, "score": 156, "upvote_ratio": 0.97, "comment_count": 18, "over_18": false}, "10": {"id": "1cmwt8c", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Vivid-Marionberry577", "link_flair_text": null, "time": 1715649668.7327256, "created_utc": 1715145588.0, "url": "https://i.redd.it/flbo7tcd05zc1.jpeg", "title": "Needs a name", "permalink": "/r/cryptids/comments/1cmwt8c/needs_a_name/", "selftext": "", "media": null, "score": 297, "upvote_ratio": 0.99, "comment_count": 147, "over_18": false}, "11": {"id": "1cq23sv", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "LongjumpingUsual1587", "link_flair_text": null, "time": 1715649668.867802, "created_utc": 1715498031.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1cq23sv/strange_activity_at_abandoned_train_station_in_as/", "title": "Strange activity at abandoned train station in As, Belgium.", "permalink": "/r/Thetruthishere/comments/1cq23sv/strange_activity_at_abandoned_train_station_in_as/", "selftext": "Tonight, 23th of March 2024, accompanied by a close friend, we drove to Belgium for a bit of exploration. We stumbled upon the abandoned station in As online, where trains still linger. Upon arriving at the location, something immediately caught our attention: noises emanating from the premises. Initially, we presumed it to be a distant rock concert, given the thuds we first heard. However, upon scaling the fence, we realized the source was much closer than anticipated. Behind the trains stood a warehouse, shrouded in darkness; this is where the sound originated. What initially resembled rock music now took on a much darker tone. I struggle to describe the sound other than likening it to the eerie sound effects from a horror film. It ceased being music; rather, it became a kind of profoundly dark ambient noise, evoking a sense of malevolence. Keep in mind, this was around 10:00 PM on a Saturday night—an odd time for activity at an abandoned station. \nUpon our arrival, we observed people walking within one of the trains. We crouched down and observed until they exited the train, then proceeded directly to the warehouse, wielding flashlights in the darkness. Intrigued, we decided to investigate further, approaching the train from which they emerged, on the right side facing from the forest. This afforded us our first clear view of the warehouse. All was dark; no windows were visible, but a faint glimmer of light emanated from beneath the large sliding door. The prolonged duration of the noises only heightened the tension. Approximately 40 minutes were spent at this location. Suddenly, we noticed the flashlights approaching our direction coming from the traintracks. We hastily retreated, watching from a safe distance as they returned to the train, this time remaining outside. They were just looking around. As if they might have heard us. I am positive they have not seen us this night. After a brief interval, they departed once more, captured on film.\nFeeling thoroughly unnerved by the unsettling sounds resonating in the darkness of the abandoned station, adjacent to the forest, my friend and I resolved to investigate once more. Proceeding cautiously, we positioned ourselves beside the warehouse, where the sound became distinctly clearer. Intermittently, we heard loud thuds, reminiscent of heavy metal colliding. There still was this dark eerie sound constantly changing tones and frequency. However, the last sound I heard defies description—I have it recorded on film. The last clip, entirely shrouded in darkness, captures this moment. When filming we were standing right next to the warehouse. It sounded akin to the startup sequence of a powerful weapon or the ignition of a jet engine. This peculiar sound was followed by a resounding thud. Pausing briefly, we then observed the return of the flashlights. This time, we sprinted back to our cars, bewildered by the experience. After a brief discussion, we decided to make one final attempt.\nApproaching the premises again, we immediately noticed the absence of sound. Proceeding with utmost caution, we arrived at the warehouse to find the faint glimmer of light beneath the sliding door had vanished. Venturing to the opposite side of the warehouse, however, we found nothing. We walked around the warehouse. There was no road or path to walk on. Just dirt, mud and train tracks. At this moment we decided to leave, and when we were back at the car we started thinking what could this have been?\nThe individuals we saw walking were wearing blue overalls, indicating that they were not merely urban explorers casually observing. It is highly unlikely that these individuals were working on a Saturday evening in the dark. Had there been ordinary music playing, I would not have harbored any peculiar thoughts about this experience, but the sounds and the concealed location have prompted me to make this post. Is there anyone who can explain any of these sounds? Are there machines producing these sounds of which I am unaware? I must ascertain this before considering a return. I have footage of all the sounds, and the guys walking around the tracks. \nSadly I can’t upload images or video on this subreddit. I will be posting this post on another subreddit also, where they allow me to post video. It will have the same title as this one. I decided to post it here anyways because maybe someone might have a clue.\nEdit: I forgot to mention, but there was a small building about 500-750 meters from the warehouse. There were 2 ladies cleaning dishes. We asked them what those sounds were coming from the train tracks. They told us they didn’t know what sounds we where talking about. When we asked if they know if there is people working there, they told us there are no people working there. We asked them if it is okay if we walked over the tracks to take a look, and they told us it is dangerous to go there.", "media": null, "score": 55, "upvote_ratio": 0.94, "comment_count": 33, "over_18": false}, "12": {"id": "1cr7nj0", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Dangerous_Party_7554", "link_flair_text": null, "time": 1715649669.1231909, "created_utc": 1715627607.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1cr7nj0/i_dodged_being_murdered_by_my_psychotic_roommate/", "title": "I dodged being murdered by my psychotic roommate just by a hair, with real news articles", "permalink": "/r/LetsNotMeet/comments/1cr7nj0/i_dodged_being_murdered_by_my_psychotic_roommate/", "selftext": "I'm a 36 year old female in Sweden.\nI have worked in mental health care for the last 18 years, mainly with people with psychotic illnesses like schizophrenia. I was working at a group home for 9 years and were very close with my coworkers there, especially two females. The last few years I worked there, another female started working there, Lets call her M, and the four of us grew very close. She was very timid, shy, friendly and we got along well. She was however often on long term sick leave because of her own mental health issues so we didn't meet much at work, but she always showed up at our after work dinners so we continued to stay in touch even when she wasn't well enough to work full time. She told us that she had a history of schizophrenia herself, just like the patiens we were treating, but that she was medicated and hadn't had any psychotic episodes for years.\nSince I have an education in psychiatry and a long experience with schizophrenia, I have no judgment towards people suffering from the illness, and it didn't bother me being friends with someone who had a diagnosis like that. (And even after what I will tell you, I still feel the same way).\nIn the summer of 2023 I had moved on to work at a new place, also within mental health but this time forensic psychiatry, like a halfway house for mentally ill murderers etc.  The four of us stayed in touch and still met every now and then for dinner parties. M told us that she had been evicted from her apartment because of an incident where she had accidently entered her neighbors apartment in the middle of the night. She told us that in the huge apartment complex the doors all look exactly the same, and that she simply walked in the wrong door by accident, and that the neighbors had created a scene out of pure drama and reported her to the police.\nI somehow felt that while that sounded out of proportion to evict someone just from that, perhaps the landlord took that kind of action because he judged her based on her medical history and I felt bad for her. I questioned her if something else happened and she claimed that it didn't and that this was the full story.\nIn Sweden, it's very difficult to get a contract for an apartment when you have gotten evicted. You pretty much get blacklisted.\nM asked me if she could move in with me. Since she was literally on the street, literally homeless, I said \"of course you can\". I've always gotten myself into uncomfortable situations by saying yes instead of thinking about myself, and I had no idea how severe this situation would get when I said yes to M.\nI live in a pretty small apartment. It's one bedroom that pretty much only fits a bed and a desk, a livingroom that fits a couch and a tv (no room for an extra bed), a small kitchen and a small bathroom. I have two cats.\nWe decided that M was going to live in the living room and I offered her to throw my couch out so she could have a bed there, but she said that she was fine with sleeping on the couch since it's comfortable enough. I insisted on giving her a bed but she declined.\nThere's a door between the livingroom and bedroom, but between the livingroom and hallway there's just an open valve so she wouldn't have total privacy. I hung up a thick velvet curtain covering the valve  so it at least gave her the sense of a door and more privacy than nothing.\nThere's another door from my bedroom to my kitchen. So I have two doors to my bedroom. I have to have one of them open at night since my cats wants to go in and out, and they also have their litter boxes in the bathroom, and food & water in the kitchen. I naturally kept the kitchen door open and not the livingroom door, since that's where M lived and we wanted to keep our privacy somehow.\nShe wasn't working at this time because she was on one of her long term sick leaves, while I was working shifts, so sometimes I had to get up at 6 am, and sometimes I didnt get home til like 11 pm. I have really severe insomnia and need to combine Zolpidem (Ambien/Stilnoct) with Lergigan (Prometazin), and even with this I still wake up easily. I told her that I would appreciate if she could try to stay quiet those nights when I have to get up at 6 am, but that it's fine if she's loud when I'm off work or when I do the evening shifts.\nShe was a heavy smoker and a coffee drinker so I bought her a coffee machine (yeah I know, I'm a weirdo who don't drink coffee very often so I didn't have one) to make her enjoy her living situation more.\nThe coffee machine and the sink is placed right outside my bedroom door, the kitchen is very small.\nSo the first night together, I had to get up at 6 for my shift. As usual I had a hard time falling asleep. M had been up several times that night to go out to smoke and I woke up every time. At 5 am she started making coffee and since it's literally outside my bedroom door I got wide awake from the sounds of it.\nI asked her in the nicest way possible why she was up this early, asking if she had any plans today (I mean she's on sick leave, why not sleep at 5 am if you can) and she just said that she couldnt sleep. I said aww Im sorry, I would just appreciate if you could wait with making the coffee til 6 am since I really need this last hour of sleep cause of work.\nAdding to why I need my sleep is that I have epilepsy that gets really bad when I don't get enough sleep. I usually get a LOT of seizures when I don't get at least 4 hours of sleep. I knew  that I would probably get seizures at work now, meaning that this day would be both stressful and potentially dangerous for me since there's a huge risk that I fall and hurt myself (and it's not a good thing to get cramps and seizures among mentally unstable criminal clients who you are supposed to care for). (I know that it's not an ideal situation to work in that field with my condition and I can inform you all that I did quit after only 6 months)\nShe said that she really wanted coffee with her cigarettes but that she would try to wait the next time I have to work.\nI accepted it and went on with my day, but things didn't get better. She continued to wake me up early in the morning and through the nights, and continued to promise to stop but insisted that she really wanted coffee with her cigarettes. I suggested making the coffee the night before, or drinking iced coffee or Coke instead, but she didn't want that.\nI may add that she demanded for me to be silent at 10 pm cause that's when she wanted to sleep, and I respected that.\nShe used to get these moments of binge eating where she would empty my fridge and pantry from everything I had. I remember this one time when I had bought a big loaf of bread, and she texted me 30 minutes after I left the apartment saying \"Hey Im sorry I ate your loaf of bread, I will buy it back once I get money\". Like an entire loaf of bread in 30 minutes. I had told her when she moved in to feel at home and whats mine is yours, so I couldn't really get mad but it started to annoy me for two reasons; it was getting kind of expensive since it was such huge amounts, and it was always in inconvenient times of the day (like after an evening shift when the store was closed, and I came home hungry and she had emptied the kitchen from everything I had bought the same day).\nM had long, black hair that was EVERYWHERE. All over the sink, the floor, the bath tub. I'm no cleanfreak but I think anyone could understand that this isn't the nicest thing to step in or see everywhere in your house, She also left her fingernails and toe nails on the bathroom floor. It was also pee drops on the toilet seat every time she had been to the toilet.\nI saw a silverfish on my bathroom floor (never ever seen one before), and they eat hair and skin and nails, so I figured this fella probably enjoyed life because of the new dirty condition my bahtroom was in.\nAt first I didn't wanna say it straigh out cause I thought it would hurt her and I didn't wanna make her uncomfortable,, so I just put a broom and shovel in the bathroom to imply that we needed to sweep the floor more often. This didn't seem to work so after a while I told her in the nicest way possible with a smile on my face \"do you think we could try to clean the floor in the bathroom more often? We tend to lose some hair when we brush it and I'm afraid we may get pests, I saw a silverfish the other day and I don't want it to get worse\". I always made sure to say \"we\" instead of \"you\" so she wouldn't feel attacked.\nShe promised to think about it but nothing changed.\nI started dating a guy and was head over heels for him. He was also in a roommate situation so we had a tough time getting any alone time. I asked M if there's any chance that we could get ONE night to ourselves every now and then in the apartment, and that she of course would get the apartment to herself aswell. She didn't like the idea and claimed that she had nowhere to go, no friends or family. Now I wasn't asking her to leave for 24 hours, just a few hours so we could just get some quality time together. She could just go to the library or take a walk or whatever. I was at work for 8-10 hours 5 days a week so she got a lot herself.\nOne of our old coworkers realized that this was really tearing at my mood, to never get any time for myself, and I started feeling really suffocated. She offered that M could stay the night at her place. After all they were friends too. M said she didn't want to \"bother her\" but we told her that she didn't, they're friends, she's more than welcome, and I really just want one night to myself and my guy. I didn't understand why she made such a big deal over leaving me and the apartment for just one night. She eventually accepted and spent the night there, and I spent the night away the next week so she could get more alone time too.\nWhen I came home the next morning from my night away I saw that my cats water bowl was completely dried out. There was no spill on the floor, and it looked like it had been whiped out with a towel or paper. I had filled it to the brim just the night before. I asked her how this was possible and she said that the cats must have tipped it out, but there was nothing on the floor like I said.\nMy cats are overly social and usually cuddle up with strangers after just a few minutes. I noticed that the cats withdrew from her more and more over time, and the last couple of weeks they never left my bedroom except from when they ate or used the litterbox. It seemed like they were scared of her which I couldn't figure out since she was so timid.\nI had this old saucepan from the 60s that meant a lot to me. You probably wonder how a saucepan can mean a lot to someone, but it was my grandmothers and it's the only thing I have that belongs to her. My mother used to cook for me with it when I was little so it has a great nostalgic value to me.\nShe burnt it one day and made no attempt to clean it, she just left it on the stove and went out to smoke. I found it ruined and cried. She didn't even say I'm sorry. She also broke dishes several times and didn't bother to replace them or apologize. This added to my frustration with her naturally.\nIt had been probably gone 2 months now and she kept waking me up at night, kept binge eating my food, never cleaned, never left the house, scared my cats and ruined my things.\nI realized she stole my prescripted sleeping pills. Lots of them aswell. And I only get 1 per night, not more or less. And as you already know I really need them.  I had 20 of them in nightstand when I left for work, and when I came home they were gone. She denied which is pretty hilarious since no one else could have been there.\nMy frustration was getting heavy. The summer heat was strong and I felt locked up in my tiny bedroom with my two cats, never getting any time to myself, never any alone time with the guy I was dating except for once every 14th day, my apartment was messy and she was stealing from me etc.\nOut of nowhere my old elementary school classmate texted me on Facebook asking me how i know M. He had seen that I had posted on facebook that we were roommates now.  I told him that we were old coworkers and that she needed a place to stay cause she got a evicted.\nHe said \"I know. Do you know why she was evicted?\"\n\"Yeah she accidently went into her neighbors apartment\"\nHe said\n\"That's not the full story. She broke in, and snuck up to their sleeping baby with a knife in her hand, but luckily the father woke up and wrestled her down and managed to save the  baby\".\nI felt sick to my stomach. Could this be true? It would certainly explaind why she was evicted, but it just sounded so horrible and she is such a timid, nice girl, I had so many questions. But my friend had the full police report, apparently the couple that M had broken into was his ex girlfriend and her family. It seemed that M had a psychosis during the break-in, but those parts weren't public. It was however clear to me that she had been lying to me about what had happened, and about how long she had been mentally stable.\nI started getting quite paranoid now, and I was already frustrated with everything, and really wanted her to move out. We did however have a contract that she had 30 days notice.\nI knew that if I asked her in a harsh way it would mean 30 days of chaos until she moves out, so I wanted to handle this as nicely as I could. I started looking for cheap hostels for her that I could suggest to her so she wouldn't be on the streets. I sat down with her and told her that I loved living with her and I feel really horrible for this, but I just miss my alone time and that the apartment is too small for two people. I said it wasn't personal, and that I wouldn't wanna live with anyone right now and that I wished it would have worked out and that I am really sorry and hope we will remain friends.\nShe looked crushed and said that it wasn't possible. I showed her the hostel I found and said that I understood that it wasn't the ultimate situation but I really needed her to move out cause I felt suffocated and also the summer heat was making it tough to always have the door to the bedroom closed, and that it was tough for me to not get my sleep etc.\nShe said okay, she was gonna try to move out but not until 30 days had passed and I said of course.\nThe first night after our talk she got up and made her coffee at 2:30 am. I nearly had a mental breakdown. I was gonna get up at 6 and couldnt go back to sleep.\nI asked her in the morning for probably the 10th time to not make coffee til I get up, but she didn't even answer me. She just sat in the sofa and stared out the window. I said \"M?\" and she kept staring. I was freaked out but left for work.\nShe kept being weird, kept making a mess, kept waking me up, kept eating my food. And all I could think about was the incident with her and the baby and the knife.\nI eventually got so pissed off about being woken up by the coffee maker, so I plugged it out and stored it in my attic which she had no access to. It may be childish but I was getting so tired at this moment. My sleeping pills were stolen and I was starting to feel like Edward Norton in the beginning of Fight Club.\nWell the next night I woke up at 4 am by her making coffee in a saucepan (not my grandmothers saucepan, that one was ruined). I tried talking to her again, explaining the situation, but she just stared and didn't reply. Me being frustrated and on the tipping point took the saucepan and stored it in the attic aswell. I know I know, but I was going crazy and just wanted her to stop with these nightly coffee-routines and get the hint!\nThe third night, I had the guy I was dating sleeping at our place cause I was getting really paranoid now over her weird behaviour (not speaking with me, just staring into space). I woke up from my very light snooze by him poking me. He whispered \"look\". In the doorway, M was just standing silently, staring at us. This was like a scene from a horror movie with her long black hair over her face, I kid you not. I didn't say anything at first cause I wanted to know if she just stood there for a second doing something by the door, but I realized after a while that she was actually just standing still staring at us. It reminded me of the ending of Paranormal Activity when Katie just stares at Micah in the final scene.\nSo I sat up and said \"What are you doing?!\", but before I could finished the sentence she just slammed the door shut and I heard the sound of something metal falling on the floor and her running into the living room.\nI yelled out \"You need to LEAVE!\" and started crying hysterically because this was turning into a fucking nightmare.\nOf course I didn't go back to sleep, and I was really happy that I had company that night. I just kept asking myself: Had she done this before? Stared at me in my sleep?\nThe next day when I got out of bed, I opened the door that she had slammed shut and saw a kitchen knife on the floor. So that was the metal sound I had heard before she ran off. I took all my knives and locked in the attic aswell.\nI then asked a friend of mine to come to my house and be here when I tell her that she has to move out immediately, that I can't wait 30 days (27 days).\nDuring the conversation I really tried to stay calm. I know she has a mental illness, I know she means no harm, even though I was so frustrated I couldn't hate her, I was mostly scared and tired. She however didn't even answer when I talked to her, she just kept staring out the window. She left the apartment and sent me a text instead saying that I was disrespectful for bringing a friend over to HER place.\nNight time came and I thought this would be a quiet night finally, no coffee maker or saucepans. But at 3 am I woke up by her burning dry coffee powder in a frying pan. At this moment I just felt terrified of her. Her face was dead, her eyes were black. I suspected that she had gone into a psychosis. I stopped the fire and she just ran off to the living room in silence.\nI knew she had an appointment with her psychiatrist the next day and while she was away I packed all her things. I then sent her a text telling her that she needs to pick them up and give me my keys back, and that I will give her money for a hostel the upcoming 26 days.\nShe didn't reply.\nThe guy I was seeing came to keep me company in case she would fight about it. She didn't. She left the keys without looking at us, and left.\nOur coworkers who were friends with us both told me that she moved in with a guy that she was dating, and she stayed there for a few weeks til she somehow amazingly got an apartment of her own.\nShe started working again and I was really happy to hear this. She seemed to do well. Then in January of this year, one of our old coworkers told me that M had called her and told her that everything must burn, that she has a baby that she must save, and other dellusional stuff. She had called 112 (Swedish emergency number, like 911) about this but they hadn't taken it seriously.\nM had then proceeded to burn her entire apartment down cause the voices in her head was telling her that she has to burn everything to save her friends and family.\nHer neighbors had tried to rescue her from the fire but she had fought them off and ran back in and poured liquor on the fire to make it burn more.\nShe was arrested and sentenced last week for aggravated arson.\nhttps://lokalpressen.eu/lerum/grov-mordbrand-i-floda\nShe will serve her time in a mental institution/prison for a long time, possibly forever. What's ironic is that she will probably be in the facility where I used to work, and end up where she used to work herself.\nMy old coworker was a witness at the trial and apparently she had stopped taken her medication (Abilify) because she thought that it made her feel numb, and she thought she was stable enough to function without it. Apparently not.\nShe had also stopped taking her medication the last few weeks when she stayed at my house. So when she stared blankly into space, she was going into psychosis. When she stared at me with the knife in her hand. When she burnet the frying pan that last night.\nIt's disturbing to think about what would have happened to me and my cats if she would have stayed, or if I would have been a heavy sleeper. I also think about what would have happened to that baby that she snuck into before she was evicted.\nAnd yeah, I know it's crazy that I didn't just throw her out by then. It was complicated.\nThe reason why I haven't been able to talk about it with my friends is cause they sympathize with her and have minimized my experience, and they think that I make a bigger deal out if it than I believe it has been. I sort of understand it since they have never seen that darkness in her eyes that I saw those last couple of days.", "media": null, "score": 220, "upvote_ratio": 0.98, "comment_count": 18, "over_18": true}, "13": {"id": "1cnxx0u", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "antoni_coin", "link_flair_text": null, "time": 1715649669.3636491, "created_utc": 1715263010.0, "url": "https://www.reddit.com/r/threekings/comments/1cnxx0u/pool_game/", "title": "Pool Game", "permalink": "/r/threekings/comments/1cnxx0u/pool_game/", "selftext": "This game was played by me and it is not that funny and laughing so after all. As always, Play at your own risk\nRequirements\nA living room.\nA Mirror.\nA Plush. ( The one that was left out and you didnt want it)\nA small kiddy pool, so it can fit in the room.\nA TV.\nA blanket.\nA red bath bomb, or a red sauce.\nPhone in your hiding place\nNow let's begin.\nEmpty the living room before 12:00 AM. Clean the sofa, put the tv on static mode, and make sure theres no pets or partners in the house. Now, bring the pool in the living room, and fill it with water. After doing that, put the mirror underwater and place the plush on it. Cover the pool with the blanket.\nIf it's 11:50 AM, wait 10 minutes.\nIf any other, wait longer. \nIf 12:00 AM hits, halfly open the blanket and fill the pool with red water using the sauce or the bath bomb. After it's fully red, place the blanket back and chant: \" The two, the two. I have prepared your requirements, come for a visit. \" 16 times. If you hear a slight step noise, they're here. If you dont hear anything move a bit away from the pool and do the chanting again. Now, when you hear the noise, close your eyes tightly, put your head a bit, but make sure not to make the blanket fall, on the blanket and think of your wish ( must not break laws of physics like flying, transforming and smth like that ) Do not stand up. Do not turn around. If you hear anything, stand up very slowly and quietly and hide under a table, bed, or anything safe. The two is now going to the pool to hear your words from the plush. They will see if you're worthy from the mirror's expections. And the water will grant you the wish. If they do think your worthy, take your prepared phone and watch the hour. After 02:00 AM, they will search for you. do not come out. Sleep like you normally do, but in your hiding place. Do not think about them. That will allow the two into the gate of your dreams or nightmares. When waking up, it shall be daylight. Take off the blanket, burn the plush to ashes, and break the mirror. Any weapons allowed. The water shall be gone and your wish shall be there. \nGood luck.", "media": null, "score": 5, "upvote_ratio": 0.86, "comment_count": 5, "over_18": false}, "14": {"id": "1cmteoh", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "justokatlyf", "link_flair_text": "Captured Apparition ", "time": 1715649669.9484391, "created_utc": 1715134401.0, "url": "https://i.redd.it/xpq2t4k534zc1.png", "title": "South Pittsburgh Hospital shadow man.                . ", "permalink": "/r/Ghosts/comments/1cmteoh/south_pittsburgh_hospital_shadow_man/", "selftext": "Taken in the 2nd story shadow hall where they report a 7ft tall shadow figure. \nThis was taken at the end of the night. There was 1 other guy with me and he was in front of me to the left. He had the flashlight so there is no way this shadow was either of ours.\nIf you have a chance and you happen to be in Tennessee, I highly recommend visiting this place. \nEarlier in the night I was walking down a dark hallway alone on the first floor and from the left side of me there was a doorway where I heard a hissing sound shoot out of one of the rooms moving towards me.\nIt was an incredible experience.", "media": null, "score": 466, "upvote_ratio": 0.85, "comment_count": 109, "over_18": false}, "15": {"id": "1cmip1a", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "nakupendwa", "link_flair_text": "Glitch Pic", "time": 1715649670.2801595, "created_utc": 1715106032.0, "url": "https://i.redd.it/72gssqqsq1zc1.jpeg", "title": "And what are the odds that I now have a set of each color?", "permalink": "/r/GlitchInTheMatrix/comments/1cmip1a/and_what_are_the_odds_that_i_now_have_a_set_of/", "selftext": "", "media": null, "score": 530, "upvote_ratio": 0.92, "comment_count": 70, "over_18": false}, "16": {"id": "1cqfheu", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Friend_of_a_Dream", "link_flair_text": null, "time": 1715649672.2389998, "created_utc": 1715541234.0, "url": "https://i.redd.it/cf7lcpnvo10d1.jpeg", "title": "Complete the Kirk Patrick meme.", "permalink": "/r/ufo/comments/1cqfheu/complete_the_kirk_patrick_meme/", "selftext": "", "media": null, "score": 169, "upvote_ratio": 0.93, "comment_count": 83, "over_18": false}, "17": {"id": "1cmcwda", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Gobblemegood", "link_flair_text": "Discussion", "time": 1715649673.8276682, "created_utc": 1715091186.0, "url": "https://i.redd.it/dp5d83hni0zc1.jpeg", "title": "Metallic Sphere spotted in the US", "permalink": "/r/UFOs/comments/1cmcwda/metallic_sphere_spotted_in_the_us/", "selftext": "Apologies if this has been discussed before. I have just come across it recently. Did anyone ever find out what it was? \nAccording to the eye witness…\nOn September 10th, 2014, Rick Ybarra pulled into his driveway near San Diego, CA around 6:45pm when he noticed a sphere in the sky.  A retired Department of Defense therapist who worked at Naval Base San Diego and Submarine Base Point Loma, we recently spoke to him about the sighting.  \nThe sphere had four meaningful observables, which were photographed in detail and captured on video:\nStop/start movement\nFailure to move with the wind\nMetallic appearance \nSeemingly independent moving antennae-like appendages\nIt was 4-6 feet in size and 400 feet above the ground — Ybarra states he first thought it was a balloon, but slowly moved away from the hypothesis when it failed to move with the wind, and had a distinct metallic shell reflecting the twilight to the west.  Ybarra showed the footage to colleagues in his chain of command — they had no explanation.  \nWe sifted through historical archives and found a nearly identical craft in Brazilian Air Force files from 1968.  \nDays after his 2014 sighting, Ybarra says he felt an \"urge\" to go outside early in the morning when he noticed a fast-moving, spherical object on the horizon.  \nDid anyone ever get to the bottom of this incident? ", "media": null, "score": 2355, "upvote_ratio": 0.8, "comment_count": 706, "over_18": false}, "18": {"id": "1cqfaen", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "UnableFox9396", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1715649675.3146894, "created_utc": 1715540719.0, "url": "https://i.redd.it/gc26wahcn10d1.jpeg", "title": "No wonder there are so many crashes!  (Humor)", "permalink": "/r/aliens/comments/1cqfaen/no_wonder_there_are_so_many_crashes_humor/", "selftext": "", "media": null, "score": 1008, "upvote_ratio": 0.95, "comment_count": 52, "over_18": false}, "19": {"id": "1co638r", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": null, "time": 1715649675.5495195, "created_utc": 1715283966.0, "url": "https://thehill.com/opinion/technology/4646417-top-senators-believe-the-us-secretly-recovered-ufos/", "title": "Top senators believe the US secretly recovered UFOs", "permalink": "/r/UAP/comments/1co638r/top_senators_believe_the_us_secretly_recovered/", "selftext": "", "media": null, "score": 72, "upvote_ratio": 0.9, "comment_count": 3, "over_18": false}, "20": {"id": "1co17mm", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "saiyamannnn", "link_flair_text": "Rule 10 Reminder", "time": 1715649677.3307629, "created_utc": 1715271600.0, "url": "https://i.redd.it/9brveo84ffzc1.jpeg", "title": "If you live in Canada you need to pack your bags and leave immediately", "permalink": "/r/conspiracy/comments/1co17mm/if_you_live_in_canada_you_need_to_pack_your_bags/", "selftext": "“The Trudeau regime has introduced an Orwellian new law called the Online Harms Bill C-63, which will give police the power to retroactively search the Internet for ‘hate speech’ violations and arrest offenders, even if the offence occurred before the law existed.\nThis new bill is aimed at safeguarding the masses from so-called “hate speech.”\nRevolver.news reports: The real shocker in this bill is the alarming retroactive aspect. Essentially, whatever you’ve said in the past can now be weaponized against you by today’s draconian standards. Historian Dr. Muriel Blaive has weighed in on this draconian law, labeling it outright “mad.” She points out how it literally spits in the face of all Western legal traditions, especially the one about only being punished if you infringed on a law that was valid at the time of committing a crime.”\n\n@newstart_2024 on X\n\nThoughts?", "media": null, "score": 2767, "upvote_ratio": 0.8, "comment_count": 951, "over_18": false}, "21": {"id": "1cq7mcq", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "cheriaspen", "link_flair_text": null, "time": 1715649677.5626583, "created_utc": 1715519686.0, "url": "/r/ProtectAndAlert/comments/1cq6bky/welcome_to_stop_covid_vaccines_now_we_are_filing/", "title": "Welcome to Stop Covid Vaccines NOW! We are filing a very important case for humanity, that involves a series of diplomatic and legal steps to invoke INTERNATIONAL RESPONSIBILITY of ALL “vaccine” regulators in the WHO Pre-qualification Program for their role in being involved in serious violations.", "permalink": "/r/conspiracyfact/comments/1cq7mcq/welcome_to_stop_covid_vaccines_now_we_are_filing/", "selftext": "", "media": null, "score": 7, "upvote_ratio": 0.77, "comment_count": 1, "over_18": false}, "22": {"id": "1cqg6c8", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "jfreak53", "link_flair_text": "humor", "time": 1715649678.0797935, "created_utc": 1715543065.0, "url": "https://i.redd.it/hig5ria8u10d1.jpeg", "title": "Holy Grail trifecta", "permalink": "/r/bigfoot/comments/1cqg6c8/holy_grail_trifecta/", "selftext": "", "media": null, "score": 162, "upvote_ratio": 0.94, "comment_count": 15, "over_18": false}, "23": {"id": "1cohtgw", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Junior_Government_14", "link_flair_text": "Discussion ", "time": 1715649678.5825305, "created_utc": 1715318208.0, "url": "https://v.redd.it/kjatzlqb9izc1", "title": "This is a sturgeon from British Columbia: this kind of fish can reach a length of 6 meters (20 feet) and an age of 100 years.", "permalink": "/r/Cryptozoology/comments/1cohtgw/this_is_a_sturgeon_from_british_columbia_this/", "selftext": "", "media": null, "score": 448, "upvote_ratio": 0.99, "comment_count": 57, "over_18": false}, "24": {"id": "1cqxtli", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Ufonauter", "link_flair_text": "Humanoid", "time": 1715649678.8455167, "created_utc": 1715602499.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1cqxtli/in_1986_an_italian_professor_working_for_the/", "title": "In 1986 an Italian professor working for the University of Pavia in Italy would have a face to face encounter with an unknown entity. But unlike so many other encounters, this professor was able to take 5 photos. ", "permalink": "/r/Humanoidencounters/comments/1cqxtli/in_1986_an_italian_professor_working_for_the/", "selftext": "To begin with, I will state that this post was months in the making (mostly waiting and chasing false leads) and carries with it perhaps some answers, plenty of questions, and perhaps for some, a similarity to their own experiences. Special thanks to u/Neo-Rex as well as u/ebycon for their assistance in helping me find and rule out some areas of research. \nDisclaimer: The following images and text are provided without photo manipulation on my end (besides simple cropping and scanning). There are going to be many references in this post to Italian media, magazines, as well as individual writers. This is by no means an endorsement, advertisement, or other form of ARG intended to sell, market, or persuade anyone to buy, rent, or procure any of the described materials. Because I know this is a new area of topic, and because the images provided are of an unusual nature, I will provide various sources to prove that these images are not enhanced, manipulated by hand or by a contemporary photo manipulation program or AI generation.\nBefore we get into the nitty gritty of the images I will provide background as to how I came upon these images, and the flow of information. \nI was first made aware of these images after researching separate alien encounters for a post of mine (see that post here for further details regarding that) one of the sources used was \"alieni in italia 1945-1995 50 anni di incontri ravvicinati\". On page VIII towards the back of the book these images (or rather image as three were compressed into one section) as well as the following text appears \nhttps://preview.redd.it/le5wrt3rm60d1.jpg?width=806&format=pjpg&auto=webp&s=39919dfcd089925de049eb66794003a5dab20573\n\"Vero alieno o scoop giornalistico? Ho evitato di inserire nel presente catalogo questo caso avvero singolare. Si tratte infatti di alcune foto )5_ scattate da un non meglio indentificato \"professore universitario di pavia\" nell'estate del 1986 e pubblicate da sette. il settimanale del Corriere della Sera. Si referiscono ad una presunta entita aliena che si sarebbe manifestata al professore in una situazione del tutto casuale. Non sono mancati pareri sfavorevoli expressi da parecchi ufologi. ( Foto tratte da: Sette n. 9/10 sette giorni illustrati dal Corriere della Sera, 5 marzo, 1988. \nTranslated: \"Real alien or journalistic scoop? I have avoided including in the present catalog this singular case. These are in fact some photos(5) taken by an unidentified \"university professor from Pavia\" in the summer of 1986 and published by seven. The weekly newspaper Corriere della Sera. They refer to an alleged alien entity that allegedly manifested itself to the professor in a completely random situation. There was no shortage of unfavorable opinions expressed by several ufologists. ( Photo taken from: Seven No. 9/10 seven days illustrated by Corriere della Sera, March 5, 1988. \nThat was all the information provided within. (it should be noted that although this description mentions 5 photos, there are only these 3 provided within Moreno Tambellinis book.) These images captured my attention fairly quickly as I am fairly familiar with purported alien/supernatural photographs, so to find one I have never seen, and in such a quality which is general not present within other such photos as these, was more than enough to tip my curiosity in the direction of delving deeper. \nFirst attempt at finding further information regarding these photos, and this particular magazine issue ended in little success, though I was able to find what I, at the time, believed to be a correctly colorized image of this entity. See below. \nhttps://preview.redd.it/tc06rvxum60d1.png?width=341&format=png&auto=webp&s=141ee2128cdcd0894f57f999876ff380a4def235\nUnassuming on some random blog that attributed a name to this entity while providing no further information regarding the image itself (as certain ufological circles are want to do). Not finding further information I attempted to find further information based off of this colorized image, but to no avail. Save for one source that used this image ( in a different colorized manner, slightly less yellow and oozing with potential, that being this image by Argentinian Ufologist Dante Franch. See below. \nhttps://preview.redd.it/39i2rdvxm60d1.png?width=280&format=png&auto=webp&s=14bf476ca33164db334bc4b835a52b349d66990d\nFinally, someone who might have a lead on this information! But no, once again this image is deceptively alluring as the contents of this book have absolutely nothing to do with the Sette report, but simply use its image to describe unsourced and unverified tales of the City of Erks (a wild dive on its own and may be deserving of its own post) and other entities that supposedly have a resemblance to this cover image. \nUpon further searches I came across this archived link with additional images some with closer to truth color, including the aforementioned first colorized image here https://web.archive.org/web/20080312200229/https://www.anomalia.org/perspectivas/fotosets/campo_cielo.htm as well as the additional references. The author of this blog post is Mexican Ufologist Luis Ruiz Noguez, notable for his skepticism and thorough investigation relating to this material, so it was a no-brainier to look into his research regarding this seeing as he had previously mentioned it here on his blogpost. So where better to look than his book \"Extraterrestres ante las camaras\" Volume X dealing specifically with italian encounters and purported alien photographs. But again, despite his previous notation in this blog, the contents of these images specifically are nowhere to be seen or mentioned within this book. \nResearch stagnated for some time during the search process for the original source cited in Moreno Tambellinis book. I was able after five months (you have no idea how hard it was to find a copy) able to acquire a copy of this magazine and finally was able to determine that the previously assumed white coverall of this entities outfit has been a false notion.\nThe following text is a translation of the pages within this issue of march 7th 1988 Sette: Corriere della Cera . 9/10, the original scans, as well as a translated text document of these pages can be found in the sources listed below. Important note: although these images are primary focus of this article, it does meander into thoughts on Whitley Striebers book \"Communion\" (which will be a source of contention that will be covered later in this post). But the translated post here is the relevant text to these images.   \n\"Just as we were editing a report on the UFO phenomenon that was supposed to appear on 7 at the same time as the television passage of Spielberg's film Close Encounters of the third kind, we came across a resounding surprise: the images published in these pages and on the cover of this issue. They were taken completely by chance, one summer evening in 1986, by a professor at the University of Pavia, above all suspicion and known for his balance, his intelligence and rationality, completely alien to the somewhat emphatic and vaguely bizarre world of the so-called \"contactees\": those people who say they have entered into a relationship with unknown entities from the cosmos.\"\n\"He is a completely normal person who has always been skeptical of the reports of unidentified flying objects and is now also a testimony, erroneous to the idea that his name is related to the disturbing figure captured by his camera. The university lecturer has agreed to give us what he considers to be evidence of his shocking experience in exchange for absolute confidentiality\"\n\"What to make of these images? We can make a few assumptions. \nA) The author of the photos is a mystrifier. It is unlikely: too much resistance has opposed the publication of his document (which he has yielded for free to 7). In addition, he wishes to remain anonymous. A behavior that is certainly not that of those who want to speculate on a scooop, true or presumed.\nB) The author is the victim of a game. Someone made him take \"fireflies for lanterns\". A well-thought-out game, by true professionals. It is not unlikely, even if the professor is not a \"contactee\", one obsessed with extraterrestrials, that is, a man who could arouse \"temptations\" among those who know him.\nC) The photos really document something alien. A mysterious otherness has been captured by the professor's camera, who was the first to be surprised by this tangible presence, imprinted on the film that is absolutely different from a hallucination. What to say? What are we to think of images that forcefully re-propose the problem (or the dream, or the myth, or the nightmare) of the existence of other beings, of other civilizations that populate galaxies or dimensions unknown to us? Science continues to question these facts, but an answer is still a long way off. All experiences at the \"edge of reality\" are embarrassing. The line that divides science and mystery is still vague. Prudence, in these cases, is a must. And the desire not to appear is widespread among the witnesses. The professor from Pavia, who chose restriction, has an illustrious precedent.\"\n\"These images, taken on a summer evening in 1986 by a professor at the University of Pavia, who asked to remain anonymous, are the subject of various hypotheses of interpretation in the text of the article. The reader is free to draw his own conclusions.\"\nHere are the direct scans of this entity as they appear in the magazine, scanned directly out of a physical copy of this magazine.  (do note although these images are uploaded in different order I believe they may be sorted as such, I make no claim to the accuracy of this in terms of chronological order, but which is most aesthetically appeasing.)\nhttps://preview.redd.it/tp2rqzw9n60d1.png?width=520&format=png&auto=webp&s=5bef77464608273cc1e6cc1f5b30665c5040a5c2\nhttps://preview.redd.it/vekj9dman60d1.png?width=385&format=png&auto=webp&s=ba133aa62862f89a1e361e21a93de19e9d549496\nhttps://preview.redd.it/sve90i9bn60d1.png?width=388&format=png&auto=webp&s=36e737a33624530c85e48f99d9ffd2d7db04d9f5\nhttps://preview.redd.it/03pcokzbn60d1.png?width=380&format=png&auto=webp&s=b8503bec04896be177ce5420daf0ee71482318a6\nhttps://preview.redd.it/yeehoehcn60d1.png?width=379&format=png&auto=webp&s=d33d814521c2581d2cb3b5c830fa62c5bae5782e\nNow, while the article was very keen to post certain aspects of this, it was rather lacking, and it must be stated although the title of this issue, as well as the description in the article infer this is related to UFO's. There is no mention of an actual UFO or craft present within this encounter, or at the very least, this information was omitted from the article, and was potentially removed at the request of the professor in question, though that is speculation on my part. \nThe following sections will deal with the author of this previous issue, as well as the two follow-up articles and their individual authors. \nThere is more information present as the above text states, not from the previous issue, but from two separate follow-up articles that were saved and printed in the Italian Ufo magazine \"UFO express no. 043.\" Link to the full untranslated issue here. These separate addendums fully cover the images in question and are critical but not overly-so. The most important aspect to this is that the professor provided further information to Sette, primarily about what they were doing prior to this entities appearance, but also their means of photographic capture. \n{Page 1}\nUFO: Is this being from another world? read the scroll on the cover of 7 (No. 9/10) that we republish on this page. Hundreds of phone calls and letters arrived at the editorial office, and they continue to arrive after Mino Damato in his TV program Alla ricerca dell'arca (Sunday, March 27, Rai 3 8:30 p.m.) dealt with the same images, depicting a hypothetical alien photographed by a professor at the University of Pavia one summer evening in 1986.\nThere are those who believe in this hypothetical alien and those who do not, but all of the readers who have phoned or written are bound to each other by the rejection of that question mark printed on the cover: each of them is persuaded to erase the hypothesis, to tear away the veil of the enigma. And they split into two equally intolerant parties, leaving no room for doubt. We have chosen two exemplary letters. The first letter comes from Brixen and is signed by Mr. Nicola De Paola (2 Clesia Street). He says “the alien is a tobogganist: typical are the tight suit the aerodynamic helmet, the face crushed by the transparent visor, the blurred colors and contours of the photos are due to the fact that they were taken from television, with the obj vo blurred or too close up and strange an alien with limbs, head, face and body identical to those of man; I too will be able to take photographs quite similar to those published; as a reader I feel mocked.”\nOthers have certainly seen in the hypothetical alien: a surgeon, a nurse, an ice skater, an Icelandic firefighter, a Norwegian cryologist (sic), a KGB spy, a hockey player with his head bandaged; in short, some man in overalls or uniforms. No one has identified in the figures, despite the width of the pelvis, a woman or an androgynous. The second letter comes from Ferrara and is signed by Mr. Giovanni Mantovani (via Luigi Borsari 51). Says; When I saw the photographs I immediately thought: but look, it looks like the E.T. seen by R.M on September 2, 1987 while he was fishing on the bank of the Canal Bianco (RO). He felt an intense tingling, turned around and saw a strange individual: dark complexion, 2 meters tall, hair that looked like plastic, wearing a luminescent blue jumpsuit. The apparition lasted a few seconds.R.M. felt a chill, a feeling that was renewed at the sight of your photos... Only one remark can be made to the professor of Pavia: that of not having given the readers further clarifications about the close approach of the third type...\nHere are the further clarifications that the professor from Pavia has allowed us to give, although he is consumed by the fear of being uncovered and covered with ridicule. The photos were taken by a Nikon camera, with motor-drive, 55 mm lens. Micro, 3.5 aperture, shutter speed: 1/4 second Polachrome film, 40 Asa sensitivity. Shortly after the sun went down, the professor was completing some experiments on the optical perception of dogs (how does a dog see things in the world? Black and white? With what depth, in what perspective?). That alone is almost ridiculous. We were missing the hypothetical alien. A dog joke? Maybe. But the professor never solved the riddle. And dogs don't talk. \\~ Paolo Pietroni\n{page caption}\nThe hypothetical alien out of 7 has caused conflicting reactions. The photo was taken from a Nikon by a university lecturer while carrying out experiments on the visual perception of dogs\nhttps://it.wikipedia.org/wiki/Paolo_Pietroni (information about this addendums author)\n{Page 2}\nYour E.T. seems to me to be a feminine being...\nDear editor, I am writing to you in relation to the series of 5 photographs taken by a better identified professor of Pavia one summer evening in 1986 and which appeared in the supplement of the Corriere della Sera n. 9/10 Since I am not familiar with photographic technique, I have written down the shooting parameters communicated by you personally during Mino D'Amato's television program In Search of the Ark on March 27.\nCorrect me if I'm wrong: Nikon camera body with motor, 5.5 mm focal length lens, aperture dia 3.5, exposure time 1/15 of a second. Certainly, with this adjustment, every little movement of the camera or of the photographed subject causes a blurred or rather blurred photograph. Probably, this whole story of the photos arose from the need of the Rizzoli Group to launch on the market the Italian version of the best American seller Communion by Ted Jacob, which deals, coincidentally, with the subject of extraterrestrials. This colossal business is also sponsored by the production of the film, which has been \"posted\" while waiting for the possible buyers of such a profitable product to be sufficiently sensitized...\nHaving said this, I wish, through his kindness, to convey to the professor of Pavia my modest comments on his photos. Feminism aside, I confess that the first spontaneous observation I made on these photographs was to recognize without a shadow of a doubt a woman, or rather a female being; The conformation of the hips, the breasts, combined with the grace of the bowed pose with folded arms, unequivocally belonged to a woman. But let's get to the details.\nThe suit - It appears so tight that it shows every little part of the body so as to give the impression of a \"second skin\"; It has light blue-green bands (as shown in the photo on the right on page 74) that are more evident around the neck, on the shoulders and on the arms.\nThe hands - They appear covered by the sleeves and more elongated than ours (cover figure), dare I say w(bed.\nThe head - Although it is more mobile, it clearly shows these elements: oval face with a slightly flattened nose, microphone with a light-colored support arm placed at the height of the left ear (photo on the right, page 74)\nThe headset - It is completely different from any type currently built because it contains a transceiver module at the top for contact with some support organ (e.g. an operations center, or a cosmoplane, or another operator), similar to what happens in Italy when astronauts go out of their vehicle and maintain constant radio contact with the control center.\nThe transceiver part can be seen both in the cover photo and on page 74, left and right, and is indicated by the protuberance on the top of the skull.\nThis study was born well out of any venal or other interest, in fact I am not a ufologist, but a pilot in full flight activity and with command responsibilities; I have been a first-hand witness to the phenomenon commonly associated with the improper name of UFO\nSure of the need to deal with the subject with more compatible methodologies than those promulgated by scientists and ufologists, I dedicate myself to the enhancement of aeronautical contactism, intending with this new term to redefine the sightings of military and civil pilots, aeronautical technicians, engineers, etc. who through direct experience with the phenomenon have acquired the conviction that we are not alone Only those who have had a direct impact with the phenomenon (the contactee) can provide a plausible image of themselves... everything else... They are only lucubrations born from mindsets that are not up-to-date with the present sotric moment on the one hand, and with the characteristics of the phenomenon on the other.\n{end of article caption}\nI forwarded his observations to the professor in Pavia, author of the photos depicting the hypothetical alien. Thank you for your interesting analysis. You are free to believe it or not, but the Rizzoli Communion book had an absolutely random presence in our service: we liked the design of the cover; the portrait of that E.T. and we thought of enriching the illustrations of the service.\nRoberto Doz (a fairly interesting individual on his own, air force colonel with his own UFO sighting) read more on that here \nAs for the author of the original article. Their name is Nullo Cantaroni, and may be more well known by his wife Bice Cairati( Sveva Casati Modigiani), Nullo Cantaroni had a fairly successful journalistic career, dealing primarily in medicine as co-authorized by fellow science journalist Severina Cantaroni. He eventually succumbed to Parkinson's disease. I make mention of these authors, Roberto Doz (who has a very good reason to be interested in the topic as he had his own experience). As well as the other two as these are not the ramblings of some crazy pumping out their own versions of weekly world news, but were and still are highly credible and respected peoples, whom by their own association are taking the flak for posting this material to begin with. \nFrom here on out, this is going to be a further dive into the already presented material, some comparisons with other cases which have direct correlation with these images, as well as other information during my research that has not been touched on up until this point. \nIn the first follow-up article there is mention of a show \"Alla Ricera dell'arca (In search of the ARK)\". With he show discussing the images posted here. I was able to confirm that this episode does exist, with the covered material, and is within the RAI archives (Italian TV network/station). However, they would not lend the episode out to a non-Italian citizen, or someone associated with a University, or media conglomeration. I mention this as there may be more material covered in this episode that was not provided in the main article and its follow-ups. If there are any Italian citizens, or peoples reading this who have the appropriate accreditation to acquire a copy of this episode I would ask for your cooperation in attempting to do so. If someone has a copy of this simply recorded off of an old VHS I implore you to make that available to all. \nGoing back to the main article, the meandering to Communion is certainly off-putting, though I disagree with the previous mention that this was a hoax on the part of the publication to push Communion. Extraordinary claims require extraordinary evidence after all (even though Carl Sagan never bothered with the evidence, side tangent: listen to J Allen Hynek talk about that here) But I believe these images were published in good faith on part of Nullo Cantaroni, his background and thorough career would make this unlikely. \nSo as it figures there are three scenarios here that describe this scenario (in no particular order of likelihood) \n1) these images are hoaxed by the publication to push communion\n2) these images are hoaxed by the supposed professor\n3) these images are legitimate and provide evidence of a non-earth based entity. \nBefore I move on I'd like to mention that I did attempt to reach out to Corriere della Sera multiple times regarding this material but was never given a response. \nTo round this off the images themselves. Humanoid obviously, female-appearing, now I say appearing because assuming this really is some unexpected entity, there is no guarantee that the physiology of this figure accurately represents its determination, and although this entity appears to have what we'd consider to be skin, that may only be a covering to another form or may be some type of robotic synthetic life-form designed specifically to mimic human appearances. What may be most interesting or most alarming depending on your perspective is this entities face appears to change between shots, and yet seemingly keeps the same body proportions. If you are of the opinion this is some type of hoax you could state this is an obvious inconsistency between shots. On the other hand, that is an obvious conclusion to make and showing differentiating faces would be a rather odd choice on the part of a hoaxer. This again could be part of the photographing process, as there is motion blur between some of these photos and it simply gives an appearance that things are changing. \nThere are other features which must be touched upon, namely the clothing, but in one such photo, what appears to be some type of headgear wrapped around this entities face. To anyone with a passing knowledge of ufology and its associated lore would know, the favorite of any interstellar interloper is the tight formfitting bodysuit. Primarily described as blue, although other colors are often reported. But unlike most humanoid encounters described in the west, this entity seems to have a darker complexion about them. Now does that mean this does not fit in with established prior encounters? Not at all, for whatever reason the blonde-hair nordic is the most popular discussion topic when it comes to human-adjacent lifeforms, but in other places, and Italy especially, some of their most well know or most covered, feature entities with darker complexions. Case in point\nhttps://preview.redd.it/0s611i7hn60d1.jpg?width=884&format=pjpg&auto=webp&s=cbc1472a0e49504d71a975ebaccb91639e592ed1\nThis encounter in 1978 Italy with a dark-skinned entity in a shimmering scaled suit.\nOr this description of a dark skinned entity with a similar described blue suit reported in 1987 \nLocation. Villamarzana, Rome, Italy Date: September 2 1987 Time: 1700\nRenzo Munari was fishing on the Bianco Canal when he noticed a strange object flying at a moderated speed over the river, as the object disappeared from sight he felt a strange prickling sensation in his body, resembling electrical static. Turning around he saw a very tall human-like figure staring intently at him. The figure was at least 2 meters in height, with orange hair and dark skin. He wore a luminous blue colored tight fitting coverall. On the left side of his chest there was a square orange colored “tag.” During the encounter the witness felt a cool wave of air and light headed. The figure apparently disappeared into the brush.\nSource: Archivio SUF, USOCAT by The Italian Center forUFO Studies (CISU)\nThere is also this report from 1989 Russia\nLocation. Salsk, Rostov region, Russia Date: August 13 1989 Time: 2300\nWorking at a cotton irrigation plant Vasiliy Ivanovich suddenly experienced total equipment failure without any apparent cause. While searching for the cause of the breakdown, the witness heard a loud voice, “He is searching for the cause”. Looking around he saw four humanoids standing close to him. One stood in the front, while the other three stood in the back. He described the humanoids as tall, with long dangling arms, with a large head, flattened on the top and wide at the temples. The humanoids are dark red or brown in color with large egg-shaped eyes and two holes instead of a nose. They have no lips, and thin strip instead of a mouth. They were wearing truncated shiny blue coveralls and footwear. The humanoid standing at the front of the others held a box in his hand and a soft pleasant voice seemed to emanate from the box. He held the box at stomach level. Ivanovich approached the humanoids and asked who they were; the reply was a question asking him if he wanted to go with them. At this point the witness saw a light at the edge of the nearby woods and a hovering object. The humanoids then floated slowly towards the craft and disappeared. Terrified the witness ran to the village to notify other witnesses but upon returning to the site the humanoids had already left. \nSource:UFOZONE Russia\nAs for the headgear, there is a report from 1995 Italy of an entity not resembling this one in this post, but wearing a similarly described headpiece. \nLocation: Ancona, Italy Date: February 3 1994, Time: 9:00am\nSix witnesses, including a Mr. Giulo observed a strange humanoid wandering around some nearby rocks. The humanoid was described as about 1 meter and a half in height, wearing a tight fitting black coverall that covered his whole body including a pair of very long feet. The face was elongated with two huge round eyes, with round black pupils. It appeared to be wearing earphones with a small thin protruding antenna. It seemed to stagger slowly and after about 10 minutes it rose up slowly and vertically into the air, quickly disappearing from sight \nSource: CISU Italy.\nThere is also this case from Barisciano Italy 1978 in which an entity bearing a striking similar blue color to the outfit was seen, with an adorning white \"cap\" or hairpiece that resembled that of a cap. read the untranslated version of that encounter here\nhttps://preview.redd.it/gkgzwmvyp60d1.png?width=310&format=png&auto=webp&s=65238cf5324c0acfcc076966d141d0114eb89be5\nFinally, lets get back to the person allegedly behind this whole spiel, the Professor. A claim such as this, where an entity appears in ones presence without any known means is a stark claim all on its own, to provide photos of such an encounter is another thing all together, but being as its an anonymous person, how can we gleam any credibility out of this? To put it in other words, is there enough information provided within the original article as well as the follow-up articles to speculate on a potential identity to who this man could have been? \nEmphatically yes, infact there is only one such individual who fits the criteria with the information provided, granted this information was given after the fact of the original articles publication. In the first article within UFO express that discusses this, we are told this person is running experiments relating to dogs (canine) eyesight, but the author was unsure whether or not this is a jest of some sort. I do not believe it is, in the secondary article it is again mentioned that this professor is working with canine eyesight, but in a caption on the second page it is emphasized this was \"non-academic research\". Now does that mean it was unrelated to their professional focus? No, it simply means this research was carried outside of official means. This leads me to who I believe the primary suspect is in terms of a potential identity, could there be other more accurate people? Perhaps. But this persons tenure and level of research within this subject and the timeframe of when they were working at the University of Pavia lines up perfectly with who this person could be. However, because of doxxing concerns, and that they initially requested complete anonymity from the publication I will not be directly naming their identity here. But I will heavily state that this person worked in the university of Pavia from 1985 in the zoology department and specifically with foxes and wolves. With this person having worked and published (into the present) works related to both of these fields. I have attempted to personally reach out to this professor both via email & telephone (their academic numbers, not personal) but have \nreceived no response. I would ask that if you do look into who this person is that you do not attempt to directly contact them as their lack of a response is response enough.\nWhat was the encounter like? How long did it go on for? Was there a conversation or was this a quick in and out? These questions and more are not answered here, and perhaps never will be unless someone; the professor, an associate, or anyone else, comes forward with more details we are left wondering and wanting more. There is of course much to be said about these images and the potential for further investigations, including the peculiar hands this entity seems to posses that does have a passing resemblance to other cases, but lest this drag on to long I will leave it here and attempt to answer any questions that I may be capable of giving insight on. \nSources and resources used\nArchive link for translations and scans of original Corriere della Sera article https://archive.org/details/Paviaentity\nMagazine and other ufological material sources: https://files.afu.se/Downloads/?dir=./\nDocument scanner for afu and other documents/sites https://updb.app/\nalieni in italia by Moreno Tambelini\nImgOps for reverse image searching\nhttps://ufologie.patrickgross.org/sys/text.htm & Albert Rosales for their compilations of humanoid encounters. \nIf you have had an encounter or know someone who has had an encounter similar to this or identical to this, do not hesitate to DM or message me with the details. ", "media": null, "score": 84, "upvote_ratio": 0.91, "comment_count": 5, "over_18": false}, "25": {"id": "1cni6lc", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "galaxybraindesign", "link_flair_text": null, "time": 1715649679.1035242, "created_utc": 1715209341.0, "url": "https://i.redd.it/woqsfu8x9azc1.jpeg", "title": "This Map Took 42 Hours To Hand-Letter — is your fave in here?", "permalink": "/r/cryptids/comments/1cni6lc/this_map_took_42_hours_to_handletter_is_your_fave/", "selftext": "", "media": null, "score": 264, "upvote_ratio": 0.98, "comment_count": 127, "over_18": false}, "26": {"id": "1cmypsj", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Familiar-Piglet-8928", "link_flair_text": null, "time": 1715649679.2393494, "created_utc": 1715153261.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1cmypsj/dopplegangers_in_my_city/", "title": "Dopplegangers in my city", "permalink": "/r/Thetruthishere/comments/1cmypsj/dopplegangers_in_my_city/", "selftext": "In my city, there are two persons who look like the same person. I have very carefully compared their photographs, they look like the same person, there's literally no difference in appearance other than that the older one looks older and has somewhat darker skin than the younger one, and even the latter is something that could change with increased or lessened sun exposure. One of the two characters was a student at my elementary school, the other was a mother of a homeschooled student that I had associated with. I met the latter less than two years after leaving the school, so I knew them both at close times, when one was an adult, and the other a child. Their husbands look like the same person, and even have the same amount of facial hair. Through research, I found that they live in houses that are carbon copies of each other, built in the same year, and within five minutes' driving distance, and thirty minutes' walking distance in a secluded rural area. This seems to me to be an example of the doppelganger phenomenon. I think that there must be something paranormal going on here.\nEdit: I changed my post to correct a bizarre sentence that looked like a borderline word salad. It previously said: 'One of the two characters was a student at my elementary school, the other was a mother of a homeschooling associated that I had.' I changed it to: 'One of the two characters was a student at my elementary school, the other was a mother of a homeschooled student that I had associated with.'", "media": null, "score": 33, "upvote_ratio": 0.9, "comment_count": 30, "over_18": false}, "27": {"id": "1cqfah2", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Scary-Routine-8725", "link_flair_text": null, "time": 1715649679.4889452, "created_utc": 1715540722.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1cqfah2/a_tinder_date_that_could_have_ended_badly/", "title": "a tinder date that could have ended badly", "permalink": "/r/LetsNotMeet/comments/1cqfah2/a_tinder_date_that_could_have_ended_badly/", "selftext": "Sorry for my English, I tried to transcribe from French to English as best as I could\nTwo years ago, I met a guy on Tinder. Good feeling from the start, we quickly decided to see each other. He asked me to come and sleep at his place, which I accepted because we had mutual friends (I told myself that he was definitely someone that I can trust) \nI arrive at his house at 9 p.m., and I immediately see that he is not as I imagined. He looked dirty, his apartment looked like a squat, and there was a smell of stale tobacco in every room.\nI see a stack of books on autism when I come into his home and I ask him about it. I learned at this moment that he is autistic with Asperger's and that he has difficulty differentiating right from wrong. He also tells me that he knows how to analyze non-verbal language very well and that he knows what a person is thinking just by their attitude. I don't know anything about neurodivergence but I directly wondered what his inability to recognise right from wrong meant. \nhe offers me a glass of alcohol which I accept, and as I follow him into the kitchen, I see a weapon placed on the counter.\nI'm a little panicked when I see this, and seeing my look, he explains to me that it is not charged and that it belongs to his father. I never knew if it was a real weapon, but I'm starting to get a little uneasy\nOn tinder, he told me that he wrote quite a bit, like me. So he shows me a poem he wrote on his computer. He recounted the rape of a child in quite precise detail. I freaked out, I pretended to appreciate his “talent” because he was really starting to scare me.\nWe then talk about his ex, and he tells me that they had fun choking and drowning each other in the shower because they wanted to know what it felt like to have control over the other’s life.\nIt was too much. I had swept away a lot of redflags in just a few hours, but I just wanted to leave.\nProblem: I had to sleep at his house, so I had to find a plausible excuse to leave without him understanding that I was fleeing the situation. I was afraid that he had bad intentions and would come after me if he understood that I was afraid and that I had understood his little game.\nI discreetly send a message to my father with the address so that he can come pick me up immediately.\nI explained to the boy that ultimately I couldn't stay but that I was really disgusted at not being able to stay longer (I played the hypocrite to perfection).\nAt that moment, we were both in bed, and I was just looking at my phone, waiting for only one thing: to find out when my father was going to be there.\nAt one point he asks me if I'm in a hurry to leave, because he notices that I look at my phone regularly.\nI was scared, because I remember him saying he knew what a person was thinking just by his attitude. I told myself that he was going to take action if I didn't hide my fear. I managed to make him believe (at least I had the impression) that everything was fine and that I was in absolutely no hurry to leave.\nHe offers me a massage which I try to refuse, but not wanting him to understand my discomfort, especially since I was soon out of trouble, I accept.\nI find myself in my underwear, him on top. It was horrible. Just as he was about to touch my chest, my phone rang. My father was in front of his house.\nI get dressed quickly and barely say goodbye to him as I leave the apartment.\nI sent him one last message explaining that I didn't want to follow up because his behavior really freaked me out, then I blocked him.\nOne of my friend matched with him on tinder a few days later. He had offered to come and sleep at his place. I warned my friend who didn't follow up on this guy.\nI don't know if he was just weird or if something could have happened to me but be careful on tinder: you never really know a person", "media": null, "score": 144, "upvote_ratio": 0.92, "comment_count": 33, "over_18": true}, "28": {"id": "1cmgy2a", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "antoni_coin", "link_flair_text": null, "time": 1715649679.7289774, "created_utc": 1715101558.0, "url": "https://www.reddit.com/r/threekings/comments/1cmgy2a/lay_and_slide_game/", "title": "Lay and Slide game", "permalink": "/r/threekings/comments/1cmgy2a/lay_and_slide_game/", "selftext": "source: old books on my moms shelf\nRequirements\n5 players.\nA feather (birds one)\nA mirror.\nA brave friend.\nA bathroom, with some big space.\nThe game \nTell the bravest friend to lay down in the middle of the bathroom. Has to be the middle. Now, put the feather on him. The friend has to imagine hes going to sleep. He will face his worst fears and nightmares until you and the 3 decide to end this. The other 4 stands in the corners with their eyes closed and hands up. Do not react to any sounds. Be calm. After some minutes, one of the friends approaches the feather if it started turning gray, if IT did: end the ritual by burning the feather and waking up your friend.\nIf it didn't: Wake up your friend, close the bathroom and leave the feather there until it disappears.", "media": null, "score": 3, "upvote_ratio": 0.81, "comment_count": 2, "over_18": false}, "29": {"id": "1cnouqj", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "technicolourhappy", "link_flair_text": "Personal Encounter ", "time": 1715649680.5179503, "created_utc": 1715229603.0, "url": "https://i.redd.it/8ycf01k8ybzc1.jpeg", "title": "I think I painted a Haunted Painting..need help", "permalink": "/r/Ghosts/comments/1cnouqj/i_think_i_painted_a_haunted_paintingneed_help/", "selftext": "About 2 years ago I was going through a really rough patch after a break up and was feeling very low. I love to paint but most of my paintings are not what I’d call very good.\nOne night I felt the urge to paint to distract myself, it was motivation I hadn’t had in months out of nowhere. I just felt oddly compelled. I sat down and obsessed over this painting and finished it in one sitting. I was shocked at how good it was and detailed compared to anything I had ever done before. Having finished and feeling tired I went to bed.\nThat night I had a terrifying and vivid dream with the woman in my painting standing at the end of my bed staring at me and saying something to me I don’t remember but I remember feeling scared. I woke up the next morning and shook it off. This is when things started happening in my home.\nThe painting sits on an easel facing my bathroom. I started seeing a new girl, she came over one night, it was late and we were watching a movie. She went to the washroom. She came out white as a ghost asking if that was me banging on the wall behind the mirror. I told her no, there is nothing behind the bathroom wall, it’s just brick. She refused to come over again. She said it was a loud pounding, so hard the mirror was shaking.\nI’ve seen a few girls over the past few years since painting this and every time they come over it’s the same thing. Banging on the wall behind my bed, bathroom walls, etc. I had never heard the banging myself but decided to put the painting away in a closet one day because the stories were starting to freak me out.\nThat night I was woken up by a very loud banging on my wall right behind my head in bed. I looked up and my dog was standing over me in bed, with her paws on my chest staring at the wall as if to protect me, I’ve never seen her do that before. The banging lasted about 20 seconds and was very loud like someone was trying to punch through my wall. It terrified me….and my dog\nThe next day I put the painting back on the easel and I haven’t experienced any banging since but now things in my house disappear or are moved. This painting terrifies me but I’ve never heard of someone painting something that invites a spirit, I feel like I’m going crazy here. ", "media": null, "score": 417, "upvote_ratio": 0.84, "comment_count": 125, "over_18": false}, "30": {"id": "1covx4t", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Prince100001", "link_flair_text": "Glitch Pic", "time": 1715649680.775706, "created_utc": 1715364253.0, "url": "https://i.redd.it/5i68qhsfwlzc1.jpeg", "title": "Skies over Oklahoma", "permalink": "/r/GlitchInTheMatrix/comments/1covx4t/skies_over_oklahoma/", "selftext": "", "media": null, "score": 284, "upvote_ratio": 0.97, "comment_count": 31, "over_18": false}, "31": {"id": "1cnwr98", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Better_Strike_7962", "link_flair_text": null, "time": 1715649682.3144104, "created_utc": 1715259757.0, "url": "https://www.reddit.com/gallery/1cnwr98", "title": "UFO Corrientes, Argentina. 09/05/24", "permalink": "/r/ufo/comments/1cnwr98/ufo_corrientes_argentina_090524/", "selftext": "(-27.4660937, -58.7297753)", "media": null, "score": 164, "upvote_ratio": 0.91, "comment_count": 54, "over_18": false}, "32": {"id": "1cnjd0p", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "News", "time": 1715649684.0923162, "created_utc": 1715212587.0, "url": "https://v.redd.it/78wfh3lcjazc1", "title": "Ross Coulthart says he has just received information that Pentagon has a video of the Eglin UAP and it's not a balloon. He says \"Air Force is reluctant to admit that there is video because the video came from their latest F-22 Raptor fighter.”", "permalink": "/r/UFOs/comments/1cnjd0p/ross_coulthart_says_he_has_just_received/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/78wfh3lcjazc1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 478, "width": 854, "scrubber_media_url": "https://v.redd.it/78wfh3lcjazc1/DASH_96.mp4", "dash_url": "https://v.redd.it/78wfh3lcjazc1/DASHPlaylist.mpd?a=1718241683%2CMGZjNDUzMjE2YjkyMTY0NmZiMGY4OGIzNTlkNDE5ZWY3ODgxZDY1MDRhNjRlOGI2ZTcyOTAyOGEzNzYwNTAxYQ%3D%3D&v=1&f=sd", "duration": 90, "hls_url": "https://v.redd.it/78wfh3lcjazc1/HLSPlaylist.m3u8?a=1718241683%2CNTU1MTY2NjMwNDM3MTFhYzc0ODE0ODgyMmU2Nzg3YzgxMDkwMjk2MjYwMGY5Y2E5YTI2NDc4OTY1MGJiYmFmMw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2140, "upvote_ratio": 0.85, "comment_count": 564, "over_18": false}, "33": {"id": "1cqwpdx", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "hoosierfan1968", "link_flair_text": "Experience ", "time": 1715649685.5755925, "created_utc": 1715598786.0, "url": "https://www.reddit.com/r/aliens/comments/1cqwpdx/i_worked_on_a_team_that_dealt_with_with_nhi/", "title": "I worked on a team that dealt with with NHI technology and left in 2018. ", "permalink": "/r/aliens/comments/1cqwpdx/i_worked_on_a_team_that_dealt_with_with_nhi/", "selftext": "Hi, I'm writing this because I never got any sort of debrief or moment to decompress from a job I quit in February of 2018. I worked for an agency that dealt with issues related to non-human intelligence. Sometimes these were referred to as EBE's, or as a friend lovingly called them, \"Ayyys\". \nI can't divulge what I did specifically, most of the information I'm going to discuss is anecdotal information I found out about from colleagues. This is because it would be easy to identify me from what my role was, as the information I can say about what I did specifically would be personally identifying. Feel free to dismiss my post as a hoax entirely, I know the right people will believe me. I'm posting this for myself, to make peace with the gravity (no pun intended) of the situation. I tried VA and independent therapy, but divulging this sort of information to a hipster trained in active listening probably wouldn't go well. Posting here is a last resort, but I hope I'm welcome to discuss what I can.\nI'll first talk about my career history, what working for the agency is like, how it functions, and then my general thoughts. If my post makes it past moderation, I'll answer as many questions as I can. I'm unwilling to post an ID privately to moderators or otherwise. People who did that faced consequences. I don't think those people were reddit leakers specifically, but any act to talk about the information in any meaningful way outside of the chain of command ends badly. I'd rather be accused of making things up than risk that, because I simply don't care what people think of me. Hopefully my post will clear up why. \nI'm currently a university professor (not at the university my username would lead you to believe). I was inspired to write this post when one of my students referred to me as, verbatim \"a dude who has to know about aliens\".  If only he knew that wasn't even the start of it. \nI graduated from college in the early 90s with a degree in something I'm passionate about but never used. I started my career as an assistant for a mechanical engineer at an aerospace contractor I got after working some connections I had. Entry-level contractor jobs are easier to get than you may think (well, maybe not if you've posted here). I eventually was a project manager overseeing a small team working on experimental aircraft. Over the course of my career in aviation I worked at 3 different contractors. I was on some of the teams working in autonomous flight in Nevada, among other places. \nI'll share two major things I noticed that, looking back, could be related to NHI research.\nIt was a sort of open secret I was let in on at some point in the late 90s that if a large-scale invasion or threat to the mainland US were to materialize, the US had an \"ultimate trump-card\" of sorts that would render everything we were working on as completely obsolete. Jokes like \"well, work smarter not harder on 'x' because if it were to come down to it, we wouldn't use that technology anyway.\" weren't uncommon. I assumed this was referring to nukes. \nLater, I spent time doing inspections at various secret facilities due to my standing in particular agencies. If I'm identified, I will definitely lose that standing, so there's that. This was not as exciting as it sounds, it was very technical and boring. I was mostly just a glorified HVAC inspector. I visited a handful of facilities, but two of them in particular stood out as there were areas within them I wasn't allowed to access. At the first facility, the scope of my job was to inspect the entire location. One area had its own security, who, after a long discussion, basically told me to kick rocks. My boss wasn't authorized to let me through either. I wrote a scathing report about this incident in my overall assessment of the facility and my boss erased it from the document entirely. The situation at the second facility was similar. I'll admit, I was what I guess the my students call a \"Karen\" about it. I knew that whoever was operating these areas was working completely outside of congressional regulation, which, while it does happen in certain sectors, is really not a good look. Once I got the job I'm talking about, I was able to confirm the second facility was related to NHI research. I was never able to confirm the first was. \nAfter a teaching stint, I was offered an interview for a position in my project management roots again near where I was living at the time. I wasn't told what I would be working on, which isn't uncommon. I was excited to get back to work because I had been working on goal-oriented drone swarms in my free time and assumed that's what the interview would be for. \nThe interview took place in a SCIF in someone's house. Looking back, this was most likely a house that wasn't lived in, but just used for the purpose of interviewing potential hires without giving away the location. It's also likely this was the location because this agency doesn't exist in any official capacity. Yes, it has a name, it gets sort-of-kind-of funding. Saying the name would get me killed. I wish I were exaggerating, I was told the name at the start of the interview, and I had never heard of it before. I've never even said the name out loud. Paradoxically, even though the agency \"doesn't exist\" if someone knew the name, it's likely a paper trail exists through publicly available documents. A lot of the information isn't classified because the agency is so secretive going through the process to classify it in the first place would reveal it to too many people.  \nIn past interviews, particularly for the inspection job, I could refer to specific colleagues, facilities I worked at, or contractors I was in good standing with to play the usual interview game. In this interview, I was treated like a brand new hire. While I was already offended about how I was being treated, the interviewer started grilling me about my love for Star Trek (?) and said that \"theatrics\" wouldn't fly in the position I was being interviewed for. Looking back, I should've never accepted the job, but the allure of working on swarms was too great. \nThe first office I worked at was an office building that didn't stand out in any way at all. I believe our neighbors in the office park were a fashion studio and a dentist, among others. The difference was our building had 24/7 armed security. The first few days were heavy paperwork and on-boarding. One of my old bosses called me on an office phone to talk to me before I was officially on-boarded. As a management nerd, the biggest challenge of working for this \"agency\" is that it's a paperless office. It has its own highly sophisticated intranet with hundreds of archival documents. The implication was, that unless it absolutely had to be saved, to never, ever write anything down. I remember an early colleague telling me \"a gantt chart is a great way to get fired\". This was a challenge at first, remembering all of the information with no documentation is not something I'm particularly built for, especially when the information is about NHI. \nLater, I worked in a facility within-a-facility just like the one I had tried to inspect. It stored a craft. Being near the craft for extended periods of time is extremely dangerous, especially if it is being experimented on with power. I didn't observe any injuries to anyone while I was there, but all sorts of long-term nasty injuries were relayed to me through rumors and warnings. The craft was shaped like a dreidel without the handle. There was a large exterior piece that went missing when it was recovered. The theory is it acted as a stabilizer, although some argue it was a crude weapon. It sat in a custom hydraulic rig that could be used to rotate it into all sorts of different positions, kind of like those aerotrim astronaut training balls where they spin you around. I wasn't on the team that got to use the rotation rig. The rig was so large and extensive I spent a few weeks thinking it was part of the craft before someone told me otherwise. Typically, the craft would held on its side in the rig for easier storage. Its weight just naturally sat it that way, although it was intended to be flown vertically. \nThe shape was directly informed by its purpose. Every shape is custom molded in a metallic material that would revolutionize the way we travel if we had it. In following the topic as much as I can manage to, I've seen some other people mention the material. There were some material scientists that had been working there for decades. I never got to go inside the craft. It was guarded 24/7. Boy, did I want to look. \nThe agency goes out of its way to hire individuals who have little interest in working in this space at all. They recruit particularly out of BYU, although you have to have a contractor or government career for around a decade to be considered for an interview. Published papers don't hurt. When I worked at the second facility the sorts of people that were there were frustrating to interact with because my initial reaction to working in the that facility was extreme excitement, and it wasn't shared. I believe this is partially responsible for the stagnation, high turnover rate, and compartmentalization. I quickly learned who to trust, and gained some enormous that helped my work. Part of why I'm being secretive about my ID is because the turnover rate results in a sort of \"summer camp\" work environment. It's easy to point to \"classes\" of people in various non-leadership positions that all were hired, fired, or quit at similar times. If I said when I started, ended, and where I worked I'd be easily identifiable because there are so few people that match my description. Leadership has been there forever. No, not literally. \nThe agency is divided up into several \"wings\", not unlike the executive, legislative and judicial branches. I'm not insinuating they're a shadow government, but the wings check and balance each other in a way a government is at least... designed to. These wings include mechanical engineering, biologic research, weapons research, computer science, tracking, what I'll call anthropology, what I'll call crash recovery because that's what colleagues who are planning to come forward will call it, and security. I'll list some information about each.  There are definitely more wings that I don't know about. \nWhat's unique is these sub-groups exist all as part of different parent government organizations and are HQ'd where their parent agencies are. For example, the tracking wing is sort-of-kind-of embedded as R&D at NORAD. This is a simplification of the actual \"paperwork\" involved, it's honestly complicated and I don't know much about how it works. I do know that this is how they maintain funding even when the parent agency goes completely dark for stretches of time. It's worth mentioning that these departments employ, at most, 50 people each. It's typically much lower than that. This is why we're all pushing for whistleblower protection. It's not hard to identify us because there are so few of us in the first place. \nMechanical engineering is exactly what it sounds like. It's the most extensive, the oldest, and the most compartmentalized. We have crashed craft in various states of complete. We had a recovered craft that worked almost perfectly that was shot down by ourselves. I saw this coming, and it's part of why I quit. There's a lot of information about this wing in the public sphere. Part of their job is to determine what each shape of craft is used for. This is an important job beacuse we're unsure of NHI's intentions. If we discover the designs are intended to hurt us, action will have to be taken. I don't know what that means in practice, but it's what the engineers mostly study. Consider this lecture around the 10 minute mark about the differing characteristics of an F22 versus a passenger plane. Now imagine figuring out the purpose of the passenger plane versus the F22. Since we're humans, and those are human designs, eventually a team could figure it out. It's not as easy when the designs aren't for us, or purposes we fully understand. Triangles are the most impressive design, and we don't have one. It's likely China does, leadership is mad about that. This team discovered, a long time ago, that the reason why craft appear so bright to us humans is because it's not really \"light\" but rather the product of the crazy amounts of power these craft require. Sort of like smoke coming out of an exhaust pipe. \nBiology is something I personally suck at, even at the high school level. I can say the NHI look like the aliens from close encounters. As far as I know, we never had one alive. My source who told this was unsure if it was true or not. I didn't learn much about this wing, it's the most secretive. I do know its HQ is hidden in almost plain sight. I still feel like the guy who told me where it is had to be lying, because it was just too obvious. There are bodies stored in other locations apart from their main HQ. \nWeapons research is a large wing, and is fairly new. It was absorbed by the Space Force when it the SF was created. Frustration with the SF as a whole is part of why I left shortly before it started. I don't know much about it. It has a high turnover rate and is dangerous to work in. People were injured and compensated by a large private aerospace contractor instead of the USG. Its main job is to strap a nuke to a reverse-engineered craft and just see what the hell happens. \nComputer science is (or, was, it may have moved after I left) hq'd at a facility in my home state. This is rare, because most of the other wings are within a stones throw of DC, or Nevada. This is mostly based around researching the crafts navigation system. The navigation in every craft is the same. The craft use a system that originally befuddled generations of researchers, but it's essentially a 3D dijkstra algorithm. It finds points around the craft, and chooses the most efficient possible route through space time to get to that point. Some of the parameters it uses to gauge efficiency are totally unknown to us and are a serious point of contention. It's not  autonomy, but rather obstacle avoidance not unlike what you would see in a self-driving car. But, the self driving car could go through air, space and water without worrying about what medium its in. Additionally, the algo accounts for the crafts place in time. I don't think this means that the craft time travel in the way we think they can, but rather go so fast that they experience dilation and can hit objects in the future, and, potentially, past at their target destination. It's possible they do this on purpose sometimes. I don't know much about the internal programming of the computer or how it actually does any of this. There are a few senior scientists that hold that information dear. One of them jokingly refers to it as \"Ayyyy C\", as in, C for NHI. I know that he doesn't work with a computer, only a pad of paper and pen. \nAlthough the algo is extremely effective, Nuclear explosions and experiments somehow interfere with this navigation. Craft particularly avoid Diablo Canyon, even if we put something they really want there. They mostly avoid previous crash sites as well. More on crashes later. \nSpeaking of avoidance, tracking, like I mentioned, is (or was) part of NORAD. The NHI deploy craft of various shapes and sizes all the time. I don't want to claim that they have advanced cloaking techniques, but from what I heard, the tracking department basically is in an eternal game of cat-and-mouse. They don't have adequate technology to track the transmedium craft. All I would say on a record is NHI know we can track them, and know how to avoid us. They usually avoid detection by going underwater, especially in the case of particularly large (by human measurement, enormous) craft. It's interesting that historical UFO designs mimic the design of buildings and vehicles of that time period. Whether this was just humans not being able to reference what the designs look like, or a form of mimicry is anyones guess. Someone in leadership knows the answer, I don't. \nIt's important to note not everyone at NORAD was part of the tracking team, but the tracking team is embedded in NORAD and interfaces with them on a minute to minute basis. This leads to scenarios where NORAD will report an object, and the tracking team will silently acknowledge, but give no explanation. This lead to a catastrophic incident that happened after I left but knew about from a colleague. Supposedly, tracking is being moved to the Space Force to clear up these miscommunications. If I were working there, I would probably be working on that onboarding process. NORAD was moved to Cheyenne not only to protect from a foreign adversary, but also because the facility is uniquely equipped to track NHI craft. \nThe wing I called \"Anthropology\" is the weirdest one by far. It focuses on a few different things. They originally studied NHIs intentions and \"culture\" if it's possible to call it that. The reports I read from this early research changed the way I see the world. \nAnthropology and Computer Science were at one point decompartmentalized to study how the NHI interact with the craft. The NHI are linked to their craft in a way that borders on biological. The actual way they interface with the components of the craft is not as sophisticated. Take this video. Although it's an immature video, the way he interfaces with a piston that moves the gas pedal is similar, albeit much simpler than the way NHI interact with their craft. They send signals using their body to systems that control the craft. It's hypothesized that they can and prefer to control craft remotely, but I'm not sure if we were really researching this. \nTake note that if the driver of the jerry-rigged death trap in the video panics, the car would accelerate due to heightened brain activity. When people wonder how a superintelligent being can crash, this is part of the answer, in conjunction with the navigation system malfunctioning. I personally don't think the NHI feel \"stress\" as we do, but if they heightened their activity and overrode the pathfinding system instead of letting it do its job, there could be an accident. \nA smaller subset of this wing focuses on how humans can interface with craft that are currently in the sky. If you see an image of a large disc above a gas station in the snow, it was someone in this department \"summoning\" a craft not unlike how cheap RC car controllers can interfere with each other when used at the same time. Some people are better suited to interfere with NHI craft than others. We're not sure why. \nOn somewhat comedic note, one colleague was harshly punished for using this research to encounter NHI craft at a party. There was an outdoor bonfire, alcohol, and questions about what she did for work. She wasn't killed or anything, just called a dumbass and told to never, ever do that again.\nSome people in this department are BYU graduates who believe they are directly interfacing with what were recorded in the bible as angels. There is an even smaller subset of this wing that focused on NHI communicating with humans. All I know about them is that they did that work at some juncture, but probably have other jobs now. \nCrash Recovery probably has the most people involved. It's split up among several parent orgs, but funding is funnelled away from it and into other departments when there's little activity. This is common among the entire agency, as funding and staff get balanced between the different wings based on progress or lack thereof. Most of the crash recovery staff are staff from tracking and security that are involved in Crash Recovery. It's also made up of members of all of our favorite three letter organizations. Crash Recovery's overall structure was referred to as a volunteer fire department. It's typically some people playing pool and watching movies, but when the need arises, all hands on deck from the current staff, and on-call members. \nCrashes are exceedingly rare. The number of crashes goes down exponentially because they learn to avoid the cause of the crash. When they crash, they make no effort to retrieve the debris, save for one instance. I personally believe some crashes weren't \"crashes\" but were NHI parking a vehicle for us, because there were no bodies recovered and the craft was in perfect shape. \nSecurity, to put it mildly, are terrifying. Imagine the very best of the SEALS, NSA and Secret Service all working together. They are short-staffed, but that staff is not only elite, but dedicated. Their numero uno rule is people that mention the agency name are killed. It's not a question, and it happened during my time. You'll hear more about them as news about the retaliation Dave comes out. I wasn't directly interviewed by him, but I know several people who were. The security team figured it out quickly and, you could say they aren't his fans. They constantly monitor all discussions about the topic, but rarely act in real life unless absoloutely necessary. They staff facilities like the second one I worked at. This team also actively engages in disinformation, gaslighting and other similar campaigns. Their goal is to keep the US's secrets about this tech, secret, because other countries are close to breakthroughs. They also conduct counter intel on what other countries know, and counter-counter intel about what they know about what we know. Not to sound crazy, but, the security team will see this at some point or another, so, a friendly hello to them. Can't touch this ;p (I sure hope!) \nI have a hunch that the current public facing task forces are actually their own wing within security. A friend of mine texted me once, \"Sean Kirkpatrick, you can get your ass kicked\". Ha. Don't confuse these public facing task forces with the work Dave & co. are doing. Dave is the real deal. \nI should mention that Leadership is kind of its own \"wing\". It's not on paper, but they operate above all of the other departments. Leadership is made up of managers who pay close attention to each wing, they discuss info they know, and bring up contradictions to upper managers. I don't know how far this chain goes up. I reported to someone who reported to someone.  I believe it goes higher than that. I have no idea who is at the top or what their credentials are. I suspect they're in the private sector, with their bankroll disguised as R&D for government contracts. Leadership, honestly, made the right choices with the information they had, at least when I was there. Some bad people started to get in charge and change the way things worked among the middle managers and individual teams. This pissed people off and led to multiple catastrophes. As far as I know they faced no discipline. \nSo, that was exhaustive. Those are the wings of the agency that I knew about during my time there. It feels good to get this off my chest. I've been sort-of keeping up to date on the topics coverage in mainstream media and want to give some of my thoughts on this. \nIf the US comes out directly and says \"We have craft, we have bodies\", it means we are on the verge of a serious global conflict like we've never seen before. They will only reveal this to the public if absolutely necessary. The way the information is going to come out is through people like Dave and further probing from congress. Not all of it should be public information, but I believe the technology that is just sitting... somewhere would completely revolutionize the way we live. I don't think anything significant will happen in my lifetime. It was a frustrating job, because everything was so stagnant and had so, so much potential. We're talking about technology so advanced it could render every single current global issue obsolete. If we solved two major issues with the craft and were able to manufacture them, we wouldn't know what to do with ourselves. The technology being incorporated into our technical revolution is a hoax. I heard one theory from a guy at a bar that the transistors at Bell Labs were inspired by technology at Area 51. This is a joke, the technology makes transistors look like sticks and stones. \nI believe multiple species of NHI is misinformation spun up by the security team. There are mystery wings of the agency I didn't get to learn about during my time. It's possible one of these researches other species, but I doubt that. \nNHI potentially experiment on us, and definitely experiment on animals. We have no idea why. The main reason you'll never see organized disclosure is because nobody can agree on what to say. We simply don't know enough. Namely, the NHIs intentions (sort-of, we have a good theory) and where they are from. The Anthropology wing believes the NHI are controlled by an intelligence that is beyond our current understanding of how life works. The biology reports conflict with this, which is why things can't be compartmentalized. If the government were to disclose info, they'd have to get the story straight. We also have no idea where they are from. \"We\" as in everyone I worked with. It's possible someone in high up in leadership knows. I don't think the answer is as simple as another planet or caves on earth. \nThe reason why specific facility locations are kept from the public is because some of them are sensitive and also not entirely NHI-researched based. It would be possible for some tiktokers and hippies to storm the first office I worked at if they were careful. Every place where the agency works is also home to other operations, which is why it's so hard to identify where they are. Lower leadership is hq'd in DC, and the upper management is split between Nevada, Australia and another foreign country. Security are everywhere and potentially even work remotely without an HQ. \nI was contacted by a documentary filmaker when some of my friends were, but I turned it down due to my specific involvement and how easy it would be to track me down if I gave particularly juicy info. I believe the story will come out soon. \nI no longer work in the field and teach full-time.   \nAfter a quick proofread, that's my post. I'm not tuned in to discussions other than what major outlets have to say, but I hope some of my information is interesting. It felt good to type, even if my post doesn't get accepted. I feel tempted to sign off with my first name how I always do in emails, but I have a feeling that would end badly. I'm currently on a camping trip with my family, but I'll be around to answer questions at various times. Please don't DM me anything too weird. Thanks for giving me an opportunity to talk, I've never done anything like this before. I'm sorry I couldn't provide information that proves who I am, I like not being paralyzed or dead. I'm sure you'll see others make the same claims in due time. ", "media": null, "score": 845, "upvote_ratio": 0.94, "comment_count": 288, "over_18": false}, "34": {"id": "1cqccmq", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "SimonFromSomerset", "link_flair_text": null, "time": 1715649685.7830727, "created_utc": 1715532960.0, "url": "https://www.reddit.com/r/UAP/comments/1cqccmq/carl_jungs_ufos_as_spiritual_symbols/", "title": "Carl Jung’s UFOs as Spiritual Symbols", "permalink": "/r/UAP/comments/1cqccmq/carl_jungs_ufos_as_spiritual_symbols/", "selftext": "https://youtu.be/kWv3g-ypGuo?si=he5SKPXDf0TnGi6h", "media": null, "score": 24, "upvote_ratio": 0.75, "comment_count": 15, "over_18": false}, "35": {"id": "1cn3mhq", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "NigerianHurricane0", "link_flair_text": null, "time": 1715649686.8939977, "created_utc": 1715172136.0, "url": "https://i.redd.it/b32rp7yc77zc1.jpeg", "title": "Herschel Weingrod famous movie producer caught trying to meet underage girl", "permalink": "/r/conspiracy/comments/1cn3mhq/herschel_weingrod_famous_movie_producer_caught/", "selftext": "The livestreamer Vitaly has been hunting predators the past few days and ended up catching a hollywood pedo yesterday. He met the \"minor\" on a dating website where she told him she was actually 15 and he decided to meet with her anyways. In the full video the girl said that he was groping her", "media": null, "score": 2319, "upvote_ratio": 0.92, "comment_count": 424, "over_18": false}, "36": {"id": "1cpqepk", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1715649687.0899873, "created_utc": 1715459257.0, "url": "https://www.youtube.com/watch?v=LLQ5js0f4js", "title": "Clear video footage of a UFO in the sky of Belgrade, Serbia - exciting scenes and details.", "permalink": "/r/conspiracyfact/comments/1cpqepk/clear_video_footage_of_a_ufo_in_the_sky_of/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Clear video footage of a UFO in the sky of Belgrade, Serbia - exciting scenes and details.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/LLQ5js0f4js?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Clear video footage of a UFO in the sky of Belgrade, Serbia - exciting scenes and details.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/LLQ5js0f4js/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 0, "upvote_ratio": 0.5, "comment_count": 0, "over_18": false}, "37": {"id": "1co9uls", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "thedankone168", "link_flair_text": "semi-related", "time": 1715649687.563549, "created_utc": 1715293501.0, "url": "https://i.redd.it/ul8s2yo88hzc1.jpeg", "title": "Reminded me of some eye witnesses sightings saying Bigfoot was super muscular ", "permalink": "/r/bigfoot/comments/1co9uls/reminded_me_of_some_eye_witnesses_sightings/", "selftext": "", "media": null, "score": 148, "upvote_ratio": 0.93, "comment_count": 37, "over_18": false}, "38": {"id": "1cqe01i", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "massi_boh16Reddit", "link_flair_text": "Question", "time": 1715649688.093184, "created_utc": 1715537358.0, "url": "https://www.reddit.com/gallery/1cqe01i", "title": "I found this head of an animal on the beach, can you tell me which animal it is?", "permalink": "/r/Cryptozoology/comments/1cqe01i/i_found_this_head_of_an_animal_on_the_beach_can/", "selftext": "", "media": null, "score": 306, "upvote_ratio": 0.95, "comment_count": 88, "over_18": false}, "39": {"id": "1cohteg", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "uofmanblue1023", "link_flair_text": "Personal", "time": 1715649688.276466, "created_utc": 1715318201.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1cohteg/unveiling_the_unknown_my_encounter_with_advanced/", "title": "Unveiling the Unknown: My Encounter with Advanced Alien Technology and Beings Aboard a UFO", "permalink": "/r/Humanoidencounters/comments/1cohteg/unveiling_the_unknown_my_encounter_with_advanced/", "selftext": "On September 11th, 2018, an ordinary drive along US 23 near Whitmore Lake, Michigan, evolved into one of the most bewildering experiences of my life. My journey took an inexplicable turn as I inexplicably lost all sense of time and found myself 40 miles past my intended exit, on the Zilwaukee Bridge. But the truly extraordinary part of this encounter began with the realization that I had somehow gained new, almost psychic abilities, and hazy memories of an otherworldly encounter.\nI underwent a hypnosis regression session to uncover the details of what happened during my missing time. The memories that resurfaced were vivid and filled with advanced technology that seemed beyond the realm of human invention.\nAboard the alien craft, I was introduced to a variety of beings. There were the humanoid figures, closely resembling humans in appearance, exuding a calm authority. Alongside them were smaller entities, the 3-foot tall grays, with large, penetrating black eyes that seemed to see right through me. These beings moved with purpose and efficiency, their interactions suggesting a structured hierarchy.\nThe neural interface technology they employed was perhaps the most striking. This device was like a mesh of fine wires that could be draped over my head. Once activated, it seemed to sync with my brainwaves, creating a direct pathway to my thoughts. It could extract memories and emotions, manipulate them, and even implant new ones. This interaction was deeply invasive yet executed with such precision that it felt almost natural, blurring the lines between my thoughts and the artificial insertions.\nTheir surgical tools were equally impressive. These instruments operated at a microscopic level, capable of making incisions and alterations without leaving a single physical mark. The precision was astounding, as if each molecular structure was known and accounted for. This technology allowed them to perform complex medical examinations and procedures that were completely pain-free and left no trace on the physical body afterward.\nAdditionally, I witnessed a form of bio-energetic suspension technology. This device enveloped individuals in a soft, glowing energy field that seemed to hold them in a state of suspended animation. Within this field, time and biological functions slowed dramatically, allowing the beings to conduct lengthy procedures without concern for aging or decay.\nThe purpose behind these advanced technologies remains a mystery, though it seems tied to both research and perhaps some form of cosmic stewardship. The combination of human-like discretion and the emotionless efficiency of the grays suggested a complex agenda, one that straddles ethical lines by human standards.\nReflecting on these encounters, I am left with both awe and trepidation. The technological marvels I witnessed hint at a civilization far beyond our current understanding, capable of both great wonders and profound manipulations. The question of their true intentions—whether benevolent, indifferent, or malevolent—continues to haunt me, as does the transformation I've undergone. This experience has irrevocably altered my perception of our place in the cosmos, revealing possibilities—and dangers—far exceeding anything previously imaginable.", "media": null, "score": 45, "upvote_ratio": 0.71, "comment_count": 91, "over_18": false}, "40": {"id": "1cmke4l", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Sans_The_Cat", "link_flair_text": null, "time": 1715649688.5132754, "created_utc": 1715110256.0, "url": "https://i.redd.it/anyzbowc32zc1.jpeg", "title": "Going on a trip to West Virginia to see some spooky things looking for suggestions", "permalink": "/r/cryptids/comments/1cmke4l/going_on_a_trip_to_west_virginia_to_see_some/", "selftext": "This is what i have so far hehe also we are planning to go in late august is that a good time to go? Lots of driving and hiking ", "media": null, "score": 138, "upvote_ratio": 0.99, "comment_count": 20, "over_18": false}, "41": {"id": "1cqpm3q", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "No-Pomelo-8413", "link_flair_text": null, "time": 1715649688.8521342, "created_utc": 1715570576.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1cqpm3q/the_date_i_was_too_scared_to_leave_from_tinder/", "title": "the date I was too scared to leave from tinder ", "permalink": "/r/LetsNotMeet/comments/1cqpm3q/the_date_i_was_too_scared_to_leave_from_tinder/", "selftext": "A bunch of years ago , I matched with a guy on tinder. I was a freshman in college and just got out of a relationship and having fun. I matched with this guy (M 24), we can call him Dee. He was a little odd, but we had similar interests and went to the same school so I thought \"why not?\". \nThe red flags started rolling in immediately when I said I would go on a date with him. (Of course the fact that he was much older isn't lost on me as the initial red flag) \nHe tells me that he is not in town but he would leave his grandmothers funeral early (at a minimum 5 hours away) to come pick me up. At this time, I didn't have a car so he said he would pick me up.\nDee ended up driving all the way to pick me up. He picked me up in sweatpants, a wife beater, and flip-flops which struck me as odd because he said he was coming from a funeral.\nWe hadn't made plans just to get a bite to eat and hangout. Since he had been out of town he asked if it was okay if we stopped to pick up his dog. He had left the dog with a friend. I like dogs so I was like no problem. It's dark and we pull up to an apartment complex and he leaves me in the car and come back with a golden retriever that's a bit older. The dog immediately starts growling at me, which had never happened to me before so I start feeling a little weird. \nBecause we have the dog he wants to drop him off at his house. This feels logical to me and I'm anxious to get the growling dog away from me. \nWhen we pull up to Dee's house he asks if I want to come in and I do. So we walk in and immediately I knew it was the wrong choice. The house is trashed. There is trash everywhere. Trash bags full along the front entry, trash on the couch, and just general crap everywhere.\nDee let's me know he has a roommate, but that roommate isn't home. After brushing the trash off the couch he asks if I want to sit and play chess. I had expressed that I was interested in learning and he seemed more than happy to help me learn. This too was a mistake. \nDee begins explaining the game to me and it isn't fun first date explaining. He has gotten vary serious and is showing me each piece while telling me what it is, what it does, and how it moves. Dee then begins questioning me over each piece, which most I get wrong. Everytime I get one wrong he yells at me the correct answer and tells me try again. \nHe got more and more frustrated and it made me very uncomfortable so I suggested we pause chess and do something else. Dee suggests watching a movie which is fine with me. The idea of us leaving and going to get food seemingly forgotten. \nDee tells me that we can watch movie in his room and I oblige, but then he explains that he has to put sheets on the bed because he washed them before leaving for his grandma's funeral. I had assumed we were moving to his bedroom because it may have been cleaner, but when we go in its not AND there is no TV in his room.\nHe proceeds to put Iron Man 2 onto his phone to have us watch. We watched about 10 minutes of it before things got sexual. I won't tell you strangers the details, but short story short we didn't have sex but other things went down. I will say those things were consensual. After they occurred I was feel really odd about the whole situation and told him I didn't want to have sex. \nDee was confused but didn't push it at first. He said fine and we watched maybe 5 more minutes of the movie before he said he didn't want to watch the movie and more. He started complaining and asking me why I didn't want to have sex with him, and I simply said I wasn't in the mood anymore. He then began pressuring me to tell him exactly what it was about him that made me feel that way. \nAt this point we had moved from the bedroom back into the dirty livingroom. You might be thinking \"Seems like a perfect time to leave\" and I thought so too but this is where things start to get scary. As if he knows I'm thinking about how I'm leaving, he explodes and begins to scream at me. \nThis is a 6 foot something man screaming in the face of a 5 foot nothing young girl. Of course I'm internally freaking out but I'm trying to make sure I don't piss him off anymore but also not agreeing to anything. \nFor the next 5 to 10 minutes, Dee screams at me about why I don't like him, why I don't want him, and continuously asks what wrong with him and to tell him. I tried to placate him as best as possible, saying the old \"it's not you it's me\" and \"no I don't want to leave\". \nAgain this man is my only ride home and I'm truthfully not sure exactly where I was. Though I did have my phone and Google maps I did not have uber at the time. \nDee finally calms down when he believes I'm going to stay. Then suggests we try playing some video game. I was in full internal freak out mode trying to make sure I was playing the part of the interested date because I was terrified that if he felt I wanted to leave he would freak out again. \nWe play this game for a while then out of no where Dee starts getting upset again. He started yelling about why no one likes him, why no one wants to get to know him, and why no one loves him. Saying that he has never had a girl friend and all his dates have been one night stands. Again I placate him with a \"I don't know. Lots of girls are just snoody like that.\" At this point I'm saying anything and everything he wants to hear. He even starts crying about how his mother never loved him and telling me very deep, dark things about what his mother has said to him and treated him. \nAfter he finally calms down once more, he gets up and goes to the kitchen to \"fix us some drinks\". Now if your anyone with a brain, you're thinking absolutely not, which was my exact thought at that moment. I decline his multiple offers for a drink. He asks if instead of alcohol, I wanted water and of course I declined that too feigning that I wasn't thirsty.\nI stayed at his apartment until about 1 am, because I was sitting next to him terrified to 1) ask him to take me home 2) say I'd walk home 3) figure out how to get anUber. \nI had been trying to download uber on my phone without him noticing but then it asks for card information and that was too hard to do without him noticing. \nSo around 1am I yawn very louded and say \"Oh wow it's 1am! My roommates going to be so worried about me \" I laugh as if my roommate would be stupid to worry and that i hadnt been watching the clock since he picked me up at 9 pm then said \"I'm so tired. I should get home soon.\" \nAgain I was super scared he would freak out but he didn't explode. He just looked at the clock and said yeah it was late, but I was not taking any chances so I said \"I have a great idea. If I get to bed, soon I'd love to have breakfast with you on campus!\" \nI was hoping my offer convinced him that I was intending to see him again, and it did he seemed very happy at the prospect of it and jumped up walking me out of my house and to his car. \nThe drive back was excruciatingly long. The Ride was completely silent, neither of us spoke. It was only a 10 minute drive but I could have sworn he slowed down everytime we got to a particularly dark area or underpass. \nDee dropped me off and I smiled and made a good show of being tired yet excited to see him tomorrow. He offered multiple times to walk me to my door but I declined everytime and said I didn't want to bother him and I'd see him tomorrow. I walked myself to the building and the moment I got around the corner, I sprinted so fast up the stairs and to my door before he could change his mind and follow me to my door.\nWhen I got in my dorm room I genuinely felt like I had just escaped a serial killer. Even now writing it makes my heart race a bit. I never met up with him but he begged me for multiple days after to meet up with him again, he ever asked to pay me $20 an hour to sit NEAR me in the library. I declined obviously and only ever saw him once after at the gym on campus. He didnt see me and I left immediately.\nI've thought about Dee occasionally since the date and wondered if all those girls he had one night stands with had the same experience I did. I still sometimes wonder how many girls there were after me. \nSo Dee, let's not meet again!", "media": null, "score": 113, "upvote_ratio": 0.97, "comment_count": 8, "over_18": true}, "42": {"id": "1coypef", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Equivalent-Stock2110", "link_flair_text": "WDYT? (What Do You Think?)", "time": 1715649689.6354191, "created_utc": 1715371384.0, "url": "https://i.redd.it/fbdm2hntnnzc1.jpeg", "title": "I took this photo in 2013. My grandpa passed away about a year before this picture.", "permalink": "/r/Ghosts/comments/1coypef/i_took_this_photo_in_2013_my_grandpa_passed_away/", "selftext": "I'm not saying that the hand in the photo belongs to my grandpa, and I've never thought much of the photo until now, over a year later, since my cat passed away. I came across the photo in my Facebook album and started to wonder if it was real. The flash was on my phone when I took the photo, as you can see from the reflection of my brother's shoe, and it was taken at the front door of my house. My cat, Cha-cha, wasn't even looking in my direction, so I'm not sure what he was looking at. I can't remember what the weather was like that day, but I don't think it was super cold, maybe around 40-50°F. I used to live in North Carolina.\nI feel like I should mention more about my grandpa. He lived with us for about 18 years, maybe longer, but I can't remember exactly. My mom and him argued because she was reminding my grandma to take her medication and prepare it for her every day, and my grandpa thought she was trying to poison her. My grandpa and mom never got along, and he was always mean to her, my dad, and me. Despite that, I still loved him.\nAnyway, my grandpa was removed from our home along with my grandma after my mom called the cops on him. He was a grumpy man, and I remember my dad crying on the couch because of some of the things he said to him. My grandparents ended up living on their own in what seemed like a nursing home, but I don't think it was since no one was bringing them meals. Maybe it was a retirement rental? I'm not sure if that's even a thing. They lived there for a few months, and then, out of nowhere, they took a flight back to their homeland, Cambodia. After about two years of living there, my grandma's health started to decline, and she passed away. My grandpa was on the phone, saying, \"Guess it's time to find a new wife\" (yeah, I know, too soon), and then a few weeks later, he passed away as well.\nSo, I was wondering if a spirit or soul can travel distances. Could my grandpa have come back home? He loved animals, especially cats, and he also loved my little sister, whom he called the reincarnation of his mom. Yeah, I don't know. I guess I miss him, even though he called me the black sheep and referred to me as \"the black blood\" (cheam kmao). Any responses would be appreciated. Thanks in advance, everybody!\nOh, I just remembered something! I took this photo because I found it cute how my cat, Aura, had his paw sticking out the front door as if he was opening the door for the other cat to sneak out. 😂 ", "media": null, "score": 379, "upvote_ratio": 0.8, "comment_count": 73, "over_18": false}, "43": {"id": "1cm4l06", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Prince100001", "link_flair_text": "Glitch Vid", "time": 1715649689.8975801, "created_utc": 1715060632.0, "url": "https://v.redd.it/ojf1olevwvyc1", "title": "Are these cloud formations normal?", "permalink": "/r/GlitchInTheMatrix/comments/1cm4l06/are_these_cloud_formations_normal/", "selftext": "", "media": null, "score": 186, "upvote_ratio": 0.96, "comment_count": 34, "over_18": false}, "44": {"id": "1co0ty6", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "kake92", "link_flair_text": null, "time": 1715649691.339951, "created_utc": 1715270639.0, "url": "https://thehill.com/opinion/technology/4646417-top-senators-believe-the-us-secretly-recovered-ufos/", "title": "Top senators believe the US secretly recovered UFOs", "permalink": "/r/ufo/comments/1co0ty6/top_senators_believe_the_us_secretly_recovered/", "selftext": "", "media": null, "score": 132, "upvote_ratio": 0.95, "comment_count": 32, "over_18": false}, "45": {"id": "1cpnuuz", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "News", "time": 1715649692.4651701, "created_utc": 1715452088.0, "url": "https://v.redd.it/xnz1cduhbuzc1", "title": "Newsnation: According to newly declassified documents, top senators met in 2011 with scientists at the Department of Homeland Security to advocate for a formal reverse-engineering program to glean new technology from recovered alien craft, the existence of which is treated as a fact in the documents", "permalink": "/r/UFOs/comments/1cpnuuz/newsnation_according_to_newly_declassified/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/xnz1cduhbuzc1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/xnz1cduhbuzc1/DASH_96.mp4", "dash_url": "https://v.redd.it/xnz1cduhbuzc1/DASHPlaylist.mpd?a=1718241691%2CNjQwNjE5MTZhMDcxYjU4NTcyYWIyMGUzY2E5MDFhNGFkNjcxYzI1NWU2ZTUxOTVhNmYyYWEwOGNmNmZhZjJlOQ%3D%3D&v=1&f=sd", "duration": 163, "hls_url": "https://v.redd.it/xnz1cduhbuzc1/HLSPlaylist.m3u8?a=1718241691%2CNWJkZGJmZTcyYmQ0OGU1N2QwZTU4Y2UzMGI0Y2E3NDc5ZDRjNTBlOWY2ODEzZmU1NWQ2NDA1OGViYmQwZjFjZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1516, "upvote_ratio": 0.95, "comment_count": 186, "over_18": false}, "46": {"id": "1cn9qv8", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "v022450781", "link_flair_text": "Evidence :upvote:", "time": 1715649694.4268448, "created_utc": 1715187986.0, "url": "https://www.psychologytoday.com/us/blog/long-fuse-big-bang/202402/the-danger-of-ufos-is-not-what-you-think", "title": "Dismissing UFO sightings as misidentification like optical illusions or hoaxes is a coping mechanism caused by an irrational fear of the unknown and our psychological need for control", "permalink": "/r/aliens/comments/1cn9qv8/dismissing_ufo_sightings_as_misidentification/", "selftext": "", "media": null, "score": 719, "upvote_ratio": 0.86, "comment_count": 118, "over_18": false}, "47": {"id": "1cpavod", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Miguelags75", "link_flair_text": null, "time": 1715649694.6635983, "created_utc": 1715408574.0, "url": "https://www.reddit.com/r/UAP/comments/1cpavod/a_strong_geomagnetic_storm_hit_us_on_may_11th/", "title": "A Strong Geomagnetic Storm Hit Us on May 11th & 12th: UAPs Expected. ", "permalink": "/r/UAP/comments/1cpavod/a_strong_geomagnetic_storm_hit_us_on_may_11th/", "selftext": "A very strong geomagnetic storm hits the Earth on May 11 and 12, during the weekend. Strong geomagnetic storms are known to trigger auroras and are linked to more UAP sightings.\nThis happens because many UAPs are made by incoming plasma from space often forming plasma balls: from meteors, solar storms or plasma discharged from the Van Allen belts. It is explained here: https://electroballpage.wordpress.com/383-2/\nBut these plasma balls could manifest in many other ways like more lenticular clouds, weird sounds in the sky, cattle mutilations-facepeelers, cryptid sightings... etc.\nThese new sightnigs could happen more likely near mountain peaks and isolated places like islands or boats specially under auroras.\n'Severe' solar storm could trigger Northern Lights as far south as Alabama on Friday night : https://www.foxweather.com/earth-space/rare-severe-solar-storm-northern-lights-alabama\nhttps://www.spaceweather.com/archive.php?view=1&day=10&month=05&year=2024\nCattle mutilations made by plasma balls from space: https://electroballpage.wordpress.com/animal-mutilations-by-proximity-to-electroballs/", "media": null, "score": 22, "upvote_ratio": 0.67, "comment_count": 34, "over_18": false}, "48": {"id": "1cnjuou", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "EmrickFe", "link_flair_text": null, "time": 1715649695.7071378, "created_utc": 1715213996.0, "url": "https://i.redd.it/7udmpcqtnazc1.jpeg", "title": "Conspiracy theorists were right.", "permalink": "/r/conspiracy/comments/1cnjuou/conspiracy_theorists_were_right/", "selftext": "", "media": null, "score": 2256, "upvote_ratio": 0.88, "comment_count": 442, "over_18": false}, "49": {"id": "1cmlihf", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1715649695.9531305, "created_utc": 1715113039.0, "url": "https://www.youtube.com/watch?v=mr2E5w0Gg-I", "title": "Clear video footage of a UFO, with a strange design resembling Star Wars vehicles.", "permalink": "/r/conspiracyfact/comments/1cmlihf/clear_video_footage_of_a_ufo_with_a_strange/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Clear video footage of a UFO, with a strange design resembling Star Wars vehicles.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/mr2E5w0Gg-I?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Clear video footage of a UFO, with a strange design resembling Star Wars vehicles.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/mr2E5w0Gg-I/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 0, "upvote_ratio": 0.45, "comment_count": 0, "over_18": false}, "50": {"id": "1cmlprc", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "SlobbOnMyCob", "link_flair_text": "sierra sounds", "time": 1715649696.4817939, "created_utc": 1715113533.0, "url": "https://www.reddit.com/r/bigfoot/comments/1cmlprc/the_hard_truth_about_the_sierra_sounds/", "title": "The hard truth about the Sierra Sounds ", "permalink": "/r/bigfoot/comments/1cmlprc/the_hard_truth_about_the_sierra_sounds/", "selftext": "I've been seeing a lot of posts about the Sierra Sounds or 'Samurai Chatter' here and on other forums. Most discussions about the sound are positive and often over look a less well known fact about the sounds. Ron Morehead and others planted fake tracks around the area and tried to sell them off as being real. \nIn his book Grover discusses the sierra sounds: \"None of them claimed to have seen the creatures, but they did show me photographs of numerous tracks in the snow at the camp. These were some of the most obviously faked tracks I( have ever seen. The tape was analyzed by some univeristy sound speciliasts who determined that a human voice could not have made them; they required a much longer ocal tract. A sasquatch investigator later asked of these experts if a human could imitate the sound characteristics by simply cupping his hands around his mouth. The answer was yes. I do not know what these recordings actually represent, but given the circumstances they do not seem to merit any further investigation.\" (See Bigfoot evidence, Pg134)\nJeff Meldrum also recently discussed the fake tracks in an interview that can be found here. Though he is much nicer about calling them out. \nSo, sadly it appears that the Sierra Sounds, given the above are a dead end. \nWorks Cited: \n\nKrantz, Grover. Bigfoot Sasquatch Evidence, Hancock House Publishers, 1999.\n", "media": null, "score": 149, "upvote_ratio": 0.8, "comment_count": 215, "over_18": false}, "51": {"id": "1cppze8", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Conorfm101", "link_flair_text": null, "time": 1715649696.8837593, "created_utc": 1715458052.0, "url": "https://v.redd.it/b4wtepfjsuzc1", "title": "Bloated beaver corpse first discovered by my dad yesterday on the shores of Lake Huron. Reminded me of the Montauk monster photos!", "permalink": "/r/Cryptozoology/comments/1cppze8/bloated_beaver_corpse_first_discovered_by_my_dad/", "selftext": "Pretty wild.", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/b4wtepfjsuzc1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/b4wtepfjsuzc1/DASH_96.mp4", "dash_url": "https://v.redd.it/b4wtepfjsuzc1/DASHPlaylist.mpd?a=1718241696%2COTMzZjEzMGE2MDZiYzViZjQzMzFkOTdmMDUxZjYyNjJlZGFiZTdiZDNmZWEwNTc1MWY4MDFjZGJlYWExMGM2MQ%3D%3D&v=1&f=sd", "duration": 22, "hls_url": "https://v.redd.it/b4wtepfjsuzc1/HLSPlaylist.m3u8?a=1718241696%2CNzI0Yzg1MDExNjQ0ZTBiNDY1NTk3MjM2YTRmOTY1MTNhZTFjMGFiNDhiMGRlY2YzYTIwMjdjN2U0ZDk0ODg2Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 181, "upvote_ratio": 0.92, "comment_count": 29, "over_18": false}, "52": {"id": "1cqsu5n", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "casefilesofVJ", "link_flair_text": "Hairy Critter", "time": 1715649697.123159, "created_utc": 1715582622.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1cqsu5n/lamington_stone_thrower/", "title": "Lamington stone thrower", "permalink": "/r/Humanoidencounters/comments/1cqsu5n/lamington_stone_thrower/", "selftext": "Tom (2018, Qld, Australia)\nI (42M) was heading on a hike to Lamington national park with a woman I was seeing for a few months at the time, Belinda. She brought along her two boys 10 - 12. I had met them a few times l, but this was going to be a good bonding experience to see how we got along on an overnight adventure. I really liked B and I wanted to get serious with her. There was a lot counting on this. \nMy old boy used to bring me up to this campsite called Binna Burra our favorite hike was the Coomera circuit. You start on the top of the mountain with all the views then descend down into the valleys where there's lush rainforest, waterfalls and what not. Stunning place, teeming with an abundance of beautiful colorful birds, reptiles, these bright blue yabbies that lay scattered along the tracks, fireflies and a multitude of leeches and ticks. Pack deet. \nThe drive from Brisbane was good and the boys loved the drive up the mountain, Belinda not so much she apparently has a fear of heights I learned. \nThere were on and off showers and the track was slippery but we packed ponchos and the kids were having a blast as we set off on our trek. \nWe booked a safari tent up near the lodge and everything seemed to be going perfectly for our weekend getaway. \nWe were about a half way through the hike when the youngest boy slipped and hurt his knee as we were crossing a creek. It was only a graze, but I think the shock of getting a bit wet and the panic made him a bit emotional and he was crying for a bit. I cleaned up the scrape and put on some bandaids and decided to carry him on my shoulders for a bit until he felt better. \nBelinda was acting quiet, and I thought maybe she wasn't enjoying herself, she was laughing and joking around just before. I thought maybe I did something wrong or she was upset her son got hurt. \nI asked if she was good and she nodded and smiled and went along gazing around quietly. \nWe started heading up the mountain for a bit and as we were walking we could hear something thundering through the trees towards us, branches snapping, loud bangs, impacts. We look up the hill to see a large stone the size of a basketball flying down just ahead of us on the trail. \nWe watched as it bounced across our path, hitting into a tree and continuing down the hill. \nI warned everyone to watch out, sometimes with erosion rocks can fall. I was honestly shaken, a rock like that could easily kill someone if it hit them. \nWe continued walking, keeping an eye on the hill above for more rocks and debris as we zig zagged up and around the mountain. Only five minutes later another rock came crashing down, this one further away, but it was followed by another that was coming right towards us, we had plenty of time to get out of the way, but if we weren't paying attention…\nWhen the third came I knew something was up, this wasn't right, someone was throwing these rocks down the mountain, it didn't feel like a natural occurrence, the way they were spread out. It didn't make sense. \nI shouted up the mountain that if it was someone doing that to stop, there's hikers. \nIn response another rock flew down towards us. \nI screamed out that they were going to kill someone and that we had children with us.\nTwo more large boulders crashed down the hill leaving a trail of destruction. \nWe heard shouts of another three or four people, another group of hikers further down the hill shouting out the same complaints as us. \nA man ran up ahead until he was in shouting distance and called out to us. \nAnother stone came crashing down and by this point the kids were crying and Belinda was shaking. \nI told them to stay there and that I would run up ahead. And I did just that. I started running up the hill, until I couldn't breathe any longer. I reached where the zig zag ended and continued along the mountain ridge and no one was there. I went up and down the trail until I reached an elderly couple sitting on a bench at a look out. \nI talked to them for a few minutes asking if they saw anything or any other hikers. They said they hadn't. That they had come from the opposite way and hadn't seen anyone for ages, a guided tourist group a few km back the other way, but too long ago to be the culprits. \nI went back down to Belinda and the kids, by this time they were with the other hikers and we did the last leg of the journey together. We caught up with the old couple as well near the exit. \nOnce we left the group with some of the other hikers bombarding one of the rangers we headed toward the shower blocks. Belinda pulled me aside once she had the kids organized and she told me that she didn't want to stay there overnight. \nI was a bit shocked. Earlier when we arrived she said she loved the safari tents and we had plans to sit around the fire and have a nice BBQ dinner. \nI asked her why and she said she didn't feel comfortable. I assured her no one would try messing with us around the campsites and it was probably just some stupid teenagers and they wouldn't be a nuisance up near the campgrounds and lodge (stupid teenagers within a year of this burnt the lodge to the ground). \nShe told me she didn't think it was teenagers. I asked her why she thought that and she said that when her boy had slipped in the water and was crying she said she thought she saw something. She said it was big and brown and when her eyes first scanned past it she thought it was just a part of the forest, like a log or a rock, but as she moved her eyes past it again, it moved. This thing she said was bigger than me and hairy, but also covered in moss and grandfathers beard and leaves so it blended in. She said she only saw it for a moment. \nShe brushed it off as just a trick of the mind, she said she knew it wasn't but she was trying to convince herself as we walked. \nI asked her why she didn't say anything and she told me she didn't want to scare the kids. Then went on to say that after the rock thing she was even more freaked out. \nI didn't know what to think and I have to admit I acted a bit pouty with her, which she was not impressed by. \nAfter we had showered and dressed she told the kids that we were going home tonight. They seemed disappointed, but didn't put up too much of a fuss. The afternoon had rattled them.\nIt was a quiet drive home and the kids were asleep by the time we reached the bottom of the mountain. \nI dropped them home and apologized to Belinda for the trip not working out that great. \nShe was in brighter spirits now we were off the mountain and thanked me so much for the day and for planning such a special weekend for her and the kids. \nWe ended up seeing each other more and eventually moved in with each other. We got married this January. \nNow after some time has passed, my wife and I have talked this over. \nWe have three theories. \n1/ It was some pesky teenagers hiding off the trail. \n2/ That friendly old couple wasn't as friendly as they seemed. \n3/ There's something weird and big up in those mountains and it likes to throw rocks at hikers. \nMy wife thinks it's option three, I'm heading closer toward option two.\nI did some research and told her that if it was a bigfoot creature she would have smelt it and that the smelliest thing out there was her feet. \nIn conclusion, we usually choose the beach over bushwalks now regardless of whether it was people or unknown cryptids, it kind of spoiled the fun of taking my family out for hikes in one of my favorite places in the world. \nI might go back one day, probably just by myself. I have done those hikes countless times before with no issues, but you best believe I'm going to be keeping a very good lookout for big hairy mountain men. \n.VJ", "media": null, "score": 41, "upvote_ratio": 0.93, "comment_count": 9, "over_18": false}, "53": {"id": "1cnvl9m", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "lisanaffziger", "link_flair_text": null, "time": 1715649697.349184, "created_utc": 1715256211.0, "url": "https://i.redd.it/zb7vg4gc5ezc1.png", "title": "Fresno Nightcrawler", "permalink": "/r/cryptids/comments/1cnvl9m/fresno_nightcrawler/", "selftext": "", "media": null, "score": 94, "upvote_ratio": 0.98, "comment_count": 7, "over_18": false}, "54": {"id": "1cne6cq", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Immediate-Patient-31", "link_flair_text": null, "time": 1715649697.7166114, "created_utc": 1715199190.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1cne6cq/my_savior_cinnamon_the_pit_bull/", "title": "My savior, Cinnamon the Pit Bull", "permalink": "/r/LetsNotMeet/comments/1cne6cq/my_savior_cinnamon_the_pit_bull/", "selftext": "This happened when I was back in high school. It was a Wednesday night. Usually on Wednesday’s, I would have youth group at my church, and my mom would have “date night” with her mom where they’d go play cards, watch tv together, etc. This would mean that we’d be gone until 9-9:30 every Wednesday night. \nFor whatever reason, both of us decided to stay home this night. I was downstairs in my moms room in the basement watching tv with her. We also had a roommate at this time, and Cinnamon was his dog. The roommate was gone this night (he was a night owl) so when he was gone, Cinnamon would sleep with one of us. I slept on a full sized futon frame at this time, so even though it was a tight fit for myself and a big old pit bull, I always took the opportunity to have her sleep with me. She was (and is still) a great dog. \nIt was about 8/8:30, (keep in mind we usually wouldn’t be home at this time, and our roommate was not home either) and I decided to head to bed. \nThe way our house was set up, was you’d go up a set of stairs, hit a landing, and then go up another set of stairs and you’d be looking through the kitchen and living room and you could see the front door. \nSo Cinnamon and I are walking up the stairs to my room, and we hit the landing. As soon as we do, Cinnamon barks a LOUD bark, and books it up the other flight of stairs. I look up and see her booking it through the kitchen and as I do, our front door BURSTS open, swings wide, and hits the wall, and I see a man in all black, with his hood up and black gloves on, running out the door frame, through our porch/entryway, down our front steps and away on the sidewalk. Cinnamon stood barking at our screen door to our porch. It was a fast, loud, shocking event. \nIt was winter, and pitch black so I didn’t see much else because it was dark and happened so fast, but I ran over and slammed the front door shut and locked the deadbolt and then took Cinnamon and went to my room and locked my bedroom door. I called my mom and told her what happened from upstairs and she just told me to lock the door and stay in my room. \nThat night I didn’t sleep much, I was keeping an eye out for any noise or footsteps outside my window, and I swore I heard something things, but ultimately\nnothing else happened. \nI spent the night snuggled up to Cinnamon, thanking her for protecting me and being a “scary” pit bull (even though she was so gentle always) and I’ll never forget that. \nSo man who broke into my house as I went to bed, I’m glad we never met again. ", "media": null, "score": 94, "upvote_ratio": 0.9, "comment_count": 7, "over_18": true}, "55": {"id": "1cqjjek", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "2201992", "link_flair_text": null, "time": 1715649698.4656463, "created_utc": 1715552030.0, "url": "https://i.redd.it/9rerebzyk20d1.jpeg", "title": "Went to the Cemetery for a Walk. While checking out this grave that was knocked over by what I assume to be wind I smelled some strong Cigarette Smoke. No one was around me. It was a pretty cool experience. ", "permalink": "/r/Ghosts/comments/1cqjjek/went_to_the_cemetery_for_a_walk_while_checking/", "selftext": "", "media": null, "score": 190, "upvote_ratio": 0.8, "comment_count": 38, "over_18": false}, "56": {"id": "1cmjgex", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "twisted_stinkeye", "link_flair_text": "Glitch Vid", "time": 1715649698.7335498, "created_utc": 1715107913.0, "url": "https://v.redd.it/k4xwj61dw1zc1", "title": "Glitch video?", "permalink": "/r/GlitchInTheMatrix/comments/1cmjgex/glitch_video/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/k4xwj61dw1zc1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1196, "width": 720, "scrubber_media_url": "https://v.redd.it/k4xwj61dw1zc1/DASH_96.mp4", "dash_url": "https://v.redd.it/k4xwj61dw1zc1/DASHPlaylist.mpd?a=1718241698%2CYzM3MjJhN2E2MDUyMGUxYjI5NjM4YWQyZDliYjZiMmU5ZGJhOWVmZjhjZjI3OGE2MTAwMDNhOTBmZjRkNDUxZQ%3D%3D&v=1&f=sd", "duration": 17, "hls_url": "https://v.redd.it/k4xwj61dw1zc1/HLSPlaylist.m3u8?a=1718241698%2CM2RmMjc0ODliMmQ3ZDQ2ZmQzMDA2Yjg4NWQxMDZhYTEyNjQ4MmJlYWU5OTYyNThkODEwZGRhYWE3N2M3NzQwMw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 186, "upvote_ratio": 0.96, "comment_count": 13, "over_18": false}, "57": {"id": "1cqh4o9", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "nunyanuny", "link_flair_text": null, "time": 1715649700.4322858, "created_utc": 1715545569.0, "url": "https://i.redd.it/y3uynfmr120d1.jpeg", "title": "Thoughts?! \"Project blue book\"? Idk", "permalink": "/r/ufo/comments/1cqh4o9/thoughts_project_blue_book_idk/", "selftext": "", "media": null, "score": 96, "upvote_ratio": 0.89, "comment_count": 59, "over_18": false}, "58": {"id": "1cnxnnv", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Gari_305", "link_flair_text": "Article", "time": 1715649701.68872, "created_utc": 1715262309.0, "url": "https://thehill.com/opinion/technology/4646417-top-senators-believe-the-us-secretly-recovered-ufos/", "title": "Top senators believe the US secretly recovered UFOs", "permalink": "/r/UFOs/comments/1cnxnnv/top_senators_believe_the_us_secretly_recovered/", "selftext": "", "media": null, "score": 1487, "upvote_ratio": 0.93, "comment_count": 273, "over_18": false}, "59": {"id": "1comqsj", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "anomalien_com", "link_flair_text": "News :illuminati:", "time": 1715649703.253352, "created_utc": 1715338629.0, "url": "https://anomalien.com/astronomers-say-the-first-alien-dyson-spheres-may-be-discovered/", "title": "Astronomers believe they have discovered 7 potential candidates for Dyson spheres that could have been created by extraterrestrial civilizations. Out of ~5 million original objects, only 7 potential Dyson spheres remain, and scientists believe that these are what they are.", "permalink": "/r/aliens/comments/1comqsj/astronomers_believe_they_have_discovered_7/", "selftext": "", "media": null, "score": 673, "upvote_ratio": 0.92, "comment_count": 143, "over_18": false}, "60": {"id": "1cnba6h", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Few-Try-2056", "link_flair_text": null, "time": 1715649703.4608638, "created_utc": 1715191893.0, "url": "https://www.reddit.com/r/UAP/comments/1cnba6h/in_new_document_aaro_explores_forced_perspective/", "title": "In new document AARO explores forced perspective and parallax effects in observing UAPs", "permalink": "/r/UAP/comments/1cnba6h/in_new_document_aaro_explores_forced_perspective/", "selftext": "The All-Domain Anomaly Resolution Office (AARO) has published a new paper addressing the impact of forced perspective and parallax effects on observations of unidentified anomalous phenomena (UAP). Their paper, “Effect of Forced Perspective and Parallax Viewing on UAP Observations,” offers insight into how these optical illusions can distort estimates of UFO size, speed, and location, providing important context for the public and analysts. They shared the document via X in the following post.\n​\nhttps://www.ovniologia.com.br/2024/05/em-novo-documento-aaro-explora-perspectiva-forcada-e-efeitos-de-paralaxe-na-observacao-de-uaps.html?m=1", "media": null, "score": 19, "upvote_ratio": 0.7, "comment_count": 21, "over_18": false}, "61": {"id": "1cpn2n3", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "wichuks", "link_flair_text": null, "time": 1715649705.0925047, "created_utc": 1715449880.0, "url": "https://i.redd.it/6f41jof85uzc1.jpeg", "title": "thoughts?", "permalink": "/r/conspiracy/comments/1cpn2n3/thoughts/", "selftext": "", "media": null, "score": 2045, "upvote_ratio": 0.88, "comment_count": 257, "over_18": false}, "62": {"id": "1cnlvxv", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Expert-Ring2532", "link_flair_text": "what is it?", "time": 1715649705.785236, "created_utc": 1715219987.0, "url": "https://www.reddit.com/gallery/1cnlvxv", "title": "Hudson Valley Mom & Baby", "permalink": "/r/bigfoot/comments/1cnlvxv/hudson_valley_mom_baby/", "selftext": "I recently saw these images on instagram on the account titled thesquatchisreal. I’ve got to say that they look very authentic and claim to be from a trail cam taken in Hudson Valley NY. Does anyone know anything about these images and have they seen them before? I took screen captures from the instagram post.", "media": null, "score": 113, "upvote_ratio": 0.85, "comment_count": 40, "over_18": false}, "63": {"id": "1cmzxth", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Mamboo07", "link_flair_text": "Art", "time": 1715649706.2840922, "created_utc": 1715158623.0, "url": "https://i.redd.it/xykx2ap436zc1.jpeg", "title": "Ningen, Stalker of the Cold South (Art by willthebao)", "permalink": "/r/Cryptozoology/comments/1cmzxth/ningen_stalker_of_the_cold_south_art_by_willthebao/", "selftext": "", "media": null, "score": 177, "upvote_ratio": 0.92, "comment_count": 15, "over_18": false}, "64": {"id": "1cnpha3", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Jeciew", "link_flair_text": "Humanoid", "time": 1715649706.5032008, "created_utc": 1715231914.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1cnpha3/humanoidharry_potter_warewolf_looking_type/", "title": "Humanoid/Harry Potter ware-wolf looking type creatures my friend saw one night in Oregon.", "permalink": "/r/Humanoidencounters/comments/1cnpha3/humanoidharry_potter_warewolf_looking_type/", "selftext": "So this happened to my friend, not me in 2007. But shes here next to me recounting her story and I am typing it out and posting it for her because she doesn’t have reddit. Sorry it’s long, but I want to share as many details as possible to hear your thoughts about it. We’re adults now, and this happened to her when she was 16. To this day she describes what she saw in the exact same as she had right after it happened, and can still clearly picture it. So here goes: \nShe was walking home from her friend’s house at night. This is a town in Southern Oregon (in case that’s important?). She doesn’t remember the exact time but says it was definitely after midnight and it was dark and no one else was out. (She says she was completely sober, and not sleep deprived.) So shes on her way home and just about 2 blocks from her house. She was walking on the sidewalk along the main street and was crossing between 5th and 6th street, (her house is on 7th.) Across the street is a Safeway and a cemetery. Right then she noticed something about 50 feet ahead of her crossing the street from the cemetery side to the side she was on. This is how she describes it:\nThere were two creatures things walking on their hind legs, side by side. One was slightly shorter than the other, but they were both really tall, at least 7ft. They were hunched over, lanky, and extremely skinny. She says her immediate first thought was they looked almost like deer walking on their hind legs, but they didn’t have any fur. It was more like a dark grayish skin. They held their arms and wrists kind of like how a t-rex would, but their arms and hands were very long, almost as long as their legs. When I asked, She said she didn’t see any tails. I asked her if they had hooves and she says she thinks so, but can’t remember that part for certain. Everything was quiet and she didn’t hear them making any sounds on the pavement as they walked. I asked her if they had antlers or deer like shaped faces (me thinking that maybe it actually was just hairless deer walking on their hind legs for some reason). She said no antlers, and their heads were not shaped like a deers… or any animal… but more like a persons. She describes their faces as looking human, with human features, but something was just slightly “off”. \nShe had frozen where she was as soon as she saw them. Everything was quiet and there were no cars driving by or anyone else around… which is normal at night in our small town. She says she stood there kind of in shock. She watched as the two creatures slowly walked side by side, silently, from across the street and over to the side of the street she was on. She says they didn’t seem to see her at all, or if they did notice her, they didn’t act at all like they did. She says they acted as if they were simply a couple going on a casual night stroll together. She doesn’t remember feeling any negative energy or vibes, she just felt fear because she was pretty damn scared. As soon as they finished crossing the street they continued strait down 6th street, and she couldn’t see them after they passed the first house and kept walking down. At that point she said she snapped out of the shock and started running the one more block towards 6th street to see where they were going. Once there she turned down 6th street to follow them, but they were completely gone. She doesn’t know where they could have possibly gone that fast considering they we’re just walking (and not walking fast- but like i said- almost as if the two of them were just out on a casual night stroll). As soon as she realized they had somehow disappeared out of nowhere, she started running as fast as she could the one more block to her house on 7th street. She told her mom and sister the next morning. \nShe says these creatures were like nothing she has ever seen or heard of before. The closest thing she can compare it to is the ware-wolf that professor lupin changes into in the harry potter movies- hairless, super lanky and hunched over strangely, except these ones had more human like heads/faces than a wolf. \nShes only ever told her family and a few friends, me being one of them. Oh and also she has no history of any mental illnesses. But whenever i ask her about it she describes it the exact same way and is still pretty shook up when she thinks about it. Nothing like that has happened to her before then or since then. \nAnyone know what this could be? Ive heard about “Notdeers” on reddit, but I’m not sure that really fits because i think those are more animal like shaped and usually on all fours. If you guys have any questions I will ask her and get back to you! Any input would be greatly appreciated! Thank you. ", "media": null, "score": 29, "upvote_ratio": 0.73, "comment_count": 15, "over_18": false}, "65": {"id": "1cpy0ek", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Ugenia123", "link_flair_text": null, "time": 1715649706.7482564, "created_utc": 1715482382.0, "url": "https://i.redd.it/fbbhbeovtwzc1.jpeg", "title": "I made a cryptid themed deck of cards. ", "permalink": "/r/cryptids/comments/1cpy0ek/i_made_a_cryptid_themed_deck_of_cards/", "selftext": "I had never seen a cryptid themed deck of playing cards so I made it.", "media": null, "score": 71, "upvote_ratio": 0.94, "comment_count": 3, "over_18": false}, "66": {"id": "1cq1vui", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Best-Influence9484", "link_flair_text": null, "time": 1715649707.1190856, "created_utc": 1715497100.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1cq1vui/bloody_man_with_a_bloody_knife_outside_my_work/", "title": "Bloody man with a bloody knife outside my work. ", "permalink": "/r/LetsNotMeet/comments/1cq1vui/bloody_man_with_a_bloody_knife_outside_my_work/", "selftext": "This happened a long time ago. I was about petite and small girl and I was only about 18-19 years old and I worked at a Jr. Food store in Kentucky. There was a couple incidents that happen to me in the short time I worked there. I have several other stories but those are for another time. \nThe store was somewhat isolated and I was left all alone for most of my shifts. My manager, who happened to be married, and another employee that happened to be my managers best friend would leave to meet with their boyfriends. Some of my duties consisted of sweeping the parking lot and measuring the gas after closing at midnight. I hated doing this by myself. There weren’t any other businesses open anywhere close to me. This was back around 1984 so of course there were no cell phones. \nI was very naive at the time. One night I received a phone call from a man asking if we had any playboy magazines. I informed him that yes we do and Playboy and a few other magazines. He asked me who was the centerfold in the Playboy. The phone I was using a cordless phone at the time. I politely told him to wait just a minute. I looked in the magazine and told him the name of the model.He then asked me if her p&$8y looked juicy. I froze and hung up on him. Thank goodness he didn’t call back. It scared me so bad and I really felt like and idiot for even looking the centerfold up for him. \nThe second incident was a lot scarier than the previous one. When I was hired I had been instructed to call the police if anyone stayed out in the parking lot for more than 15 minutes. There weren’t  many people that came into the store after dark and that night I was scared for my life, it was no difference. \nI had completed my duties at the time andI was just waiting until I could close the door and go home. A man pulled up right in front of the door in a light colored car. I have never been able to distinguish the make and model of any car. I waited for him to come in, happy that someone would break the silence of my shift. I could see him as I stood by the cash register. \nHe was leaning over, looking at himself in the rearview mirror. He continually wiped his face with his hands. I couldn’t see anything on him from where I was standing. I immediately got a really bad feeling about what he was doing. When he had pulled up, I had glanced at the clock and time crept by as I watched him wipe his face over and over. I waited 15 minutes and then called 911 and told the dispatcher about the situation.  In no time, two police cars pulled up and confronted the man. I watched them handcuff him but didn’t see anything else due to the fact another customer came in to buy some gas. It seemed like forever before one of the offices came in to thank me for calling them and to ask if I was ok. What he told me next made a shiver run through me and my blood ran cold. \nHe informed me that the man had been wiping blood of his face and there was a huge butcher type knife with the handle broken off and it was covered with blood as well. He said the man appeared intoxicated and since his car was running, they arrested him for DUI. The officer added that they had contacted his family and everyone appeared okay.  He added that they didn’t know whose blood it was but they would continue to investigate to see if they could find someone that he had apparent hurt or killed. I never heard anything in regards to the case. I realized that anything could have happened to me that night and I quit shortly afterwards. So phone guy and bloody guy with a blood covered knife, let’s not meet again. ", "media": null, "score": 66, "upvote_ratio": 0.91, "comment_count": 7, "over_18": true}, "67": {"id": "1cqumw4", "locked": true, "subreddit": "ghosts", "stickied": true, "category": "Paranormal", "author": "GhostsMods", "link_flair_text": "Paranormal Community [Discussion]", "time": 1715649708.2804332, "created_utc": 1715590496.0, "url": "https://i.redd.it/h36kjdwcr50d1.jpeg", "title": "To anyone considering posting a video or image - READ THIS FIRST", "permalink": "/r/Ghosts/comments/1cqumw4/to_anyone_considering_posting_a_video_or_image/", "selftext": "The overwhelming majority of orbs have nothing to do with the paranormal. The incessant parade of dust, bugs, and other debris posted is proof of that reality. Therefore, it is necessary to revisit this problem. If you have a video of an 'orb' and you believe it's paranormal, it is strongly recommended that you read this post first.\nA basic understanding of the principles that create orb-like phenomena on camera can go a long way in preventing your post from being ridiculed in the comments and removed from the sub. Please take this generous opportunity to review the above-posted article and familiarize yourself with light play and focusing issues in photography and filmography.", "media": null, "score": 116, "upvote_ratio": 0.88, "comment_count": 1, "over_18": false}, "68": {"id": "1cockhm", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Glum_Rule2953", "link_flair_text": "Glitch Pic", "time": 1715649708.5532753, "created_utc": 1715301043.0, "url": "https://i.redd.it/uz5pcqunuhzc1.jpeg", "title": "How companies expect you to work for 3 cents an hour", "permalink": "/r/GlitchInTheMatrix/comments/1cockhm/how_companies_expect_you_to_work_for_3_cents_an/", "selftext": "", "media": null, "score": 76, "upvote_ratio": 0.87, "comment_count": 2, "over_18": false}}}