{"_default": {"1": {"id": "1f9tzax", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "METAMANCY", "link_flair_text": "Discussion", "time": 1725677525.972534, "created_utc": 1725561747.0, "url": "https://i.redd.it/riaqxu60d1nd1.jpeg", "title": "UAP Size Comparison", "permalink": "/r/ufo/comments/1f9tzax/uap_size_comparison/", "selftext": "Frankly, I'm ready for some 4k footage", "media": null, "score": 498, "upvote_ratio": 0.93, "comment_count": 173, "over_18": false}, "2": {"id": "1f6h7jv", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Electronic-Amount-29", "link_flair_text": "Video", "time": 1725677527.517159, "created_utc": 1725204658.0, "url": "https://v.redd.it/8w6hftz5v7md1", "title": "Boeing's Starliner crew are reporting hearing strange \"sonar like noises\" emanating from the spacecraft", "permalink": "/r/UFOs/comments/1f6h7jv/boeings_starliner_crew_are_reporting_hearing/", "selftext": "Crews on the International Space Station are trying to identify the source of strange noises reported by Boeing’s Starliner crew, who contacted Mission Control saying, ‘Houston, on two, we have a question about Starliner. We are hearing strange noises coming from the speaker, and we don’t know what’s causing it.’ The Starliner began emitting these ‘strange sonar noises,’ and astronauts on the ISS are working to diagnose the issue, which occurred on Saturday. Since the launched by Boeing on June 5th, the Starliner has faced several problems and significant challenges, temporarily stranding two astronauts. Due to safety concerns, Boeing’s Starliner is set to return on September 6th with no crew on board.", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/8w6hftz5v7md1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 640, "scrubber_media_url": "https://v.redd.it/8w6hftz5v7md1/DASH_96.mp4", "dash_url": "https://v.redd.it/8w6hftz5v7md1/DASHPlaylist.mpd?a=1728269526%2CYmQ1YzYxZjAzOWQxNzBlNDE5NzkxMmNiMjFjMWJmYjg3N2Q3MGIyYjRjY2UwNjA0NzUyMTM4MzMwMDZhNDMwYw%3D%3D&v=1&f=sd", "duration": 101, "hls_url": "https://v.redd.it/8w6hftz5v7md1/HLSPlaylist.m3u8?a=1728269526%2CYjZjZGNlYzc3M2MyMGYwYzgxMzg4MGFmZTQwMzBiNjBhZDhlODQ5NDQxMWY3NGUxYmU3ZTA0YmY2Yzc2NTMwYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4668, "upvote_ratio": 0.89, "comment_count": 636, "over_18": false}, "3": {"id": "1f5wqsr", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Sky5759", "link_flair_text": "Evidence :upvote:", "time": 1725677528.8156826, "created_utc": 1725136241.0, "url": "https://v.redd.it/ozqv1s9n62md1", "title": "\"It's called the Kumburgaz video, which is a close-up of a craft, so close that you can see the occupants. It is 100% real, and I was there as it was filmed.\" —Roger Leir \"This is 100% genuine footage\" —Jacques Vallée — retweetd by Joe Rogan ", "permalink": "/r/aliens/comments/1f5wqsr/its_called_the_kumburgaz_video_which_is_a_closeup/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/ozqv1s9n62md1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 768, "scrubber_media_url": "https://v.redd.it/ozqv1s9n62md1/DASH_96.mp4", "dash_url": "https://v.redd.it/ozqv1s9n62md1/DASHPlaylist.mpd?a=1728269527%2CMDFiZjNlODVkZTA4NGFjMjgzNTM5ODhlYmUxMDE2MjFjMWE0ZTc1NDc4YzMxMWY3YmFkOTUyY2E2MjljM2Y2NA%3D%3D&v=1&f=sd", "duration": 26, "hls_url": "https://v.redd.it/ozqv1s9n62md1/HLSPlaylist.m3u8?a=1728269527%2CM2IxN2I3YmNkMmMzZWM3OTJjY2RmOWNmZGEyNDAwYmJlZWJhOTc0ZGM0NDkwZWEwMDk4ZjUyMWM4MzQ3YmI2ZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3253, "upvote_ratio": 0.87, "comment_count": 699, "over_18": false}, "4": {"id": "1f7k7tb", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "disclosurediaries", "link_flair_text": null, "time": 1725677529.0072725, "created_utc": 1725316941.0, "url": "https://www.reddit.com/r/UAP/comments/1f7k7tb/all_the_relevant_uap_updates_from_aug_26sep_01/", "title": "All the relevant UAP updates from Aug 26-Sep 01", "permalink": "/r/UAP/comments/1f7k7tb/all_the_relevant_uap_updates_from_aug_26sep_01/", "selftext": "This past week in Disclosure:\nAug 27 – A 10-month UAP study conducted off Long Island's coast produces notable findings\nThe study – Eye on the Sky: A UAP Research and Field Study off New York’s Long Island Coast – documented recurring luminous spheroids with extreme velocities and stationary behavior. These objects often appeared outside the visible spectrum, detectable mainly in infrared. Clearly not your typical aircraft or natural phenomena.\nKey observations include:\n\nLuminous spheroids, 1.5-3m in diameter\nExhibited extreme velocities and stationary periods\nOften undetectable in visible light, primarily observable in infrared (especially short-wave infrared)\n\nAug 27 – National Brazilian Archives releases ±900 documents reporting UFOs\nThe National Archives of Brazil released nearly 900 documents containing UFO (Unidentified Flying Object) reports from civilian airline pilots. According to the released material, the southern region of the country alone accounts for eight records, primarily in Rio Grande do Sul. In most cases, the reports involve more than one light or object. In at least ten instances, images of the sightings were taken, but they are not publicly available.\nAug 27 – Dr. Kirkpatrick officially severs ties with AARO as his successor is named\nThe DoD has confirmed to Liberation Times that the former director of the U.S. government’s Unidentified Anomalous Phenomena (UAP) office - the All-domain Anomaly Resolution Office (AARO) - Dr Sean Kirkpatrick, has stepped down from his role as an unpaid consultant to the office (a position he held whiole the DoD searched for a suitable permanent replacement).\nThe news comes as the AARO confirmed Dr. Jon T. Kosloski as its new director, nine months following Dr Kirkpatrick’s departure. \nAug 28 – Ross Coulthart joins the r/aliens subreddit for an AMA (Ask Me Anything)\nThe  with Ross Coulthart's presence, who was available to answer a variety of community questions.\nSome notable Q/As:\n\nQ: Is there any merit to the claim that in 2004 there was a blue-on-blue fire fight between a JSOC unit and a Lockheed Martin Recovery Team over UAP craft resulting in the death of two JSOC members?\nRoss: Yes. [...]  And that's not the only incident.\nQ: Matthew Pines said a significant figure in American public life is going to come out and make a statement that will push forward disclosure. Are you aware of this and do you have any idea of who it could be?\nRoss: Yes. Can't say anymore.\n\nSep 1 – Lue Elizondo's \"Imminent\" reaches #1 on the NY Times best-seller list\nAs of September 3rd, Lue Elizondo's new book on his background and experience delving into the UAP topic in an official capacity has reached the #1 spot on the NY Times best-seller list.\nLue has appeared on a variety of high profile news shows to promote his book and assert his claims regarding UAP. E.g. on CNN:\n\nCNN Host: \"Are you telling me that aliens are real?\"\nLue: “We have something that is made by non-humans\".\n\nThings to look out for in the near future:\nSeptember\n\nAccording to Senator Gillibrand – a public hearing in line with AARO's latest report can be expected soon, saying –\"I’m hoping July, and if not then September. But I’m trying to do July.”\nSpeaking with Askapol, Reps. Luna and Burchett indicated that the next UAP hearing is likely to come after the August recess\n\nBeyond/currently unknown\n\nFollowing the UAP hearing on the 26th of July, Members of Congress have called for a select committee with subpoena authority, to “go about the task of collecting information from the Pentagon and elsewhere” on unidentified flying objects. There have been conflicting messages from various Members of Congress on whether this is likely to happen anytime soon. Note – a select subcommittee was formally requested on March 13th.\nReps. Moskowitz, Luna, and Burchett have repeatedly stated their intent to hold field hearings to overcome stonewalling from the Pentagon and military establishment \"I think we [Congress] should try to get into one of these places [housing UAP evidence]...and if they won't let us in I think we should have a field hearing right outside the building...and the military will have to explain why that is.\" – Rep. Moskowitz (D) It is currently unknown when exactly we might expect that to occur, however as of Jan 12 – Rep. Luna confirmed: \"I feel confident that we have enough evidence to move forward with our first field hearing. We will be announcing details soon.\"\nSeveral journalists have indicated that first-hand witnesses of the alleged UAP legacy programs are in the process of providing testimony/evidence to the relevant authorities (e.g. the IC IG) and/or are on the verge of making public statements in the near future (Example 1, example 2, example 3, example 4)\nDavid Grusch has received additional clearances through DOPSR to discuss some of his (alleged) first-hand knowledge of Legacy programs. He has mentioned he may be covering more of this information in an upcoming Op-Ed\n\nSkimmed through this post but need a quick refresher on how we got to this point? Check out this handy Disclosure Timeline to get up to speed.", "media": null, "score": 30, "upvote_ratio": 0.94, "comment_count": 2, "over_18": false}, "5": {"id": "1f9w2oj", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "No_Beat_6355", "link_flair_text": null, "time": 1725677530.0552502, "created_utc": 1725566869.0, "url": "https://i.redd.it/v32g71k8s1nd1.jpeg", "title": "Any thougths?", "permalink": "/r/conspiracy/comments/1f9w2oj/any_thougths/", "selftext": "", "media": null, "score": 4608, "upvote_ratio": 0.96, "comment_count": 353, "over_18": false}, "6": {"id": "1f7ijyj", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "shylock92008", "link_flair_text": null, "time": 1725677530.864, "created_utc": 1725312657.0, "url": "https://i.redd.it/5m90753bsgmd1.jpeg", "title": "National Gary Webb Day is Today (August 31, 2024) RESPECT to the man who discovered that the drug war is a fraud. The USA brings with drugs in!!!", "permalink": "/r/conspiracyfact/comments/1f7ijyj/national_gary_webb_day_is_today_august_31_2024/", "selftext": "", "media": null, "score": 50, "upvote_ratio": 0.97, "comment_count": 4, "over_18": false}, "7": {"id": "1f6770n", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "RocketSkates314", "link_flair_text": "semi-related", "time": 1725677531.510667, "created_utc": 1725168964.0, "url": "https://v.redd.it/be96wc7ow4md1", "title": "I think this is the source of most high tree breaks. ", "permalink": "/r/bigfoot/comments/1f6770n/i_think_this_is_the_source_of_most_high_tree/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/be96wc7ow4md1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/be96wc7ow4md1/DASH_96.mp4", "dash_url": "https://v.redd.it/be96wc7ow4md1/DASHPlaylist.mpd?a=1728269531%2CNGE0MmY2OGU0MmE2ZGZjOGVmMzcyYzU0ODNlZWQzOGNkZWMyZmI2MTk4N2ExNzExMGMwN2E0NzE1NzAwNTU1Mg%3D%3D&v=1&f=sd", "duration": 24, "hls_url": "https://v.redd.it/be96wc7ow4md1/HLSPlaylist.m3u8?a=1728269531%2CMjQ2ZGZjNGU3MjJhODA1NTQ4MzBiY2ZiNGZmMjc2YmY0OTZkZmE2MTc1NmIxYTFkMWY2ZDA3YTc1YzMxM2ZmMg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1365, "upvote_ratio": 0.98, "comment_count": 122, "over_18": false}, "8": {"id": "1f5xh07", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1725677532.4442985, "created_utc": 1725138135.0, "url": "https://i.redd.it/4dx9idodd2md1.png", "title": "In 1959 a group of hunters allegedly killed a mokele-mbembe near Lake Tele. After eating the cryptid they all became sick and died", "permalink": "/r/Cryptozoology/comments/1f5xh07/in_1959_a_group_of_hunters_allegedly_killed_a/", "selftext": "", "media": null, "score": 1321, "upvote_ratio": 0.97, "comment_count": 108, "over_18": false}, "9": {"id": "1f64tyn", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Vivid_Plastic_741", "link_flair_text": "Flying Humanoid", "time": 1725677532.6956537, "created_utc": 1725160469.0, "url": "https://www.reddit.com/gallery/1f64tyn", "title": "Weird Flying Humanoid in Belarus, 1937.", "permalink": "/r/Humanoidencounters/comments/1f64tyn/weird_flying_humanoid_in_belarus_1937/", "selftext": "Location. Near Chashniki, Belarus.\nDate: 1937.\nTime: 11:00 a.m.\n7-year old Ludmila Chepik was shepherding some cows and collecting flowers on a meadow near the River Uloy when suddenly she saw a “man” descending from the sky towards her without a parachute. He descended to about 1 to 2 meters from her. The man was approximately 113cm in height (dwarf like), of athletic built, with broad shoulders and a disproportionately large head. He had a narrow waist, and something like heavy boots starting at the knees, like wide trousers, red in color. The man wore dark tight-fitting clothing. He had a helmet on his head, resembling that of an ancient Russian warrior. The helmet had a cone-shaped “bulb” shaped protrusion on top. His face was visible, reddish in color and was wearing something resembling a transparent visor. The entity spent approximately 1 minute with the witness. He opened his visor, produced a protracted smile at the girl, looked around, and touched the grass---he carried an oval device in his hands. After that, he waved his hands, and zoomed soundlessly up into the sky at high speed. After gaining an altitude of about 100 meters, he seemed to compress into a ball and dissolve into thin air.\nSource: Aleksandr Kuzovkin, Selected reports of UFO observations in \nThe USSR 1982.\nI colored The Sketches Of The Encounter.", "media": null, "score": 420, "upvote_ratio": 0.97, "comment_count": 35, "over_18": false}, "10": {"id": "1f638se", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "sillyflxx", "link_flair_text": null, "time": 1725677533.1626186, "created_utc": 1725155230.0, "url": "https://i.redd.it/tmhw0uf7s3md1.jpeg", "title": "What is this? ", "permalink": "/r/cryptids/comments/1f638se/what_is_this/", "selftext": "Hello! I don't know much about cryptids or anything, but a year back I saw a weird thing and wanted to ask what it could possibly be because I'm completely stumped. I saw this at Penn State University on May 15, 2023 at 9:21 PM. ", "media": null, "score": 887, "upvote_ratio": 0.91, "comment_count": 507, "over_18": false}, "11": {"id": "1f8jfyf", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "acid_brainz", "link_flair_text": "Ghosts/Apparitions", "time": 1725677533.2944171, "created_utc": 1725420390.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1f8jfyf/i_saw_the_ghost_of_my_dead_ex/", "title": "I saw the ghost of my dead ex. ", "permalink": "/r/Thetruthishere/comments/1f8jfyf/i_saw_the_ghost_of_my_dead_ex/", "selftext": "So my ex committed suicide over 2 years ago now. We were together very briefly, but knew one another for a long time- we went to festivals with friends. We didn’t work out and it broke my heart. \nI check in on his sister all the time, and there was a big concert that we traveled together to see over the weekend. (All our friends went too- and her brother would’ve if he was alive) \nHer and I weren’t extremely close before this weekend but I’ve known her for a long time and reach out as much as I can. She asked me if we wanted to carpool together because she was coming from a further away state. \nShe was an hour away from my apartment, so I decided to take a quick nap before I started the road trip. \nAs I dozed off in my couch I became aware of the room around me, almost like a sleep paralysis. I felt this intense pressure / weight on my body. It wasn’t scary but it was hella intense, sooo real. Then as quickly as he came, my ex was standing above me. I jolted awake.\nI told his sister about this, and she told me paranormal experiences her and her other brother have had after his passing. Her entire family have had paranormal experiences. She even told me about demons she’s seen- and what’s crazy is I saw a demon in her brother. (If you’re interested in that story, there’s a post I wrote awhile ago on my account) \nSometimes I hear him speak to me, over the weekend he told me he was sorry and thank you for taking care of his sister. Her and I really bonded over the weekend. She’s my sister for life now. ", "media": null, "score": 79, "upvote_ratio": 0.95, "comment_count": 18, "over_18": false}, "12": {"id": "1f7hqu5", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "BrilliantBex1992", "link_flair_text": null, "time": 1725677533.4616892, "created_utc": 1725310661.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1f7hqu5/the_reason_i_always_keep_all_the_doors_locked/", "title": "The reason I always keep all the doors locked", "permalink": "/r/LetsNotMeet/comments/1f7hqu5/the_reason_i_always_keep_all_the_doors_locked/", "selftext": "Back with another one, as I will likely post as I remember them. I’ve done so much healing this last year that buried memories keep resurfacing, like this little gem. \nThis was some years ago, when I was living in a different city. I hadn’t really been on my own all that long, and my housing situation fell apart at the last minute so I had to scramble to figure it out. Meaning, you guessed it: random roommates. Now, the year before I’d had a random roommate that was the most amazing person and ended up becoming a great friend, so I figured this would be the same. It was not, but that’s actually not the focus of this story. \nEnter the roommates: Ben, who I did actually know a bit from the previous year and was becoming friends with, Tom, and Mike. Now this was the very first couple days after move in and we’d all hung out to get to know each other better, but Tom and Mike hadn’t fully moved in yet. It was a big old house separated by floor, and the top level locked at the stairs. This is important to note. Ben and I lived upstairs with Tom and Mike downstairs.\nI’ve always been paranoid and definitely have good reason, so when I’m home all doors are locked. When I leave all doors are locked. I sleep with my bedroom locked. I was home alone with Ben at work and Tom and Mike sort of in and out moving stuff in. I’ll note here that both had a lot of expensive stuff, like in the five figure range. Well, I was watching something on my laptop in my room, bedroom locked and both entrances to my part of the house locked.\nI started hearing a lot of noise coming from downstairs, sounding like doors and cupboards opening, furniture moving etc and figured it’s just Tom or Mike, until I hear footsteps coming up the stairs. I was technically supposed to be somewhere at that time which they knew but it had been canceled last minute, so no one would have known I was home, and they had no reason to come upstairs when they knew both of us were supposed to be gone. That was when I got panicky, hearing them come closer and closer to the top of the stairs. \nI’ve never sat so still. Then the knob began to jiggle, I could hear it clearly as my room was closest to the entryway. At this point I’m on with 911 whispering that someone is in my house without giving away that I’m there to whoever it was.The house was super close to downtown and cops arrived in mere minutes but they were the longest of my life at that moment. \nThe downstairs was completely ransacked. Like something out of a movie. It was so surreal to see. They’d taken over $20k in electronics (honestly don’t remember the exact amount just about that I think),broken furniture and plates and stuff, even ripped through the mattresses. Turned out Tom and Mike had left a door unlocked when moving (this would not be the last time before I fled this house).\nThey were gone before the cops showed so I’d spend the next several months afraid they’d come back, though it would turn out to be the least of my future worries. So glad that I always lock doors. Considering the way downstairs looked I don’t know what they would have done to me. To whoever was on the other side of that (thankfully locked) door, let’s not meet", "media": null, "score": 294, "upvote_ratio": 0.98, "comment_count": 13, "over_18": true}, "13": {"id": "1f8187t", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "HamletX95", "link_flair_text": null, "time": 1725677533.6811395, "created_utc": 1725373404.0, "url": "https://i.redd.it/t7lbwpmyslmd1.jpeg", "title": "Edgar Allan Poe predicted the future. His only novel is about 4 shipwrecked men who run out of food and eat the cabin boy, Richard Parker. 46 years after it published, a yacht sank in real life and 3 of the 4 survivors also decided to eat the cabin boy... named Richard Parker.", "permalink": "/r/truecreepy/comments/1f8187t/edgar_allan_poe_predicted_the_future_his_only/", "selftext": "", "media": null, "score": 171, "upvote_ratio": 0.98, "comment_count": 8, "over_18": false}, "14": {"id": "1f7ztqk", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Voodevil", "link_flair_text": null, "time": 1725677533.8098931, "created_utc": 1725369776.0, "url": "https://www.reddit.com/r/threekings/comments/1f7ztqk/time_to_fuck_around_and_find_out/", "title": "Time To Fuck Around, And find out!", "permalink": "/r/threekings/comments/1f7ztqk/time_to_fuck_around_and_find_out/", "selftext": "Some of you might have seen my post about doing dangerous rituals.\nWell this month I'm going to do some, and I hope you all will be suggesting more, dangerous rituals.\nTo-Do list so far.\nLetter of intent (in Progress)\nMan In The Fields (currently not available for me)\nThree Kings (thrift shopping mirrors, later)\nWhat rituals do I refuse to do?\nAnything that involves hurting animals or other people is, absolutely off the table.\nGive me more rituals, and preferably ones that are rumored/\"proven\" to be dangerous to the one doing them, and I will share my findings.\nWho gets to know the results?\nThose who suggest rituals, will get the results.\nI won't be posting them as a post myself, in case it could convince someone to be dumb.\nBut those who get the results, can do whatever they wish with it.\nI aim to get answers about spirits, ghosts, demons, angels and anything that attaches or is summoned.\nIf the ritual seem to dangerous to post as a comment, throw it in my DM's.\nThank you all, for your contribution and/or support.", "media": null, "score": 21, "upvote_ratio": 1.0, "comment_count": 30, "over_18": false}, "15": {"id": "1f6t0n1", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "places_forgotten", "link_flair_text": null, "time": 1725677534.7150755, "created_utc": 1725235337.0, "url": "https://www.reddit.com/gallery/1f6t0n1", "title": "I explore abandoned places and never ever believed in spirits. I did this school in Japan and I know I was alone. See last pics", "permalink": "/r/Ghosts/comments/1f6t0n1/i_explore_abandoned_places_and_never_ever/", "selftext": "", "media": null, "score": 5762, "upvote_ratio": 0.91, "comment_count": 658, "over_18": false}, "16": {"id": "1f5ug9x", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "NonSenseNonShmense", "link_flair_text": "Glitch Pic", "time": 1725677534.870139, "created_utc": 1725130078.0, "url": "https://i.redd.it/rmd28ckfp1md1.jpeg", "title": "The trees are glitching again", "permalink": "/r/GlitchInTheMatrix/comments/1f5ug9x/the_trees_are_glitching_again/", "selftext": "", "media": null, "score": 206, "upvote_ratio": 0.88, "comment_count": 20, "over_18": false}, "17": {"id": "1f9pha1", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Sea_Sheepherder_", "link_flair_text": "Discussion", "time": 1725677535.8821223, "created_utc": 1725550754.0, "url": "https://www.reddit.com/r/ufo/comments/1f9pha1/i_found_2000_pages_of_mj12_documents/", "title": "I found 2000 pages of MJ-12 documents ", "permalink": "/r/ufo/comments/1f9pha1/i_found_2000_pages_of_mj12_documents/", "selftext": "https://archive.org/details/majiall337/2_05mar1942/mode/2up\nIf someone faked 2000 pages with accurate historical events , locations, dates, names, agencies, when/hows/whys ... then i take my hat to that person. BUT, i highly doubt it. This looks legit\nEDIT: ALERT : Someone is DDoSing me , thankfully my father and 2 brothers have degrees in PC/software engineering and we resolved this fast.   \nSide note : Of course it could be irrelevant to this post. ", "media": null, "score": 238, "upvote_ratio": 0.88, "comment_count": 90, "over_18": false}, "18": {"id": "1f7cw5v", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "PONETHEPOON", "link_flair_text": "Photo", "time": 1725677537.0651753, "created_utc": 1725298969.0, "url": "https://www.reddit.com/gallery/1f7cw5v", "title": "We saw a UFO on Friday night for about 2-3 minutes, photos, videos, and wife cried after", "permalink": "/r/UFOs/comments/1f7cw5v/we_saw_a_ufo_on_friday_night_for_about_23_minutes/", "selftext": "On Friday night my wife and I were sitting on the deck out back looking at the stars, we do this every night. Just after 10 pm my wife said \"is that a shooting star??\", which I found odd, because if it was I wouldn't have time to look at it. The tree near me was blocking the direction she was staring so I got up and looked, and my jaw dropped. I said \"Holy shit. Holy shit!!\" and we both jumped off of the deck and got into the yard for a better view.\nThe craft seemed huge, miles away, had tons of blinking and spinning lights, and a rotating orange/red light on the bottom. You can only see the orange/red light in the video. We observed it for 2-3 minutes as it continued flying away, and then it was just gone. No noise, it was just gone.\nFor the photos and videos, these were taken on my wife's Galaxy Fold 4, I think it's the 4 anyway. She's had it two years. I pulled out my S21 Ultra immediately and it died right in front of my eyes. I knew the battery was low, but I don't ever \"need\" my phone while we're on the deck, so pre-ufo I didn't care to go throw it on the charger. If only I'd known!!!!\nWhile I was taking the photos and videos I couldn't see shit on the screen because it has to process the night time photos, so I was pointing her phone in the general direction and taking tons of various zoomed photos and videos. What I have here is the best that came out of all that, this thing was really far away for a night time phone shot, so I'm pleased with what we did get.\nI've got \"the best shot\" first, which is the zoomed out one where you can see the craft and trees. Then I have a crop of that photo that I messed with the settings on to show up better. Two shitty photos as well. And two videos, one video is the original, and one I over-exposed to show the lights better. You see the craft right at the beginning, and then I zoom in around 10-14 seconds and you can really see the edge lights and rotating bottom. There's one additional video, which is a screen recording of me going through the video and really highlighting the rotation. EDIT: It's only letting me put photos in the post, I'll figure out how to put videos in the comments. I added two more photos that are screenshots from the video. One is a very dark original screenshot, the other is blue from me over-exposing it to pip out the lights.\nI don't believe this was Starlink, I've watched a ton of Starlink videos since observing this, and our lights were rotating/blinking, not a static line of unchanging lights.\nThis was August 31, 2024, Choteau Montana, between 10:10-10:15 pm.\nAfter we got inside to see what we actually captured, my wife was shaking and crying from the experience. It was kind of scary, I couldn't fall asleep until 4am and it was my night to do the early feed for our twin boys.\nWhat does everybody think? ", "media": null, "score": 3775, "upvote_ratio": 0.81, "comment_count": 993, "over_18": false}, "19": {"id": "1f8p4xk", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Moontorc", "link_flair_text": "Analysis Required :snoo_thoughtful:", "time": 1725677538.8683498, "created_utc": 1725442926.0, "url": "https://v.redd.it/t5ki6ndiirmd1", "title": "I rotated the Jonathan Reed Alien video and it looks like the eye is blinking", "permalink": "/r/aliens/comments/1f8p4xk/i_rotated_the_jonathan_reed_alien_video_and_it/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/t5ki6ndiirmd1/DASH_1080.mp4?source=fallback", "has_audio": false, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/t5ki6ndiirmd1/DASH_96.mp4", "dash_url": "https://v.redd.it/t5ki6ndiirmd1/DASHPlaylist.mpd?a=1728269537%2CMWUwNDQwM2NkMWFmYzc1ODdjZDdhYmI2YWU2ZDRmM2UzYmJiZWUwNTczNjAzN2M1YTY4NjdmZDc1OGZlNTVlMA%3D%3D&v=1&f=sd", "duration": 42, "hls_url": "https://v.redd.it/t5ki6ndiirmd1/HLSPlaylist.m3u8?a=1728269537%2CZjc0YTIxMzM3MTEzNzk3NmJkNWI3N2RmN2JjZWEzZjcyMzQ2Zjc0NjU1ZWZlODM2NjkwNGRjZjFiMDVlYmVlZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2301, "upvote_ratio": 0.83, "comment_count": 796, "over_18": false}, "20": {"id": "1f9shpl", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": null, "time": 1725677539.0804062, "created_utc": 1725558083.0, "url": "https://unidentifiedphenomena.com/topics/whats-next-for-uap-ufo-september-2024-update-of-major-events/", "title": "What's next in the world of UFOs and UAPs? Update September 2024 - main events ", "permalink": "/r/UAP/comments/1f9shpl/whats_next_in_the_world_of_ufos_and_uaps_update/", "selftext": "", "media": null, "score": 31, "upvote_ratio": 0.83, "comment_count": 10, "over_18": false}, "21": {"id": "1f8hx50", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Appropriate_Face9750", "link_flair_text": null, "time": 1725677540.3232846, "created_utc": 1725415833.0, "url": "https://i.redd.it/hu1stxl4bpmd1.jpeg", "title": "Same shit, different country.", "permalink": "/r/conspiracy/comments/1f8hx50/same_shit_different_country/", "selftext": "", "media": null, "score": 4290, "upvote_ratio": 0.96, "comment_count": 197, "over_18": false}, "22": {"id": "1f929cg", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1725677540.4907942, "created_utc": 1725478140.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1f929cg/three_videos_from_china_serbia_and_florida_usa/", "title": "Three videos from China, Serbia and Florida, USA, Clear video footage of a UFO.", "permalink": "/r/conspiracyfact/comments/1f929cg/three_videos_from_china_serbia_and_florida_usa/", "selftext": "Interesting UFO video scenes from different places, watch them and tell me what you think.\nThis UFO caused the closure of Hangzhou Airport, China. Looks like an exploratory mission.\nhttps://www.youtube.com/watch?v=Z6miMUgmGNE\nClear video footage of a UFO in the sky of Belgrade, Serbia - exciting scenes and details.\nhttps://www.youtube.com/watch?v=LLQ5js0f4js\nHuge UFO video footage over Venice Beach, Florida, May 7, 2022.\nhttps://www.youtube.com/watch?v=ZuizH40G9EU\nhttps://preview.redd.it/ph7cps3egumd1.jpg?width=639&format=pjpg&auto=webp&s=33a7ad7c25f536bc19332b09c7de52099380d80a\nhttps://preview.redd.it/4apggt3egumd1.jpg?width=639&format=pjpg&auto=webp&s=0ddfd2f4b9a859424a0ab2e1403d1fc2960efae2\nhttps://preview.redd.it/5zfurs3egumd1.jpg?width=639&format=pjpg&auto=webp&s=0949b36f5849be0207e10676500d19887faeb172", "media": null, "score": 5, "upvote_ratio": 0.99, "comment_count": 0, "over_18": false}, "23": {"id": "1f97s3i", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "RL7205", "link_flair_text": "bigfoot sign/cutout/statue/etc", "time": 1725677541.0978308, "created_utc": 1725492147.0, "url": "https://i.redd.it/f6oym7r1mvmd1.jpeg", "title": "Time to Believe…. Bigfoot/Mothman 2024", "permalink": "/r/bigfoot/comments/1f97s3i/time_to_believe_bigfootmothman_2024/", "selftext": "", "media": null, "score": 486, "upvote_ratio": 0.99, "comment_count": 11, "over_18": false}, "24": {"id": "1f5jvly", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Amazing_Chocolate140", "link_flair_text": "Art", "time": 1725677541.5555725, "created_utc": 1725098777.0, "url": "https://i.redd.it/9ysm0axc4zld1.jpeg", "title": "Nessie. I love this picture ", "permalink": "/r/Cryptozoology/comments/1f5jvly/nessie_i_love_this_picture/", "selftext": "", "media": null, "score": 583, "upvote_ratio": 0.98, "comment_count": 24, "over_18": false}, "25": {"id": "1f5nxvw", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "emilos260", "link_flair_text": "Troll or Gnome", "time": 1725677541.7810302, "created_utc": 1725112815.0, "url": "https://i.redd.it/4h5ixbia80md1.jpeg", "title": "Hooded green 'gnomes' seen near Wrzeszczyn, Poland, 1948 (full encounter in the comments)", "permalink": "/r/Humanoidencounters/comments/1f5nxvw/hooded_green_gnomes_seen_near_wrzeszczyn_poland/", "selftext": "", "media": null, "score": 213, "upvote_ratio": 0.99, "comment_count": 13, "over_18": false}, "26": {"id": "1f8y47n", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "dead_thing13", "link_flair_text": null, "time": 1725677542.136113, "created_utc": 1725468302.0, "url": "https://i.redd.it/8jvlgjb5ntmd1.jpeg", "title": "Thought you guys would appreciate my Mothman tattoo", "permalink": "/r/cryptids/comments/1f8y47n/thought_you_guys_would_appreciate_my_mothman/", "selftext": "", "media": null, "score": 320, "upvote_ratio": 0.98, "comment_count": 12, "over_18": false}, "27": {"id": "1f980eg", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "sulavavuo", "link_flair_text": "Picture/Evidence", "time": 1725677542.2956314, "created_utc": 1725492794.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1f980eg/little_forest_creature/", "title": "Little forest creature", "permalink": "/r/Thetruthishere/comments/1f980eg/little_forest_creature/", "selftext": "Hello! This is my first time posting in this sub and on reddit in general. I'd like to share a photo with you and hear your thoughts. \nSo, for the context, I was picking mushrooms in the nearby forest. I live in Finnish countryside so the forest was a big one with not a lot of people living in the area. I thought the forest looked nice so I took some photos. Later at home I took a closer look and I noticed something weird in one of them. It kinda looks like some weird lookig creature sitting on the branch. \nI shared a zoomed picture in the comments with imgur link. It's a mess of pixels so could be just a weird shaped stick or something. Anyways I wanted to share this with you!", "media": null, "score": 46, "upvote_ratio": 0.95, "comment_count": 16, "over_18": false}, "28": {"id": "1f97ljz", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Adam-51", "link_flair_text": null, "time": 1725677542.4773142, "created_utc": 1725491643.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1f97ljz/country_road/", "title": "Country road ", "permalink": "/r/LetsNotMeet/comments/1f97ljz/country_road/", "selftext": "Few weeks ago I was driving in the middle of nowhere, heading to one of my friends. My wife was sleeping next to me, while my teenage daughters were watching a movie in the back. Next to them, my toddler was playing with his toys. It was around 1 AM and I was nervous as the drive there seemed to last forever. The dirt road with no lights gave me chills, as all I could see around were only fields. \nThe road had many holes and I was trying to avoid them as much as I could. I was very focused on that when I saw in front of the car a luggage. It was in the middle of the road, on my side. On the other side, a car was parked, facing us. The car was completely in the dark, as there were no lights inside or outside of it. I did not want to drive over the luggage so my first instinct was to go out and move it. I was lucky to have my wife with me. She grabbed my hand and indicated me something on the right. One person was in the field, looking sometimes at his phone, reason for which my wife saw him in the first place. I turned my car around and I was ready to leave this road, when 2 people jumped in front of us, from the field. There was no space on the road, so I couldn't go without harming them. \n2 people were in front of my car. One luggage, a car and the person checking their phone in the field were behind us. I did not know what to do, so I did the only thing that I thought of. I just turned around again, facing the luggage and just drove over it. Fortunately there was nothing inside it to damage my car, so we got out of this situation completely unharmed. We arrived at my friend's house and everything was perfect and we had a great time there, however I still have chills when I am thinking about this incident. So, people from the field, let's not meet again. ", "media": null, "score": 173, "upvote_ratio": 0.99, "comment_count": 14, "over_18": true}, "29": {"id": "1f5o8kz", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "happypants69", "link_flair_text": null, "time": 1725677542.6603448, "created_utc": 1725113611.0, "url": "https://i.redd.it/qadp8cugc0md1.jpeg", "title": "80-year-old man cloned sheep via illegal animal parts to create, hunt enormous hybrid species", "permalink": "/r/truecreepy/comments/1f5o8kz/80yearold_man_cloned_sheep_via_illegal_animal/", "selftext": "", "media": null, "score": 138, "upvote_ratio": 0.92, "comment_count": 16, "over_18": false}, "30": {"id": "1f9bdca", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "lessonsNblessings", "link_flair_text": null, "time": 1725677542.7834296, "created_utc": 1725502479.0, "url": "https://www.reddit.com/r/threekings/comments/1f9bdca/oujia_board_experience/", "title": "Oujia Board Experience", "permalink": "/r/threekings/comments/1f9bdca/oujia_board_experience/", "selftext": "Court ordered for 3 months in a group home for legal reasons Im not going to dive into. \nTo spend the time I’ve created a ouija board out of some cardboard I found from the recycling bin. Found a triangle from a deodorant box which perfectly fits the board to use as a planchette. \nI have family members back in the Philippines who practice witchcraft. And I have had plenty of experience with using ouija boards in the past, so I know exactly what I’m getting into and the whole process\n ( Example: went to a well know hotspot in my area which was a lake, where an infamous murder happened. Took a vid of myself alone sitting by the docks, there was hundreds of frogs croaking at once by the time I got there which was normal. But as soon as I asked the board and requested for complete silence, immediately the frogs stopped croaking in unison. Pretty cool tbh, multiple more stories but I wont dive to deep into it for the sake of time) \nAnyways back to the story. \nI made the board N tried it out in my room shared by two other people, the planchette didn’t move however the environment around the house definitiely did over time. Items were getting knocked off the drawers, doors opening and closing, a shadowy figure seen multiple times in the closet and most notably a hand being seen inside the bathroom. Not an arm or full body just the hand can be seen peeking around the corner of the door, and if you’re inside the shower, above the shower door you can see it just waving and twisting its fingers, pretty dope. My fellow housemates have had their own personal experiences. Such as having nightmares, having somebody whisper their name in their sleep and seeing shadows figures in their closet. Even the staff members here have had their own sightings, two staff members were in their office having a discussion when the main door opened and closed violently repeatedly.\nMake matters more interesting this place used to be a covent for nuns back in the 70’s which transformed into a group home for recovering addicts and those under the penalty of the criminal justice system. Recently before this was a mens only group home, this housed only women and from word to mouth one of them overdosed here. \nAnyways just wanted to share my story to give others more insight on what ouija boards are capable of, very fun if you know what you are doing. Always be respectfull and close the portal when you are finished. Announcing you are done communicating and for whatever supernatural being is with you, to return wherever it came from. (I never closed the portal because I wanted other people here to experience some activity lol)\nTake care and be safe.", "media": null, "score": 5, "upvote_ratio": 0.86, "comment_count": 0, "over_18": false}, "31": {"id": "1f81fpf", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "places_forgotten", "link_flair_text": null, "time": 1725677543.267784, "created_utc": 1725373942.0, "url": "https://www.reddit.com/gallery/1f81fpf", "title": "Updated post ; original photo of the abandoned school in Japan. ", "permalink": "/r/Ghosts/comments/1f81fpf/updated_post_original_photo_of_the_abandoned/", "selftext": "Original", "media": null, "score": 2076, "upvote_ratio": 0.95, "comment_count": 299, "over_18": false}, "32": {"id": "1fa6upk", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "johnnypancakes49", "link_flair_text": "Glitch Pic", "time": 1725677543.453439, "created_utc": 1725597621.0, "url": "https://i.redd.it/6ec6fqwd41nd1.jpeg", "title": "I thought you guys would enjoy this photo i took.", "permalink": "/r/GlitchInTheMatrix/comments/1fa6upk/i_thought_you_guys_would_enjoy_this_photo_i_took/", "selftext": "", "media": null, "score": 178, "upvote_ratio": 0.95, "comment_count": 12, "over_18": false}, "33": {"id": "1f602op", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": null, "time": 1725677544.6766188, "created_utc": 1725145498.0, "url": "https://ovniologia.com.br/2024/08/lockheed-e-jsoc-travaram-batalha-sangrenta-por-ufo-em-2004.html", "title": "Did Lockheed and JSOC Engage in a Bloody Battle over a UFO in 2004?", "permalink": "/r/ufo/comments/1f602op/did_lockheed_and_jsoc_engage_in_a_bloody_battle/", "selftext": "", "media": null, "score": 217, "upvote_ratio": 0.9, "comment_count": 69, "over_18": false}, "34": {"id": "1f60yw0", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "NHI", "time": 1725677546.0180612, "created_utc": 1725148088.0, "url": "https://v.redd.it/adspif8v63md1", "title": "CNN anchor asks former head of secret gov't UFO program Lue Elizondo - \"Are you telling me that aliens are real?\" - Lue's answer - “We have something that is made by non-humans\".", "permalink": "/r/UFOs/comments/1f60yw0/cnn_anchor_asks_former_head_of_secret_govt_ufo/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/adspif8v63md1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 478, "width": 854, "scrubber_media_url": "https://v.redd.it/adspif8v63md1/DASH_96.mp4", "dash_url": "https://v.redd.it/adspif8v63md1/DASHPlaylist.mpd?a=1728269545%2CMDdkMjUxY2Y5ODAyNTg2MjFjODU3ZDNmY2ViODA2ZjA3Y2MwOTRlNDFmMjY1OTg4YzcwYWM5ODZiMGIyYmI2NQ%3D%3D&v=1&f=sd", "duration": 33, "hls_url": "https://v.redd.it/adspif8v63md1/HLSPlaylist.m3u8?a=1728269545%2CYTQwMGI0ZTk1OGUzMDM3MmJlMzc5YjEzZWQzZDFjNmMwYjRiNjdkNTBlMTZkN2NiNzYzOGE5OGJiZDgxMDE4Yg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3705, "upvote_ratio": 0.87, "comment_count": 869, "over_18": false}, "35": {"id": "1f9f00j", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "IkaIka239", "link_flair_text": "Image 📷", "time": 1725677547.8090675, "created_utc": 1725514609.0, "url": "https://i.redd.it/6fe9zftsbo2d1.jpeg", "title": "A statue depicting a three-fingered and five-fingered hand crossing with a DNA helix was discovered in Ambo Peru.", "permalink": "/r/aliens/comments/1f9f00j/a_statue_depicting_a_threefingered_and/", "selftext": "", "media": null, "score": 1694, "upvote_ratio": 0.93, "comment_count": 265, "over_18": false}, "36": {"id": "1f80xxf", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "TheGoodTroubleShow", "link_flair_text": null, "time": 1725677547.9516306, "created_utc": 1725372678.0, "url": "https://youtu.be/DyX0dNandc4", "title": "🔥TODAY, 12 pm, Pacific.  We are re-airing the livestream of the Long Island UAP investigators, adding new UAP footage not part of the original show.   Over 20 of the most compelling UAP videos I have ever seen.   These folks are doing incredible work.", "permalink": "/r/UAP/comments/1f80xxf/today_12_pm_pacific_we_are_reairing_the/", "selftext": "", "media": {"oembed": {"provider_url": "https://www.youtube.com/", "title": "The UAP Study That Changes Everything", "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/DyX0dNandc4?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"The UAP Study That Changes Everything\"></iframe>", "thumbnail_width": 480, "height": 200, "width": 356, "version": "1.0", "author_name": "The Good Trouble Show with Matt Ford #TGTS", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/DyX0dNandc4/hqdefault.jpg", "type": "video", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@TheGoodTroubleShow"}, "type": "youtube.com"}, "score": 27, "upvote_ratio": 0.87, "comment_count": 0, "over_18": false}, "37": {"id": "1f5rd74", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Mighty_L_LORT", "link_flair_text": null, "time": 1725677549.225292, "created_utc": 1725121928.0, "url": "https://i.redd.it/2s3b5hc511md1.jpeg", "title": "True Purpose of Work", "permalink": "/r/conspiracy/comments/1f5rd74/true_purpose_of_work/", "selftext": "", "media": null, "score": 3132, "upvote_ratio": 0.93, "comment_count": 372, "over_18": false}, "38": {"id": "1f6qw3b", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Vib_ration", "link_flair_text": null, "time": 1725677549.3967497, "created_utc": 1725229282.0, "url": "/r/Spiritualchills/comments/1f6jq8e/ever_gotten_chills_from_a_song_you_really_liked/", "title": "Ever gotten chills from a song you really liked, from being too cold or a moving movie scene?", "permalink": "/r/conspiracyfact/comments/1f6qw3b/ever_gotten_chills_from_a_song_you_really_liked/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.62, "comment_count": 0, "over_18": false}, "39": {"id": "1f5dtef", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "No_Visit_4355", "link_flair_text": "video", "time": 1725677549.9153354, "created_utc": 1725074327.0, "url": "https://v.redd.it/vrcjl0el3xld1", "title": "I'd imagine a bigfoot to look like this walking amongst normal sized people", "permalink": "/r/bigfoot/comments/1f5dtef/id_imagine_a_bigfoot_to_look_like_this_walking/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/vrcjl0el3xld1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 480, "scrubber_media_url": "https://v.redd.it/vrcjl0el3xld1/DASH_96.mp4", "dash_url": "https://v.redd.it/vrcjl0el3xld1/DASHPlaylist.mpd?a=1728269549%2CYjE3ZGJmMmViZWU0MDk2ZjhkYmIxODRhMzU4ZTE0MjE3ZmY2ODc0MDUwYzM0ZjBkYmJhZjQzZThkM2JmY2JlMw%3D%3D&v=1&f=sd", "duration": 58, "hls_url": "https://v.redd.it/vrcjl0el3xld1/HLSPlaylist.m3u8?a=1728269549%2CYjM1ZTA4Yjk3YmM5NDc5OTE5Yjg4ZTkxYWRmYjQzNDViNGFmMGI3NGUwNzUwN2Q2YTlhMTJjNGFmMmY1MTI0ZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 435, "upvote_ratio": 0.96, "comment_count": 74, "over_18": false}, "40": {"id": "1f9utfa", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "AnyAward666", "link_flair_text": "Discussion ", "time": 1725677550.4580963, "created_utc": 1725563816.0, "url": "https://i.redd.it/q9q1ern5j1nd1.jpeg", "title": "Why still no pictures of Bigfoot?", "permalink": "/r/Cryptozoology/comments/1f9utfa/why_still_no_pictures_of_bigfoot/", "selftext": "Can someone please explain why there are no definitive photos of Bigfoot yet? If scientists can photograph an orangutan why not Bigfoot?", "media": null, "score": 562, "upvote_ratio": 0.9, "comment_count": 365, "over_18": false}, "41": {"id": "1f6g64d", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Vivid_Plastic_741", "link_flair_text": "Flying Humanoid", "time": 1725677550.6839762, "created_utc": 1725201996.0, "url": "https://i.redd.it/5n84xc1an7md1.png", "title": "Weird Flying \"Nun\" in Italy, 1983.", "permalink": "/r/Humanoidencounters/comments/1f6g64d/weird_flying_nun_in_italy_1983/", "selftext": "Location: Val Trebbia, Emilia Romagna, Italy.\nDate: mid-April 1983.\nTime: 16:00.\nOn a beautiful afternoon the witness, Mr. A. was riding his ‘Aprilia’ trail motorbike on the dry bed of the Treibbia River, more or less in a locality called “Dolgo.” As Mr. A accelerated the motorbike on the stones of the river, he soon reached a speed of 60km/h when suddenly he noticed on his right near a wood at about fifty/seventy meters away a being of very unusual features. The witness described the figure as a sort of “flying nun” dressed in a long and dark-colored diving suit, apparently rigid and without folds. The figure also wore a sort of headdress or helmet that closely resembled the one worn by the nuns. The being flew faster than A’s motorbike and at a height of about twenty/thirty centimeters from the ground with its torso slightly bent forward. The bizarre flying figure covered a distance of one hundred and fifty/two hundred meters in about three or four seconds always remaining level to the ground, then it suddenly shot off into the nearby bush and disappeared from sight. It did not make any noise it did not disturb the waters of the river or dust from the ground. The whole encounter lasted about ten interminableseconds. Frightened, the witness immediately reversed and drove towards his house where he told his family what he had seen.\nSource: UFO e Alieni in Italia, Moreno Tambellini citing Archivio: CUN.", "media": null, "score": 163, "upvote_ratio": 0.96, "comment_count": 17, "over_18": false}, "42": {"id": "1f8a7vb", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "archangel-4444", "link_flair_text": null, "time": 1725677551.0835633, "created_utc": 1725394861.0, "url": "https://fenomenum.com.br/ufo/investigacao/chupacabras/imagens/animal1.jpg", "title": "Chupacabras, Rafard town, São Paulo state, Brazil. July 7th 1997, analogic camera with flash. Backstory on comments.", "permalink": "/r/cryptids/comments/1f8a7vb/chupacabras_rafard_town_são_paulo_state_brazil/", "selftext": "", "media": null, "score": 244, "upvote_ratio": 0.89, "comment_count": 85, "over_18": false}, "43": {"id": "1f75073", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "senku_E-MC", "link_flair_text": "Ghosts/Apparitions", "time": 1725677551.287853, "created_utc": 1725278492.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1f75073/very_polite_ghost/", "title": "Very polite ghost ", "permalink": "/r/Thetruthishere/comments/1f75073/very_polite_ghost/", "selftext": "i used to live near a place called battlefield (creative name). back in the 1400's a small conflict happened there and now there's a church located in the middle of where the battle took place. one day my dad took me there and as we're looking around I see a tall man come up to me and have a full on conversation with me, he told me about the church and the bible, I looked around and my dad was in a different room so I sit in one of the rows and keep listening. A good part of the conflict is that the church was attempted to set on fire during but was put out quickly, and as I hear footsteps from the room my dad was in i look up to him, he has the biggest frown I've ever seen, like inhumanely sad frown and his clothes look a lot more rugged and destroyed now with patches and poor sewing, he looks down, the frown disappearing for a second to smile at me, he frowns again and walks off to a room where they kept a perfectly preserved organ. my dad comes back to see me and I start telling him about the man I saw, the organ room has no way out and I never saw him leave so I take my dad to go see him and he's not there, gone entirely. We left quickly as he didn't believe me. When we went back again a few months later I swear I saw him but couldn't find him. I've been back multiple times and never found him again however, After I did some research into the church I find that when they attempted to burn the church down 2 people who were made to do it died in a tunnel under the church that was supposed to be their escape route but the end was blocked and one of their legs was burnt which cause them both to burn to death inside. Guess where that fucking tunnel was and still is to this day. The fucking organ room. I keep telling my parents that I swear this man was real, no one believes me and I'm skeptical myself as I was only about 7 but I remember every little word perfectly. If anyone wants an exact transcript I'll happily put in as a comment.", "media": null, "score": 40, "upvote_ratio": 0.95, "comment_count": 6, "over_18": false}, "44": {"id": "1f6mwg6", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Academic-Birthday-66", "link_flair_text": null, "time": 1725677551.4500659, "created_utc": 1725219124.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1f6mwg6/my_allotment_neighbour_wanted_to_harm_me/", "title": "My Allotment Neighbour wanted to harm me", "permalink": "/r/LetsNotMeet/comments/1f6mwg6/my_allotment_neighbour_wanted_to_harm_me/", "selftext": "I am a teenager who helps his dad out on the Allotment. If you dont know, an allotment is like a mini farm. You can plant veggies, have animals like chickens or rabbits to care for etc. This happened recently and this still creeps me out. In the evening, my dad says we need to go to the allotment to feed our chickens as he forgot to feed them earlier that day.\nIt was around 8pm when I agreed and went in the car and started driving. When we got to our allotment which is like a 15 minute drive, it was already dark outside, not alot but dark. I opened the gates to the allotment, let my dad drive in and then closed them. As i was about to though, i saw a black car outside. The car belonged to a guy that used to be chill with my dad but they both kind of fell off from talking to each other. My dad said he was becoming more mentally ill as the guy had a divorce and got his kids taken by the mother. The guy lives on the allotment now, even sleeping there. Remember theres other people too on this allotment area around 20 other ones. But there was no one else except me, dad and the guy.\nAfter my dad parked the car, we got out and started getting the food for the chickens out of the trunk. While my dad was doing that, i looked at his ex friends allotment only to see him staring at us, it was dark so i can only see a shadow of him but I knew he was staring at us. I had a gut feeling but i decided to ignore it.\nWe went to the allotment, fed the chickens and were about to go home until my dad almost forgot about something. He went to the shed at the end of the allotment to fetch something and i was going to enter but had a feeling to wait out instead. As i told my dad how much longer till he finds what he needed, i turned back to face our gate being opened. I didnt see it at first but saw the guy trying to enter our allotment quietly, he stared at me and slowly closed the gate before just disappearing.\nI didnt react or say anything, i just stood there. I thought of telling my dad but didnt want to scare him or something, in the end this isnt a horror movie where i should scream like a girl. When my dad left the shed, now we could go. As we were leaving, we heard a sound like a axe hitting wood non stop. We knew something was wrong, we quickly walked to our car, started it and went to the gate.\nI left the car, creeped out of the guy being around in the allotment. I quickly opened the gate and let my dad drive through. As i was closing the gate, i saw something that terrified me on the spot. The guy was just standing there, 20m away from me, looking at me. I couldnt see any details but just darkness on him. He was holding something in his hand, but then he just moved and went into some bushes. My dad got out of the car to lock the gate , he looked at the bushes through the closed gate, and rushed to his car.\nWhen we left and started driving, I told my dad if he saw what I saw, he said he saw him hiding in the bushes, squatting, looking at us. Dad said he saw him holding something too. Like a axe or knife. We left terrified but we tried to laugh it off, knowing we were probably close to being attacked, or worse, dead.\nWe came back to the allotment at the same time around 8pm a few days after what happened, we saw the guys car in the allotment and we knew we needed to be quick with feeding the chickens. As we did so, everything was going fine until as we were about to leave. My dad stopped me and we hid over a blue shed. My dad told me \"hes there, hes in the bushes\" My heart dropped. I told my dad where he was and he said 5 second walk and we were done. We quickly ran to the car, closed it and drove off. For a second, i saw him. He had a axe. He wanted to sneak up on us, harm us. He wanted to kill us.", "media": null, "score": 167, "upvote_ratio": 0.94, "comment_count": 25, "over_18": true}, "45": {"id": "1f9ohh8", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "sasbergers", "link_flair_text": null, "time": 1725677551.6532395, "created_utc": 1725548280.0, "url": "https://i.redd.it/kpoekepm80nd1.jpeg", "title": "Itzhak Bentov created the model for Consciousness used by the CIA but was later killed in the deadliest plane crash in American history.", "permalink": "/r/truecreepy/comments/1f9ohh8/itzhak_bentov_created_the_model_for_consciousness/", "selftext": "", "media": null, "score": 91, "upvote_ratio": 0.93, "comment_count": 11, "over_18": false}, "46": {"id": "1f7hs1r", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "HR_Weiner", "link_flair_text": "Is this undeniable evidence? You decide.", "time": 1725677552.3365252, "created_utc": 1725310744.0, "url": "https://v.redd.it/3dm1xz8nmgmd1", "title": "What do we think of this? Caught on security camera in a school on a Saturday. ", "permalink": "/r/Ghosts/comments/1f7hs1r/what_do_we_think_of_this_caught_on_security/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/3dm1xz8nmgmd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 848, "scrubber_media_url": "https://v.redd.it/3dm1xz8nmgmd1/DASH_96.mp4", "dash_url": "https://v.redd.it/3dm1xz8nmgmd1/DASHPlaylist.mpd?a=1728269552%2CZWY3M2MwNzhkZTc3Zjc3MGQ5ZmEyZWYxNDU4MTQzMzU3ZDhlMmQxZmVhYTRmOTlkZTNhMzA1YjdiMzIxY2NhMA%3D%3D&v=1&f=sd", "duration": 8, "hls_url": "https://v.redd.it/3dm1xz8nmgmd1/HLSPlaylist.m3u8?a=1728269552%2CZWI0YTFkNmJjYjRkYTA5NTY0ZjA2NTQ2ZTA5OWM1MWZiMjk5OTg2ZGViMjZkYjM4YjVlYWFlNDllNjBjODRlNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 436, "upvote_ratio": 0.93, "comment_count": 119, "over_18": false}, "47": {"id": "1f7k021", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "derf_vader", "link_flair_text": "Glitch Pic", "time": 1725677552.5079565, "created_utc": 1725316360.0, "url": "https://i.redd.it/w6dc46ec3hmd1.png", "title": "Lizard in almost the exact same pose as the lizard statue he's sitting on.", "permalink": "/r/GlitchInTheMatrix/comments/1f7k021/lizard_in_almost_the_exact_same_pose_as_the/", "selftext": "", "media": null, "score": 63, "upvote_ratio": 0.85, "comment_count": 8, "over_18": false}, "48": {"id": "1faejuc", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "zenona_motyl", "link_flair_text": "Article", "time": 1725677553.6511948, "created_utc": 1725627526.0, "url": "https://anomalien.com/ufo-disclosure-is-happening-now-but-not-as-you-imagined/", "title": "UFO Disclosure Is Happening Now, But Not As You Imagined", "permalink": "/r/ufo/comments/1faejuc/ufo_disclosure_is_happening_now_but_not_as_you/", "selftext": "", "media": null, "score": 214, "upvote_ratio": 0.9, "comment_count": 165, "over_18": false}, "49": {"id": "1f9wn0w", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "fed0ra_p0rn", "link_flair_text": "Clipping", "time": 1725677555.1668646, "created_utc": 1725568238.0, "url": "https://v.redd.it/2ecg4ay3u1nd1", "title": "Celebrity bodyguard \"BigHomie.CC\" says that a potential UAP whistleblower attempted to hire him as his bodyguard until he could testify in front of Congress. Says the whistleblower was going to testify that our moon and oceans are occupied by NHI.", "permalink": "/r/UFOs/comments/1f9wn0w/celebrity_bodyguard_bighomiecc_says_that_a/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/2ecg4ay3u1nd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1036, "scrubber_media_url": "https://v.redd.it/2ecg4ay3u1nd1/DASH_96.mp4", "dash_url": "https://v.redd.it/2ecg4ay3u1nd1/DASHPlaylist.mpd?a=1728269554%2CMDg5MWJjOGFjYmQzMmM2Mjg4NjU1NWIwNDI2MGI2ZmE4NDg4NDYzMzViYzJjNzE3MzExMGViOWJkMTQ3ODZiNg%3D%3D&v=1&f=sd", "duration": 112, "hls_url": "https://v.redd.it/2ecg4ay3u1nd1/HLSPlaylist.m3u8?a=1728269554%2CMDY5MmZmNjRlNjdhZTY2ZDlhYjVlYTkzMDVlOTVjMDAwMDhiNGY0NGMwZjg5Y2MwMGQ3YTA0NGJhMjNkZjM0MA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2904, "upvote_ratio": 0.88, "comment_count": 682, "over_18": false}, "50": {"id": "1f8yjug", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "a-controversial-jew", "link_flair_text": "Debunked", "time": 1725677556.9204516, "created_utc": 1725469323.0, "url": "https://v.redd.it/4h9xkloxptmd1", "title": "Clear Footage of an Orb UFO, 9:42 AM July 13th 2008, in the United Kingdom. ", "permalink": "/r/aliens/comments/1f8yjug/clear_footage_of_an_orb_ufo_942_am_july_13th_2008/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/4h9xkloxptmd1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 640, "scrubber_media_url": "https://v.redd.it/4h9xkloxptmd1/DASH_96.mp4", "dash_url": "https://v.redd.it/4h9xkloxptmd1/DASHPlaylist.mpd?a=1728269555%2CYWNhNzNiMTU4NTZlYWQ2ZDMxNTc1YzExZjU3YTU2YzUxYzZmODY2MTcwYWViYTlhODI0ZGQwODhmMmEwZDQxOQ%3D%3D&v=1&f=sd", "duration": 207, "hls_url": "https://v.redd.it/4h9xkloxptmd1/HLSPlaylist.m3u8?a=1728269555%2CYjBlNmMwN2IyMjllMTg5N2UyZGFkM2YzY2UwM2YyNzRkOTczZGIzNTllZGExNWNkOWIxYTk1YWFkYzE0ZWIwOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1108, "upvote_ratio": 0.73, "comment_count": 176, "over_18": false}, "51": {"id": "1f79zdw", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": null, "time": 1725677557.0884714, "created_utc": 1725291943.0, "url": "https://v.redd.it/ezczhmhq1fmd1", "title": "Exploring Methodologies for Determining Fact from Fiction (American Alchemy with Daniel Sheehan)", "permalink": "/r/UAP/comments/1f79zdw/exploring_methodologies_for_determining_fact_from/", "selftext": "", "media": null, "score": 16, "upvote_ratio": 0.77, "comment_count": 3, "over_18": false}, "52": {"id": "1f6w4gr", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "pacmanpill", "link_flair_text": null, "time": 1725677558.0494163, "created_utc": 1725244959.0, "url": "https://i.redd.it/tihex6317bmd1.png", "title": "The guy on the left was arrested and convicted for illegally selling missiles to Iran during the Reagan Administration. The guy on the right is a Fox News 'military analyst' who thinks Iran shouldn't have missiles. They're the same guy.", "permalink": "/r/conspiracy/comments/1f6w4gr/the_guy_on_the_left_was_arrested_and_convicted/", "selftext": "", "media": null, "score": 3064, "upvote_ratio": 0.97, "comment_count": 154, "over_18": false}, "53": {"id": "1f5vfvr", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1725677558.2249362, "created_utc": 1725132711.0, "url": "https://www.youtube.com/watch?v=dwBDUYl-Iig", "title": "Video footage of a UFO battalion, many mysterious lights above of the ocean.", "permalink": "/r/conspiracyfact/comments/1f5vfvr/video_footage_of_a_ufo_battalion_many_mysterious/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Video footage of a UFO battalion, many mysterious lights above of the ocean.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/dwBDUYl-Iig?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Video footage of a UFO battalion, many mysterious lights above of the ocean.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/dwBDUYl-Iig/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 2, "upvote_ratio": 0.67, "comment_count": 1, "over_18": false}, "54": {"id": "1f8q81o", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "200Dachshunds", "link_flair_text": "tattoo", "time": 1725677558.7838523, "created_utc": 1725447138.0, "url": "https://i.redd.it/ou99rej7wrmd1.jpeg", "title": "Another Bigfoot tattoo!", "permalink": "/r/bigfoot/comments/1f8q81o/another_bigfoot_tattoo/", "selftext": "I’m a tattoo artist and got to design and apply this tattoo recently.  So much fun!  ", "media": null, "score": 438, "upvote_ratio": 0.97, "comment_count": 24, "over_18": false}, "55": {"id": "1f5htwa", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "shsusnsnaj", "link_flair_text": "Discussion ", "time": 1725677559.3148313, "created_utc": 1725089778.0, "url": "https://i.redd.it/ryr2yt2ldyld1.jpeg", "title": "Anyone heard of the Australian Bunyip?", "permalink": "/r/Cryptozoology/comments/1f5htwa/anyone_heard_of_the_australian_bunyip/", "selftext": "", "media": null, "score": 364, "upvote_ratio": 0.96, "comment_count": 64, "over_18": false}, "56": {"id": "1f85bhb", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "No-Refrigerator-3914", "link_flair_text": "Possible Hoax", "time": 1725677559.547555, "created_utc": 1725383268.0, "url": "https://www.reddit.com/gallery/1f85bhb", "title": "I Think I May Have Solved the Santa Isabel Entity Incident ", "permalink": "/r/Humanoidencounters/comments/1f85bhb/i_think_i_may_have_solved_the_santa_isabel_entity/", "selftext": "Ok I think I may have solved this. In September of 1972, multiple people at a plant in Santa Isabel, Argentina claimed to have witnessed a bizarre humanoid creature. Four years prior to this incident, an episode of the Japanese show Ultraseven aired. The episode was called “Search For Tomorrow”, or “Find Tomorrow” depending on which English release it’s viewed on. The episode features uncanny looking aliens called Alien Shadow. Upon viewing this episode, I thought “wow these resemble the Santa Isabel entity”, but it was simply a passing thought. I will describe the similarities, but keep in mind that all of the depictions of this entity are a little different looking. Both Alien Shadow and the Santa Isabel entity have large ears that end above the head, a sharp, triangular nose, an appearance that is sculpture-esque, a straight mouth, lifeless uni-colored eyes, and a belt. I simply assumed that this was a coincidence and nothing else. However, around the middle of the episode, a man gets into a car and sees the reflection of Alien Shadow in the rear view mirror. This exact thing happens in one of the witness testimonies of the Santa Isabel entity. The fact that this happened in both the witness testimony and the Ultraseven episode, along with the creatures looking very similar, and the event happening only four years after the episode really makes me think that this is more than just a coincidence. Perhaps the so-called witnesses viewed this episode and fabricated a story based on this episode. ", "media": null, "score": 138, "upvote_ratio": 0.89, "comment_count": 41, "over_18": false}, "57": {"id": "1f7kebk", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "RevolutionaryYoung28", "link_flair_text": null, "time": 1725677559.9490104, "created_utc": 1725317418.0, "url": "https://i.redd.it/0ox9zhph6hmd1.jpeg", "title": "Possible Bigfoot? ", "permalink": "/r/cryptids/comments/1f7kebk/possible_bigfoot/", "selftext": "Took a picture at my camp then when I zoomed in on it I saw this. Adirondack mountains. ", "media": null, "score": 214, "upvote_ratio": 0.79, "comment_count": 187, "over_18": false}, "58": {"id": "1f5vqzs", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Longjumping-Owl-797", "link_flair_text": null, "time": 1725677560.1141722, "created_utc": 1725133543.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1f5vqzs/an_alien_encounter_and_a_weird_family_house/", "title": "An alien? encounter and a weird family house", "permalink": "/r/Thetruthishere/comments/1f5vqzs/an_alien_encounter_and_a_weird_family_house/", "selftext": "Here goes the story that inspired me to create this post.  \nMy older brother is not the kind of person that makes up some hoaxes about paranormal things but this seemed incredibly weird and not real even to me. Basically after some time he spent in a bar, being a bit drunk  he, for some reason, decided to go deep into the forest. Perhaps someone told him to do so or he had planned this already. Worth mentioning that in the village we`ve lived is allegedly located a WW2 German bunker along with an old airstrip. So he went into the forest and(as he stated) found an entrance inside the bunker. Inside he had seen a maybe white figure of a man. A figure left no tracks on a snow and had a small talk with my brother. He decided not to tell anyone about what they had a conversation but everything he told us that some bad things are going to happen. And, if i`m not mistaken, that happened before COVID or at least at its start. That was so out of my brothers behavior, nothing even close to that ever happened and nothing similar happened after that. Pretty sure my family forgot about this but for me it sometimes pops up in my mind.   \nOnce while sleeping, i started to hear consecutive knocks on the ceiling. These knocks lasted for a different amount of time but had always been the same. And they usually started at night though. The worst thing about the knocks is this is actually almost impossible for someone to get into an attic, because a normal way inside was never built and only way to get there is to bring a ladder, climb onto the roof, open a wooden lid and squeeze inside. Also there is actually nothing inside of the attic except a big water reservoir for a very old boiler that is placed in a different position from where the knocks have been heard. They never occured before and never after   \nMy mom was called by her name at the middle of the night(that time we were alone in the house). It might sound very stupid but that is what she told me in the next day. In addition to this: once she was preparing and cooking for a birthday in the building that is separated from the main house(basically a kitchen) and stayed there till the late night, as she then told me: she felt a very weird and sudden urge to lock the house and the kitchen. After about 10 minutes someone started banging and pulling the kitchens door. Scary to think what could`ve happened if she didn`t lock the doors. \nAlso all of us from time to time felt a creepy presense, especially my grandma who went alone into the house to pour plants with water, felt that presense, that scared her so much, she ran away outside and now doesn`t go there alone anymore. Perhaps it`s somehow connected to the fact that that exact house is actually connected to all bad things my mom ever had in her life, but who knows.\n Just read again my post and it really sounds as a very goofy made up story and my bad skill of writing makes it even worse but this is the things my family told me. ", "media": null, "score": 30, "upvote_ratio": 0.92, "comment_count": 3, "over_18": false}, "59": {"id": "1faegrd", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Wolfer889", "link_flair_text": null, "time": 1725677560.2770073, "created_utc": 1725627275.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1faegrd/my_dads_stalker_brought_us_presents_repost/", "title": "My dads stalker brought us presents repost", "permalink": "/r/LetsNotMeet/comments/1faegrd/my_dads_stalker_brought_us_presents_repost/", "selftext": "I recently read a story on LNM that brought back old memories of my dads crazy ex-girlfriend. This took place when I was around 8-9 years old. So I guess it would've been the year 1997.\nMy parents had gotten divorced several years prior so me and my little sister, two years younger, used to stay with our dad every other weekend. One day he introduced us to his new girlfriend, Rachel, who was a tall blond woman that had apparently won some kind of beauty pageant or something. \nI remember those first months of getting to know Rachel as fun - she seemed like a nice lady. I also think my inital impression of her was helped by the fact that she had a rather cuddly grey parrot and a pet raven that could talk. Which of course made my younger self quite ecstatic.\nBut after a while things started to change. \nI began to notice she could be a bit odd at times. Saying weird things or acting a bit strangely. We started seeing her less frequently when staying with our dad. Then one day he told us they'd broke up and that we wouldn't be seeing her anymore. He also told us we shouldn't talk to her or go home with her if she showed up at school.\nNot long after that Rachel really started harassing my dad. She would randomly turn up at places we went to visit during weekends. Trying to talk with us. She called him non stop on the phone when we where at home, crying, making threaths, it usually didn't stop until he pulled the plug. Years later I found out she had even threathened to kill me and my sister on several occassions and that dad got a restraining order.\nRachel also keyed my dads car, broke into his company to trash it, and stole a lot of money that he never got back. She even started writing threathening letters to my mom - my parents have always been good friends ever since the divorce - and it all culminated with a letter from the authorities. \nA letter accusing my dad of being a child molester.\nI still vividly remember how mom sat us down in our room, holding the letter, a deep look of concern on her face, asking if dad had ever touched us inaproprietly. Which of course he never has. It later turned out it was Rachel who had falsely accused him of such in an attempt to prevent him from seeing us. I remember feeling really angry and upset that she had gone to such lengths.\nThe last memory I have of Rachel was a few weeks before christmas. We were staying at my dads place over the weekend. It was a two-story apartment complex, with a large window spanning an entire wall, floor to ceiling, in the living room where we had just sat down to watch tv. Next to the window there was a glas door leading onto a stone patio, bordering a lawn that ended with a tall hedge, and on this particular day the outdoor lights had been swithed off, which means it was pitch black outside as the intro to Superman started playing.\nA while into the episode I suddenly heard a strange, sharp, noise comming from the window. It sounded like something was clawing on the glas in an attempt to get in. The sofa I was sitting on was placed right infront of the window so I had my back toward it when I slowly turned around to look over my shoulder, heart thumping in my chest, hairs standing on end as if I was beeing watched. But all that came into view was a pitch black darkness lurking behind my own reflection. \nBy this point dad had also heard the sound and gotten up to turn on the patio lights. When the outside suddenly flooded with light I found myself staring into the face of a smiling blond woman peering into our livingroom. \nNeed I tell you that I screamed?\nBoth me and my sister flew up from the couch like it had been scoarched with fire and ran behind our dad. When I looked toward the window again I saw Rachel with both of her hands up against the glas, tightly cupped beside her face, as she was trying to look inside. The patio door was right next to her. I tugged on dads shirt and whispered if the door was locked when she reached toward the handle. That milli-second of doubt flashing across my dads face still haunts me to this day. Rachel truly looked like a mad woman as she furiously jerked on the handle in an attempt to get in, briefly pausing to peer through the glas now and again.\nI remember thinking dad looked oddly calm as he ushered us around a corner wall, telling us to stay out of sight, as he walked toward the patio door. We begged him not to go outside. Thinking she could have a knife hidden somewhere. So he opened up a smal crack with the door, firmly holding onto the handle, and asked what the hell she was doing in his backyard. She tried to get him to let her in, putting on a big smile, tossing her hair, but dad obviously wouldn't budge, telling her to leave or he would call the cops, to which she eventually conceded leaving a bunch of christmas presents behind.\nWhen Rachel was out of sight from the window dad went out to make sure she was gone, picking up what she had left behind on his way back. None of us wanted anything to do with the presents, something just felt really off about them, so they ended up still fully wrapped in the trash.", "media": null, "score": 95, "upvote_ratio": 0.98, "comment_count": 5, "over_18": true}, "60": {"id": "1f781wd", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "alecb", "link_flair_text": null, "time": 1725677560.4582033, "created_utc": 1725287152.0, "url": "https://www.reddit.com/gallery/1f6glep", "title": "In January 1959, a group of young hikers set off on a journey through the Ural Mountains in Russia. These are the final photos they took before investigators discovered their bodies mangled beyond recognition weeks later.", "permalink": "/r/truecreepy/comments/1f781wd/in_january_1959_a_group_of_young_hikers_set_off/", "selftext": "", "media": null, "score": 53, "upvote_ratio": 0.91, "comment_count": 8, "over_18": false}, "61": {"id": "1f6zzki", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "PanigaleDuc", "link_flair_text": null, "time": 1725677561.08868, "created_utc": 1725258547.0, "url": "https://i.redd.it/zfzzlmifbcmd1.jpeg", "title": "Working night shift at a rural hospital built in the 1940s", "permalink": "/r/Ghosts/comments/1f6zzki/working_night_shift_at_a_rural_hospital_built_in/", "selftext": "No ghosts in the picture that I’m aware of but I have to walk these dim hallways, apparently there’s a nurse in the classic white attire that can be seen roaming the halls or a little bit that sits in the corner of the cafeteria, doors do open by themselves or call lights go off in empty rooms. ", "media": null, "score": 306, "upvote_ratio": 0.91, "comment_count": 34, "over_18": false}, "62": {"id": "1f93l1z", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Responsible-Funny337", "link_flair_text": "Glitch Pic", "time": 1725677561.2665758, "created_utc": 1725481339.0, "url": "https://i.redd.it/fb748umwpumd1.jpeg", "title": "Stoplight with no crosswalk ", "permalink": "/r/GlitchInTheMatrix/comments/1f93l1z/stoplight_with_no_crosswalk/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.22, "comment_count": 2, "over_18": false}, "63": {"id": "1f8z95l", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Nervous-Scheme-9543", "link_flair_text": null, "time": 1725677562.3828056, "created_utc": 1725470978.0, "url": "https://www.reddit.com/r/ufo/comments/1f8z95l/how_a_flying_saucer_works_its_an_mhd_generator/", "title": "How a flying saucer works: It's an MHD generator (specifically, it's a Hall effect disk generator).", "permalink": "/r/ufo/comments/1f8z95l/how_a_flying_saucer_works_its_an_mhd_generator/", "selftext": "Power source: \nIt’s an MHD generator. Specifically, it’s a Hall effect disk generator. MHD generators draw energy from plasma. Hall effect disk generators hold the efficiency and energy density records for MHD generation. Typically, the magnetic excitation field is made by a pair of Helmholtz coils above and below the disk. However, “flying saucers” are an altered form of a Hall effect disk generator. Instead, these flying saucers induce an electromagnetic field around the entirety of the craft. This has the same effect as the magnetic excitation provided by the Helmholtz coils and it provides a side benefit: propulsion. There is no engine and there appears to be no fuel source because the flying saucers use electrons drawn from oxygen and nitrogen molecules. This is why flying saucers spend so much time in Alaska’s airspace. The easiest way to get free electrons from these molecules is to use the ones that make up the Aurora Borealis. There is an episode of “unidentified inside America's UFO investigation” with Lue Elizondo on Youtube where a commercial airline pilot that often has scheduled flights over Alaska, was interviewed. This pilot reported seeing a flying saucer that dropped down into the middle of the Aurora Borealis and appeared to be using the Aurora Borealis to “power up.” He described the saucers as glowing very brightly and then shooting up in the air. \nAuroras are the result of disturbances in the Earth’s magnetosphere caused by the solar wind. These disturbances alter the trajectories of charged particles in the magnetospheric plasma. These particles, mainly electrons and protons, precipitate into the upper atmosphere. The resulting ionization and excitation of atmospheric constituents emit light of varying color and complexity.\nThis is actually a very easy way to get free electrons. When the generator is turned off, there is no longer plasma inside the generator. The particles return to a gaseous state. The electrons are taken from oxygen and nitrogen, which are the same molecules that compose our atmosphere. So when the generator is cut open, it appears that there is nothing but air in the generator, because well, that’s technically true.\nThis is why the reverse engineering program thinks that the craft use free energy or zero-point energy. It’s because there appears to be nothing in the generator when it’s off. Here is the link to the Wikipedia page on MHD generators: https://en.wikipedia.org/wiki/Magnetohydrodynamic_generator\nWe currently do not use this technology because of the electrothermal instability problem.\nNo one wanted to fund the research studies needed to solve this problem because apparently, if you can’t make a bomb out of something then it isn’t useful.\nPlease do not put a nuclear reactor in a Hall effect disk generator anymore. It is very difficult to control the power output with a nuclear reactor. This makes the disk functionally useless in a wartime situation and extremely dangerous as a spaceship.\nWhat are the solutions to the electrothermal instability problem? There have been three proposed solutions:\n\nIn the 1970s and more recently, some researchers tried to master the instability with oscillating fields. Oscillations of the electric field or of an additional RF electromagnetic field locally modify the Hall parameter.\nA solution has been found in the early 1980s to completely remove the electrothermal instability within MHD converters, by means of non-homogeneous magnetic fields. A strong magnetic field implies a high Hall parameter, and therefore a low electrical conductivity in the medium. So the idea is to create some \"paths\" linking one electrode to the other, where the magnetic field is locally attenuated. Then the electric current tends to flow in these low B-field paths as thin plasma cords or streamers, where the electron density and temperature increase. The plasma becomes locally Coulombian, and the local Hall parameter value falls, while its critical threshold rises. Experiments where streamers do not present any inhomogeneity have been obtained with this method. This effect, strongly nonlinear, was unexpected but led to a very effective system for streamer guidance.\nAnother idea to control the instability is to increase the non-thermal ionisation rate by using a laser which would act like a guidance system for streamers between electrodes, increasing the electron density and the conductivity, therefore lowering the Hall parameter to below its critical value along these paths. But this concept has never been tested experimentally.\n\nThe answer is all of the above.  \nOkay so, let’s address #1 first: The craft use electromagnetic field propulsion. They induce an electromagnetic field around the entirety of the craft. An electromagnetic field is a combination of an electric field and a magnetic field. A disturbance in the electric field can create a disturbance in the magnetic field which in turn affects the electric field, leading to an oscillation that propagates through space, known as an electromagnetic wave. So, a craft using electromagnetic field propulsion will cause the solution that is being proposed in #1 to begin with.\nNow, Let’s address #2. The solution here is to completely remove the electrothermal instability within MHD converters, by means of non-homogeneous magnetic fields.  But what is a non-homogeneous magnetic field? This just means that the magnetic field lines are not parallel. The most common crafts we see are disks, cigars, spheres, and eggs. When an electromagnetic field is induced around any of these objects, the field lines that are produced will be non-homogeneous field lines to begin with. For example: If we were to do a vector analysis of the field lines using a physical diagram of all of these shapes, we would find that when an electromagnetic field is induce around this shapes, that non-homogenous line will form.\nSo, let’s address #3. Lasers can be used in combination with solution #2. I see no reason for why you would not be able to use both. Lasers would further lower the Hall parameter to below its critical value and increase the ionization rate. I suspect that this would increase the power output since you would be increasing the ionization rate. However, I am not a plasma physicist and solution #3 has never been tested experimentally. Solution #3 is also discussed in a thesis paper that is in French and I am no longer proficient in French.\nIn conclusion, all of the above are correct.\nPlease keep in mind if you are reading this, that this technology can be used as a spaceship but it can also be used as a power generator to generate electricity in a renewable, safe, and stable manner. All coal power plants can be replaced directly with these generators without replacing the current electrical grid in place. We can also transition to electric cars to further reduce our emissions. The initial capital cost would be moderately high, but longterm these generators are cheaper than coal and the electricity they provide would be a cheaper fuel source than oil. We could create a realistic green energy plan with this technology and an aggressive plan could get us close to net zero emissions by 2050.\nAn 80 year cover up thwarted by a screenshot off Wikipedia.\nIt’s not rocket science, it’s plasma science.\nPropulsion system: \nElectromagnetic field propulsion (EMP). The injuries acquired by military staff are non-nuclear radiation injuries and electrical injuries including the following:\n\nRadiation related brain damage \nRadiation burns on the eyes\n1st and 2nd degree radiation burns on the skin\nAgressive cancers\nHeart damage (This one is electric field related)\n\nAnti-gravity would not cause these kinds of injuries. Here are some videos for reference: https://www.youtube.com/watch?v=Rdf9qcrHd6s and https://www.youtube.com/watch?v=GHzkR74yh_M\nAbility to levitate: \nInteraction between Bismuth and the magnetic field being generated. The magnetic field has to be extremely strong to do this. Bismuth is the most diamagnetic element out of all of the elements. The propulsion system actually uses repulsion.\nMethod of transit: \nTransit via the fifth dimension (the fourth dimension is designated as time). There’s a video of a UFO on the internet from 2013 by the Puerto Rico coast guard. It was released by the United States DOD, here is the video: https://www.youtube.com/watch?v=2nSIKYlm2eE This is an object flying in and out of the fifth dimension. This is what it looks like when a 3D object is moving in and out of a 4th spatial dimension. When a 3D object moves in and out of a 4D space it appears to be splitting and fusing back together but it’s actually not. This is because the dimensions are designed in a way that the observer cannot see the fifth dimension. You can tell it’s flying in and out of the fifth dimension by modeling it on a computer program like this one: https://www.youtube.com/watch?v=lnQ4Zfj18Og\nIf you can figure out how to traverse the fifth dimension, you can go anywhere in the spacetime continuum. This is the only mechanism that any intelligent species has to be able to move vast distances in space. That is because it is not possible to go faster than the speed of light. In addition, it is almost impossible to go 10% of the speed of light. That is because the acceleration of an object affects the force. If an object is going 10% of the speed of light, even a small rock hitting the object would be equivalent to a nuclear bomb blast going off.\nHave a nice day CIA. I'm not going away.", "media": null, "score": 180, "upvote_ratio": 0.81, "comment_count": 93, "over_18": false}, "64": {"id": "1f7wwgc", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "Video", "time": 1725677563.8275836, "created_utc": 1725360752.0, "url": "https://v.redd.it/pm2hf847rkmd1", "title": "Associated Press appears to have edited out Nancy Mace's entire line of questioning to Dave Grusch about Non-Human Biologics recovered along with UAPs during the Congressional hearing.", "permalink": "/r/UFOs/comments/1f7wwgc/associated_press_appears_to_have_edited_out_nancy/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/pm2hf847rkmd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/pm2hf847rkmd1/DASH_96.mp4", "dash_url": "https://v.redd.it/pm2hf847rkmd1/DASHPlaylist.mpd?a=1728269562%2CMWRlMDM2MTVjOGZhZDA1MDFiYTY2YWM5Zjk5NzJiYzU2MDhiYzk3MmVmNTEwY2U4Y2Q5N2U4NjUzYjkxYTVkZQ%3D%3D&v=1&f=sd", "duration": 92, "hls_url": "https://v.redd.it/pm2hf847rkmd1/HLSPlaylist.m3u8?a=1728269562%2CYjlmY2QwYjYzN2M5MmZiYzVhZjQzNzIyMTZlZDkwODU3NGVmNjhlODQ1Y2M4N2MxN2IzODMwZmVkYTViNGJlOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2762, "upvote_ratio": 0.9, "comment_count": 392, "over_18": false}, "65": {"id": "1f7j5do", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Sky5759", "link_flair_text": "Evidence :upvote:", "time": 1725677565.1354809, "created_utc": 1725314158.0, "url": "https://v.redd.it/5gllp201ugmd1", "title": "Travis Walton shows 'accelerated tree growth' at the site of his abduction in 1975, where the trees exposed to the UFO seemed to grow faster for a period of 14 years then stopped. It was also found this specific growth was immune to rotting. Compared to other trees this was an anomaly. ", "permalink": "/r/aliens/comments/1f7j5do/travis_walton_shows_accelerated_tree_growth_at/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/5gllp201ugmd1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 640, "scrubber_media_url": "https://v.redd.it/5gllp201ugmd1/DASH_96.mp4", "dash_url": "https://v.redd.it/5gllp201ugmd1/DASHPlaylist.mpd?a=1728269564%2CMTg4ZmNmZWExM2ZjNmFlNWYwMmU0YTBmODI5MzNjYWRiODU5NjcxOTEyN2NmNDg5MjlhOTNiZTgzZWMyZWM0OA%3D%3D&v=1&f=sd", "duration": 60, "hls_url": "https://v.redd.it/5gllp201ugmd1/HLSPlaylist.m3u8?a=1728269564%2CYTRiY2ViNWZkYTQ0MWZmNmJjZjdiOWNkZDNmNzhlODk0ODQxMTM0Y2YzYzE5OTAwMWQwNzQ2NDc3MGVmZmFkYQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1081, "upvote_ratio": 0.91, "comment_count": 136, "over_18": false}, "66": {"id": "1f6yztx", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "thegoatherder911", "link_flair_text": null, "time": 1725677565.3163214, "created_utc": 1725254749.0, "url": "https://www.reddit.com/r/UAP/comments/1f6yztx/help_with_research/", "title": "Help with research", "permalink": "/r/UAP/comments/1f6yztx/help_with_research/", "selftext": "Hey I’ve been assigned UAP as a research topic in my english 102 course and needed 2 solid books about UAPs that I could read to find information for my paper and hopefully statistics as well. If y’all had any suggestions that would be awesome and it would be even better the more recent the publishing. Thanks i’m advance", "media": null, "score": 11, "upvote_ratio": 0.78, "comment_count": 9, "over_18": false}, "67": {"id": "1f9iy5u", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "flexnerReport1776", "link_flair_text": null, "time": 1725677566.2139382, "created_utc": 1725531531.0, "url": "https://i.redd.it/gcsrf3l4vymd1.png", "title": "Every. Single. Time.", "permalink": "/r/conspiracy/comments/1f9iy5u/every_single_time/", "selftext": "", "media": null, "score": 3045, "upvote_ratio": 0.96, "comment_count": 209, "over_18": false}, "68": {"id": "1f9ut14", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "StopTheNewNormal", "link_flair_text": null, "time": 1725677566.3942492, "created_utc": 1725563790.0, "url": "https://youtube.com/watch?v=3LVsBojlWYw&si=tER7mueORfXePSsC", "title": "Barrie Trower From the beginning . Microwaves , Ionizing Radiation , WI ...", "permalink": "/r/conspiracyfact/comments/1f9ut14/barrie_trower_from_the_beginning_microwaves/", "selftext": "", "media": {"oembed": {"provider_url": "https://www.youtube.com/", "title": "Barrie Trower From the beginning . Microwaves , Ionizing Radiation , WI FI Dangers !", "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/3LVsBojlWYw?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Barrie Trower From the beginning . Microwaves , Ionizing Radiation , WI FI Dangers !\"></iframe>", "thumbnail_width": 480, "height": 200, "width": 356, "version": "1.0", "author_name": "smiff da mista", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/3LVsBojlWYw/hqdefault.jpg", "type": "video", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@smiffdamista"}, "type": "youtube.com"}, "score": 1, "upvote_ratio": 0.57, "comment_count": 1, "over_18": false}, "69": {"id": "1f5wajb", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "iconoclastskeptic", "link_flair_text": "merchandise", "time": 1725677566.949568, "created_utc": 1725135015.0, "url": "https://i.redd.it/h2n2zv0442md1.jpeg", "title": "Saw this at my local flea market in Florida today. I figured you all would appreciate it!", "permalink": "/r/bigfoot/comments/1f5wajb/saw_this_at_my_local_flea_market_in_florida_today/", "selftext": "", "media": null, "score": 377, "upvote_ratio": 0.98, "comment_count": 20, "over_18": false}, "70": {"id": "1f5yatg", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Smoky1279", "link_flair_text": null, "time": 1725677567.4548755, "created_utc": 1725140414.0, "url": "https://i.redd.it/71yqpfz5k2md1.jpeg", "title": "This was the first cryptozoology related work I remember seeing. ", "permalink": "/r/Cryptozoology/comments/1f5yatg/this_was_the_first_cryptozoology_related_work_i/", "selftext": "It's about a scientist couple that ventures into the jungles of Africa in search of Mokele-Mbembe. I think we recorded on a Beta Max VCR when it was a Disney Sunday movie. It was also an early trauma as there is a sad scene. ", "media": null, "score": 290, "upvote_ratio": 0.99, "comment_count": 25, "over_18": false}, "71": {"id": "1f8qemq", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "emilos260", "link_flair_text": "Alien", "time": 1725677567.66481, "created_utc": 1725447785.0, "url": "https://i.redd.it/vbj0j3cxxrmd1.jpeg", "title": "UFO with its occupants seen by six-year old girl in Liiduvere, Viljandi, Estonia - 1950 (full encounter in the comments)", "permalink": "/r/Humanoidencounters/comments/1f8qemq/ufo_with_its_occupants_seen_by_sixyear_old_girl/", "selftext": "", "media": null, "score": 99, "upvote_ratio": 0.98, "comment_count": 4, "over_18": false}, "72": {"id": "1f6o8rd", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "ExternalAd9127", "link_flair_text": null, "time": 1725677568.138472, "created_utc": 1725222362.0, "url": "https://i.redd.it/mg6atd4ub9md1.jpeg", "title": "Jersey Devil ", "permalink": "/r/cryptids/comments/1f6o8rd/jersey_devil/", "selftext": "", "media": null, "score": 195, "upvote_ratio": 0.93, "comment_count": 31, "over_18": false}, "73": {"id": "1f9kmnx", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "CoachAdorable6346", "link_flair_text": "Theory/Debunking", "time": 1725677568.2940698, "created_utc": 1725537511.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1f9kmnx/the_bag_that_never_existed/", "title": "The Bag That Never Existed ", "permalink": "/r/Thetruthishere/comments/1f9kmnx/the_bag_that_never_existed/", "selftext": "I've always had a thing for luxury goods, but I'm not the type to splurge on them. Instead, I enjoy finding high-quality dupes for the items I love at more reasonable prices. However, my recent trip to Houston left me with a rather eerie experience that still gives me chills.\nDuring my visit to The Galleria, something I'm sure you've also seen before there were two Prada stores – one was an outlet, and the other was a regular store. There wasn't a significant difference between the two, despite variations in stock and size. I found myself visiting both stores on different occasions, as my friends were busy checking out and buying bags, while I was on the lookout for one to add to my collection.\nDuring my first visit to one of the Prada locations, I struck up a conversation with a friendly older gentleman who seemed to be setting up new stock. He even took the time to chat with me about the items while I was admiring a particular bag – it looked like a large green suede Arqué, but wasn't and had a few hardware upgrades. I was so captivated by the bag that I failed to retain much of what he said about the collection. Although I regret not taking a picture of the bag, which is something I usually do when I come across a piece I like, I distinctly remember him encouraging me to pick up the bag. It was one of the most exquisite bags I had ever laid eyes on – soft and absolutely stunning. As we conversed, my friends eventually pulled me away.\nThe next day, consumed by the desire to see the bag again, I made a point to stop by both Prada locations to take a picture of it. It was also because I wasn't sure which location had it anyway. To my surprise, the bag was nowhere to be found, and neither store seemed to recall ever having it in stock. This baffled me, and I contemplated various explanations for the strange occurrence – perhaps the man had sold it already or inadvertently displayed unreleased stock and miscommunicated. I also asked my friends if they remembered anything… and they didn't see the bag but they remember me talking about it on the way home on the first day so I definitely didn't dream it.\nI ended up going on a wild goose chase, scouring the internet and past collections to no avail. I even reached out to multiple Prada stores, including the one in Houston and others in different cities, but none of them could shed any light on the mysterious bag. Some even assured me that their system kept records of old, current, and upcoming stock, making it highly unlikely that the bag had ever existed. It's as if the bag belonged to another dimension altogether.\nIt was a bizarre and unnerving experience, and I can only hope that I never encounter something like it again. If anyone can debunk my experience or help me find out what that bag actually was, I'd be forever grateful. The whole ordeal has left me genuinely bewildered!", "media": null, "score": 19, "upvote_ratio": 0.83, "comment_count": 6, "over_18": false}, "74": {"id": "1f7x30n", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "BrilliantBex1992", "link_flair_text": null, "time": 1725677568.4824796, "created_utc": 1725361377.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1f7x30n/post_disco_psychos_that_attacked_me/", "title": "Post disco psychos that attacked me", "permalink": "/r/LetsNotMeet/comments/1f7x30n/post_disco_psychos_that_attacked_me/", "selftext": "This is so bizarre. This isn’t even a memory I forgot, just one that I basically turned into my own fun anecdote to make it less scary. 11 years later, it’s fucking scary and I know how lucky I was. \nFor context: I was a fresh 21 yo, and had recently rediscovered a love of dance and started enjoying concerts and festivals. I had attended my first festival at 20, and had the most amazing time volunteering and meeting people! It was a last minute and unexpected situation that first year, but after the amazing experience I had, I was hooked. It’s prudent to add that I was extremely naive and obviously new to that kind of scene. \nSo the next year, I had cut off the friends I’d gone to festivals with before, but still had friends of friends that went that I got along with really well, and had good memories with. So even though I was going to my second year at the same festival, I was going solo, and just camping with friends of friends.\nWhich I suppose was the beginning of the problem. I got going kind of late, so when I got to the festival the lines to get in were extremely long. I’d packed diligently, but the service wasn’t great and I was having a hard time contacting the (semi) friends that I was camping with. \nBy the time I found them and had set up, it was dark. It was a newer but pretty large festival and I have a really bad sense of direction. In future years I’d learn to bring battery/solar lights and obnoxious decorations because of this night. It was also in a different location that year. So, unfamiliar with where I’m camped, with my surroundings… second part I fucked it up.\nMy ex roommate, Tom, and his girlfriend Gina were the ones I was closest to, and Tom was bringing some special acid for me. As kind of an apology for not sticking up for me in a roommate situation (it’s more a different sub so I haven’t posted about it).\nWe all went to the first show together, but all got really high so fast. I took too much, and knew it pretty quickly so I knew the night was going to go sideways, but by the time I realized, Tom and Gina had wandered off, leaving me completely alone. \nI tried to find my way to my tent, thinking I’d lay down for a bit and be okay, but I couldn’t remember how to get to it or where it was. \nIt was dark, and I was starting to panic, being that I was high as shit and didn’t know where anyone I knew was, didn’t know how to find my campsite, or anything. I was in a crop top, and Jean shorts in high desert at nighttime, so it was starting to get cold.\nI wandered over to the disco area, because it was the first thing I found. Had a legit disco ball and all. I’m wandering around, and see this woman in the most unusual clothing (think almost pioneer) so I went to talk to her. I genuinely to this day don’t know if this person was real, that’s how messed up I was.\nWe end up wandering around (again, not sure this was a real person or hallucination) trying to find my campsite when we reach the rv/car camp area. This man ( maybe early 30’s?) with glow sticks ask if we want any and we say yeah!!! She goes first, and as soon as it’s on her wrist goes skipping away.\nI call out to her to wait but she doesn’t stop. The man looks at me and says “are you okay? Do you think you can find your friend?”\nI stupidly say: “ oh I don’t know her really. I can’t find my campsite and she was helping, but oh well.”\nHe responds with “you remind me a lot of my little sister. I wouldn’t want her running around lost like this. Look, my buddy and I are going to watch “xyz” shows and I wouldn’t feel right leaving you, so you could stay in his rv for a few hours to sleep it off. “\nObviously I was too high, too young, too naive, to see where this would go, and I stupidly complied and followed him. \nIt was fine at first. It was a toy hauler(? I think that’s what it’s called?) so the back end was like a uhaul that stayed open. The first guy put on an album I’d previously loved as a teenager but now can still barely listen to, tucked me in, and left. I didn’t see his buddy at that point.\nFast forward god knows how many hours, I’ve been tripping out to this music and actually been getting to the point of okay, when they get back. (For the record I didn’t request this particular band, it was on a loop)\nFirst thing was the guy that told me I looked like his sister climbing on top of me while I was half conscious, kissing my neck and touching me. Then I felt the second one. And his hands.\nI was still so high and out of it, but immediately told them to stop, that I wasn’t in a place for that. \nThey got angry, and the one who’d gotten me there was the most frightening. I saw his eyes change in that moment, and knew I was fucked if I couldn’t get away. It didn’t matter how high I was, I needed to get away from them. I don’t even recall formulating a plan. I remember the main man saying:\n“We helped you. Now you owe us”\nAnd slamming my knee into his groin. I may have forgotten that he was on top of me at that point. \nAll I remember is running for my life into the very prickly bushes, not knowing where I was going but desperately running away. The second man seemed a bit nervous about the whole thing and didn’t do much except for touch me while the other one held me down with the weight of his body. \nI met a couple of kind souls that calmed me down when I was completely freaking out, crying, covered in dirt and thorns, and they gave me a safer space. I didn’t sleep that night, as I could no longer trust the kind stranger, but I also couldn’t find my camp. It was 10 yards away as I discovered the next day. \nTo the two men who tricked me, trapped me, and would have done something inevitably bad to me: let’s not meet again. And also fuck you both\nEdit: I forgot to add this cause it’s a pretty intense memory for me, but I’m pretty sure the only reason I got away is because they were on something. I hadn’t even met guy #2 before so idk about him, but the one I did seemed crazed and very amped and high and out of it. And yes, I know the whole thing was stupid of me. I was not even a month into 21 though with very little life experience.", "media": null, "score": 79, "upvote_ratio": 0.96, "comment_count": 8, "over_18": true}, "75": {"id": "1f7eoie", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Independent_Age_6593", "link_flair_text": null, "time": 1725677568.6367438, "created_utc": 1725303198.0, "url": "https://www.reddit.com/r/truecreepy/comments/1f7eoie/the_peter_bergmann_case_irelands_baffling_mystery/", "title": "The Peter Bergmann Case: Ireland's Baffling Mystery", "permalink": "/r/truecreepy/comments/1f7eoie/the_peter_bergmann_case_irelands_baffling_mystery/", "selftext": "On a quiet June morning in 2009, a man arrived in the small coastal town of Sligo, Ireland. He checked into a local hotel under the name \"Peter Bergmann\" and proceeded to spend his days wandering the town. Little did anyone know, this man's presence would ignite one of the most perplexing mysteries in Irish history.\nThe events leading up to the arrival of \"Peter Bergmann\" are shrouded in mystery. It is believed that he arrived in Ireland via Belfast, but there is no record of his entry in any airport or ferry terminal. The man was described as being of medium build and around 60 years old, with short grey hair and a receding hairline.\nMr. Bergmann's hotel stay was also unusual. He had no luggage with him and always paid in cash. He would spend hours writing in a notebook, but no one knows what he was writing. He also made multiple trips to the local post office, but it is unclear what he was mailing.\nOn June 15th, Mr. Bergmann checked out of the hotel and left his room in immaculate condition.", "media": null, "score": 1, "upvote_ratio": 0.57, "comment_count": 3, "over_18": false}, "76": {"id": "1f5fwzc", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "SleeplessinVancity3", "link_flair_text": null, "time": 1725677569.321425, "created_utc": 1725081904.0, "url": "https://v.redd.it/dx5izio6qxld1", "title": "My husband and I got a motion alert late at night with a weird sighting. Are we haunted? ", "permalink": "/r/Ghosts/comments/1f5fwzc/my_husband_and_i_got_a_motion_alert_late_at_night/", "selftext": "Hi redditors, we have an indoor camera for my dog. Both my dog and I traveled to my parents and my husband was alone in the apartment and sleeping when he got an alert at 10pm that there was motion. We both checked the camera and found two videos where there’s flashing coming from our bedroom where he was sleeping. We can confirm no lights were on, his phone wasn’t flashing, the room should have been pitch back. We’re both a little creeped out but can’t figure out what it is. Are we overthinking this? ", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/dx5izio6qxld1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 848, "scrubber_media_url": "https://v.redd.it/dx5izio6qxld1/DASH_96.mp4", "dash_url": "https://v.redd.it/dx5izio6qxld1/DASHPlaylist.mpd?a=1728269568%2CNTU5NGU1NTQyNzk2MDhiNzFiZmQ2MDgyZWZjZDQ5MGNiMjhkYzFiYWNkMTE1YjVmNjUwYzc0MmQ1ZDQ0OWQ2OQ%3D%3D&v=1&f=sd", "duration": 15, "hls_url": "https://v.redd.it/dx5izio6qxld1/HLSPlaylist.m3u8?a=1728269568%2CMDE4MWI0ZDhjODMwODY5YWRkNjdkOTVmNzdmYmZjMDBlNGE5OGFjMjQzNzk1NTE2OTg2NDU0YzQ2MTViNmFiYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 206, "upvote_ratio": 0.8, "comment_count": 94, "over_18": false}, "77": {"id": "1fa0236", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Powerful_Friendship6", "link_flair_text": "Glitch Pic", "time": 1725677569.5358303, "created_utc": 1725576959.0, "url": "https://i.redd.it/w3uxhwcvl2nd1.jpeg", "title": "Paranormal/Energetic Attachment? ", "permalink": "/r/GlitchInTheMatrix/comments/1fa0236/paranormalenergetic_attachment/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.15, "comment_count": 10, "over_18": false}}}