{"_default": {"1": {"id": "1evf7rp", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "awcomix", "link_flair_text": "Discussion", "time": 1724467639.4069827, "created_utc": 1724003199.0, "url": "https://www.reddit.com/gallery/1evf7rp", "title": "Remember the Red Rocks Sighting? I Spoke to a Witness and Turned It into a Comic.", "permalink": "/r/ufo/comments/1evf7rp/remember_the_red_rocks_sighting_i_spoke_to_a/", "selftext": "", "media": null, "score": 684, "upvote_ratio": 0.98, "comment_count": 123, "over_18": false}, "2": {"id": "1exdjlu", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Clipping", "time": 1724467641.0149543, "created_utc": 1724205264.0, "url": "https://v.redd.it/q1vm3rj7bxjd1", "title": "Lue Elizondo tells Ross Coulthart the U.S. has retrieved “vehicles of unknown origin” and “the occupants of these vehicles to include biological specimens.” Elizondo: “We are not alone in this universe… the U.S. Govt has been aware of that fact now for decades.”", "permalink": "/r/UFOs/comments/1exdjlu/lue_elizondo_tells_ross_coulthart_the_us_has/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/q1vm3rj7bxjd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 474, "width": 854, "scrubber_media_url": "https://v.redd.it/q1vm3rj7bxjd1/DASH_96.mp4", "dash_url": "https://v.redd.it/q1vm3rj7bxjd1/DASHPlaylist.mpd?a=1727059639%2COGY3ODQwOWZhODBhZGNhMmY5NDRkZjllNmI1ZjYyYzEzYjk2MGU0NTcwYjA3ZWFiZTA3MjVkNmVlNTMzMWU3Mw%3D%3D&v=1&f=sd", "duration": 46, "hls_url": "https://v.redd.it/q1vm3rj7bxjd1/HLSPlaylist.m3u8?a=1727059639%2CMzNmY2QyNzQ1NGQzNDE5OWRlMWZjYTIzNDAxNzc1MjFmZTU0MmE0ZTNmNTFjMzAyODE5YjNhYzk4Y2Q0ZDZiNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4277, "upvote_ratio": 0.89, "comment_count": 1032, "over_18": false}, "3": {"id": "1ev38di", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "elProtagonist", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1724467642.8852987, "created_utc": 1723964602.0, "url": "https://i.redd.it/ucns30frfdjd1.png", "title": "I'm sick and tired of these games", "permalink": "/r/aliens/comments/1ev38di/im_sick_and_tired_of_these_games/", "selftext": "", "media": null, "score": 2618, "upvote_ratio": 0.88, "comment_count": 352, "over_18": false}, "4": {"id": "1ew4d6l", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "Video", "time": 1724467643.5922952, "created_utc": 1724080503.0, "url": "https://v.redd.it/kcfka9iuzmjd1", "title": "Today, CBSMornings: Interview with Lue Elizondo", "permalink": "/r/UAP/comments/1ew4d6l/today_cbsmornings_interview_with_lue_elizondo/", "selftext": "", "media": null, "score": 344, "upvote_ratio": 0.94, "comment_count": 76, "over_18": false}, "5": {"id": "1euwsed", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "astralrocker2001", "link_flair_text": null, "time": 1724467644.8764052, "created_utc": 1723942170.0, "url": "https://i.redd.it/zc93tov5lbjd1.jpeg", "title": "The 300+ year-old Vampire didn't kill himself.", "permalink": "/r/conspiracy/comments/1euwsed/the_300_yearold_vampire_didnt_kill_himself/", "selftext": "", "media": null, "score": 6069, "upvote_ratio": 0.89, "comment_count": 552, "over_18": false}, "6": {"id": "1ezhtep", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1724467645.162276, "created_utc": 1724432217.0, "url": "/r/ClimateAndCovid19/comments/1ezhotb/seeing_comments_about_dropping_ice_in_a_glass_of/", "title": "Strange that so many reports about cooling Atlantic Ocean claim \"No one knows\" why. Yet well-known studies conducted for years have determined water under heavy Saharan dust is cooler.\nThick \"Saharan dust\" is metallic, reflects sun back into space, cooling water. Not so hard to believe.", "permalink": "/r/conspiracyfact/comments/1ezhtep/strange_that_so_many_reports_about_cooling/", "selftext": "", "media": null, "score": 6, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "7": {"id": "1evf36x", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "stuartdokken", "link_flair_text": "art", "time": 1724467646.2373304, "created_utc": 1724002877.0, "url": "https://i.redd.it/lmon7ooolgjd1.jpeg", "title": "My tribute to the legend  ", "permalink": "/r/bigfoot/comments/1evf36x/my_tribute_to_the_legend/", "selftext": "I just got this Bigfoot tattoo and have got a lot of compliments I love it. ", "media": null, "score": 1255, "upvote_ratio": 0.99, "comment_count": 48, "over_18": false}, "8": {"id": "1ew3mrm", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Sonnybass96", "link_flair_text": "Discussion ", "time": 1724467647.5048857, "created_utc": 1724078701.0, "url": "https://i.redd.it/xo2vgu45vmjd1.jpeg", "title": "Why most locals are casual to the cryptids of their own region?", "permalink": "/r/Cryptozoology/comments/1ew3mrm/why_most_locals_are_casual_to_the_cryptids_of/", "selftext": "So I just recently watch a podcast segment of David Choe with Joe Rogan and he tells his account/adventures in the Congo where he and an acquaintance attempt to find the Mokele Mbembe, although, it didn't go as planned since they got lost but when they finally found themselves in a village, the locals there were pretty casual about whatever creature was lurking in the region, and even decided to volunteer in assisting them to the exact location of the creature. Though, in the end they just decided to not pursue it due to injuries and fatigue.\nIt still amuses me that you have these big expeditions in TV shows, vlogs, and private ventures, well funded, more people, and having the latest equipment and most of them couldn't get solid evidences with the exceptions of mystery samples, figures, and potential images. When they try to venture inside the region, they still couldn't find a good solid one. (News-breaking level)\nBut for most of the locals in every place, they are pretty casual about it like \"Oh, I've seen it many times, It regularly passes by our village almost everyday.\"\nNot just to Mokele Mbembe but to different cryptids around the world. \nAlso, credits to the expeditions that utilizes the familiarity of the locals in the region thus leading to a discovery of a cryptid or a thought to be extinct creature. ( Eg. Black-Naped Pheasant Pigeon discovery)", "media": null, "score": 503, "upvote_ratio": 0.97, "comment_count": 34, "over_18": false}, "9": {"id": "1evrnby", "locked": true, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "voc417", "link_flair_text": "Possible Hoax", "time": 1724467647.7694302, "created_utc": 1724036892.0, "url": "https://i.redd.it/uydux3vtejjd1.jpeg", "title": "What is this?", "permalink": "/r/Humanoidencounters/comments/1evrnby/what_is_this/", "selftext": "This happened last night (8/17/2024) at 10:31pm in Michigan. My friend was in the basement, got a notification someone was detected by his camera and heard a pounding on the door. He went upstairs, opened the door and no one was there. He looked at his notification a little while later and saw this. What is this? We’re hoping it’s just someone messing around. ", "media": null, "score": 657, "upvote_ratio": 0.83, "comment_count": 108, "over_18": false}, "10": {"id": "1eud5di", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Skeletonmolester3000", "link_flair_text": null, "time": 1724467648.560625, "created_utc": 1723884473.0, "url": "https://i.redd.it/yng7p2qlt6jd1.jpeg", "title": "Weird figure standing in the woods behind my house", "permalink": "/r/cryptids/comments/1eud5di/weird_figure_standing_in_the_woods_behind_my_house/", "selftext": "Sorry if the post is janky or awkward, this is my first post. My mom built a walkway to the forest behind our house lined with driftwood and mossy sticks, and took this picture to show my brother. But she noticed something weird in the background. She cropped the image and circled the figure, as seen above.\nI wander around in the forest behind my house all the time, and the worst thing I’ve seen out there is a coyote or black bear. Also, I know the layout of trees and plants in my backyard, and it’s pretty evident that that’s not a tree stump. I live by a really tame and shallow forest, and due to its proximity to different neighborhoods, it even has cell service. We figured it must’ve been a person, so we tried to recreate the image, but a person in that spot just stood out way too much, and wasn’t ever as shrouded or shadowed as this figure. Nobody in my family was outside at that time, and my mom said she was alone when she took that picture. Weirdly, the figure in the picture seems to be the wrong color, wrong lighting, and wrong resolution. It almost looks like it was just photoshopped in. Its color and build looks too pale grey and statue-like to be a person. What is this thing?", "media": null, "score": 2562, "upvote_ratio": 0.96, "comment_count": 972, "over_18": false}, "11": {"id": "1ezh5xo", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Hawkeye09090", "link_flair_text": "Unidentified?", "time": 1724467648.8280406, "created_utc": 1724430621.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1ezh5xo/possible_encounters_from_a_michigan_nature_park/", "title": "Possible Encounters From A Michigan Nature Park Worker", "permalink": "/r/Thetruthishere/comments/1ezh5xo/possible_encounters_from_a_michigan_nature_park/", "selftext": "General info:\nFor my safety I do not want to reveal which park system I work for but it is important to the story that I (F19) work a position at a Michigan nature park not entirely dissimilar to that of a park ranger. My job duties usually include manning the entry booth, locking up the buildings at night. And although not a usual duty sometimes they ask me to walk or take a park vehicle through some of the trails as I am on the younger side but still have several years of experience at the park (I’m a relatively experienced outdoorsman).\nI’ve had some odd things happen to me while on the job that I can’t quite explain, I’m decently well versed in some areas of the paranormal and although not entirely relevant its of note that I am also a Norse Pagan as part of a family belief and often wear protective symbols as well. And to be honest I’ve started wearing them more since these odd things have been happening. I’ve tried looking into it myself but overall I’m overwhelmed and not sure where to look so a friend suggested I ask a forum like this about my experiences. \nThere are 2 things in particular I want to ask about. \nThing 1: \nI usually work the night shift and this night in particular it was raining a lot and the conditions were getting unsafe. I was posted out in the booth which is multiple miles from the office so when things took a turn for the worse my boss radioed me back. Some people who don’t spend a lot of time in the woods don’t realize how dark deep woods can get, much less in the dark at night. But I had both a flashlight and the light from the booth which gave me probably 30 feet of visibility. And when I went to grab my stuff so I can lock up the booth and get to my car I swore I saw something that moved very human like but moved in a really odd way like the only way I can describe it is if a horse deer hybrid tried to run like a person. But there were no people out there and it was most definitely not a deer. I’m probably not describing it in the best way but it was very off. So I got to my car asap and it didn’t start right away a bit odd but not entirely out of character for my car but when I turned the key a second time I saw something out of the corner of my eye and it looked like whatever it was had gotten closer. \nThe drive goes without incident but I’m still off about what I saw, and when I get closer I radio in to see if they need me to pick anyone up. And the radio doesn’t work right, which was very out of character. These radios are designed to work in awful conditions and I was the closest I’d been to any sort of signal in a while. I chalked it up to the weather and pulled into the office. But as I do something runs past me.\nI did not get a good look at what it was but it was not a person and I’m telling you there’s not an animal in that woods that I know of that looks like either of the things I saw. And I just can’t seem to shake it.\nThing 2:\nThis happened more recently and is what prompted me to finally reach out to a forum of some kind. \nI was walking the trails for security purposes close to closing (we close around 11pm and start a final walk through around 9pm). We do this to make sure no one’s stuck on the trail or hurt so they aren’t stuck overnight when there’s fewer staff and none that patrol those trails. So I was walking one of our trails and I was pretty deep in woods already as I’m a fairly fast hiker and this is a trail I know well, I was already about a 2 miles into the trail when things start to get weird. I hear a noise off in the distance and at first I thought it could be a coyote or an owl so I pressed on (coyotes stay off the trails, won’t go after people unless they have dogs and dogs are banned in the woods here, and they know when we do our sweeps so I was not concerned). But then the noises got weirder. I’m used to the sounds of the woods and I know the area and the wildlife very well and I have never once in my life heard that sound before. It didn’t come from any animal I recognize and it most definitely was not human.\nI’ve never aborted a sweep before even when I’ve had coyotes nearby, but it did not feel right and I got out of there. (We are allowed to use our judgement in these cases). \nIf anyone has any idea what either of these things could be please let me know I really appreciate it. ", "media": null, "score": 34, "upvote_ratio": 0.97, "comment_count": 13, "over_18": false}, "12": {"id": "1eup0hc", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Street-Promise9455", "link_flair_text": null, "time": 1724467649.222833, "created_utc": 1723920706.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1eup0hc/woman_insistent_that_i_was_holding_a_child_hostage/", "title": "Woman Insistent that I was holding a child hostage  ", "permalink": "/r/LetsNotMeet/comments/1eup0hc/woman_insistent_that_i_was_holding_a_child_hostage/", "selftext": "So a kinda scary thing just happened to me a couple hours ago and I’m still kinda shaken up about it. \nA woman was knocking at my door, and when I answered she said she heard a child screaming and an older male yelling. She told me it was super loud, and she heard an older man saying something along the lines of “people are looking for you now”. \nI live in a duplex with my boyfriend and dog, we live on the main floor and we have a neighbor who lives by himself in the upstairs unit. We have absolutely no children. I also found it odd because moments before this I was in my shared laundry room (that you access from the backyard) with the back door open (I always do that to let my dog out into the backyard) & I heard absolutely nothing. \nThe way she was talking and the look on her face seemed really genuine so I was trying to assure her that we had no children, and she probably just heard one of the neighbors kids (we live close to the city in a populated area, so there’s lots of kids and they scream when they’re playing all the time). \nWe just kept going in circles- I didn’t have any children in the home and she most likely had the wrong house. I even offered her to peak over my fence and check the yard. But otherwise that was all I could do. But when I’d say these things she’d just stare with this accusatory look in silence- then start again on what she’d heard. That’s when she began to subtly force herself through the doorway, like a foot or a hand. By this point our upstairs neighbor and my boyfriend heard what was going on, and joined me in at the door. She just refused to accept my explanations & eventually fully got herself into the door way. she clearly wasn’t going to leave, so that’s when I called the police. She stood in that doorway until they arrived. \nAfter the cops talked with her and asked us questions, we found out she admitted to using meth earlier that morning. So they told us she was just experiencing hallucinations due to coming down from that. But they had to keep telling her “you’re free to go” and she VERY hesitantly left. She kept turning around and looking at the house, so the cops even hollered out “let’s just do a quick check” to make her believe they searched the house.\nI know this could’ve been so much worse and isn’t the craziest thing on this subreddit by any means. But I’m still so nervous that she will come back- can’t stop checking windows. \nSo, woman who thought I was a kidnapper, let’s never meet again. ", "media": null, "score": 266, "upvote_ratio": 0.98, "comment_count": 14, "over_18": true}, "13": {"id": "1exxooh", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "littlequeef99", "link_flair_text": null, "time": 1724467649.4573224, "created_utc": 1724266271.0, "url": "https://v.redd.it/uudy808rc2kd1", "title": "The Paris Catacombs - this is just one of the corridors, of the countless galleries that exist underground, and according to rumors they are all over the center of Paris.", "permalink": "/r/truecreepy/comments/1exxooh/the_paris_catacombs_this_is_just_one_of_the/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/uudy808rc2kd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 592, "scrubber_media_url": "https://v.redd.it/uudy808rc2kd1/DASH_96.mp4", "dash_url": "https://v.redd.it/uudy808rc2kd1/DASHPlaylist.mpd?a=1727059649%2CNzA4ODI2MjBhYzgyZWM0MDYzMjRlODBjYjFiYzk4YzhjZDBlOTJiNWQxNWVmY2RhOGFiNTc2ZDc1OWNjZDczMw%3D%3D&v=1&f=sd", "duration": 12, "hls_url": "https://v.redd.it/uudy808rc2kd1/HLSPlaylist.m3u8?a=1727059649%2CZmM3NDM4Y2ZiZTQ3OTdmOGRmNzNhZmU2MDJhYmRjMzM5YjZhOTE2NWUyNDY2MDI3YzQ2ODc3NjcwODU4ODJhNA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 167, "upvote_ratio": 0.98, "comment_count": 20, "over_18": false}, "14": {"id": "1euxk9v", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Ill_Assistant_9543", "link_flair_text": null, "time": 1724467649.6911461, "created_utc": 1723944514.0, "url": "https://www.reddit.com/r/threekings/comments/1euxk9v/christian_magick_the_casting_of_lots_cleromancy/", "title": "Christian Magick - The Casting of Lots (Cleromancy)", "permalink": "/r/threekings/comments/1euxk9v/christian_magick_the_casting_of_lots_cleromancy/", "selftext": "Hello my Christian brothers that find this ritual,\nYou may be wondering, could you get direct contact with the Lord Yahweh, our Father in Heaven? The answer is yes. The Casting of Lots allows you to obtain an answer from the Lord for strong life decisions and questions. Be warned that using this ritual will is nothing to be taken lightly. Do not use this ritual for Earthly matters and pleasures- Christ did not teach prosperity through popularity, wealth, fame, or materialistic matters. The greatest commandment is to love Yahweh above all (Matthew 22:36-40).\nThe casting of lots was done in Ancient Judaism for inheritance, discover whether Jonah was responsible for a storm, and selection of Apostle Matthias to replace Judas.\n1) Select an item with different colored items that are identical. You may use anything that will not allow or enable manipulation of the first item. Write down on a piece of paper of which color the results mean.\n\nA container\nDifferent colored straws, markers, or rocks\nUse a set with the following options. Do not force an answer and tempt God (Matthew 4:7). Take this seriously as if you were confessing doing a crime to your father as a child.\nYes\nNo\nNeither\nBoth\nNone / Other - This option is important. This way, there is no forced answer for your question.\n\nIn order to cast a lot, you must:\n\nHave faith for God's magick to work. This is actually how all religions of the world work. Holding faith in God allows the Holy Ghost to enter your body.\nIf you do not worship Yahweh, you are not communicating with him (John 9:31). Doing this ritual as an Atheist or pagan will result in communicating with different spirits unaffiliated with Yahweh.\nDo NOT conduct this ritual if you are not a Christian. If you do get an answer, it may be from a malicious spirit- such spirits hold no morals and can cast the results to harm you.\n\n2) Pray to God genuinely in your heart. Be very honest about your situation, question, or major decision. You must be honest with your intentions and heart- God will see right through you whether you consciously or unconsciously should go a path.\n3) Close your eyes, shake the container holding the items, and grab the first one you touch. That is your answer.\nLastly, DO NOT disobey the fate G-d gives you. You will end up with a worse fate. Do not badger for another fate if you hate the result and ask G-d for a new one- things will end horribly. Below are a few Biblical and historical examples:\n\nKing Hezekiah begging to live longer - King Manasseh and Hezekiah's sons taken to Babylon as eunuchs. Hezekiah's repentance did not stop this because he reaped as he sowed by giving away state secrets.\nKing Saul - G-d told Israel not to have a king. They refused to obey, so Saul came and fulfilled just as G-d warned them. Arguably, this also resulted in the whole book of Kings, Chronicles, and 2nd Temple Judaism's tragedies.\n\nOnly exception of badgering for another fate - Hannah\n\nThe difference is Hannah does not want a son out of selfishness, but rather to serve G-d. Prophet Samuel did just that.\n\nHypothetical Scenario - Badgering for Another Fate\nScenario: Let's say a man gave Yahweh an ultimatum: let him win the lottery or he will kill himself. There are two possible routes:\n\nGod intervenes - Allows the man to win:\n\nThe man will very likely endure an extremely difficult and likely worse-off life because of his behavior. The odds are this man has no idea of financial discipline and management, how difficult protecting money is, and all sorts.This will result in social isolation, social exploitation by friends and family and relatives for money, likely drugs and prostitution and being targeted for his money, and all kinds of calamity. He may end up becoming homeless with STDs, additional children he did not want, and all types of problems.\nWhy does God allow it despite his warnings? To teach the man a hard lesson. The man will be tested. If he succeeds the test, he becomes loyal to G-d. If he fails the test, he will likely die and go home.\n\nGod does not intervene - This is the more likely outcome.\nGod has willed the man is better off coming home without any of the 5 crowns in Heaven for his attitude. Whether the man truly held faith in G-d for starters is contextual to his salvation. If truly worthy for salvation, he will spend time in Sheol and learn a harsh lesson.\nGod knows the man will not actually kill himself.\n\nIf you choose to resort to the casting of lots, do not take this ritual lightly. Opposed to prayers, purposely manipulating the lots will turn this ritual into witchcraft and attract demons (1 Samuel 15:23).", "media": null, "score": 7, "upvote_ratio": 0.82, "comment_count": 2, "over_18": false}, "15": {"id": "1eyzwho", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Is_It_Haunted", "link_flair_text": null, "time": 1724467650.2217383, "created_utc": 1724374996.0, "url": "https://i.redd.it/6pvmp8cxbbkd1.jpeg", "title": "Apparition photo at the sooner theater in Oklahoma.  A picture of the rumored lady in a white dress.", "permalink": "/r/Ghosts/comments/1eyzwho/apparition_photo_at_the_sooner_theater_in/", "selftext": "", "media": null, "score": 1063, "upvote_ratio": 0.94, "comment_count": 69, "over_18": false}, "16": {"id": "1euogfy", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Denny_Dust", "link_flair_text": "Glitch Pic", "time": 1724467650.5602896, "created_utc": 1723919253.0, "url": "https://i.redd.it/g917b9z0p9jd1.jpeg", "title": "Wtf is wrong with this Gator??", "permalink": "/r/GlitchInTheMatrix/comments/1euogfy/wtf_is_wrong_with_this_gator/", "selftext": "", "media": null, "score": 1667, "upvote_ratio": 0.98, "comment_count": 450, "over_18": false}, "17": {"id": "1exkqr7", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "zenona_motyl", "link_flair_text": "Article", "time": 1724467652.0536933, "created_utc": 1724230665.0, "url": "https://anomalien.com/lue-elizondos-alarming-ufo-statement-prepare-for-alien-invasion/", "title": "Lue Elizondo, the former director of the secretive Pentagon unit that studied UFOs, has made headlines with a provocative statement suggesting that UFOs may be preparing for an alien invasion", "permalink": "/r/ufo/comments/1exkqr7/lue_elizondo_the_former_director_of_the_secretive/", "selftext": "", "media": null, "score": 613, "upvote_ratio": 0.86, "comment_count": 549, "over_18": false}, "18": {"id": "1ewcjxr", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "AltKeyblade", "link_flair_text": "Clipping", "time": 1724467653.4971213, "created_utc": 1724100056.0, "url": "https://www.reddit.com/gallery/1ewcjxr", "title": "Former Nimitz Chief Radar Officer Kevin Day calls out key individuals involved in the 2004 Nimitz Tic Tac UFO incident. \"The entire world is going to know who they are. I have had quite enough of bearing this burden alone. F**k them.\"", "permalink": "/r/UFOs/comments/1ewcjxr/former_nimitz_chief_radar_officer_kevin_day_calls/", "selftext": "\"The entire world is going to know who they are. I have had quite enough of bearing this burden alone. F**k them.\" - Kevin Day\n\"I was sworn to track and report all air contacts detected by SPY radar, including identification, flight safety, and tactical recommendations. This was my duty, just as it was for everyone else. Yet, I am of the very, very few who truly fulfilled that duty to our country. That is, did our jobs.\nIn return, I lost my career, ended up destitute in the Kalmiopsis Wilderness, and went through a painful divorce after a 30-year marriage with an ex-wife who even attempted to KILL me with a sword. I lost the respect of my fellow warfighters and endured relentless ridicule. I have faced it all, seemingly in vain.\nI now realize I was on a misguided quest, and I should have known that most were too cowardly to stand up. Only a few of the pilots and enlisted personnel involved showed true courage.\nLet's see. Aboard the PRINCETON, the key players were the CO, Tactical Action Officer (TAO), Anti-Air Warfare Coordinator (AAWC), Air Interceptor Controller (AIC), and the Electronic Warfare Coordinator (EWC). Names to follow.\nThe key players in the 2004 Nimitz Tic Tac encounter were:\n\nCaptain David Fravor - Commanding Officer of VFA-41, the Black Aces squadron. He was one of the fighter pilots who visually observed and engaged with the Tic Tac UFO.\n\nThank God some of the pilots showed REAL courage. Fravor is a hero even though he is an egotistical asshole. Beyond belief. I am not the only one that knows that.\n\n\nLieutenant Commander (LCDR) Jim Slaight - A pilot from VFA-41 who was also involved in the encounter. He was flying alongside Captain Fravor during the engagement.\n\n\nLieutenant (LT) Chad Underwood - A pilot from VFA-41 who recorded the encounter on video. His footage, known as the \"FLIR1\" video, captured the Tic Tac object from his fighter jet.\n\n\nCaptain Carl E. Smith - Commanding Officer of the USS Princeton (CG-59), the Ticonderoga-class cruiser that was part of the Nimitz carrier group.\n\n\nLieutenant Commander (LCDR) Jason \"Jay\" Turner - Tactical Actions Officer (TAO) aboard the USS Princeton, responsible for overseeing the ship’s combat operations and radar systems.\n\n\nLieutenant Commander (LCDR) Brian C. R. “B.C.” Powers - Anti-Air Warfare Coordinator (AAWC) aboard the USS Princeton, responsible for managing the ship's air defense operations.\n\n\nCaptain Robert \"Bob\" T. “Bobby” McCullough - Commander of Carrier Strike Group 11, which included the USS Nimitz and its associated ships.\n\n\nThese individuals played significant roles in the events and subsequent investigations related to the Tic Tac UFO encounter.\nThe pilots that have come forward are true heroes. However, focusing on them is missing the forest in the trees. The people with the real story were aboard ships dealing with these unknown air contacts for ~10 days. The pilots were only involved for perhaps 10 minutes. I know, I know. The Tom Cruise factor. I get it but that alone demonstrates just how misguided and unserious this entire investigative effort by Congress has been. A concocted hoax designed to scratch an itch hopefully putting the issue to rest -- it failed! I won. Check & Mate.\nIn 2004, the captain of the USS Princeton (CG-59), a Ticonderoga-class guided missile cruiser in the United States Navy, was Captain Carl E. Smith. He was in command during the famous \"Tic Tac\" UFO incident, where the ship's radar systems tracked unidentified flying objects off the coast of Southern California.\nDuring the 2004 \"Tic Tac\" UFO incident involving the USS Princeton, the Tactical Actions Officer (TAO) was Lieutenant Commander (LCDR) Jason \"Jay\" Turner. As the TAO, he was responsible for overseeing the ship's combat operations, including managing the radar and tracking systems that detected the unidentified flying objects.\nIt’s been almost 20 years since the TIC TAC incident, and yet most of those who were involved seem too focused on protecting their own interests to speak out about what really happened. I’ve lost respect for every single one of you who lacks the courage to come forward, especially the officers. Even after Congress lifted the NDA you signed, you’ve remained silent—a silence that loudly proclaims, \"I’m a coward.\" And sadly, that’s exactly what you are.\nWithout me speaking out early and often. And hiding smoking gun evidence in the Library of Congress in 2009. The world would have never even heard about TIC TAC. Fravor et al (the pilots) came forward because I did. I do not like Fravor personally, he reminds me of Trump, but the man does have courage. Or, is simply stupid like me.\nI'm not on X. Feel free to post for me there. I have my reasons. Forward and repost if you want to. Thank you in advance. My goal is the get the ship watchstanders in front of Congress. Pilots alone? Pure hoax designed to put this to rest. It is not going to work.\" - Kevin Day", "media": null, "score": 4171, "upvote_ratio": 0.9, "comment_count": 598, "over_18": false}, "19": {"id": "1eyk1zu", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "FunkleKnuck291", "link_flair_text": "Video", "time": 1724467655.3730175, "created_utc": 1724335201.0, "url": "https://v.redd.it/d7x3qnxs18kd1", "title": "Chester Bennington’s UAP encounter", "permalink": "/r/aliens/comments/1eyk1zu/chester_benningtons_uap_encounter/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/d7x3qnxs18kd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/d7x3qnxs18kd1/DASH_96.mp4", "dash_url": "https://v.redd.it/d7x3qnxs18kd1/DASHPlaylist.mpd?a=1727059654%2CNDUwMzdlNmU0ZjZjMzMxMWU2NmExYzE5NDQwNWQyYzIxOGU0ZjgxODNkN2NkZDA2NjhiOWQ0NmY3NzBkY2JkNg%3D%3D&v=1&f=sd", "duration": 120, "hls_url": "https://v.redd.it/d7x3qnxs18kd1/HLSPlaylist.m3u8?a=1727059654%2CN2NiZGQzNDIyNWUyYzZkNjgyYzEyMmViZmQ2NGM0NjRhMGZhNjNlNDk1OWZhNTcxZjY5NDZhYWIxZWQzYWEyMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1554, "upvote_ratio": 0.96, "comment_count": 124, "over_18": false}, "20": {"id": "1exkid8", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "anomalien_com", "link_flair_text": "Article", "time": 1724467655.9573252, "created_utc": 1724229713.0, "url": "https://anomalien.com/lue-elizondos-alarming-ufo-statement-prepare-for-alien-invasion/", "title": "Lue Elizondo’s Alarming UFO Statement: Prepare for Alien Invasion?", "permalink": "/r/UAP/comments/1exkid8/lue_elizondos_alarming_ufo_statement_prepare_for/", "selftext": "", "media": null, "score": 198, "upvote_ratio": 0.78, "comment_count": 278, "over_18": false}, "21": {"id": "1ez5cv3", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "meowbitchxoxo", "link_flair_text": null, "time": 1724467657.8721592, "created_utc": 1724392724.0, "url": "https://i.redd.it/yawd8l7wsckd1.jpeg", "title": "Look under the teeth…", "permalink": "/r/conspiracy/comments/1ez5cv3/look_under_the_teeth/", "selftext": "", "media": null, "score": 4243, "upvote_ratio": 0.9, "comment_count": 567, "over_18": false}, "22": {"id": "1ew53t6", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Vib_ration", "link_flair_text": null, "time": 1724467658.1477609, "created_utc": 1724082256.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1ew53t6/stress_is_the_silent_killer/", "title": "Stress is the silent killer.", "permalink": "/r/conspiracyfact/comments/1ew53t6/stress_is_the_silent_killer/", "selftext": "Luckily we have a \"switch\" inside our physical body to counteract stress. Even though it goes unnoticed and is unknowingly activated daily by most for other reasons.\nYou might have noticed it before, it's this extremely blissful subtle energy that's activated when experiencing Frisson, or as the Runner's High, as the Vibrational State before an Astral Projection, as Qi in Taoism / Martial Arts, as Prana in Hindu philosophy, during an ASMR session and as Chills from positive events/stimuli.\nIn ancient Chinese culture and ancient Indian culture, they observed that when activated, this can cause a few physical reactions like controlling your temperature, dilating your pupils, controlling your heartbeat, perspiration, smiling, teary eyes, flooding yourself with euphoria or activating in certain parts of your body and of course goosebumps.\nThis soothing subtle energy can be learned to be activated as you please without any outside stimuli, with just the simple intention of experiencing it. So imagine how helpful it can be when faced with unwanted stress/anxiety. You can even feel it over your whole body, flooding your being with its natural ecstasy and master it to the point of controlling its duration.\nIn the eastern part of the world they discovered that it can be made to flow through the body via channels coined as Meridians or Nadis that encompass the entire human body.\nIt has been documented in various cultures and has been coined under many names like Bioelectricity, Life force, Prana, Qi, Runner'sHigh, Euphoria, ASMR, Ecstasy, Orgone, Rapture, Tension, Aura, Mana, Vayus, Nen, Intent, Tummo, Odic force, Pitī, Frisson, Ruah, Spiritual Energy, Secret Fire, The Tingles, on-demand quickening, Voluntary Piloerection, Aether, Chills, Spiritual Chills and many more to be discovered hopefully with your help.\nNow for some of you that say that stress is good should consider that there are two types of stress and oxidative stress has been linked to several neurological diseases (i.e., Parkinson's disease, Alzheimer's disease (AD), amyotrophic lateral sclerosis (ALS), multiple sclerosis, depression, and memory loss).\nIf you are interested in learning how to active this whenever you please, here are three written tutorials going more in-depth on how you can control this subtle energy and to understand where it comes from.\nP.S. Everyone feels its activation at certain points in their life, some brush it off while others notice that there is something much deeper going on. Those are exactly the people you can find on the subreddit community r/spiritualchills where they share experiences, knowledge and tips on it.", "media": null, "score": 3, "upvote_ratio": 0.81, "comment_count": 0, "over_18": false}, "23": {"id": "1ey15h9", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "ufosww", "link_flair_text": "facebook", "time": 1724467659.1468012, "created_utc": 1724274675.0, "url": "https://i.redd.it/e7156xqv13kd1.jpeg", "title": "Anyone know any further details?", "permalink": "/r/bigfoot/comments/1ey15h9/anyone_know_any_further_details/", "selftext": "So I came across this post just now and wondered whether or not anyone else out there had heard anything further beyond this? ", "media": null, "score": 590, "upvote_ratio": 0.77, "comment_count": 479, "over_18": false}, "24": {"id": "1ev9yt7", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1724467660.1511648, "created_utc": 1723989704.0, "url": "https://i.redd.it/uq53wwwgifjd1.png", "title": "There may be freshwater seals in the Great Lakes. In 1882 a seal was reported in Onondaga Lake in New York. Locals thought it had swam there from Lake Ontario", "permalink": "/r/Cryptozoology/comments/1ev9yt7/there_may_be_freshwater_seals_in_the_great_lakes/", "selftext": "", "media": null, "score": 320, "upvote_ratio": 0.98, "comment_count": 47, "over_18": false}, "25": {"id": "1ewxpvq", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Johanharry74", "link_flair_text": "U.F.O. Humanoid", "time": 1724467660.3939888, "created_utc": 1724165786.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1ewxpvq/humanoid_close_encounters_from_the_nordic/", "title": "Humanoid close encounters from the Nordic countries - part 2.", "permalink": "/r/Humanoidencounters/comments/1ewxpvq/humanoid_close_encounters_from_the_nordic/", "selftext": "I continue the Nordic humanoid encounter series with four new fascinating cases from Denmark, Finland, Sweden and Norway....\nThe farting aliens.\nRaklev in Denmark, August 1956\nThis report has some funny elements and is a little unusual and was only published some years ago by the witness Arne‑Harder Jørgensen. He held on to it, because it would have strained his credibility in the labor market — in the military and later in the postal service.\nThe story takes place when Arne‑Harder was a 10 year old boy in the village of Raklev on Zealand in Denmark. One evening in August 1956 at approx. 8 pm he was playing “cowboys and indians” with other children and he hid in a pit he had dug in a hedge to the neighbour's yard. As he lay there waiting, he suddenly heard some strangers speaking \"like Japanese”, he thought is sounded like. He looked up and saw some small persons 7-10 meters (20-30 feet) away, eating rasberries from the bushes in the neighbour’s garden, while they farted and laughed out loudly like little boys. Armed with his air pistol, he snuck up on them, but was hit by a toxic stench of poop and chemicals.\nThe \"poison gas\" came from three small, gray beings. Since this was Scandinavia in the summer, it was not very dark outside at 8 pm, so he could see them quite clearly. They were 120 cm (4 feet) tall with enormously large heads, small mouths, two small holes for the nose and large, round, red or purple eyes. They all looked alike like “three drops of water”. The three also had tight fitting clothes and some big oversized shoes on their feet, like “moon boots”.\nRather funny picture of the encounter, for a quite amusing story. The aliens were farting and laughing while they were eating berries in the garden. (artistic impression)\nAt the sight of him, the beings throw away the rasberries. Arne‑Harder Jørgensen wanted to flee back down into his pit, but was paralyzed and turned towards the aliens. Two of them immediately ran away towards the apple orchard, while the third came closer and studied him and not least his air pistol. The boy felt that he was both photographed and X-rayed by the creature’s strange eyes.\nFinally the little gray man ran after the others. Arne-Harder remained motionless until a spaceship emerged behind a nearby ridge and sped upwards towards the sky at very high speed. This broke the “spell”, and he ran back to the other kids, who hadn't noticed anything unusual.\nFirst thing the next morning, he and three other children went up to the old gravel pit, which was located behind the ridge, and here they found four holes, which they assumed were from the landing gear of the craft. They also found a strange substance in the middle between the holes. This lump they peeled apart and hammered it down into a couple of the holes, which they covered with stone and sand. The aliens large, clumsy \"moon boots\" had also left traces both in the gravel pit and in the nearby pastures. The neighbour also said that a flower stand and three chickens were missing. The children found the stand in the gravel pit. But the birds were gone - along with the aliens. Also when Arne-Harder shot his air pistol a few days later, it broke into pieces, even though it was almost new.\nThis story has some childish and far fetched elements. Farting and laughing aliens eating berries? Really? Could this just be a kid’s fantasy story? Maybe, maybe not. And the other children who also saw the traces in the gravel pit, were never found or interviewed. Though the witness experienced this as a child, he waited until his retirement to tell the story, to not jeopardize his career. And the man was an officer in the military for a long time. That gives him some credibility. Or does it? Nothing is of course certain…\nSource: SUFOI\nThe Kinnula Ufonaut.\nKinnula in the middle of Finland, February 2-5 1971\nOn February 2, 1971, at approximately 8 pm, two Finnish women - Sinikka Kuittinen and one Mrs. Manninen - were driving from Kuusamo towards Oulu in a region near Kiiminki, when they saw a strange light behind their car, on the right side of the road.\nAfter a few moments, this mysterious light slipped over the vehicle and began to pace the car on the left side of the road. Sinikka, who was driving the vehicle, claimed that as the UFO passed overhead her ears began to mysteriously “plug up.” When the pair arrived at a nearby field, the light abruptly disappeared. This is when Kuittinen and Manninen both claimed to have caught a glimpse of the unbelievable. The women later insisted that they had seen a peculiar, helmeted creature that stood approximately 1 m (3-feet) tall. They both agreed that this strange being was clad in a greenish-brown suit and crossed the road in front of them utilizing a series of small jumps.\nThe two women in the car saw a small being in a green \\\"space suit\\\" crossing the road in front of them. (Source: Rob Morphy - American monsters)\nThis odd being swiftly disappeared on the far side of the road, which, the women confirmed, was a desolate area with no buildings or houses. Kuittinen, whose fear far outweighed her curiosity, hit the gas and sped directly toward the city of Oulu. Neither woman seemed interested in investigating the matter any further. As fascinating as this incident was, this would not be the last, nor the most frightening encounter that people would have with this enigmatic creature.\nThe incident that made this ostensibly alien being famous occurred on the snowy, overcast afternoon of February 5, 1971. On this day two lumberjacks, 21-year-old Petter Aliranta and 18-year-old Esko Juhani Sneck, had a close encounter that would haunt them for the remainder of their days. The fantastic event began at approximately 3:00 pm when the young duo, who had spent the morning cutting down trees in the forests near the village of Kangaskyla in Kinnula, Finland, decided to call it a day because the overcast conditions were making it too dark to continue.\nAccording to their account, Aliranta had just turned off his chainsaw, when he suddenly noticed an odd metallic object hovering at tree-top level. He claimed that it was shaped like “two saucers” on top of each other and was about 5 m (15 feet) in diameter. At the bottom of the vehicle, there were four thin landing legs with rounded bases, which he estimated to be more than 2 m (6 feet) long. If the craft made any sound it was no doubt overwhelmed by the continued roaring of Sneck’s chainsaw. Aliranta continued to watch as a circular portal opened at the base of the slowly descending ship. Within moments, the object landed in a small clearing between the trees, less than 15 m (45 feet) away from the awestruck lumberjack and his still oblivious comrade. Aliranta stared in amazement as a weird, green-garbed entity slowly descended through the open portal from the bowels of the craft. He later described this unusual entity as being less than 1 m (3 feet) in height and with its entire body covered in a green, one-piece suit. On the front of the head was a faceplate that was described as being akin to that of a scuba diver.\nAlthough the creature had arms and legs, the suit gave no indication of hands or fingers. The apparent structure of this suit seems to be similar to a hazmat suit or the deep sea suits divers wear to protect them from the pressure of the oceans most severe depths. Perhaps this alien was wearing something similar as the pressure of Earth’s surface may be harmful to creatures like itself. While this is pure speculation, there is still the possibility that it is true. The bizarre “Ufonaut” seemed to defy gravity as it floated down the 2 m (6 feet) to the snow-covered ground below the ship. It was then, much to Aliranta’s alarm, this creature began to approach him. Much to the lumberjack’s surprise, the being did not sink into the snow but continued toward him with short, stiff, gliding movements akin to that of an astronaut skipping on the moon. Aliranta described the motion as almost robotic, but perhaps its movement was just inhibited by the suit it was wearing. At that moment, Aliranta, who was understandably terrified, started his chainsaw. Sneck — who was so focused on cutting branches off a felled tree he had not noticed the anomalous aircraft or its occupant, turned at the roar of the chainsaw and saw the shocked expression on his friend’s face as well as the tiny, alien oddity that was galloping toward them.\nThe UFO and the Ufonaut (Source: Thinkaboutits)\nThe lumberjack, with what must be accredited to a jolt of youthful bravery, advanced upon the humanoid as Sneck watched dumbfounded. Aliranta and the encroaching alien were less than 10 m (30 feet) apart when the entity abruptly turned and started back towards his craft with the same looping gait. This retreat further emboldened Aliranta who now ran in pursuit of the “little green man.” When he got closer to the UFO, Aliranta claimed to have noticed other vaguely humanoid figures through three “windows” on the topside of the vehicle. When the alien was just 3 m (9 feet) away from the craft, it levitated into the air in an odd fashion, floating towards the opening from which it had come. Just as the humanoid had ascended to about 1 m (3 feet), Aliranta lunged and grabbed hold of the heel of the being’s right “boot” with his bare right hand. It was then he was overcome with a flash of pain, as the material of the creature’s suit burned like a “hot iron.” The wounds caused by the contact with the boot were, according to reports, still clearly visible two months later. Aliranta instinctively leapt backwards allowing the creature to glide back into its ship untouched. The moment the alien disappeared into the craft, it began to emit a soft buzzing sound. The machine slowly started to ascend off the ground with what Aliranta described as a “weak gust” of air, but no smoke or other scents were evident. As the saucer rose skywards the circular portal at the bottom closed and within fifteen seconds the UFO had disappeared into the atmosphere.\nOne of the lumberjacks tries to grab the Ufonaut by the foot, something he would later regret. (artistic impression)\nAccording to the eye-witnesses, the visit of this strange craft lasted at least three minutes. After the saucer had disappeared the men could not talk, for they were too amazed by the whole incident. They felt stiff all over and had some difficulty in moving, especially Petter Aliranta. It took them close on one hour before they were able to walk away from the woods. Before they left they had a closer look at the markings left in the snow from the landing gears, evidence of this incredible event. Where the landing legs had been standing, the snow had melted. Footsteps from the humanoid in the snow, were also clearly visible. \nOnce again we have a case where humanoids in some kind of space suits have been reported. We have seen similar stories all over the world. Like some aliens who come here, can not handle our atmosphere or pressure. We also see injures or burns from touching or going near an alien or UFO, something that has been reported many times before as well.\nUnfortunately this encounter was not reported to any UFO-investigators so no one was able to check out the landing site. And as with tracks in snow, it disappears very soon if it it snows more or the temperature gets warmer for example, so there is no other evidence, other than the witnesses.\nThe story was only told from hearsay by a local radio station some time after. So therefor it was speculated that the encounter was all a hoax. But none of the four witnesses ever admitted the story was made up.\nSource: https://www.thinkaboutitdocs.com/ufo-with-humanoid-encountered-by-two-forestry-workers-in-finland/\nFlying Saucer Review, 1971 no. 5\nThe two \"boys\" on the road.\nSahavaara in northern Sweden, December 18, 1977.\nIt is about 7 pm and it is dark and cold outside. Bruno Nygård is on his way home in the snow on his kick-sledge. It is only a few hundred meters to his house, when he sees a light above the old street lamps at the gravel road. It is heading down towards the ground and disappears behind some trees. After a while, he sees a floating object illuminated by the street lights. He thinks it looks like a dark gray, round snuff box or tractor tire, and there are two people sitting in it. On the edge, something similar to a lamp or reflex is visible. But then the object disappears again and Bruno continues his journey with the kick-sledge. After a few meters (yards) he then sees the object again. Now the two figures have got out of the \"snuff box\" and are walking next to it on the gravel road, one figure on each side of the object. It hovers on the road and slowly moves forward at the same time as the two people. Bruno thinks the people look like little boys and as they walk down the road, they bend down from time to time to pick something up from the ground. He thinks this is strange, because at the side of the road there is only snow and ice and small under vegetation.\nBruno saw two \\\"boys\\\" and a wierd hovering vehicle on the road in front of him. (artistic impression)\nAbout 20 meters (60 feet) from Bruno, the little boys stop and look at him. He cannot make out what they look like, since they are dark silhouettes in the glow of the streetlight just behind. When they spot Bruno, they both bend their legs and jump evenly and gracefully into the box, almost at the same time. The object now begins to quickly lift straight up almost silently, while spinning around, with the two boys in it. Bruno notes that while the craft spins, the two boys remain still in it. There was also no glass dome or roof on the craft. When the object has reached 15-20 meters (45-60 feet) in the air, it then deviates to the east and disappears over the treetops. Now Bruno understands that these figures were not at all \"boys\" he had seen, but something completely different, unexplainable and mysterious.\nJust a stone's throw from where Bruno saw the craft, lived his neighbors Einar and Anna-Lisa Harju. The couple sat in the living room sofa watching TV and unfortunately saw nothing of the strange happenings on the road outside. Anna-Lisa later explains to UFO investigators that Bruno was a man you could trust. He wasn't the kind of person to lie about things. If he says he had seen or experienced something, then it was like that, she says. Today, Bruno Nygård is gone, he was 92 years old and died in 2001, but his son still lives in the house. And he says the same about his father as his neighbor Anna-Lisa. Bruno was a serious and honest man, who would never think of making up stories for just for attention.\nSource: UFO-Sweden\nThe Marching Humanoid.\nYtterøya in Norway, June 1985 or 1986.\nThe incident took place in June just before the summer holidays on Ytterøya, a small island in the Trondheims fjord. The weather was nice with sun from a slightly cloudy sky. The witness whom we call \"Leif Vinje\" was a courier and had delivered goods to the shop \"Samvirkelaget\", which was located to the south of the island, right next to the sports field at the school. The warehouse entrance was at the back towards the sports field, and his car was parked next to the corner of the building. After bringing some documents from the shop, he went out to the car. As Leif walks towards the driver's side, he sees a small “space alien” coming straight at him. The humanoid was about 1.20 cm (approx 4 feet) long, and had a head, hands and feet just like us humans. But the head was a little bigger and the skin more towards gray and it had big eyes. It was dressed in a bright blue, tight jumpsuit. Leif thinks that the jumpsuit may also have gone up on the neck and head a bit. But here he is unsure and doesn't really remember, because it was the eyes that caught his attention the most. The eyes were larger than ours, almond-shaped and almost entirely black. The distance between Leif and the being was only 2 meters (6 feet). When they both caught sight of each other, the being stopped immediately and turned around. It looked like when a soldier is marching and doing a U-turn. Leif also thought that the walking style looked like a soldier marching, because when the humanoid walked, it raised its knees high and had its arms hanging straight along the sides of its body. Leif naturally got scared and took a step back to hide behind the car. A thousand thoughts ran through his head in a second. - Was this little creature dangerous? - Could there be any harmful radiation from it?\nThe strange humanoid near the school yard was marching like a soldier towards Leif. (artistic impression)\nSoon after, Leif comes to his senses and looks up again. Then he sees that the small being has jumped into a small UFO, which was standing on the asphalt behind the shop about 4-5 meters (12-15 feet) from him. The craft was parked on 3 landing legs and was flat on the underside. The lower part of the craft was in a gray, smooth and strange metal and on the top was a large transparent dome, like a \"snow globe\". The diameter of the small craft was only about 2 m (6 feet). Inside the glass dome, Leif could see two humanoids sitting side by side. They looked completely identical, the same size and appearance and the same blue jumpsuits. And completely synchronized at the same time, they turned to face Leif. It is this eerie part of the story that burned itself into Leif's brain and which he can see in front of him as if it were yesterday. The two beings inside the ship stared at him with an intense and stinging gaze. After that, the craft lifts a few meters without a sound, angles a little to the side, and then increases its speed. All the while the beings are staring at Leif. Then the ship becomes smaller and smaller, after a few seconds there was a streak of smoke or condensation from the ship, which then disappeared in a northeast direction.\nWhile the craft took off, Leif could still see the humanoids inside the transparent dome, and they both stared at him. (Source: Norwegian UFO magazine)\nWhen Leif came home, his wife immediately understood that something was not right. Had he hit something…or someone? Instead, his wife was quite surprised by what he told her, but she understood from the way Leif behaved and how shocked he was, that the strange story might be true. For many years to come, only Leif's wife and children heard about his experience. He didn't want to tell anyone else on the island, because he was afraid people would think he was crazy or a nutcase. But many years later, he got some courage and told his story to UFO-Norge. Leif Vinje is no longer with us today, but his fascinating story about the marching humanoid lives on...\nSource: Norwegian magazine UFO, issue 1, 2006", "media": null, "score": 51, "upvote_ratio": 0.99, "comment_count": 9, "over_18": false}, "26": {"id": "1ev0wgl", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Ok-Theory9963", "link_flair_text": null, "time": 1724467661.164113, "created_utc": 1723955728.0, "url": "https://i.redd.it/g932e9jhpcjd1.jpeg", "title": "It’s a bird.", "permalink": "/r/cryptids/comments/1ev0wgl/its_a_bird/", "selftext": "The shape, wings, tail, and head all match up. This might explain why the original photographer didn’t notice anything unusual. I’m pretty sure—it’s just a bird!", "media": null, "score": 929, "upvote_ratio": 0.9, "comment_count": 285, "over_18": false}, "27": {"id": "1eybezh", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "sacreligousshifter", "link_flair_text": "Discussion/Advice", "time": 1724467661.464493, "created_utc": 1724304153.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1eybezh/the_moon_has_been_full_for_too_long/", "title": "The Moon Has Been Full For Too Long.", "permalink": "/r/Thetruthishere/comments/1eybezh/the_moon_has_been_full_for_too_long/", "selftext": "I didn't know what to flair this as, but I have to talk about it somewhere that I feel like it may be taken more seriously.\nI go on drives nearly every night with my best friend/roommate, no specific destination, we just drive around the surrounding towns. \nI've noticed though, over the past handful of weeks, maybe even a month or two, every time I look at the moon, it has been full. It's creeping me out. Mind you, this couldn't be a timing thing due to how much we take these drives, and I always look at it.\nI've always been a fan of looking at the moon any chance I get, this can't simply be a mistaken moon phase or something of the sort. \nIt's full, and seems brighter than usual. I told my roommate, however she didn't take it seriously. Simply stating it was likely just a timing thing, pretty much just shrugging it off..\nI don't know what to do, but it's driving me crazy. I quite literally haven't seen anything but a full moon in so long. Please someone help, I just wanna see if anyone else is experiencing it. I feel like I'm going insane or something. I can start taking pictures if need be. ", "media": null, "score": 18, "upvote_ratio": 0.58, "comment_count": 65, "over_18": false}, "28": {"id": "1evwc3i", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "jamesplaytime", "link_flair_text": null, "time": 1724467661.8402543, "created_utc": 1724054858.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1evwc3i/my_ex_tried_to_kill_me/", "title": "My ex tried to kill me", "permalink": "/r/LetsNotMeet/comments/1evwc3i/my_ex_tried_to_kill_me/", "selftext": "I (f22 at time of writing this) was almost killed by my ex boyfriend (m about 30 now) I will be changing the names as to protect myself. I’ll start with a quick back story. At the time of the attack I was 19 almost 20. My ex Gavin was 27.we had a big chow chow and a cat the dog being his and the cat mine We lived in a three bedroom house the lay out being you walk in to the right is the living room in front of you the dinning room and off to the left a kitchen (open concept living and dinning room, closed kitchen) down a longish hallway we had the bathroom to the right, and the main bedroom at the end of the hall on the right. Than two other bedrooms on the two other walls. a few months before we had allowed a friend to stay with us (lacy) and it didn’t end will as she was just taking advantage of us.\nThe week leading up to the attack Gavin had just gotten back from a work trip which I believe was about 3-4 weeks away from home. The week he was back he was completely out of it, not being able to complete a thought, I’d ask or tell him something and less than five minutes later he’d completely forget or just not have heard me just off in some other world almost. One day I was very frustrated with this as I’d ask for help with chores or for him to take the garbage out only to be “ignored” one day he said that if it continues that he wanted me to slap him. \nwe’d gone out for dinner with his mum two days prior to the attack and she was obviously very worried about him as there was clearly something wrong, at the time the only mental disorder he had or was aware of was ocd. In which I am now even more convinced that that is not what he had by any means. \nThe day of the attack we’d just gotten back from grabbing some take out and were sitting on the couch in the living room. I’d been painting my nails and he playing Mario kart. He looked over at me and said “lacy put a curse on my family” I was dealing with my own really poor mental health at the time so wasn’t really in a space where I could be forcing on his. (I have bpd) I wasn’t sure what to do so I suggested he just hop in a cold shower as it helped him earlier In the week to just “reset” a bit. He walked into the bathroom and was muttering to himself and it just felt so off I don’t know how to describe it I didn’t feel safe. I walked over and asked if I could call his mum for him maybe invite her over for supper, kinda beating around the bush that I wanted her to come help him. He looked at me and just started yelling that all he needed was me. I walked out and started for the living room as I was calling his mum, he came of of the bathroom naked and started yelling at Ollie ( the dog) to discipline me and attack me mind you he was trained as my guard dog . At this point I believe his mum had answered the phone and heard what was happening. He started to call me lacy and that I needed to pay for what I did. \nI ran into the bedroom with my phone his mum still on the line. He kicked down the door and smashed my head into our mirrored closest doors and throw my phone to the ground . He was Screaming that he was going to kill me. I scrambled out the bedroom door trying to get to the front door. As I was passing the kitchen he got ahold of me and wrapped his arms around my throat, again saying he was going to kill me. I remember looking over to the table and seeing my cat sterling all puffed up I have never seen him so scared. I was fighting not to go unconscious, I couldn’t breath, I clawed at him just trying to get his arms off of my throat. I remember starting to see black specks in my vision and thinking I am going to die, what is he going to do with my body. \nHe asked me I knew what it was like to be raped , this is the part where I’m not sure if he was actually out of his mind as I had been raped before and it was a year that month, I was very open about how that had been effecting me. He throw me to ground and put his foot over my head as if to stomp on it.this was the only time I had seen his eyes through out the attack and they were almost lifeless his pupils so dilated, you could barely see the iris. He was yelling over and over again “ admit it lacy, you know what you did admit it” I just started apologizing doing and saying anything I could to make him happy. \nThis seemed to work as I got the opportunity to scramble to my feet and race out the door, I just wish I’d left the screen door open. \nI ran from house to house in nothing but shorts and sweater in February in on of the coldest provinces in Canada. I’d gotten to maybe 2-3 houses before I heard Ollie screaming. It’s a sound I can never get out of my head. I just dropped to the ground screaming and crying“Gavin leave him alone” I knew he’d killed the dog. At this point a bunch of the neighbours had heard me and came running to help. An older couple called the police and brought h me into their home not knowing if they were putting their own lives at risk. My parents were living in a completely different province. Someone gave me their phone to call my mum. She was out for supper with some friends and I just told her Gavin killed the dog and tried to kill me. The police finally showed up after what seemed like hours. 5-6 cars, fire arms out. They used the mega phone to tell him to come out with his hands up. He walked out naked and covered in blood. \nOnce they had gotten him into the car a police officer came to talk to me, while the others searched the house. Shortly after an officer came up and asked how many dogs we had , I told him one and a cat. I asked if Ollie was still alive and they told me he was dead in the bath tub, Gavin had killed him in the living room than brought him the bathroom filled up the tub and put ollies body in it. I had asked about the cat and they said they couldn’t find him just yet. I was sure he had killed my sweet boy too.sterling was the only thing I could think about I went into a panic and was no longer able to give them any more information as I was basically in tunnel vision “ where’s my cat, I want my cat find my cat” The officers asked if their was any treats they could use to coax him out and we’re his hiding spots where. They ended up finding sterling alive but scared and they couldn’t get to him as he was to scared and attacking the officers. They had blocked off the worst of the scene so they had me go in to get sterling. As much as they did block off there was still so much blood and the smell off blood and faeces is overpowering. Sterling was in the bedroom on the bed just crying. I scooped him up and asked the officers to find my vape. As I was walking out of the house Gavin’s mum had just gotten out of her car. She asked me where Ollie was and all I could say was “Gavin killed him” she dropped to the ground and started bawling. I just walked past her and put sterling in her car and sat in the front sir not sure what to do as I didn’t want to go with her. In that moment I hated her for what her son did to me and Ollie. To this day I regret how I acted towards her I had no right to be so cruel to someone who was also now suffering. \nMy mum had gotten ahold of my aunt that lived a few towns over. So once I was done with the officers I was to go with her. Once the police were done doing whatever it was they were doing in the house, I had to go back in to get clothes and such. They forgot to close the bathroom door luckily I wasn’t the one who walked by fist it was Gavin’s mum. The sound she made was horrible.\nEventually my aunt came and I went with her. The next day I had to go back to the house to get my thing the polic had gotten someone to take care of the body but not the mess of blood and bodily fluids and pee and poop. Half of the stuff I didn’t know what it was. His mum sister and I had to clean the house. Blood every where a lot of broken furniture nator His mum was kind enough ti clean all my bathroom things and throw through anything out that couldn’t b save.  Unfortunately I had African black soap. That night I waded myself  ith it and when i lookd down i was washing myself with a bar of soap caked in ollies blood. \nTwo weeks later sterling and I were on a plane to my mum. the court case took 2 years and I only later found out he had gone and loaded our guns, for the longest time I did it want to know how he killed Ollie but when going through the evidence a officer mentions a baseball bat. Not knowing I didn’t want to know what haves he only got ten months house arrest.\nTo this day two year later he still tried to contact me. Blaming m for not getting him help. I think the worst part is I do partly blame myself not just for not knowing to get him help but also for not leaving the door open for the animals for bringing the baseball bat into the house weeks prior because I was to lazy to walk it to the shed. \nThank you for reading and I hope maybe I can find some to relate to so I don’t feel so alone in my experience. I know that horrible to say but it’s just hard to speak to anyone about it that hasn’t been through something somewhat Similar. Any advice or comment are welcome again thank you for taking the time to read I know it was long and somewhat choppy my memory of that day is both a blur and also like I’m reliving it.\nLet’s never meet again Gavin ", "media": null, "score": 249, "upvote_ratio": 0.96, "comment_count": 20, "over_18": true}, "29": {"id": "1ew34eb", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "happypants69", "link_flair_text": null, "time": 1724467662.0607233, "created_utc": 1724077450.0, "url": "https://i.redd.it/983jsg78rmjd1.jpeg", "title": "The relic of Bir Hooker is a giant mummified finger from Egypt. Some believe it is evidence of an ancient race of giants, while others dismiss it as a hoax.", "permalink": "/r/truecreepy/comments/1ew34eb/the_relic_of_bir_hooker_is_a_giant_mummified/", "selftext": "", "media": null, "score": 92, "upvote_ratio": 0.75, "comment_count": 24, "over_18": false}, "30": {"id": "1eu9nla", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "ramienthedragon", "link_flair_text": null, "time": 1724467662.2802322, "created_utc": 1723870355.0, "url": "https://www.reddit.com/r/threekings/comments/1eu9nla/has_anyone_actually_played_hide_and_seek_alone_if/", "title": "Has anyone actually played Hide and seek alone? if so, what was it like?", "permalink": "/r/threekings/comments/1eu9nla/has_anyone_actually_played_hide_and_seek_alone_if/", "selftext": "Hide and seek alone is a japanese ritual where you play hide and seek with a possessed doll.", "media": null, "score": 4, "upvote_ratio": 0.75, "comment_count": 5, "over_18": false}, "31": {"id": "1exhqjl", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "giomorales", "link_flair_text": "Captured Apparition ", "time": 1724467662.7253098, "created_utc": 1724218546.0, "url": "https://www.reddit.com/gallery/1exhqjl", "title": "Girl sitting in front of a house in Oaxaca, Mexico", "permalink": "/r/Ghosts/comments/1exhqjl/girl_sitting_in_front_of_a_house_in_oaxaca_mexico/", "selftext": "My dad visited his hometown in Mexico after being in the US for over 25 years. He took various photographs while on his vacation and would send them to my family’s group chat. \nThis photograph depicts one of his aunts’ house. If you zoom into the door on the left you can see what appears to be the figure of a little girl. My dad swears nobody was sitting there, and mentioned no kids live at the house.", "media": null, "score": 372, "upvote_ratio": 0.84, "comment_count": 55, "over_18": false}, "32": {"id": "1eue8z2", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Herecomethefleet", "link_flair_text": "Glitch Pic", "time": 1724467663.0161226, "created_utc": 1723889179.0, "url": "https://i.redd.it/1xl14qpl77jd1.jpeg", "title": "Had a PC chair for 4 years. Heard a thunk and this screw just fell from the underside of it. There's just one problem, it doesn't have any screws like this at all and never has. I should know, I put it together myself.", "permalink": "/r/GlitchInTheMatrix/comments/1eue8z2/had_a_pc_chair_for_4_years_heard_a_thunk_and_this/", "selftext": "", "media": null, "score": 142, "upvote_ratio": 0.89, "comment_count": 40, "over_18": false}, "33": {"id": "1ex18by", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": "Article", "time": 1724467664.7279415, "created_utc": 1724174041.0, "url": "https://www.newsweek.com/i-worked-pentagon-americans-have-right-know-about-uaps-1941089", "title": "I Investigated UAPs at the Pentagon—Americans Can Handle the Truth : A new article in Newsweek\n was published today, as written by Lue Elizondo", "permalink": "/r/ufo/comments/1ex18by/i_investigated_uaps_at_the_pentagonamericans_can/", "selftext": "", "media": null, "score": 348, "upvote_ratio": 0.93, "comment_count": 83, "over_18": false}, "34": {"id": "1ex6m6z", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Substantial_Bat_4853", "link_flair_text": "Sighting", "time": 1724467666.2608025, "created_utc": 1724186952.0, "url": "https://v.redd.it/4dyj9e61tvjd1", "title": "Static UFO sighting in Contagem - Brazil", "permalink": "/r/UFOs/comments/1ex6m6z/static_ufo_sighting_in_contagem_brazil/", "selftext": "Just found this tweet containing the video, the author said the UFO wasn't moving at all. Here's the link:\nhttps://x.com/pitococremoso/status/1825857986234818652?s=46\n\"Ontem saindo da faculdade olhamos pra cima e simplesmente voando no céu de Contagem City um OVNI estático no céu em absoluto silêncio\nChupa Belo Horizonte, estamos fechados com Varginha!\"\nTranslation is something like \n\"Yesterday after leaving Uni we looked up the sky of Contagem City and there was this static UFO in absolute silence\nSuck it up Belo Horizonte, we are friends with Varginha!\"", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/4dyj9e61tvjd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 848, "width": 480, "scrubber_media_url": "https://v.redd.it/4dyj9e61tvjd1/DASH_96.mp4", "dash_url": "https://v.redd.it/4dyj9e61tvjd1/DASHPlaylist.mpd?a=1727059665%2CYWU5ZmUwOTM5YWExODE4YjFkNjc2ZTJhMjNmOWIxMTUyNWNmN2RiYjZlMmRjOTc0NGY0YmIyM2QxZDg3ODRiMA%3D%3D&v=1&f=sd", "duration": 14, "hls_url": "https://v.redd.it/4dyj9e61tvjd1/HLSPlaylist.m3u8?a=1727059665%2CMjY4MjFhMzM0OGM0ODFkNDE0OTRhMDdmNTFiMzcyZGU0MThlYmMxYzMzNjY4NjFkMGE5ODEzNDY1NTM4ZDE0OA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3983, "upvote_ratio": 0.79, "comment_count": 630, "over_18": false}, "35": {"id": "1ey5co6", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "pokezillaking", "link_flair_text": "Video", "time": 1724467668.0171075, "created_utc": 1724285584.0, "url": "https://v.redd.it/v0xxy2wsw3kd1", "title": "Lue Elizondo tells Ross Coulthart the U.S. has retrieved “vehicles of unknown origin” and “the occupants of these vehicles to include biological specimens.”", "permalink": "/r/aliens/comments/1ey5co6/lue_elizondo_tells_ross_coulthart_the_us_has/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/v0xxy2wsw3kd1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 356, "width": 640, "scrubber_media_url": "https://v.redd.it/v0xxy2wsw3kd1/DASH_96.mp4", "dash_url": "https://v.redd.it/v0xxy2wsw3kd1/DASHPlaylist.mpd?a=1727059666%2CYmE1NGI5MTBjMGE5ZDFiYTAyNzM1ODk2YmQ3NmMwNWI5YzhhMDhiZGUyODU3NzFhZTI4YmQ1ZjFhNjYzMjdkMw%3D%3D&v=1&f=sd", "duration": 46, "hls_url": "https://v.redd.it/v0xxy2wsw3kd1/HLSPlaylist.m3u8?a=1727059666%2CYTQ3ZjFhZTQ2NDFiM2EzOGEwN2Q1ODE5OGVkNjU4NTg4OGEyMWYyMjNmMzY2OWRmNzZkYmMxMjJkMjIxNTQwNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1266, "upvote_ratio": 0.92, "comment_count": 433, "over_18": false}, "36": {"id": "1ey4hb4", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": "Discussion", "time": 1724467668.696242, "created_utc": 1724283174.0, "url": "https://x.com/Ovniologia01/status/1826389263321288750", "title": "Kevin Day speaks about how he put his account of the Tictac Encounter in the Library of Congress, hoping someone would find it and ask what the hell happened off the coast of southern California.", "permalink": "/r/UAP/comments/1ey4hb4/kevin_day_speaks_about_how_he_put_his_account_of/", "selftext": "", "media": null, "score": 176, "upvote_ratio": 0.97, "comment_count": 7, "over_18": false}, "37": {"id": "1eyk3rt", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "dukey", "link_flair_text": null, "time": 1724467670.0357566, "created_utc": 1724335315.0, "url": "https://www.reddit.com/gallery/1eyk3rt", "title": "Billboards going up around London", "permalink": "/r/conspiracy/comments/1eyk3rt/billboards_going_up_around_london/", "selftext": "", "media": null, "score": 3430, "upvote_ratio": 0.82, "comment_count": 1677, "over_18": false}, "38": {"id": "1ezn2o7", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1724467670.3360107, "created_utc": 1724445336.0, "url": "https://www.youtube.com/watch?v=w_JHO8ifHiI", "title": "Two exciting videos, filmed in the Philippines and Colombia, clear video footage of a UFO.", "permalink": "/r/conspiracyfact/comments/1ezn2o7/two_exciting_videos_filmed_in_the_philippines_and/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Two exciting videos, filmed in the Philippines and Colombia, clear video footage of a UFO.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/w_JHO8ifHiI?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Two exciting videos, filmed in the Philippines and Colombia, clear video footage of a UFO.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/w_JHO8ifHiI/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 1, "upvote_ratio": 0.67, "comment_count": 0, "over_18": false}, "39": {"id": "1extnjx", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "OrganicRanger765", "link_flair_text": "class B encounter", "time": 1724467671.3272069, "created_utc": 1724256674.0, "url": "https://i.redd.it/2aj1i9mck1kd1.jpeg", "title": "Georgia Sasquatch ! I still can’t believe what I experienced. ", "permalink": "/r/bigfoot/comments/1extnjx/georgia_sasquatch_i_still_cant_believe_what_i/", "selftext": "Is there anyone out there in the BF community that lives in NEGA ??? Or the Stephen’s Co./ Habersham Co./ area In particularly ??? Is there any local researchers I could get in contact with !??! I have 2 distinct recorded vocals and a possible 3rd that sounds like a growl. All this happened on 8/18/24 around 9:30pm with a. Fool moon. Dogs were going crazy, so I left my phone outside on top of my car to record, while I went back in the house with my earphones still connected so I can hear simply because it was to close for comfort being outside. The neighboring dogs in this rural area I live were going nuts and at times It felt like this thing was imitating the dogs barking like fw them. It was loud and I’ve heard coyotes before, but based off distance of sound this thing had one hell of a lung capacity. ", "media": null, "score": 338, "upvote_ratio": 0.85, "comment_count": 158, "over_18": false}, "40": {"id": "1ew31zu", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1724467672.4048173, "created_utc": 1724077288.0, "url": "https://i.redd.it/udez6bpxqmjd1.png", "title": "The mountain boomer is a Texan cryptid described as a fast running bipedal lizard. It's voice is said to resemble the sound of thunder. One sighting described them as 6 feet or 1.8 meters tall. A man near Big Ben Ranch State Park once spotted it eating roadkill.", "permalink": "/r/Cryptozoology/comments/1ew31zu/the_mountain_boomer_is_a_texan_cryptid_described/", "selftext": "", "media": null, "score": 246, "upvote_ratio": 0.97, "comment_count": 31, "over_18": false}, "41": {"id": "1ew4vmy", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "North-Lettuce5254", "link_flair_text": "Personal", "time": 1724467672.6621048, "created_utc": 1724081724.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1ew4vmy/encounter_with_something/", "title": "Encounter with something", "permalink": "/r/Humanoidencounters/comments/1ew4vmy/encounter_with_something/", "selftext": "This happened when I was living out in South Korea back in the early 2000s. \nIt was Chuseok or Seollnal, I forget which, so I had time off work, and my friends/family were all off doing their own thing, so I ended up deciding to go for a short hike up a mountain. I'd been told that it was a fairly short hike, and it tends to always be deserted on chuseok so I figured nobody would be around to see me if I had to give up halfway.\nSo I set out on the mountain path, lots of trees, pretty nice. It was one of those commonly hiked trails so there were a few wooden pavilions around, mostly empty. I am hardly in good shape so around halfway up I decide to stop at one to catch my breath.\nThis pavilion was set just off a dirt path, quite narrow, and the only way to get up there apart from that would be to scramble up/down a quite steep dirt ledge. Which was why I was quite surprised to suddenly see an old man sitting at the side of the pavilion, when I was like 90% certain he hadn't been there before. \nI was weirded out but when I get over the initial fright I'm mostly just embarrassed that I must have been so out of breath I didn't notice this guy sitting there.\nIt takes me a minute or so of sitting there and drinking my water to realise something else strange.The guy is completely motionless. It was fairly windy up on the mountain that day but I swear even his hair isnt blowing. He's sitting with his side to me overlooking the mountain and he is just completely still. Like not even his eyes are moving at all. I went '아 잠시만요?' (excuse me?) to check if he was alright and he turns and gives me this huge, shit eating grin. \nA lot of people living in Korea assume my first language is English because I am white, but my first language is actually very obscure, less than 100k speakers worldwide obscure (not gonna name it because it's unusual enough to somewhat doxx me). You wouldn't be able to tell from my accent, I mostly just have a regular North American accent. So you can imagine my surprise when the guy answers me in that language and tells me that he is just enjoying the lovely day. \nI reply that I'm surprised he speaks that and he just winks at me, and I suddenly feel an absolutely insane amount of anxiety. I could literally feel my heart pumping in my teeth it was beating so fast. \nI just went home after that, booked it down the mountain as fast as possible. Never told anyone about it until today. Still wonder if I encountered something up there, or if I just had some kind of mental episode.", "media": null, "score": 32, "upvote_ratio": 1.0, "comment_count": 6, "over_18": false}, "42": {"id": "1ex352x", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Senseless_drama", "link_flair_text": null, "time": 1724467673.4328465, "created_utc": 1724178599.0, "url": "https://v.redd.it/88124x374vjd1", "title": "Screaming/ howling captured in Appalachian mountains ", "permalink": "/r/cryptids/comments/1ex352x/screaming_howling_captured_in_appalachian/", "selftext": "I’ve posted this in a different sub acouple of years ago, but thought I would bring it back again. This was captured on my front porch in rural Kentucky during the summer of 2022. In the clip you hear two distinct howls, then toward the end you hear what sounds like pig noises toward the end (I don’t own or ever ever seen a pig at my house). But wondering what you guys think ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/88124x374vjd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/88124x374vjd1/DASH_96.mp4", "dash_url": "https://v.redd.it/88124x374vjd1/DASHPlaylist.mpd?a=1727059672%2CNzA3ZWYxY2U5NzlhNDE1M2ZlMGQ4MWVjN2M1OWZlYjhlNDdiODE0Y2Y3ZTUzOGNhOTJjMjJjMWRhNmI1OWYwMw%3D%3D&v=1&f=sd", "duration": 34, "hls_url": "https://v.redd.it/88124x374vjd1/HLSPlaylist.m3u8?a=1727059672%2CMWUzYmMyZmUwYzdjZjE0OTcwZmE1YWE1YjYxOWFlYzk0YTJlMWMyMWI4YTJhYTlmZTE4OWExY2UxMTM1MTgwNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 407, "upvote_ratio": 0.96, "comment_count": 106, "over_18": false}, "43": {"id": "1exigi0", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "victim80", "link_flair_text": null, "time": 1724467673.7167675, "created_utc": 1724221340.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1exigi0/flash_of_red_light_filled_my_room_last_night/", "title": "Flash of red light filled my room last night.", "permalink": "/r/Thetruthishere/comments/1exigi0/flash_of_red_light_filled_my_room_last_night/", "selftext": "Got home late from work last night, I was lying down and had my eyes closed.\nWaiting for my mind to wind down so I could drift off to sleep, at around 1am a red flash of light fills my room, lasting for a half of a second. \nI sat up and immediately looked out my bedroom window to see if maybe the neighbors behind my house are goofing around.\nI didn't see anything out of place but couldn't shake off a feeling of unease.\nMy room has two windows,  one overlooking the back yard, and one that overlooks a house next door.\nIf it was a car it had some ridiculous tail lights.", "media": null, "score": 17, "upvote_ratio": 0.95, "comment_count": 8, "over_18": false}, "44": {"id": "1euy0ih", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "jamestar725", "link_flair_text": null, "time": 1724467674.1004024, "created_utc": 1723945955.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1euy0ih/open_the_door/", "title": "Open The Door", "permalink": "/r/LetsNotMeet/comments/1euy0ih/open_the_door/", "selftext": "This happened several years ago. While it may not be as scary as some of the stories here, it was definitely one of the most terrifying and bizarre encounters I've ever had. \nI (33m) live in the rural midwest. I was born and raised in my hometown and, with the exception of  a few months of living with my father on the East Coast, I've lived here my entire life. I've become pretty acquainted with the majority of the backroads in my area. \nOne such road is an old highway that no longer has the traffic of days prior to the construction of the Interstate that runs through the town. It's a long and winding road that offers gorgeous scenic views during the day, and a quiet escape from the \"city\" at night. \nAlong this road is a small lot with no more than ten parking spaces, two picnic tables and single trashcan. It's easy to miss due to the heavily wooded area surrounding it and the majority of the rest of the drive to it. Due to its secluded nature, it had played host to a fair share of teenage debauchery. I myself spent many a Friday night smoking away with my friends. \nNeedless to say there were a lot of good memories attached to this place and over the years it's become one of my favorite spots to venture to when I need peace or solidarity. \nOne night, about 5 years ago. My girlfriend and I were going through a rough patch. We had a big fight due to having to work early in the morning and her deciding to have a party full of her loud and intoxicated friends. Things escalated and I stormed out of the house and started driving towards my favorite spot. \nAs soon as I was out of city limits, I promptly cranked my angriest metal music and sped down the road, chain smoking my menthols in an effort to calm down until I finally found the turn off for the spot. I was happy to find no other cars in the lot, meaning I wouldn't awkwardly stumble upon two lovers engaged in the act. \nI immediately jumped out of the car and sat down on one of the picnic tables, lit a cigarette, and stared up at the stars. I sat there for several minutes until I decided to head back to the warmth of my car after hearing some rustling coming from the woods. Not wanting to become a chew toy for a coyote or an angry bobcat, I hustled back to my car and blared my music again, quickly forgetting the sounds I just heard. \nI decided to have one more smoke and then make my way home. I smoked it have way through when out of nowhere I heard pounding coming from the passengers side of my car. I looked over to see a large hand beating against the window. I turned down my music that was still blasting and as I did I can here a very angry voice shouting \"Open the f****n door!\" while yanking on the door handle.\nThankfully my doors were locked, and after a few moments the man disappeared from the passengers side and then reappeared out the drivers side window while screaming and cursing at me to open the door. He was now PUNCHING my window trying to get in. \nI was frozen in a mix of confusion and fear but eventually snapped out of it and threw the car in reverse. It was so dark I didn't get a good look at the guy accept for a split second he was illuminated by my headlights. \nHe had a black zip up hoodie with the hood up, a dark gray tshirt and a ball cap. He was a stocky guy and had to be well over 6 feet as he towered over my Sonata. The only distinguishing feature I could make out was a very large, dark beard. \nI noped out of there REAL quick. I floored it across the parking lot and back towards the highway.\nThat's when I heard it.... A loud BANG that sounded like a gunshot. \nI slammed my foot on the pedal took the first turn I could find. Once I was sure no one was following me I slowed down and realized I was doing 90 on a gravel road.\nAt the time one of my best friends worked for a nearby gas station so I made my way to tell him the whole story. We looked over my car thoroughly and found a couple of dents on top of the car and what looked like a boot print on my passenger door. \nWe talked it over and ultimately decided not to call the police. It's a twenty minute drive to the location from the closest town. We were sure that the guy would most likely be gone by the time anyone got all the way out there. (Yes, I realize this was probably ignorant of me in hindsight) \nI'm still baffled by this encounter. I don't know if the guy wanted to rob me, steal my car, or worse but I'm glad I made it home in one piece. And I hope I never meet that maniac again", "media": null, "score": 154, "upvote_ratio": 0.99, "comment_count": 9, "over_18": true}, "45": {"id": "1ezhai7", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "verystrangeshit", "link_flair_text": null, "time": 1724467674.3205764, "created_utc": 1724430932.0, "url": "https://i.redd.it/s82vwhjhyfkd1.jpeg", "title": "Bible John - the unidentified serial killer in Scotland who had an extremely unique appearance who murdered three women in Glasgow '68-'69. All three were last seen at the same club, all three were menstruating.", "permalink": "/r/truecreepy/comments/1ezhai7/bible_john_the_unidentified_serial_killer_in/", "selftext": "", "media": null, "score": 50, "upvote_ratio": 0.96, "comment_count": 3, "over_18": false}, "46": {"id": "1evogxb", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Few_Ear_5858", "link_flair_text": null, "time": 1724467674.5568962, "created_utc": 1724027288.0, "url": "https://www.reddit.com/r/threekings/comments/1evogxb/hello_my_name_is_barbra_and_i_like_to_summon/", "title": "hello my name is barbra and I like to summon spirits ", "permalink": "/r/threekings/comments/1evogxb/hello_my_name_is_barbra_and_i_like_to_summon/", "selftext": "hello , I have this wonderful game u can play at ur own risk , so what u need is a mirror a stool a red pen paper and a teddy (if not mirror use a toilet!) you want to go into ur bathroom and bring everything needed . sit on the floor with a flashlight on ur phone and door locked , with the pen and paper write down ur full name , address and body count . set the pen and paper down in ur bathtub and lay down . before you lay down get ur teddy and place on the stool beside u and drip a little bit of toilet water on it. keep the mirror up at ur face while u are laid down , say ur address and name 3 times and ur teddy should say it back . you cant fall asleep til sunrise so the spirit has left ur house . DONT TRY IF YOU GRT SCARED EASILY!!!", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 7, "over_18": false}, "47": {"id": "1ewg0na", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Due_Power8078", "link_flair_text": "Is this paranormal?", "time": 1724467675.0372114, "created_utc": 1724108654.0, "url": "https://v.redd.it/hdhmprq7cpjd1", "title": "Let me know what you think not sure what that dark shadow is flying around", "permalink": "/r/Ghosts/comments/1ewg0na/let_me_know_what_you_think_not_sure_what_that/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/hdhmprq7cpjd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/hdhmprq7cpjd1/DASH_96.mp4", "dash_url": "https://v.redd.it/hdhmprq7cpjd1/DASHPlaylist.mpd?a=1727059674%2CNzZjOGY1NTM1MjlhNDZmYjI5YzYzZmNkYmFlOTM0YjFhY2Y3NGY5MTVlNjUyNTkzNzhkODc3OTU4MzMxYzFiNg%3D%3D&v=1&f=sd", "duration": 47, "hls_url": "https://v.redd.it/hdhmprq7cpjd1/HLSPlaylist.m3u8?a=1727059674%2CNmEyZjcxMTg3OGY3MDdkNDlkNjEyNDIxMjY3YWFjNGJjNDBkM2Y4MTIxYmU5MDI1OGM0YjM4M2E3MDBkMjIwZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 71, "upvote_ratio": 0.8, "comment_count": 62, "over_18": false}, "48": {"id": "1evju2w", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "iledoffard", "link_flair_text": "Glitch Pic", "time": 1724467675.3585582, "created_utc": 1724014832.0, "url": "https://i.redd.it/1jr7g8b8lhjd1.jpeg", "title": "Red sun without red/orange clouds or sky", "permalink": "/r/GlitchInTheMatrix/comments/1evju2w/red_sun_without_redorange_clouds_or_sky/", "selftext": "", "media": null, "score": 91, "upvote_ratio": 0.93, "comment_count": 15, "over_18": false}, "49": {"id": "1ey7tam", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "BlueGTA_1", "link_flair_text": "Discussion", "time": 1724467676.9405837, "created_utc": 1724292551.0, "url": "https://www.reddit.com/gallery/1ey7ot0", "title": "Turkey UFO Incident /// Still No Debunked", "permalink": "/r/ufo/comments/1ey7tam/turkey_ufo_incident_still_no_debunked/", "selftext": "", "media": null, "score": 340, "upvote_ratio": 0.82, "comment_count": 226, "over_18": false}, "50": {"id": "1exmz9a", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "NHI", "time": 1724467678.382492, "created_utc": 1724239105.0, "url": "https://i.redd.it/3a1rxmex30kd1.png", "title": "Journalists finally starting to pay attention to the fact that the most powerful democrat in Congress has been trying to pass the craziest disclosure bill in history. A \"Bill that contains the phrase \"non-human intelligence\" 22 times\". ", "permalink": "/r/UFOs/comments/1exmz9a/journalists_finally_starting_to_pay_attention_to/", "selftext": "", "media": null, "score": 2806, "upvote_ratio": 0.94, "comment_count": 241, "over_18": false}, "51": {"id": "1evc2um", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "BuletinTerlambat", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1724467680.3602386, "created_utc": 1723995208.0, "url": "https://i.redd.it/646sc7pvyfjd1.jpeg", "title": "UFO caught on tape", "permalink": "/r/aliens/comments/1evc2um/ufo_caught_on_tape/", "selftext": "Elon Musk posted this", "media": null, "score": 1208, "upvote_ratio": 0.89, "comment_count": 35, "over_18": false}, "52": {"id": "1ewftr3", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Discussion", "time": 1724467681.0663245, "created_utc": 1724108161.0, "url": "https://twitter.com/Halsrethink/status/1825658208175702074", "title": "Harald Malmgren: \"60+ years ago I was provided highest level classifications to lead DOD work on nuclear weapons&anti-missile defense. Informally briefed on \"otherworld technologies\" by CIA's Richard Bissel (who had been in charge of Skunkworks, Area 51, Los Alamos, etc.) but sworn to secrecy.\"", "permalink": "/r/UAP/comments/1ewftr3/harald_malmgren_60_years_ago_i_was_provided/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/Halsrethink/status/1825658208175702074", "author_name": "Harald Malmgren", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">60+ years ago I was provided highest level classifications to lead DOD work on nuclear weapons&amp;anti-missile defense. Informally briefed on &quot;otherworld technologies&quot; by CIA&#39;s Richard Bissel (who had been in charge of Skunkworks, Area 51, Los Alamos, etc.) but sworn to secrecy. <a href=\"https://t.co/GcSEDiwPeH\">https://t.co/GcSEDiwPeH</a></p>&mdash; Harald Malmgren (@Halsrethink) <a href=\"https://twitter.com/Halsrethink/status/1825658208175702074?ref_src=twsrc%5Etfw\">August 19, 2024</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n", "author_url": "https://twitter.com/Halsrethink", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 166, "upvote_ratio": 0.97, "comment_count": 32, "over_18": false}, "53": {"id": "1evjnf6", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "pacmanpill", "link_flair_text": null, "time": 1724467682.3601246, "created_utc": 1724014383.0, "url": "https://i.redd.it/ueirhtzvjhjd1.png", "title": "This thing has been here for 8 hours now, in Tunis, Tunisia. No one knows what's this. Yesterday we had the biggest storm and rain ever. Never seen in August.", "permalink": "/r/conspiracy/comments/1evjnf6/this_thing_has_been_here_for_8_hours_now_in_tunis/", "selftext": "", "media": null, "score": 2995, "upvote_ratio": 0.93, "comment_count": 478, "over_18": false}, "54": {"id": "1ewav9a", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1724467682.6346529, "created_utc": 1724096075.0, "url": "https://www.youtube.com/watch?v=LQeNj2Cbwwk", "title": "Clear video footage of a UFO, amazing scenes filmed in the skies of Spain and Colombia.", "permalink": "/r/conspiracyfact/comments/1ewav9a/clear_video_footage_of_a_ufo_amazing_scenes/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Clear video footage of a UFO, amazing scenes filmed in the skies of Spain and Colombia.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/LQeNj2Cbwwk?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Clear video footage of a UFO, amazing scenes filmed in the skies of Spain and Colombia.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/LQeNj2Cbwwk/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 2, "upvote_ratio": 0.6, "comment_count": 0, "over_18": false}, "55": {"id": "1ezembm", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": null, "time": 1724467683.6194556, "created_utc": 1724424426.0, "url": "https://i.redd.it/aplyulnhefkd1.jpeg", "title": "Most famous for taking the \"Freeman Film\", Paul Freeman also photographed a bigfoot with his son several years before the footage. They were in Washington's Blue Mountains when the animal emerged out of the woods and his son snapped some pictures", "permalink": "/r/bigfoot/comments/1ezembm/most_famous_for_taking_the_freeman_film_paul/", "selftext": "", "media": null, "score": 305, "upvote_ratio": 0.94, "comment_count": 56, "over_18": false}, "56": {"id": "1evi4g0", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Potential-Reading402", "link_flair_text": null, "time": 1724467684.7154367, "created_utc": 1724010556.0, "url": "https://i.redd.it/gem9r9ri8hjd1.jpeg", "title": "Could It Be?", "permalink": "/r/Cryptozoology/comments/1evi4g0/could_it_be/", "selftext": "I have come to believe that several of the \"plesiosaur' sightings could very well be a giant freshwater long neck turtle, thought to be extinct. It fits the description and SOME photos (not all). Could that also explain why water samples show nothing unusual in them? Just a theory of mine. I was really struck by the Lake Champlain photos and videos as well as several from Loch Ness. It would certainly fit SOME of the descriptions. Anyhow. That's it. Thanks for playing. And yes, there's the nesting problem, I understand that.", "media": null, "score": 239, "upvote_ratio": 0.96, "comment_count": 24, "over_18": false}, "57": {"id": "1eusdm1", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Skeletonmolester3000", "link_flair_text": null, "time": 1724467685.8058696, "created_utc": 1723929677.0, "url": "https://i.redd.it/f54v7zt0kajd1.jpeg", "title": "Uncropped picture of the figure", "permalink": "/r/cryptids/comments/1eusdm1/uncropped_picture_of_the_figure/", "selftext": "", "media": null, "score": 411, "upvote_ratio": 0.95, "comment_count": 131, "over_18": false}, "58": {"id": "1euyrjz", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Pitiful-Ad-398", "link_flair_text": "Aliens/UFOs", "time": 1724467686.0780084, "created_utc": 1723948415.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1euyrjz/ufo_sighting/", "title": "UFO Sighting?", "permalink": "/r/Thetruthishere/comments/1euyrjz/ufo_sighting/", "selftext": "I didn’t think I’d talk about it, but I continue to think about a weird sighting me and a friend had around 10 months ago.\nOne night, me and two of my college friends went to try out our school’s archery club. They hold meetings at a building around fifteen minutes from campus. \nWhen we drove back it was around 8 pm, and since it was winter it was dark out. The three of us started walking back to our dorms from the school parking lot, and we were having a pretty normal conversation until one of my friends (L) looked up and asked if we saw something in the sky.\nMe and my other friend (A) looked up, and I first I didn’t see anything but then I noticed a large oval shape that was just slightly darker than the sky around it. The shape was moving pretty fast to the left, and so I only saw it for a few seconds before it was out of sight. \nA said she didn’t see anything at all, and L said he saw the same shaped object flying fast to the left but said he also saw lights which I didn’t. \nWe were really weirded out by it since it was way too large to be a drone and didn’t resemble any sort of plane. Also, since this was in central Wisconsin, there aren’t any kind of military bases that might’ve caused this (I think). \nAll three of us were pretty paranoid after this, but we successfully walked the rest of our way to the dorms without seeing anything else.\nTLDR: My friend and I saw a UFO(?)", "media": null, "score": 15, "upvote_ratio": 0.94, "comment_count": 2, "over_18": false}, "59": {"id": "1eu8yl9", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Conscious-Sample-975", "link_flair_text": null, "time": 1724467686.4716456, "created_utc": 1723867937.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1eu8yl9/bad_movie_theatre_experience/", "title": "Bad movie theatre experience ", "permalink": "/r/LetsNotMeet/comments/1eu8yl9/bad_movie_theatre_experience/", "selftext": "Today, my best friend and I (both 18F) went to see the new Alien Romulus movie, and while the film was as thrilling and terrifying as we had hoped, something else overshadowed our experience--- a man who sat directly behind us.\nWe first noticed him as we approached the theater. He stood out immediately, dressed in an old-fashioned brown suit with a blue dress shirt. I’m not exactly a fashion expert (I was wearing a hoodie with my college logo and shorts), but his outfit was unusual. Certainly not red carpet fancy, but fancy enough to where it makes people dressed in a baggy t-shirt and jean shorts look bad In comparison. As we got closer, he turned his head and stared at us, making no effort to hide it. And kept staring until we entered the building. It set off alarm bells in both of us.\nInside, while my friend ordered a mini pizza at the concession stand, she noticed that the man had come in, got behind us, and continued to stare. I was too distracted by movie posters to notice at the time, but she made direct eye contact with him.\nWhen we got our food, we headed to the ticket booth. The process was manual, and while we were figuring out which theater house was ours, I noticed that the man was again behind us, just watching. It struck me as odd, especially since he got his popcorn before we even got our pizza, but my mind didn't want to assume the worst.\nWe eventually found our seats in a theater that wasn’t very crowded. Only a few couples were sitting higher up, while we chose seats near the railing. Despite plenty of empty rows, the man chose to sit directly behind us. At first, I tried to brush it off, thinking maybe he didn’t want to sit alone or wanted to feel young again by being near some young ladies who had exaggerated reactions to jumpscares (which we did).\nThe man kept getting up and leaving the theater, sometimes for short periods, other times for longer. I could hear him grunting or sipping his drink, though I never heard him eat his popcorn (thankfully because I hate chewing noises). Occasionally, it felt like he was staring at us when he returned, and once, when I turned my head slightly, it seemed like he was.\nAs the movie neared its end, my anxiety peaked and I couldn't handle it. My heart was already racing from the suspense on screen and the growing paranoia. I decided I wanted to leave, and it seemed my friend felt the same way, as she immediately got up when I did. We were the first people out of the entire theatre to make a move to leave. Me and my friend noticed that the very moment we stood up to leave, the man did as well. As we made our way down the stairs opposite to the one he took, we noticed the man standing by his stairwell, just staring at us. He could’ve left before us, but he waited. When we passed him, he followed after us.\nAs we walked down the hallway leading to the exit, I tried to play it cool, making casual comments about the movie to avoid looking alarmed. My friend was too freaked out to respond, but I kept talking until we reached a corner, where she suddenly bolted for the front doors. I followed, walking quickly, pretending to be on the phone and holding my car keys. Once outside, we sprinted to her car, both of us shaking with fear.\nWe decided to go to a nearby store instead of heading home right away. As we pulled off into the road, I looked back and saw a truck moving about around the area we were in at the parking lot. My mind convinced itself that it was the guy, but I had no proof to go off of. While we were at the stores, we discussed what had happened, both of us admitting to feeling a bad gut feeling. My friend had muscle tension in her shoulders, while I felt nauseous and endured a painful stomach cramp.\nAfter some time, we returned to the theater parking lot. There were more cars and people around by then. She dropped me off at my car, and we agreed to meet at a nearby Walmart, just in case. As I pulled out of my parking space, I noticed a truck of similar color to the one I had seen earlier behind my car. My heart dropped, and I called my friend in a panic. The truck made an abrupt turn to get into the same lane as me (or so it seemed), but fortunately, there were enough cars at a stop sign to slow it down. We made several turns to lose the truck before arriving at Walmart (I want to clarify that we weren't sure if the truck was behind us or not, we just assumed the worst and did what we felt necessary in a scenario we were followed). When we finished shopping, our anxiety had extinguished itself and we both got home safely.\nReflecting on it now, I feel a mix of embarrassment and sadness. Maybe I was overreacting. Maybe the man just liked those seats or was trying to be polite by letting us go first. Perhaps he had a bladder problem, which explained his frequent trips out of the theater. Or maybe my paranoia made me imagine that the truck was his. I don’t know, and I feel a bit ashamed for assuming the worst. My friend and I love movies, and to run out of our favorite theater felt humiliating, especially if the man meant no harm.\nWas I overreacting, or was I right to trust my instincts? The whole situation feels weird and creepy, made worse by watching a horror movie. The movie was fantastic, though—just maybe not the best idea to watch it when your mind is already on high alert.", "media": null, "score": 143, "upvote_ratio": 0.96, "comment_count": 17, "over_18": true}, "60": {"id": "1exqc43", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "anonymouslyinvisible", "link_flair_text": null, "time": 1724467687.496388, "created_utc": 1724248719.0, "url": "https://i.redd.it/9og68w5pw0kd1.jpeg", "title": "Does anyone have an idea of what this could be?", "permalink": "/r/Ghosts/comments/1exqc43/does_anyone_have_an_idea_of_what_this_could_be/", "selftext": "This is at the Stanley hotel. I’m sitting down in front with my daughters. This isn’t my photo. Some guy standing in the back took this and I took a picture of his photo. There was nobody in front of the tour guide sitting on stage in red. Any insights are appreciated. Is there a way to tell if he manipulated the photo since this is just a photo of his photo?  The only thing I did was mark out their faces. ", "media": null, "score": 60, "upvote_ratio": 0.73, "comment_count": 64, "over_18": false}, "61": {"id": "1exrm6t", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "PsychologicalDrag385", "link_flair_text": "Glitch Pic", "time": 1724467687.8737328, "created_utc": 1724251909.0, "url": "https://i.redd.it/tcdmb5p661kd1.jpeg", "title": "Texture glitch😂", "permalink": "/r/GlitchInTheMatrix/comments/1exrm6t/texture_glitch/", "selftext": "", "media": null, "score": 63, "upvote_ratio": 0.9, "comment_count": 4, "over_18": false}, "62": {"id": "1ewvxv1", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Ad1714", "link_flair_text": null, "time": 1724467689.5731978, "created_utc": 1724161423.0, "url": "https://www.cbsnews.com/losangeles/news/this-isnt-just-any-ordinary-ufo-encounter-story-meet-a-man-who-says-he-has-proof/", "title": "This isn't just any ordinary UFO encounter story. Meet a man who says he has proof.", "permalink": "/r/ufo/comments/1ewvxv1/this_isnt_just_any_ordinary_ufo_encounter_story/", "selftext": "", "media": null, "score": 164, "upvote_ratio": 0.84, "comment_count": 136, "over_18": false}, "63": {"id": "1ew4ah2", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "News", "time": 1724467691.1111946, "created_utc": 1724080317.0, "url": "https://v.redd.it/kcfka9iuzmjd1", "title": "Today, CBSMornings: Interview with Lue Elizondo", "permalink": "/r/UFOs/comments/1ew4ah2/today_cbsmornings_interview_with_lue_elizondo/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/kcfka9iuzmjd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/kcfka9iuzmjd1/DASH_96.mp4", "dash_url": "https://v.redd.it/kcfka9iuzmjd1/DASHPlaylist.mpd?a=1727059689%2CYzI5N2IxNWNhOTA5M2U4YzA2YjI3MTBjMDgxMDgzNjdjMGMyY2I3ZGZiYTQ0YTg1YTAwYmM3ZmFmZmQ4YjE2Nw%3D%3D&v=1&f=sd", "duration": 304, "hls_url": "https://v.redd.it/kcfka9iuzmjd1/HLSPlaylist.m3u8?a=1727059689%2COWU4YzY0ZDFmMDBlZTEwYWM4MTkxMjJhZDc1ZDM5ZjE2YzUxMTNkODExMzk0ZTE0MTMxMzMwMGVlMjIwMTEwZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2780, "upvote_ratio": 0.94, "comment_count": 352, "over_18": false}, "64": {"id": "1ew4djf", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "News :illuminati:", "time": 1724467693.070505, "created_utc": 1724080528.0, "url": "https://v.redd.it/kcfka9iuzmjd1", "title": "Today, CBSMornings: Interview with Lue Elizondo", "permalink": "/r/aliens/comments/1ew4djf/today_cbsmornings_interview_with_lue_elizondo/", "selftext": "", "media": null, "score": 843, "upvote_ratio": 0.94, "comment_count": 125, "over_18": false}, "65": {"id": "1exb07f", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "Video", "time": 1724467693.787817, "created_utc": 1724198045.0, "url": "https://v.redd.it/e7zevsd4pwjd1", "title": "Ex-Pentagon official, Lue Elizondo's exclusive interview with Ross Coulthart premiering this Friday, August 23rd, on News Nation | Elizabeth Vargas Reports", "permalink": "/r/UAP/comments/1exb07f/expentagon_official_lue_elizondos_exclusive/", "selftext": "", "media": null, "score": 113, "upvote_ratio": 0.9, "comment_count": 14, "over_18": false}, "66": {"id": "1evpuw1", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Own_Teacher3433", "link_flair_text": null, "time": 1724467695.6984675, "created_utc": 1724031445.0, "url": "https://i.redd.it/u9t7b8yfyijd1.jpeg", "title": "This almost looks like it was carved out of one piece. It's a temple of Lord Shiva in Thanjavur Tamilnadu India built in 1010CE. ", "permalink": "/r/conspiracy/comments/1evpuw1/this_almost_looks_like_it_was_carved_out_of_one/", "selftext": "", "media": null, "score": 2819, "upvote_ratio": 0.91, "comment_count": 492, "over_18": false}, "67": {"id": "1evt7zb", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "WildInterest983", "link_flair_text": "encounter story", "time": 1724467697.040718, "created_utc": 1724042211.0, "url": "https://www.reddit.com/r/bigfoot/comments/1evt7zb/huh/", "title": "“Huh?”", "permalink": "/r/bigfoot/comments/1evt7zb/huh/", "selftext": "I believe I have seen/ heard what others know as a Bigfoot. About 6 months ago I was rucking with my 50 lb. pack around Lake Jacomo in Lee’s Summit Missouri, about 7 miles in from a trail head. I didn’t get a clear view but saw something running extremely fast through the woods about 70 yards to the right of me. It was big, heavy, and fast. Whatever it was darted through the woods effortlessly, but also made some thumping as it moved along, and shook all of the brush around it. I just chalked it up to being a large buck after I first saw it, but no clear view of the body, just lots of brush/trees moving. \nI went about another mile into the woods and that’s when I heard the voice. I heard “Huh?” in a very deep, loud voice. It was deeper than any human can talk , and I could feel it in my chest like a subwoofer. It sounded surprised that I was there, I’m guessing because I was deep in the woods, and slightly off the beaten path. I stopped in my tracks at first, then took about 10 more steps questioning if I really heard that, the possibilities of someone messing with me, etc. I realized I definitely did just hear that and got a bad feeling, like a sense of dread. I knew no one or anything I know of could sound like that. Maybe it was my fight or flight response kicking in, but I decided it was best to start walking the other way out of there and started speed walking back to my car, which keep in mind wasn’t exactly a cake walk because of how far I was into the woods with the weight on my back. I felt like something was watching me the whole way back. \nI’m a former Marine, and train consistently with my weapons. I am very confident with my ability to shoot my Glock 48 that I was carrying at the time. I had several magazines filled with hollow points and still didn’t feel like pushing further after hearing what I heard and then piecing together the big thing I just saw run through the woods earlier. \nThat is all I experienced, and just to clarify, I’m a perfectly normal guy with a normal life, and no reason to lie. I’m a decently intelligent guy and of sound mind. I did not believe in Bigfoot before this experience, but am now questioning all of the stories I’ve heard before, wondering how much truth there is to them. Writing this hoping someone else has heard something similar to me. Thank you for your time if you read this.", "media": null, "score": 228, "upvote_ratio": 0.94, "comment_count": 83, "over_18": false}, "68": {"id": "1ez43l4", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Skepticism ", "time": 1724467698.0171356, "created_utc": 1724387986.0, "url": "https://i.redd.it/grh9zr9teckd1.jpeg", "title": "Jeff Meldrum's drawing of how a sasquatch's foot bends vs how a guy with large fake shoes bends ", "permalink": "/r/Cryptozoology/comments/1ez43l4/jeff_meldrums_drawing_of_how_a_sasquatchs_foot/", "selftext": "", "media": null, "score": 236, "upvote_ratio": 0.86, "comment_count": 135, "over_18": false}, "69": {"id": "1eurzyg", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Skeletonmolester3000", "link_flair_text": null, "time": 1724467699.145071, "created_utc": 1723928719.0, "url": "https://i.redd.it/8u1e2146hajd1.jpeg", "title": "Weird figure update", "permalink": "/r/cryptids/comments/1eurzyg/weird_figure_update/", "selftext": "Here is my dad standing in the same spot as the figure was, less than an hour after the picture was taken. and you can see that he’s far too well-lit and clearly defined, and you can tell the direction he’s facing, as well as all of his features. I don’t think the figure in the og picture is human at all.", "media": null, "score": 404, "upvote_ratio": 0.96, "comment_count": 95, "over_18": false}, "70": {"id": "1ewq8rb", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "PUMPKINJUNGLE", "link_flair_text": "Disemb. Voice", "time": 1724467699.4373002, "created_utc": 1724142135.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1ewq8rb/chased_by_a_disembodied_laugh_at_night/", "title": "Chased by a disembodied laugh at night", "permalink": "/r/Thetruthishere/comments/1ewq8rb/chased_by_a_disembodied_laugh_at_night/", "selftext": "I recently posted an encounter with some sort of entity or creature that resembled the beings in the “Fresno Nightcrawlers” video and decided that I wanted to post this other encounter I had that happened near the same location I had with the Nightcrawler. If I recall correctly, this happened about a month after my first experience, so I would say around November of 2018 (Northern VA). \nMy friends and I were out one night and wanted to go to a store to get some snacks to eat. It was around 10pm and there was only one store we knew of that was opened in that area so we started walking to it. We decided to cut through a golf course just for the heck of it and stopped at a big pond that was in the middle of the golf course. We stayed there for maybe 10 minutes just talking and sitting around. \nWhile we were chilling, we heard a laugh come from quite a distance away. We didn’t think anything at first, because it sounded like it came from a distant neighborhood that was bordering the golf course. One thing I should add before continuing, is that the golf course either had its lights off that night, or didn’t have any to begin with. It was pitch black except for the faint light from the moon and the houses in the distance. Anyways, the laugh didn’t scare us at first, because it was far away. We got up and started walking for the path that leads to the exit of the golf course when we heard the laugh again, only this time much closer. The area we were chilling at was at one edge of the pond, and on the other edge of the pond was a small wooded area, and that’s where we heard the second laugh. After the second laugh, we decided to just get the hell out of there and went for the exit even faster. Once we got to the path, we heard the laugh again for the third time, this time it was at the exact area where we were chilling at. At that point, we all got off the path and ran through another set of woods that would lead us to a main road, but before we got into the tree line, one of my friends and I looked back to see what it was. There was nobody there. Despite there being no light posts, there were no trees by where we were at, and the moonlight would’ve at least been enough for us to see the shape or silhouette of a person. While running through the woods, we heard the laugh once more, this time on the path we were just at. We got through the woods and made it to the main road and that was the end of the encounter.\nOne thing I want to add is that the time between the first and second laugh was about a minute or two, and the distance between them was really far. We barely heard the first laugh and a minute later, we hear it at the other side of the pond, loud and clear. Whatever it was was moving unnaturally fast. The laugh itself sounded like a classic witch cackle. I understand that it could’ve been two or more people trying to be funny (which is why it seemed like it was moving fast), but the part that gets me is that we didn’t see anyone. We had a clear view of the pond and we were still close enough to it when we heard the third laugh but there was no one there, despite the laugh clearly coming from that area. The laughs were also very similar, it didn’t sound like two different people laughing. \nHas anyone had any experiences similar to this? What do you think it could’ve been? Feel free to ask any questions below and I’ll answer them as best as I can.", "media": null, "score": 12, "upvote_ratio": 0.88, "comment_count": 3, "over_18": false}, "71": {"id": "1evz8yi", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "According-Rhubarb715", "link_flair_text": null, "time": 1724467699.8294022, "created_utc": 1724066545.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1evz8yi/winter_2014_unknown_attacker/", "title": "Winter 2014 unknown attacker", "permalink": "/r/LetsNotMeet/comments/1evz8yi/winter_2014_unknown_attacker/", "selftext": "This happened in 2014/ 2015. I (F) was about 20 years old. I will give you some context before letting you know what happened. \nI was studying in a lovely seaside city in France, and everyone was cycling all the time. Cycling to school, to work, to parties, etc... It was very safe place, full of tourists and students. I lived and studied in this city between 2012 and 2015. Up until the events I am going to mention, I never ever felt unsafe and I didn't hear anything from my friends either  \nIn December 2014, my boyfriend took me to his engineering school's Christmas party. We were a large group of friends and mingled a lot. One of the guys from the group, whom I didn't know personally, left the party without anyone noticing. A month later, he was found dead in the harbor, and the police never figured out what had happened. I went online to check if there was any news, and it's still a cold case. I didn't know him, but I think about it all the time. Was it because he was alone? Did he fall, or did someone push him? Why didn't anyone care to walk home with him?\nNeedless to say, the city started to feel a whole lot less safe. But at 20 years old, I didn't have the same understanding of such things as I do now as a 30-year-old. My life carried on.\nA couple of months passed, and it was the beginning of 2015. A friend was assaulted badly while cycling back home after a party. He was found in critical condition, his body lying halfway on the road and halfway on the sidewalk. His head had been smashed on the sidewalk's step, and his jaw was completely shattered. He was a big guy in every sense possible, not the sort of guy you could push around easily. When he was recovering in the hospital, he couldn't make sense of what had happened. He had no idea why he was attacked on his bike. The police didn't find the suspect(s).\nTwo students, my age, in the same friend circles, were brutally assaulted for no reason.\nI still cycled everywhere because I had no other choice. I lived 8 km away from my school and I didn't have any other means of transportation. This meant that I cycled approximately 16 to 20 km every day, and I had been doing it since 2012.\nWe are in the spring of 2015. I am cycling back home from a party with my boyfriend. I have had a few drinks, but I am not drunk. I am just tired. My boyfriend is annoying me because he is not waiting for me, and the distance between us keeps getting bigger. Suddenly, someone jumps on me. He appears from nowhere and kicks my bike to the floor.\nI have been cycling so much. I am so used to the bike. I let it fall between my legs, but I do not fall. I resist and stand up.\nIt's a man. I reach for my bike, which is now on the floor, with my left hand. I'm trying to get hold of the handlebars. He kicks me, then my hand. He kicks again and again, but I'm already holding the handlebars. It hurts, but I'm lifting the bike. He says something, and I don't hear it. \nI see my boyfriend looking at me. He's a bit far away, but he's stopped cycling. He's going to help me; the man will see I'm not alone.\nI'm still standing and lifting my bike. It's been maybe two or three seconds since the man jumped on me.\nMy boyfriend is looking at me, and then he turns his back. My heart drops. He starts pedaling away. It's the dead of night, and there's no one else. I'm on my own.\nThe man keeps kicking. He wants me to let go. My hand looks blue, but my grip is strong. I think about the other two students. They give me strength. I think about my boyfriend.The sight of him cycling away fills me with pure rage.\nI'll use this rage. The man is holding some kind of glass in his hand. I grab it with my free hand and I smash it into his face. I'm doing it! I'm furious. I'm getting the bike up. Surely, the glass had alcohol in it, because it burns his eyes. I have a split second to launch myself and start pedaling away.\nHe can't reach my hand anymore, so he kicks my bike one more time. I stand strong on the pedals. He tries to chase me, but I am faster. I pedal until I can no longer breathe. I pedal until I feel numb.\nThat night, I know I escaped something terrible. Due to the stress, I couldn't describe the man. I'll never know for sure if my experience was linked to the other attacks. However we were all walking/cycling on the same route.\n10 years later, I can remember the look on my exboyfriend's face when he turned his back on me.\nLet's never meet either of these two men again.", "media": null, "score": 130, "upvote_ratio": 0.97, "comment_count": 23, "over_18": true}, "72": {"id": "1evnn5d", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Is_It_Haunted", "link_flair_text": "EVP", "time": 1724467700.6908813, "created_utc": 1724024921.0, "url": "https://v.redd.it/qxa93rn7eijd1", "title": "Audible Ghost cat meow during investigation at Hammel House Inn in Waynesville.   Details in the comments.  ", "permalink": "/r/Ghosts/comments/1evnn5d/audible_ghost_cat_meow_during_investigation_at/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/qxa93rn7eijd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/qxa93rn7eijd1/DASH_96.mp4", "dash_url": "https://v.redd.it/qxa93rn7eijd1/DASHPlaylist.mpd?a=1727059700%2CNzQ2ZmVhZDcwYzJhMDFlYThhNWM2OTZkNDdkN2RmYmQ2MjkwNzFlMmJiYTdhN2I0OGE1ODhlOTQ2OGQ4MTMwMg%3D%3D&v=1&f=sd", "duration": 27, "hls_url": "https://v.redd.it/qxa93rn7eijd1/HLSPlaylist.m3u8?a=1727059700%2CMGQ1ZGZhNjExM2QzMTU1ZTkxZDVhMTFkZDhjNDRiNDgzMzMwNDRhMDIxMWVhZDU3ZDk2MTYyMjI3NzBiYjk1MA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 60, "upvote_ratio": 0.72, "comment_count": 52, "over_18": false}, "73": {"id": "1evti63", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "TheChosenToffee", "link_flair_text": "Glitch Vid", "time": 1724467701.0087235, "created_utc": 1724043297.0, "url": "https://v.redd.it/56hn8lttwejd1", "title": "Gloves on a drill", "permalink": "/r/GlitchInTheMatrix/comments/1evti63/gloves_on_a_drill/", "selftext": "", "media": null, "score": 52, "upvote_ratio": 0.83, "comment_count": 8, "over_18": false}}}