{"_default": {"1": {"id": "1771sjn", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "notorious-bug", "link_flair_text": null, "time": 1697250925.4590695, "created_utc": 1697212083.0, "url": "https://www.reddit.com/gallery/1771sjn", "title": "Question everything you see", "permalink": "/r/conspiracy/comments/1771sjn/question_everything_you_see/", "selftext": "", "media": null, "score": 3891, "upvote_ratio": 0.85, "comment_count": 753, "over_18": false}, "2": {"id": "173o1kf", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Mysteryeverything", "link_flair_text": null, "time": 1697250925.9346602, "created_utc": 1696845621.0, "url": "https://youtu.be/sNngAqWlID4", "title": "The Illuminati does Exist", "permalink": "/r/conspiracyfact/comments/173o1kf/the_illuminati_does_exist/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Hidden Secret Societies: The Proof the Illuminati Exists!", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/sNngAqWlID4?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Hidden Secret Societies: The Proof the Illuminati Exists!\"></iframe>", "author_name": "Mystery Matrix", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/sNngAqWlID4/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@MysteryMatrix-TV"}}, "score": 6, "upvote_ratio": 0.88, "comment_count": 0, "over_18": false}, "3": {"id": "173si4k", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "TinyLaughingLamp", "link_flair_text": "Article", "time": 1697250927.6721492, "created_utc": 1696859940.0, "url": "https://www.the-express.com/news/science/114480/ufo-us-state-alien-sightings-california", "title": "UFO reports explode in US state with more than 16,000 sightings", "permalink": "/r/ufo/comments/173si4k/ufo_reports_explode_in_us_state_with_more_than/", "selftext": "", "media": null, "score": 899, "upvote_ratio": 0.92, "comment_count": 183, "over_18": false}, "4": {"id": "175ql4l", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "DragonfruitOdd1989", "link_flair_text": "Video", "time": 1697250929.3605862, "created_utc": 1697062502.0, "url": "https://v.redd.it/lzg2nn53entb1", "title": "Dr Edson Salazar Vivanco (Surgeon) dissects Nazca Mummy for a DNA sample. These are the very same samples that are now viewable online, and are being cross examined by individuals around the world.", "permalink": "/r/UFOs/comments/175ql4l/dr_edson_salazar_vivanco_surgeon_dissects_nazca/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/lzg2nn53entb1/DASH_480.mp4?source=fallback", "height": 480, "width": 854, "scrubber_media_url": "https://v.redd.it/lzg2nn53entb1/DASH_96.mp4", "dash_url": "https://v.redd.it/lzg2nn53entb1/DASHPlaylist.mpd?a=1699842928%2COWVlZjZiNzEyYzBlM2I0NDZmY2EwNGM0ZDc4YWRiNmI3ZGJlYTE5MmZjYmIxYjZjMzUyNjY0YzIxNjAxN2ViYQ%3D%3D&v=1&f=sd", "duration": 107, "hls_url": "https://v.redd.it/lzg2nn53entb1/HLSPlaylist.m3u8?a=1699842928%2CMzBjYmI3YTg0MjAxMmM4MmJmZTQ5ZTI5NGFkOWU3ZmYxM2NhMTY4NWMxYTNjOWMyNTljN2VjY2M2Mjk2ZGZlOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4169, "upvote_ratio": 0.78, "comment_count": 1684, "over_18": false}, "5": {"id": "175c8oe", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Hungry-Eggplant-6496", "link_flair_text": "LMAO :snoo_trollface:", "time": 1697250930.94476, "created_utc": 1697025399.0, "url": "https://i.redd.it/bmpoa339bktb1.jpg", "title": "The last month in a nuttshell.", "permalink": "/r/aliens/comments/175c8oe/the_last_month_in_a_nuttshell/", "selftext": "", "media": null, "score": 4771, "upvote_ratio": 0.95, "comment_count": 272, "over_18": false}, "6": {"id": "174356q", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "aliensinbermuda", "link_flair_text": null, "time": 1697250931.2922833, "created_utc": 1696885859.0, "url": "https://v.redd.it/6h32dnxjs8tb1", "title": "RICHARD DOLAN ISSUES A WARNING TO THE UFO COMMUNITY", "permalink": "/r/UAP/comments/174356q/richard_dolan_issues_a_warning_to_the_ufo/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/6h32dnxjs8tb1/DASH_1080.mp4?source=fallback", "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/6h32dnxjs8tb1/DASH_96.mp4", "dash_url": "https://v.redd.it/6h32dnxjs8tb1/DASHPlaylist.mpd?a=1699842931%2COWQ1NmMyYzdlODA0MTQ3OTMwNDk1ODFiYTNkMDBjODI1ZTdiOTJkMjc5ZTBkMGViMDZkMDBiMWNlZDdlYTA0OA%3D%3D&v=1&f=sd", "duration": 134, "hls_url": "https://v.redd.it/6h32dnxjs8tb1/HLSPlaylist.m3u8?a=1699842931%2CMjgwMDFlOGZmOTAzNjAwNWU5MjU2MWRhMjJkYzQ5ODZjNzY0N2I4YWMwMGQwZjY1ZGY4YTdlNDE2NjhkNDQ4Nw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 883, "upvote_ratio": 0.91, "comment_count": 199, "over_18": false}, "7": {"id": "174zgyp", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "zombiegrey", "link_flair_text": "Update", "time": 1697250931.73572, "created_utc": 1696980436.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/174zgyp/i_have_temporarily_moved_the_rgratefuldoe/", "title": "I have temporarily moved the r/gratefuldoe subreddit to private.", "permalink": "/r/UnresolvedMysteries/comments/174zgyp/i_have_temporarily_moved_the_rgratefuldoe/", "selftext": "Hi everyone,\nI made the decision to go private on the r/gratefuldoe subreddit overnight.\nThere are many, many reasons behind this. \nLast year, I was receiving death threats from the subreddit. I was told on multiple occasions I would ‘go missing’. Law enforcement had to get involved.\nWe have started to see an increase again in trolls on the subreddit, which now really only has myself as the active moderator.\nI needed to put the subreddit as private to deal with my own response to these trolls, to deal with some very concerning comments made, and to try to figure out how we can keep the community afloat.\nThis is not a permanent decision, but I need some time to work out next steps.\nObviously, this is not what I want to do, especially not with the great outcomes and discussions that have occurred on the subreddit. However, it is near impossible to float the ship alone, especially with the challenges I have experienced in the recent history of the subreddit.\nThis is not a permanent decision. But I cannot make decisions with the subreddit active right now. I do not feel it is safe, and many rules are being breached daily.\nhttps://amp.theguardian.com/us-news/2015/dec/11/grateful-doe-unidentified-man-named-jason-callahan-20-years-after-death\nThank you for understanding.\n\nGrey.\n", "media": null, "score": 1543, "upvote_ratio": 0.93, "comment_count": 247, "over_18": false}, "8": {"id": "1756el4", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "Yougotfoodforme", "link_flair_text": null, "time": 1697250932.1021106, "created_utc": 1697001709.0, "url": "https://www.reddit.com/r/MorbidReality/comments/1756el4/oklahoma_mom_pleaded_guilty_for_allowing_her/", "title": "Oklahoma mom pleaded guilty for allowing her 12-year-old daughter give birth to a 24-year-old man’s child.", "permalink": "/r/MorbidReality/comments/1756el4/oklahoma_mom_pleaded_guilty_for_allowing_her/", "selftext": "https://www.foxla.com/news/oklahoma-mother-pleads-guilty-allowing-12-year-old-daughter-give-birth-24-year-olds-baby\nA Tulsa, Oklahoma mother pleaded guilty in court late last month to allowing her 12-year-old daughter give birth to a 24-year-old man’s child.\nFOX 23 in Tulsa reported that Desiree Castaneda pleaded guilty to child neglect and enabling child sexual abuse, both charges she was arrested for in March 2022.\nIn June 2021, the pre-teen girl arrived at a midtown Tulsa hospital and was in labor.\nTulsa Police spokesman Danny Bean told the station in July 2021 that the girl and newborn’s father \"walked in just like any other couple would, excited to deliver their newborn child.\"\nAfter arriving, hospital staff called 911, and the newborn’s father, Juan Miranda-Jara, was arrested and charged with first-degree rape.\nBean told the station that Miranda-Jara, who was 24 years old, was bragging about becoming a father with a child giving birth, when officers arrived. \nHe was also heard saying he had the family’s blessing and was in a loving relationship with their daughter.\nWhen Miranda-Jara was arrested for rape, it was a surprise because Castaneda approved of the relationship and even threw a baby shower in preparation for the newborn’s birth.\nPolice told the station that Miranda-Jara was at first in a relationship with Castaneda, but when things did not work out, she was ok with him to st\nart dating her daughter.\nA study found that hotter temperatures could put pregnant women at risk of giving birth earlier than expected, sometimes as early as two weeks.\nMiranda-Jara was found guilty of first-degree rape in March 2022 and sentenced to 20 years in prison, though he will be eligible for parole after serving 17 years. He must also register as a sex offender. \nAfter pleading guilty to \nchild neglect and enabling child abuse, Castaneda was sentenced to 15 years in \nprison. Once she completes her sentence, she is required to register as a sex offender.", "media": null, "score": 2990, "upvote_ratio": 0.99, "comment_count": 241, "over_18": true}, "9": {"id": "175xm0g", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "chubachus", "link_flair_text": "Vintage", "time": 1697250932.2403328, "created_utc": 1697082718.0, "url": "https://upload.wikimedia.org/wikipedia/commons/4/40/A_wooden_plague_box%2C_carved_in_low_relief_with_the_figure_of_Wellcome_V0029669.jpg", "title": "“A wooden collection box for the benefit of plague victims, carved in low relief with the figure of Saint Roch as a pilgrim.”", "permalink": "/r/Jessicamshannon/comments/175xm0g/a_wooden_collection_box_for_the_benefit_of_plague/", "selftext": "", "media": null, "score": 31, "upvote_ratio": 0.95, "comment_count": 3, "over_18": true}, "10": {"id": "173zg38", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "StateSideSpoonZ", "link_flair_text": null, "time": 1697250932.4443889, "created_utc": 1696876879.0, "url": "https://i.redd.it/07jvzn3428tb1.jpg", "title": "In the 1990s Stanley Meyer had produced Water fuel celled Cars but he mysteriously died and his patent considered fraudulent", "permalink": "/r/UrbanMyths/comments/173zg38/in_the_1990s_stanley_meyer_had_produced_water/", "selftext": "", "media": null, "score": 16, "upvote_ratio": 0.75, "comment_count": 3, "over_18": true}, "11": {"id": "174pdhj", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "NotIsuna", "link_flair_text": "Native American", "time": 1697250932.638321, "created_utc": 1696955112.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/174pdhj/weird_experience_in_canyonlands_at_night/", "title": "Weird experience in Canyonlands at night", "permalink": "/r/Thetruthishere/comments/174pdhj/weird_experience_in_canyonlands_at_night/", "selftext": "This happened only a week ago. \nMy girlfriend and I were visiting the Arches and Canyonlands area for the weekend, and ended up heading out pretty late from Moab to get into Canyonlands (about 45min-1hr drive). A few years previous, I'd gone there myself and stayed until the moon rose, because that meant people were leaving, and as a field recordist, that meant a quiet environment to record in. That night in 2020, the moon was bright and there were a few night photographers there I ended up hanging out with, and it was generally a surreal experience and I felt completely safe. \nHoping to have a similar time again with GF along for the ride (and forgetting the fact that maybe the clouds would largely block moonlight that night), I drove us up. It was pretty dark before we even made it 15 minutes along the drive there. \nHaving been there (more specifically, Mesa Arch) twice before and this being a borderline spiritual place for me, I didn't even think about danger or anything of the sort. Despite that, I had a 6th sense type of gut feeling pretty early on that we shouldn't head up there that night. Not wanting to freak myself out, or my gf, I didn't say anything or think much of it, and chalked it up to just being nervous because it was dark. \nThere was a certain vibe along the roads leading up, and we noticed there were people leaving the park but no one coming in ahead of or behind us. The instinct to not continue hit me subtly a few more times, and I kept pushing it away like an idiot.  I've been very familiar with these instincts over the past years and they've served me well, as far as I can tell. I think I genuinely thought I was just scared because it was dark. \nWe ended up at the Mesa Arch parking lot, where two cars were packing up and heading out. When they left, it was almost completely dark with only the faintest glow of moon through the clouds, and not a person around anywhere near us. Canyonlands is pretty remote. \nWe get our backpacks on, grab a couple things, and my gf makes sure I've got my CCW. She doesn't usually care much, so this struck me as indication she was maybe concerned too. \nWe start heading up. It's a pretty short trail, maybe 1/4 mile. All we wanted to do was get to this little \"bowl\"-like area (the main destination) and hang out and record some sounds. The area is pretty open, with trees both live and dead scattered around, bushes and small cacti, and rocky slopes that can be climbed in a few seconds. It's a pretty dope scene in daytime. I've never felt uneasy here previously.\nWe'd been doing a bit of a travel vlog so far, so I continued doing that. \nI genuinely get goosebumps and chills every single time I think about this part. It was the weirdest feeling I've never felt. I've felt instinctua l\"I should get out of here\", \"I'm being watched\", etc. type of feelings before and have several stories to tell from those, but I've never felt what I felt while vlogging. \nThis might not seem relevant, but for context, the field recording I do is largely of gathering wood and rock sounds. Canyonlands has Navajo sandstone and Juniper wood, both of which sound wonderful when tumbled and rolled around. I think of field recording as an art, yes, but also as a way to appreciate a land in a closer way (at least for me) than just taking pictures of it. I feel like I'm capturing the essence of a location in a very respectful way. \nAs I'm vlogging, I felt something I can only describe as a need to show that I was there peacefully and with respectful intent. I didn't hear anything, or see anything, that would indicate that I needed to show I was here on peaceful business, but I felt it so strongly. Again, I didn't want to scare my gf, so I didn't say this. I figured I was just feeling on edge being in near complete darkness (we could barely see our own feet on the easy, open trail). \nWe'd kept our lamps off to let our eyes adjust to the glow, but I turned mine on to read a plaque. My gf mentioned I should probably turn it off so I don't create shadows and freak us out, so I turned it back off. I also felt like I was spotlighting myself by having it on, and I was about to turn it back off before she said that.\nWe continued and the uneasiness only grew. This lasted until we both reached the same exact spot on the trail and stopped at the same time, in silence. \n\"I think we should go back.\" My gf said, and I agreed. \nNever have I felt a stronger feeling of being unwelcome in a place. It felt like we hit a barrier. Not only did I feel unwelcome, it was more particularly the feeling of intruding on a congregation/meeting/gathering that we were not invited to. I don't know how to describe this feeling at all besides that, and it was not a conscious thought. It was just there, as these kinds of instincts tend to be. \nAt that point, I realized I'd been ignoring these feelings long enough and it was most certainly time to go. I have no idea what was going on in that little bowl we were about to reach, but I didn't want to find out. \nWe made our way quickly back to the car. As soon as we get back, we hear a large pack of coyotes quite nearby, but in the opposite direction we'd been heading on the trail. If we'd continued on that trail it was not coyotes we would've run into. \nStill, this felt like an additional cue to leave, and my gf said \"that's our cue!\". I badly wanted to record their yips, but common sense took over and we got the hell out of there. \nThe road, completely devoid of any sign of other people, was particularly eerie. Driving back wasn't just trying to get back to our campsite in Moab, it felt like we were escaping, like when you turn off the lights and run up the stairs. \nNow relatively safe in our car, we discussed what has just happened. \nEvery single unspoken, strong gut feeling I had had, my girlfriend had felt.tbe exact same things at the same times. \nBoth felt the need to show (something(s)? Someone(s)?) that we meant no harm by vlogging and being chill outwardly.\nBoth felt multiple times both on the drive there and on the trail that we shouldn't go. \nBoth felt at the same times that we were like actors on a stage being watched by a multitude of... something. \nBoth felt unwelcome, like we were crashing a party. \nBoth felt that we NEEDED to go, at the same exact point on the trail. \nNone of these were spoken aloud to each other at any point until we were back on the road GTFO'ing. \nAs we drove, the moon became visible for a bit. I'm not familiar with moon stuff, but it had been a full moon a few days before, and that night it was large (not full tho) and red. This was because of the red sand in the air from the windy day we'd had, I think, but my gf said that also meant bad juju. \nLooking into the history of the region, and even stories of strange happenings AT Mesa Arch, I am sure we avoided something strange and/or dangerous. \nI wanted to share this story here. Sometimes the places you love can still get spooky things going on when you're there at the wrong time.", "media": null, "score": 70, "upvote_ratio": 0.97, "comment_count": 13, "over_18": false}, "12": {"id": "176vzwb", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "amandarama89", "link_flair_text": null, "time": 1697250932.768613, "created_utc": 1697194412.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/176vzwb/encounter_with_traffickers_in_china/", "title": "Encounter with traffickers in China", "permalink": "/r/LetsNotMeet/comments/176vzwb/encounter_with_traffickers_in_china/", "selftext": "I’m a woman. I’m Chinese but grew up in Sydney, Australia. However I was born in Beijing but on the outskirts of it in a large town called Yungang Residental District where my mums family is from. When I was 5, I immigrated to Australia but my family would still travel back to China every few years. This incident happened in the snowy winter of 1997 when I was 11 years old. \nMy grandparents still lived in Yungang and introduced me to a brother and sister who lived in the same building as them. I can’t remember their exact ages but I think the older girl was around 14 and the younger boy was around 6. I still remember the exact outfit as I was wearing as I’d been wearing the same outfit all trip. At that time flared jeans were in and, coming from Australia, I wasn’t prepared for the snow and coldness of the Chinese winter and so on my first or second day there, my Chinese cousin had taken me to a shopping mall where she’d helped me haggle down the price of a bright pink duffle coat with fluffy white trimming. I thought it was the most fashionable thing ever (haha) and wore it every day. I have photos of me from the trip wearing that exact outfit.\nWe walked around town and ended up going to a very large park with a lake inside it. It was a little bit of a distance from the center of town. We were playing by the shore, throwing rocks, joking around and having a good time. At some point I looked up at realised it was getting dusky. Although it probably wasn’t very late but considering it was winter the sun set early. The park, which had never been very busy to start with, was nearly deserted. There were still some other people but they were a fair distance away from us.\nAll except for two men who suddenly approached us. They were middle to late middle aged, the “uncle” type. One of them approached me and said he was a friend of my father’s and that he’d asked him to pick us up. I remember being confused because my dad didn’t live in this town and was in another district about 2 hours away in Beijing where his family were from. Pretty quick I realised something was off and so did the brother-sister I was with. We all started making excuses and backing off. \nI still remember very clearly that as we started backing away, the man who approached us looked back over his shoulder at his companion as if asking him what he should do. His companion was standing a little distance away beside a white van with the door already slid open. I completely believe that he was considering snatching one of us and making a run for it. However perhaps because there were 3 of us and perhaps because there were still people around in the peripheries, they didn’t do anything.\nAs I walked away rapidly I looked back over my shoulder and remember seeing the two men just standing there, watching us go. That 15-20 minute walk back was one of the scariest walks in my life as I imagined someone grabbing me from behind every second. The sun set just as we got into my building and burst in through the door, so happy to be home safe. I did tell my mum and grandmother about it but at that time child kidnappings in China (while already definitely happening) were much less of a massive and widespread news story as it is now. I think my mum especially felt that my being almost kidnapped was somehow a commentary on her parenting skills and was very dismissive and even now dislikes it when I bring it up. \nNow that organised child and/or bride kidnappings are such a huge story in China it often makes me shiver at night to think how different my fate could have been. There have been so many stories about young women/girls kidnapped and forced into becoming brides of villagers in remote countrysides, sometimes tied to beds and having their legs broken to prevent them running away. They’re forced to bear children one after another. No one in the village will help them because almost all the men in the village have “purchased” brides from traffickers in this way. There’s also children, usually boys, kidnapped into families who have been unable to have kids or adopt legally. They fare a bit better but can also be abused and neglected.\nNow that I have my own kids and safe and warm in my bed in Sydney, I sometimes think about how wildly and irrevocably my life might have derailed that snowy evening in Yungang and shiver. Hi", "media": null, "score": 79, "upvote_ratio": 0.95, "comment_count": 4, "over_18": true}, "13": {"id": "1768hg9", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "dannydutch1", "link_flair_text": null, "time": 1697250932.9639552, "created_utc": 1697121406.0, "url": "https://www.dannydutch.com/post/edith-cavell-england-s-heroic-nurse-of-compassion-and-courage", "title": "Remembering Edith Cavell on the anniversary of her death. Executed in 1915 for helping about 200 British and French soldiers to escape the country - She admitted frankly what she’d done, and doesn’t appear to have been afraid of the consequences.", "permalink": "/r/MorbidHistory/comments/1768hg9/remembering_edith_cavell_on_the_anniversary_of/", "selftext": "", "media": null, "score": 17, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "14": {"id": "172o8no", "locked": false, "subreddit": "crimescene", "stickied": false, "category": "Crime", "author": "aloeGrimoire", "link_flair_text": "Accident ", "time": 1697250933.1366513, "created_utc": 1696733233.0, "url": "https://www.reddit.com/gallery/172o8no", "title": "Sampoong Department Store Collapse in Seoul, Korea - the Deadliest Building Collapse in the World Before 9/11", "permalink": "/r/CrimeScene/comments/172o8no/sampoong_department_store_collapse_in_seoul_korea/", "selftext": "", "media": null, "score": 811, "upvote_ratio": 1.0, "comment_count": 16, "over_18": true}, "15": {"id": "174j055", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Ok_Cup_521", "link_flair_text": null, "time": 1697250933.3040686, "created_utc": 1696937916.0, "url": "https://www.reddit.com/r/truecreepy/comments/174j055/three_years_later_i_still_dont_know_what_happened/", "title": "Three years later, I still don't know what happened to these people.", "permalink": "/r/truecreepy/comments/174j055/three_years_later_i_still_dont_know_what_happened/", "selftext": "In september of 2020, I was on a business trip going home from California. I was out in the desert near the border of Nevada and California with my coworker.\nI love exploring so I downloaded a database of all of the abandoned mining claims in nevada and found one that was nearby and not far off the highway.\nWhen we arrived, we had to drive over really rough terrain, through a winding road that was at some points a valley between ridges of hills. It was only about 2000 feet off the road but it was far enough that we couldn't see the mine from the road.\nAs soon as we got up to the base of the hill that the mine was cut into, we saw a car and had a bad feeling.\nThe car was dusty, it looked like it had been there for a while, and we called out but didn't hear any response. \nAs we opened the door to the mine, we saw that there was a pile of water bottles and some paint cans that supposedly contained food. \nIt didn't hit me until I saw the date written on the can - July 17th. That day was September 6th, 51 days later. If the people who put it there were still alive, they would have eaten it by now.\nIf you don't know about abandoned mines, they're very unsafe. You can slip and fall to your death, you can breathe bad air and suffocate or get hydrogen sulfide poisoning, you can get lost, your flashlight batteries could die; there are about a million ways to go into a mine and not come back out. They even place signs on the mines that say \"stay out, stay alive.\"\nI went to the police the next day to let them know what I had found.\n​\nI probably discovered what was left of some dead people. Three years later I can't help but wonder what happened to them.\n​\nHere is a link to a gallery that contains the relevant photos from this experience. \nhttps://imgur.com/a/XaeSo70\nI've checked the news from the area and never found anything relevant. If any of you guys know a place I can check to figure out what happened that would be awesome. I also have the plate number of the vehicle but don't think it's a good idea to post that online.", "media": null, "score": 47, "upvote_ratio": 0.94, "comment_count": 7, "over_18": false}, "16": {"id": "1757fj5", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "realscooterdom", "link_flair_text": null, "time": 1697250933.4211166, "created_utc": 1697005752.0, "url": "https://www.reddit.com/r/threekings/comments/1757fj5/if_you_did_the_11_miles_challenge_what_car_would/", "title": "If you did the 11 miles challenge, what car would you take?", "permalink": "/r/threekings/comments/1757fj5/if_you_did_the_11_miles_challenge_what_car_would/", "selftext": "Assuming I am seeking insane wealth as my desire, it wont matter if my car is destroyed at the end. I would go for something very reliable (German or Japanese comes to mind) and with four wheel drive. It would also be a coupe since they would handle well on mile 8. The Porsche 911 4S seems like a good choice. If it wasnt a coupe, i would take an Audi RS6 since they have impeccable traction especially on the dirt road sections.", "media": null, "score": 7, "upvote_ratio": 0.99, "comment_count": 5, "over_18": false}, "17": {"id": "1753fmo", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Last_Mammoth895", "link_flair_text": null, "time": 1697250934.253957, "created_utc": 1696991777.0, "url": "https://v.redd.it/ypqzzkisjhtb1", "title": "Weird experience and voice caught on video today", "permalink": "/r/Ghosts/comments/1753fmo/weird_experience_and_voice_caught_on_video_today/", "selftext": "I was at work today and my wife said something weird just happened. She sent me this video that captures movement when the dogs are barking etc. She was emptying the dishwasher in the kitchen which is in the other room about 20 feet behind the camera and you may hear that at the beginning of the video. She only noticed the door open to the closet at first. I had my AirPods in when she sent me the video and heard the voice immediately, i quickly realized she hadn’t heard this yet, it definitely gave me chills. She’s been really freaked out since after I made her aware of it. I’m really pretty quick to explain away certain things that happen around the house but these two happening right next to each other is too great to ignore. My first impression was the word “hiya” but when I keep listening to it I’m hearing “taya” more and more. Let me know what you think you hear or if I’m just losing it haha ", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/ypqzzkisjhtb1/DASH_720.mp4?source=fallback", "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/ypqzzkisjhtb1/DASH_96.mp4", "dash_url": "https://v.redd.it/ypqzzkisjhtb1/DASHPlaylist.mpd?a=1699842933%2CMGI3YjZhZWQ4NmI0MWZkYjlhMzM2MGI1MDE4YTJjOWMwMmU0MmMzMWEzY2QwNDcwNjQ3NjUzMzAzNmQyMjhhOA%3D%3D&v=1&f=sd", "duration": 15, "hls_url": "https://v.redd.it/ypqzzkisjhtb1/HLSPlaylist.m3u8?a=1699842933%2CMDUwYjZjMTAxYTY4ZmIzNWU4MWRiMmUyMjI4MzIwMjk1OTZlOTk1YzNlZGMxZTQyN2FkYTY2NTZiMTA0NTQxOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2131, "upvote_ratio": 0.94, "comment_count": 408, "over_18": false}, "18": {"id": "173q5w2", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Admirable-Media-9339", "link_flair_text": "Glitch Vid", "time": 1697250934.4758437, "created_utc": 1696853298.0, "url": "https://v.redd.it/pn9cyz8146tb1", "title": "People in this sub seeing a few cars that are the same color and thinking it's a glitch.", "permalink": "/r/GlitchInTheMatrix/comments/173q5w2/people_in_this_sub_seeing_a_few_cars_that_are_the/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 450, "fallback_url": "https://v.redd.it/pn9cyz8146tb1/DASH_270.mp4?source=fallback", "height": 270, "width": 398, "scrubber_media_url": "https://v.redd.it/pn9cyz8146tb1/DASH_96.mp4", "dash_url": "https://v.redd.it/pn9cyz8146tb1/DASHPlaylist.mpd?a=1699842934%2CZWI3MTVlMmUyNWFlY2QyMmViOGI3NjJmOGNjZDAwYjA5N2FhNjVhMGE1NGI5YzRlZGIyNTAwMTI0MTIxMmM4MA%3D%3D&v=1&f=sd", "duration": 5, "hls_url": "https://v.redd.it/pn9cyz8146tb1/HLSPlaylist.m3u8?a=1699842934%2CZGY0NTI1NDk4Y2JhMzQ2YTcyNmNmMGRlMGZiZjg5ZmFlOGZjZGJhY2I1YWQ3MDMyYzYwNWVhZTFkNTZiMGJkNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 174, "upvote_ratio": 0.94, "comment_count": 6, "over_18": false}, "19": {"id": "175jzdy", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "RyuFu12", "link_flair_text": "what is it?", "time": 1697250935.256966, "created_utc": 1697045892.0, "url": "https://v.redd.it/as0hj93k0mtb1", "title": "Bigfoot - Durango and Silverton Narrow Gauge Railroad Video", "permalink": "/r/bigfoot/comments/175jzdy/bigfoot_durango_and_silverton_narrow_gauge/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/as0hj93k0mtb1/DASH_720.mp4?source=fallback", "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/as0hj93k0mtb1/DASH_96.mp4", "dash_url": "https://v.redd.it/as0hj93k0mtb1/DASHPlaylist.mpd?a=1699842934%2CMTkzOWRiYWUyYjljNGEzNTZmNjY1ZjQ1ZmQyNjk4MGQwOTcxMDI4YTQ2NGUyMzk2MzY0ZjJhYmFjZWEwODVkNQ%3D%3D&v=1&f=sd", "duration": 18, "hls_url": "https://v.redd.it/as0hj93k0mtb1/HLSPlaylist.m3u8?a=1699842934%2CNTk3OGExNzZkNGFlNDFhMmM3MTZmZWRhZjEzMjIxYWY5OWU4YjVhYTIzMWExNWY3MTM2MGI5YjViZmEzMTY1Mw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1977, "upvote_ratio": 0.85, "comment_count": 547, "over_18": false}, "20": {"id": "175gxf5", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "tacticalDildos", "link_flair_text": "Video ", "time": 1697250935.8967497, "created_utc": 1697038409.0, "url": "https://v.redd.it/6ttzli2eeltb1", "title": "Bigfoot reportedly spotted from train in remote part of Colorado", "permalink": "/r/Cryptozoology/comments/175gxf5/bigfoot_reportedly_spotted_from_train_in_remote/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/6ttzli2eeltb1/DASH_720.mp4?source=fallback", "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/6ttzli2eeltb1/DASH_96.mp4", "dash_url": "https://v.redd.it/6ttzli2eeltb1/DASHPlaylist.mpd?a=1699842935%2CMDg5NGU0MTA3MzMwODg4YzQ1Y2U2MmE5Yzk4MjgyN2U4MzM0NzkzOGUxZmY1ZGNjNjFkZTM0MmE5Nzk0ZWZmZA%3D%3D&v=1&f=sd", "duration": 18, "hls_url": "https://v.redd.it/6ttzli2eeltb1/HLSPlaylist.m3u8?a=1699842935%2CNWUzMzk0Nzg1NjUzZTE4Mzg5NzExM2FjZGE5MmY1NTAzODc5OTc3ODI3ZmVlMzVhNWEyMmE5ZTRmNDAwZmRjZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2256, "upvote_ratio": 0.88, "comment_count": 340, "over_18": false}, "21": {"id": "175mfib", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "sinerama", "link_flair_text": "Personal", "time": 1697250936.0586379, "created_utc": 1697052110.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/175mfib/strange_encounter_twice/", "title": "Strange encounter TWICE", "permalink": "/r/Humanoidencounters/comments/175mfib/strange_encounter_twice/", "selftext": "Hey,\nI have found this sub to share my personal experience. I’m have been a marine in the Kenyan🇰🇪 army between 2011 and 2014. During my service I have visited the northern part of the country and the coastline of Somalia🇸🇴 .\n​\nMy first visit in the northern part I was on duty of guarding my sleeping unit (30 min shifts 23:00hrs to 05:30hrs until wake up time).\nDuring this time I went for number 01 and then the walkie talkie started making strange noise, I raised my head from my private part and saw a strange figure, 2-3 paces away. Looking straight at me. The eyes were shiny as in predator or night animals and the skin looked latex like. Or like a nylon bag.\nI went for my gun but when I raised my eyes again it was gone. When I informed in the walkie talkie the unit has woke up and we started a massive man hunt which resulted in nothing but me getting mocked and beaten by my pals for this incident. I thought i was insane but kept silent since.\n​\nTwo months later, i’m on a SHIP in the coastline of Somalia🇸🇴, this time placed on tower searching for raiding pirates. I’m alone, 3 meter high and my eyes are hawking down ANYTHING. Then i feel a strange touch on my neck, turning around and that rubber man is looking at me with these damn predator eyes.\nHe sent his hand as he’s willing to give me something, I opened my palm, terrified and stunned, his hand felt like a condom but the not lubed side and he left some kind of golden necklace in my hand. I look down on it and next when i look back he’s gone and the necklace is my dog tag (which I’ve seen numerous times and it’s not golden at all).\n​\nThis time i kept silent, and i have resigned from active service when we came back.\n​\nSince then i searched in numerous places for an answer, or something that might give me a clue or a direction. This sub may elaborate me.\n​\nHopefully anyone here knows something about this strange rubber man.\n​\nThanks,", "media": null, "score": 130, "upvote_ratio": 0.95, "comment_count": 25, "over_18": false}, "22": {"id": "1765347", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "BigfootDynamite", "link_flair_text": null, "time": 1697250936.9416456, "created_utc": 1697111433.0, "url": "https://v.redd.it/r8xe2wplfrtb1", "title": "A couple in Colorado shared footage they captured on a train of what they believe to be the legendary “Bigfoot”", "permalink": "/r/cryptids/comments/1765347/a_couple_in_colorado_shared_footage_they_captured/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/r8xe2wplfrtb1/DASH_720.mp4?source=fallback", "height": 1280, "width": 592, "scrubber_media_url": "https://v.redd.it/r8xe2wplfrtb1/DASH_96.mp4", "dash_url": "https://v.redd.it/r8xe2wplfrtb1/DASHPlaylist.mpd?a=1699842936%2CNDdlMjAxZTAxYTg5NDQyM2I1ODE2MTk4MWVjOTIxMzM4NmY5YzhjN2UwNGVlMTBiZGY1ZTZhMDczZTYyNTdhOQ%3D%3D&v=1&f=sd", "duration": 14, "hls_url": "https://v.redd.it/r8xe2wplfrtb1/HLSPlaylist.m3u8?a=1699842936%2CZjY0ZWI1ODI1OGE0NzRhZjNkZDJkYzk1YzczN2Y2ZTBhNGMzYjczNGExN2I2NDQ3M2Q5YjJkZjFkYjEzOGQzMw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 159, "upvote_ratio": 0.77, "comment_count": 38, "over_18": false}, "23": {"id": "174cl4p", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "OvertinMiss", "link_flair_text": null, "time": 1697250938.1889303, "created_utc": 1696912432.0, "url": "https://www.reddit.com/r/conspiracy/comments/174cl4p/ive_kept_an_eye_on_this_israel_situation_for_the/", "title": "I’ve kept an eye on this Israel situation for the past few days. Here’s what I’ve learned, & here are my blunt & honest thoughts.", "permalink": "/r/conspiracy/comments/174cl4p/ive_kept_an_eye_on_this_israel_situation_for_the/", "selftext": "\n\nIsrael chose to ignore intelligence from Egyptian officials about a major attack coming from Hamas.\n\n\nMultiple former IDF soldiers & Israeli intelligence personnel have come forward online and said there’s a zero percent chance Israel was unaware of this attack beforehand or couldn’t have prevented it.\n\n\nWe just watched unsophisticated terrorists on hang gliders soar into one of the most heavily-defended & surveilled countries on the planet.\n\n\nWithin 48 hours of the attack, we’re now suddenly seeing enormous support for an American war with Iran and the genocide of the Palestinian people.\n\n\nI’m witnessing American pastors and formerly level-headed influencers in our world completely lose their minds and call for genocide.  It’s unsurprising, but insane to watch.\nIf the events of the past three years have taught me anything, it’s that when people get whipped into an emotional frenzy, critical thinking completely goes out the window.\nPeople become highly suggestible and will rush to extremely dangerous conclusions without thinking about the consequences.  I think this is what we’re all witnessing with this situation in Israel.\nI’m reminded of Pearl Harbor and 9/11.  In both scenarios, the American government received intelligence in advance of the attacks, but chose not to prevent the attacks.\nWhy?\nThe American government was willing to sacrifice the lives of American citizens in order to advance its geopolitical goals.\nPearl Harbor gave the justification to enter WWII.\n9/11 gave justification to invade the Middle East & drastically expand the American military industrial complex & our surveillance apparatus.\nThey were brutal & extremely traumatic events for the American public to witness. The emotional trauma caused people to get whipped into an emotional frenzy.  \nAmerica wanted ONE THING in response to these attacks: The blood of our enemies.  I see the same psyop playing out now.  People are whipped into a frenzied bloodlust.\nIn their frenzied bloodlust, people are overlooking some SERIOUSLY important facts here, notably:\n\n\nThe fact that none of this adds up,\n\n\nInnocent civilians are being threatened with genocide, and\n\n\nEscalated violence in the Middle East and a war with Iran both risk the rest of the planet getting dragged into WWIII.\n\n\nWhat happened in Israel this weekend was obviously gut-wrenching and awful to witness, but I do not trust Israel’s so-called “intelligence failure”, nor do I trust the snakes in Washington calling for war with Iran, & I sure as hell no longer trust any of the emotionally-frenzied influencers calling for explicit genocide of innocent civilians.\nThis was a defining moment in history, similar to Pearl Harbor, 9/11, COVID, the beginning of the Ukraine war, etc, and a lot of people just got played.  Hard. \nPeople responded by going full mask-off, exposing themselves as reckless & incapable of exercising sound judgment in moments of chaos and heightened emotion.\nAnd we’re now at the brink of WWIII because of it.  This is all worth noting.\nThere’s a high likelihood there will be more chaos throughout the rest of this decade.  There will be more psychological operations.\nThere will be more moments in time in which cooler heads ought to prevail, but people will get whipped into an emotional frenzy instead.\nKeep your wits about you, & be cautious in whom you allow yourself to be influenced by.\nRecognize that governments & intelligence agencies spend enormous resources waging psychological operations on social media nonstop when stuff like this goes down.\nRemember that when chaos is at its peak, history shows there is ALMOST ALWAYS a hidden agenda being played out, & that hidden agenda is ALWAYS designed to prey on our base emotions to facilitate a desired end-result.\nPray for world peace tonight.\nThanks. 🤙\nWritten by SovereignBrah.", "media": null, "score": 3191, "upvote_ratio": 0.89, "comment_count": 928, "over_18": false}, "24": {"id": "176ohh2", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "weimmom", "link_flair_text": null, "time": 1697250938.5399053, "created_utc": 1697164765.0, "url": "https://www.youtube.com/watch?v=rGVgjS98OsU", "title": "How Palestinians were expelled from their homes (2023) - 75 years ago Zionist Militias executing \"Plan Dalet\" ethnically cleansed over 500 Palestinian villages, forcibly displaced over 80% of the native population of Palestine and declared 78% of British Mandatory Palestine to be \"Israel\" [00:16:25]", "permalink": "/r/conspiracyfact/comments/176ohh2/how_palestinians_were_expelled_from_their_homes/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "How Palestinians were expelled from their homes", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/rGVgjS98OsU?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"How Palestinians were expelled from their homes\"></iframe>", "author_name": "Vox", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/rGVgjS98OsU/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@Vox"}}, "score": 5, "upvote_ratio": 0.78, "comment_count": 3, "over_18": false}, "25": {"id": "175vexv", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "quetzalcosiris", "link_flair_text": "Article", "time": 1697250939.9128008, "created_utc": 1697076047.0, "url": "https://www.postapocalypticmedia.com/massive-ufo-hidden-international-nightmare/", "title": "Massive UFO Hidden in 'Laudatory' Building, Journalist Ross Coulthart Hints", "permalink": "/r/ufo/comments/175vexv/massive_ufo_hidden_in_laudatory_building/", "selftext": "", "media": null, "score": 488, "upvote_ratio": 0.86, "comment_count": 420, "over_18": false}, "26": {"id": "173byme", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "RedManMatt11", "link_flair_text": "Video", "time": 1697250941.0812278, "created_utc": 1696804242.0, "url": "https://v.redd.it/o9hlwmg622tb1", "title": "UFO appearing to follow commercial aircraft near LaGuardia in NY", "permalink": "/r/UFOs/comments/173byme/ufo_appearing_to_follow_commercial_aircraft_near/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/o9hlwmg622tb1/DASH_720.mp4?source=fallback", "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/o9hlwmg622tb1/DASH_96.mp4", "dash_url": "https://v.redd.it/o9hlwmg622tb1/DASHPlaylist.mpd?a=1699842940%2CNGNjZTBjNGJlZjYzMzJjM2Q1MmM3MGE5ZWZmYjQwZDJiZTgyNjlhNTJiNTNjZWNlMTYyN2RkMjAzZDY4ZTY3Yw%3D%3D&v=1&f=sd", "duration": 20, "hls_url": "https://v.redd.it/o9hlwmg622tb1/HLSPlaylist.m3u8?a=1699842940%2CNzE5ZTdiZDk2ZGQwOTQzNDlkYmZjOTgyMGM0ZTE0MTM0ZjQ2MTg0NTMxNGM1OWEyOGE1NjcxOWMzNDE3OWZmYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3506, "upvote_ratio": 0.78, "comment_count": 647, "over_18": false}, "27": {"id": "176g8ww", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Trueboey", "link_flair_text": "Unexplained :snoo_shrug:", "time": 1697250942.70357, "created_utc": 1697141630.0, "url": "https://twitter.com/Unexplained2020/status/1712561502849561080", "title": "Ex-NASA researcher Ed Harris claims that the story of President Jimmy Carter crying after being briefed on classified UFO information is true. Even Richard Dolan writes about this in his book.", "permalink": "/r/aliens/comments/176g8ww/exnasa_researcher_ed_harris_claims_that_the_story/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/Unexplained2020/status/1712561502849561080", "author_name": "Vicky Verma", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">Ex-NASA researcher Ed Harris claims that the story of President Jimmy Carter crying after being briefed on classified UFO information is true. Even Richard Dolan writes about this in his book.<a href=\"https://twitter.com/hashtag/UFOtwitter?src=hash&amp;ref_src=twsrc%5Etfw\">#UFOtwitter</a> <a href=\"https://twitter.com/hashtag/UAPtwitter?src=hash&amp;ref_src=twsrc%5Etfw\">#UAPtwitter</a> <a href=\"https://twitter.com/hashtag/UAPs?src=hash&amp;ref_src=twsrc%5Etfw\">#UAPs</a> <a href=\"https://twitter.com/hashtag/UAP?src=hash&amp;ref_src=twsrc%5Etfw\">#UAP</a> <a href=\"https://twitter.com/hashtag/UFOX?src=hash&amp;ref_src=twsrc%5Etfw\">#UFOX</a> <a href=\"https://twitter.com/hashtag/uapX?src=hash&amp;ref_src=twsrc%5Etfw\">#uapX</a><a href=\"https://t.co/xCLaX4gGDd\">https://t.co/xCLaX4gGDd</a></p>&mdash; Vicky Verma (@Unexplained2020) <a href=\"https://twitter.com/Unexplained2020/status/1712561502849561080?ref_src=twsrc%5Etfw\">October 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n", "author_url": "https://twitter.com/Unexplained2020", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 3054, "upvote_ratio": 0.87, "comment_count": 704, "over_18": false}, "28": {"id": "172gq7y", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Smooth_Network_1304", "link_flair_text": null, "time": 1697250943.053671, "created_utc": 1696712387.0, "url": "https://www.reddit.com/r/UAP/comments/172gq7y/what_is_the_most_credible_podcast_to_listen_to_on/", "title": "What is the most credible podcast to listen to on these topics?", "permalink": "/r/UAP/comments/172gq7y/what_is_the_most_credible_podcast_to_listen_to_on/", "selftext": "With a host that people take seriously", "media": null, "score": 168, "upvote_ratio": 0.92, "comment_count": 187, "over_18": false}, "29": {"id": "171v39h", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "source-commonsense", "link_flair_text": "Unexplained Death", "time": 1697250943.5920906, "created_utc": 1696645974.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/171v39h/a_new_jersey_housewife_disappeared_after_an/", "title": "A New Jersey housewife disappeared after an ominous request of a friend, an uncharacteristic confrontation, and a tripped burglar alarm at her home. What happened to Patricia Viola...and how did her remains end up on a beach 45 miles away?", "permalink": "/r/UnresolvedMysteries/comments/171v39h/a_new_jersey_housewife_disappeared_after_an/", "selftext": "On February 13, 2001, Patricia Viola vanished from her home in suburban New Jersey. More than a decade later, her partial remains were identified after washing up 45 miles away on a beach in Queens, NY.\nPatricia Viola (neé Marri) was a 42-year-old housewife and mother who lived with her husband James, and their children Christine and Michael in suburban New Jersey. They lived in Bogota, a charming town a few miles away from the George Washington Bridge, which crosses into upper Manhattan.\nPatricia was known for going above and beyond to make special occasions even more special for her family—elaborate homemade cakes, perfectly personalized presents for every holiday, and efforts to make every Christmas, birthday, and other notable days memorable. She was a volunteer librarian at her son’s school in her free time. Family and friends remembered her generosity and her love for taking care of her extended family. Patricia spent a lot of time in the last months of her life caring for her sick mother-in-law and cleaning up after her sister-in-law, Donna, who was staying in the Viola household after a difficult breakup.\nAs much as people praise Patricia’s enthusiasm for taking care of others and turning holidays into huge productions, there was undeniably a considerable amount of stress on her. She evidently held herself to very high expectations, and the people in her life had come to expect her going above and beyond.\nIt's important to note that Patricia had epilepsy and normally carried her medicine with her at all times. Roughly three months before her disappearance, in November 2000, Patricia experienced a grand mal seizure. Following this, her license was suspended for 90 days at the recommendation of her doctor. This was hugely limiting to Patricia’s independence and mobility—and reportedly impacted her morale heavily. She could no longer easily do the things she loved, like going to the mall alone to buy presents for her family, which she expressed sadness about during the Christmas season. Additionally, it made errands that weren’t optional—for instance, traveling across town to check on her mother-in-law at the hospital—even more difficult, stressful, and time consuming.\nThe Weeks Before Patricia's Disappearance\nIn the weeks before her disappearance, the stress in Patricia’s life continued to mount. Several events were weighing on her heavily or gave loved ones reason to worry:\n\nLicense Suspension (February 6): One week before she went missing, Patricia received upsetting news. Her doctor was recommending a further 90-day suspension of her driving privileges, extending her time without a license until at least late spring. She was incredibly depressed by this news.\nHouseguest Tension (February 12): As mentioned, Patricia’s sister-in-law Donna had been staying with the Viola family following a breakup. Donna was a smoker. Patricia was not a smoker; did not approve of Donna smoking in the house; and had so far been unable to convince her to knock it off. The typically level-headed and non-confrontational Patricia had been managing the effects of Donna’s indoor smoking instead by cleaning, vacuuming, and airing out Donna’s room on a daily basis. The day before she went missing, Patricia discovered that Donna burned a hole in the guest bedspread—a move that could have started a fire and put the whole family in danger. Although Patricia was upset, she and her husband Jim decided to wait to address it with Donna until following day.\nA Breakdown in Brooklyn (February 12): The night before her disappearance, Patricia and Jim attended a party in Brooklyn, NY at the home of Patricia’s best friend and close confidante Toinette Fazio-Markowitz. When Patricia arrived at the party she was beautifully dressed with her hair and makeup done to the nines—yet Toniette knew something was amiss. Patricia soon pulled Toinette into an empty bedroom where they could speak privately. Once alone with her friend, Patricia burst into tears. Through sobs, she managed to tell Toinette that something was deeply, seriously wrong that she needed to discuss…but when Toinette pressed her repeatedly for more details, Patricia insisted it was too complicated to get into at the moment. Patricia did, however, ask two things of her friend. First, she begged Toinette to cancel her upcoming vacation. She claimed she would Toinette everything if the two of them could go away together for a few days. Then, chillingly, she asked Toinette for another favor: to “take care of her kids, no matter what.”\n\nFebruary 13, 2001: A Timeline of The Day Patricia Disappeared\n6:30am: At his usual time, Jim departs the family’s house on Chestnut Ave. for work.\n8:15am: Christine and Michael Viola leave for school.\nToinette Phone Call: Toinette called Patricia in the morning to discuss her emotional breakdown the night before. Shockingly, Patricia brushed it off completely. Instead, she redirected the conversation to a gag gift she wanted to buy Jim for Valentine’s Day—a singing monkey in a cage, similar to one Toinette had bought for her own husband. Toinette noted that Patricia sounded tired and was in a hurry to get off the phone.\nDonna Confrontation: After hanging up with Toinette, Patricia suddenly stormed downstairs to confront her sister-in-law Donna about the burned bedspread. Jim would later remark that Patricia’s approach was extremely and extraordinarily out of character for her. She was irate and screamed “like a raving maniac” at Donna over the incident.\n8:38am: Patricia leaves her house and walks to Bixby Elementary School, where she worked as a volunteer librarian. Bixby was located on the corner of Fischer and Chestnut Avenues, less than two blocks away from the family’s home and easily walkable. Patricia spent roughly two hours at the library that day, spending her time shelving books and assisting at the checkout counter.\nSecurity Alarm Trip: At some point after Patricia leaves for the library, a local security alarm company got a report of an alarm going off at the Viola home. First, they tried to contact Patricia but were unable to reach her. (She had a cellphone, but rarely turned it on.) The security company then tried to contact Jim (who was unreachable at work) and Patricia’s mother, who received the call and promptly called the Viola home to check on her daughter. She left a message on the home’s answering machine.\nMeanwhile, the alarm going off also triggered contact with the local Bogota Police Department. Officers from the station performed a check on the exterior of the house by walking the perimeter of the property and checking in windows. They determined that nothing looked abnormal and deduced that the door probably didn’t close fully when Patricia left for her library job. (This would have triggered the alarm, and had happened in the past.)\n11:35–11:40am: Patricia leaves Bixby Elementary School. On her walk home, Patricia is seen by a crossing guard on Palisade Avenue and waved at a passing mailman. This was the last confirmed sighting of her.\nPatricia Arrives Home: Patricia arrives home and checks her voicemail. She arrived home to the answering machine from her mother and returns the call. During this conversation, Patricia assured her mother that everything was fine at the house and that she was aware of the alarm situation. Otherwise, the rest of the conversation was reportedly normal. This was the last time anyone spoke to Patricia Viola.\nSome time between 1:11pm and 4:00pm, Patricia evidently left the house again. She had no means of transportation and had not told anyone—her husband, her mother, her best friend Toinette, nor anyone at the library—about plans to go anywhere that day. Per the control panel, Patricia performed a reset of the home security alarm at 1:11pm. Because the alarm had been triggered that morning, a reset of the system was required in order to re-arm the alarm capabilities.\nTherefore, it can be assumed she left the house sometime between the reset at 1:11pm and Jim returning home at 4:30pm, likely re-arming the alarm system on her way out. No one knows if Pat left voluntarily, or if she was forced to leave.\n4:30pm, Jim Returns Home: Jim returned home from work that afternoon to find the alarm beeping and Patricia nowhere to be found. The family only set the alarm before going to bed or leaving the house, so he deduced at once that his wife wasn’t home.Although Patricia’s coat was missing, she’d left behind her purse, keys, cell phone, ID, and epilepsy medication. The last was the most concerning; Patricia was meticulous about taking her medication twice a day, especially to stave off future seizures that could further restrict her driving freedoms. The Viola family used a key to lock the back door of the house, which was usually inserted into the deadbolt. Jim found it lying on the kitchen table, out of place. Confident that Patricia could have only traveled on foot, Jim called friends and family and consulted bus schedules to try and locate his wife.\n11:58pm, Jim Reports Patricia Missing: Just before midnight, Jim reported Patricia missing to Captain James Sepp of the Bogota Police Department.\nThe Investigation\n\nThe following days: Police conducted door-to-door searches to speak with neighbors, consulted taxi logs from all car services in town, and stopped busses to be searched along the main routes. The Viola family papered the neighborhood with fliers. The Bogota Police Department also consulted with Port Authority Police to inspect flight manifests from nearby airports. No suicides or attempts had been reported at the George Washington Bridge that day. Three days after her disappearance, investigators brought in police dogs and conducted aerial searches. Law enforcement kept in touch with area hospitals as well, but no Jane Does or Patricia Violas were checked in. Nothing—no evidence, no trace of Patricia’s whereabouts or wellbeing—turned up.\nTwo weeks later: Jim and Toinette began their own search. Toinette spoke to every drugstore and gift shop located within walking distance from the Viola home. The singing monkey gift Patricia mentioned wanting to buy Jim was in stock at a  Rite-Aid Pharmacy nearby. Toinette showed the clerk a picture and he recalled seeing Patricia in the store that day—but had no idea where, or in which direction, she went after leaving the store. Jim focused his search on local hospitals. His theory at the time was that Patricia may have had another epileptic seizure, of which amnesia is a possible side-effect.\nOne month later: A month after her disappearance, investigators recieved a tip from someone who said he saw Patricia in East Stroudsburg, PA while stopped at a light. The Viola family had a timeshare nearby in Shawnee, PA but, although there was hope that the sighting would prove legitimate, nothing ever came of this.\nOne year later: A man called the Bogota Police Department and claimed responsibility for killing Patricia saying, “I killed the old girl.” The police ruled this out as a false confession because he claimed to have Patricia’s driver’s license, which she left behind at the time of her disappearance. Further investigation proved his confession was a hoax.\n\nJuly 27, 2002: Discovery Of Patricia’s Remains\nIn July 2002, a left foot, shoe, and sock were discovered washed up off the 123rd Street stretch of Rockaway Beach in Queens, NY. This was 45 miles away from the Violas’ home in NJ. Rockaway Beach runs roughly five-and-a-half miles along the Atlantic Ocean. Police conducted additional searches on foot and by helicopter, but no additional remains or clues surfaced. Although DNA samples were taken from the remains and later submitted to CODIS, they would not be identified until September 2012—more than a decade later.\n2008–2010, Adoption & Enaction of “Patricia’s Law”: New Jersey adopted “Patricia’s Law” in 2008 after tireless efforts by Jim Viola to get laws concerning missing people passed. The new laws enforced officers to begin investigating missing persons reports immediately and required that DNA be secured from victims’ family and cross-checked in national databases for cases open longer than 30 days. By 2010, requirements to cross-check DNA under “Patricia’s Law” were in place.\nThe first missing person whose remains were identified through this process was Patricia Viola herself. No cause of death could be determined; investigators continue to suspect foul play.\nThe Main Suspects & Theories\nJim Viola, Patricia’s Husband: Jim was investigated, but eventually ruled out by investigators. He first drew suspicion when it was discovered that he took the afternoon off work the day his wife went missing—but his alibi of being out shopping for Valentine’s Day gifts for Patricia evidently checked out. He also passed a polygraph exam and has been fully cooperative with the investigation. Jim has also continued to keep Patricia’s case alive through legislation, media coverage, online discussion, and posters.\nDonna Viola, Patricia’s Sister-In-Law: Was there more to the conflict with Donna, the sister-in-law Donna? Patricia’s blowup was extremely out of character. Some suggest that maybe Donna tripped the alarm to draw Patricia home early, was in the house when Patricia returned home from the library waiting to continue their fight, or was in the room during Patricia’s phone call with Toinette, preventing her from speaking freely.\nEpileptic Seizure or Medical Emergency: If Patricia had—or was in the middle of—another epileptic seizure, it could explain her erratic behavior in the days leading up to her disappearance. Is it possible she left seeking medical attention and met foul play or died by misadventure? Could a seizure have caused amnesia, as Jim believed, or influenced suicidal tendencies? Perhaps she had a seizure on her way back from Rite-Aid and disappeared somewhere along her route home?\nSuicide: While her family maintains Patricia would not commit suicide or abandon her children, this theory holds a lot of weight. Her recent seizure, friction with her sister-in-law, mounting responsibilities, lost license and limited mobility, the breakdown to Toinette, etc. It’s not unreasonable to think that the pressure and shrinking borders of her life could have overwhelmed Patricia.\nConnection to Local Crime: Five years before Patricia went missing, in October 1997, a triple homicide occurred in the house across the street from the Viola family home. The incident had been a robbery-homicide targeting a diamond dealer in the house; two others were killed as collateral damage. Four men were eventually arrested for the crime—and their trial was underway at the time of Patricia’s disappearance. To be clear, Patricia was not a witness in that crime and had no ties to it. Still, some theorize that she was potentially kidnapped or killed either because someone believed her to be a witness or because of a case of mistaken identity targeting an actual witness in the area.\nCrime of Opportunity: Could there have been more to the tripped alarm that morning than an improperly closed door? While no strong physical evidence specifically supports this theory, it’s been theorized that someone was waiting in the house when Patricia returned. Her return home was possibly interrupted a burglar or other criminal inside, who then may have attacked or forced her to leave against her will. If she left the house of her own free will that day, either to shop or visit the beach, did she meet someone with ill intentions along the way?\n(Only Some Of The Many) Unanswered Questions\n\nWhy was Patricia in a hurry to get off the phone with Toinette? Mania because she was on the verge of committing suicide and no longer wanted to be talked down? Was someone else in the house with her—an intruder or her sister-in-law Donna, for instance—that restricted her ability or comfort to speak freely?\nWhy were Patricia’s remains found all the way in Queens? Did she travel out to Rockaway Beach to get some much-needed alone time and meet foul play? Did she commit suicide far from home?\nWhat did Patricia need to tell Toinette? Was she going to open up about her depression? Vent about Donna? Was she having an affair? Was Jim? Did she want to disclose plans to run away from her life? Was she simply overwhelmed, or could this hold all the answers?\nWhat was Donna’s alibi? I don’t necessarily think she has anything to do with this, but it’s bothering me that there’s seemingly nothing available about it online. She hasn’t participated in any of the interviews/TV specials related to the case, either.\nWhat's actually up with the alarm going off? Was it really just an incorrectly closed door? Was it bait, an intruder, or someone who waited for Patricia to come home?\n\nSources\n\nhttps://namus.nij.ojp.gov/case/MP45\nhttps://charleyproject.org/case/patricia-marie-viola\nhttps://web.archive.org/web/20200223172220/http://patriciaviolamissing.homestead.com/\nhttps://law.justia.com/cases/new-jersey/appellate-division-unpublished/2011/a2439-09-opn.html\n", "media": null, "score": 1396, "upvote_ratio": 0.98, "comment_count": 179, "over_18": false}, "30": {"id": "172rs1p", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "PlantZenGuy", "link_flair_text": null, "time": 1697250943.9511323, "created_utc": 1696745189.0, "url": "https://www.reddit.com/gallery/172rs1p", "title": "Police found 115 bodies at Colorado ‘green’ funeral home while investigating putrid smells", "permalink": "/r/MorbidReality/comments/172rs1p/police_found_115_bodies_at_colorado_green_funeral/", "selftext": "", "media": null, "score": 2373, "upvote_ratio": 0.99, "comment_count": 154, "over_18": true}, "31": {"id": "174ryx3", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "andr3wgibbs", "link_flair_text": null, "time": 1697250944.252454, "created_utc": 1696961688.0, "url": "https://www.reddit.com/r/UrbanMyths/comments/174ryx3/found_out_about_an_urban_legend_called_tall_betsy/", "title": "Found out about an urban legend called Tall Betsy while in Tennessee", "permalink": "/r/UrbanMyths/comments/174ryx3/found_out_about_an_urban_legend_called_tall_betsy/", "selftext": "This summer we drove down to Tennessee for a family reunion. One of the days, my wife and I went out driving around the area, and came into a town called Cleveland.\nWe stopped in this old cemetery called Fort Hill, and I had my camera on me, so I filmed some footage there. Super cool, parts were really old, and had a unique landscape.\nAfter we got back home, I was editing the video, and doing research into the cemetery. That's when I found the history of Tall Betsy.\nTall Betsy is a story told over time, of a tall cloaked woman who wandered the streets of Cleveland at night. Parents would tell kids to not stay out late, especially on Halloween, because Tall Betsy would catch and eat them.\nThere are a lot of different stories I've read now, but the town of Cleveland took and ran with it, and threw huge Halloween parties that at one point focused on Tall Betsy, which is pretty awesome.\nHere's the video I made while we were there, with a narrative behind it. Hope you like it. It's perfect for the season.\nhttps://www.youtube.com/watch?v=-s0qbfJXsBY ", "media": null, "score": 15, "upvote_ratio": 1.0, "comment_count": 0, "over_18": true}, "32": {"id": "172qya3", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Leafysoupp", "link_flair_text": "Aliens/UFOs", "time": 1697250944.418002, "created_utc": 1696742227.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/172qya3/a_few_years_ago_i_saw_some_things_that_changed_my/", "title": "A few years ago, I saw some things that changed my life forever", "permalink": "/r/Thetruthishere/comments/172qya3/a_few_years_ago_i_saw_some_things_that_changed_my/", "selftext": "As a disclaimer, I have never subscribed to the belief in aliens/ufo and have never been interested in it until a few years ago. So a few years back I was talking to someone that lived in an apartment building near me outside. Normal day, had just gotten off work. I noticed something in the corner of my eye. So I looked over her shoulder and saw a triangular something in the sky above my apartment building with 1 blue light on every corner. I told the person I was talking to that she needed to turn around and look, and it was gone. \nI disregarded it as maybe I was tired from work. Later that month, there was heat lightening in the night sky. I was outside and noticed a circle almost translucent but the outline was blurred literally right across the street from me. I marked that one off as a reflection from the street lights. But as I am getting older, I have revisited those thoughts. The circle was entirely too big to be a reflection of a street light, and considering I have not seen anything like these since, I am beginning to wonder if that really happened.", "media": null, "score": 62, "upvote_ratio": 0.97, "comment_count": 7, "over_18": false}, "33": {"id": "1775dlz", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Peonyuwu", "link_flair_text": null, "time": 1697250944.545119, "created_utc": 1697221912.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1775dlz/you_screwed_my_whole_life/", "title": "You screwed my whole life.", "permalink": "/r/LetsNotMeet/comments/1775dlz/you_screwed_my_whole_life/", "selftext": "I was too naive when i was 19.I met you through a game when i was 17.You were 24.I hate for myself for how pitiful that i was when i was 17-19.We started to chat and you started to threat me to 'throw me under the bus' blocking me and delete me forever from your life like you did before.When i was done with your toxic nature i wanted to break up.You decline it and started to be creepy stalker.You kept messaging me and threaten me.I answered them with manners. 'No thank you' all you got more creepy.You started to find my adress,phone,personal information and post pictures of me without my permission.You even send me so much mails from god knows where.You found my friends.You even hacked my PHONE.You feisted on my fear.You kept doing this for 1 ENTIRE YEAR! Without a DAY MISSING.I lost my mental health,started to hurt myself and attempt suicide in the end.This started in 19 i am 25 and i am still taking MEDICINE because of you.I hope you see this Lars.You were from norway.Nickname goes by Ultimate.Mmorg game remember?you even have a video in reddit.These are just a short story of what you done to me.You have no control over me and im not fearing you.I have people who support me.Lets not meet.Also fuck you.", "media": null, "score": 35, "upvote_ratio": 0.86, "comment_count": 5, "over_18": true}, "34": {"id": "175rfuc", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "GeneralDavis87", "link_flair_text": null, "time": 1697250944.6693358, "created_utc": 1697064734.0, "url": "https://youtu.be/VexZuWxhXbg?si=M4WZi05ukg_H7W5a", "title": "To the Shores of Iwo Jima (1945) WW2 WWII Film", "permalink": "/r/MorbidHistory/comments/175rfuc/to_the_shores_of_iwo_jima_1945_ww2_wwii_film/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "To the Shores of Iwo Jima (1945) WW2 WWII Film", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/VexZuWxhXbg?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"To the Shores of Iwo Jima (1945) WW2 WWII Film\"></iframe>", "author_name": "Marvelous Movies", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/VexZuWxhXbg/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@Marvelous_Movies"}}, "score": 7, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "35": {"id": "176muuq", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "PriyanshuSingh_POP", "link_flair_text": null, "time": 1697250945.0155537, "created_utc": 1697159617.0, "url": "https://www.reddit.com/r/truecreepy/comments/176muuq/once_he_called_me_in_midnight/", "title": "Once he called me in midnight", "permalink": "/r/truecreepy/comments/176muuq/once_he_called_me_in_midnight/", "selftext": "This is about that time when I did slept with my grandpa who have expired now, once night I went to sleep with him as usual but something has been done weird, a voice had came in my ears, \"Priyanshu, get up and it's time to move\". I got disturbed cause that person was completely looking like my grandpa sleeping near me. I was shocked how is that possible and then I ignored him and again got slept. That experience was very horrific and that was happened when I was only 14 years old.", "media": null, "score": 3, "upvote_ratio": 0.62, "comment_count": 1, "over_18": false}, "36": {"id": "1769889", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "mik4ela", "link_flair_text": null, "time": 1697250945.1223204, "created_utc": 1697123358.0, "url": "https://www.reddit.com/r/threekings/comments/1769889/question_about_the_bath_tub_game/", "title": "Question About The Bath Tub Game", "permalink": "/r/threekings/comments/1769889/question_about_the_bath_tub_game/", "selftext": "I don't really believe in rituals like that (I mean look at how many youtubers do it as a \"3 am challenge\" when it's specifically supposed to be done before midnight-) but what if it is said outside the bath? I know there is a children's game based on the legend where the same words are said (the game is very similar to red light green light). Or typing/writing?\n(ignore the flair, as I know this game is not original content. it just won't let me remove it)", "media": null, "score": 2, "upvote_ratio": 0.76, "comment_count": 0, "over_18": false}, "37": {"id": "1728v8u", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "swissarmydoc", "link_flair_text": null, "time": 1697250945.7626483, "created_utc": 1696692029.0, "url": "https://v.redd.it/cehacefisssb1", "title": "So... in your new house that you've been in less than 3 months...You hear your 1 year old daughter crying from her crib in her room.... Walk in and see this.... What exactly do you do?", "permalink": "/r/Ghosts/comments/1728v8u/so_in_your_new_house_that_youve_been_in_less_than/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/cehacefisssb1/DASH_1080.mp4?source=fallback", "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/cehacefisssb1/DASH_96.mp4", "dash_url": "https://v.redd.it/cehacefisssb1/DASHPlaylist.mpd?a=1699842945%2CMzRkMWQzNmQ3NGM5NWU0MWI4MDZhZTg1OTJkYmIyZmMwNDIyNmMzMmYxZDNjY2I4ZDNjYWNjZTU4MDcwZTk3Nw%3D%3D&v=1&f=sd", "duration": 8, "hls_url": "https://v.redd.it/cehacefisssb1/HLSPlaylist.m3u8?a=1699842945%2CYjgzMWE2Nzg3ZDVjOTNkMjk4YmUxMWE0NjNjNmI3ZWQzN2YxMWFlYTIwNGFiZjkzOTBkOTZiYTg3M2RiNTIwOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1342, "upvote_ratio": 0.85, "comment_count": 453, "over_18": false}, "38": {"id": "17740st", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "New-Possibility-577", "link_flair_text": "Glitch Pic", "time": 1697250946.331174, "created_utc": 1697218212.0, "url": "https://i.redd.it/q3b2znu390ub1.jpg", "title": "Many of the same Looking Person", "permalink": "/r/GlitchInTheMatrix/comments/17740st/many_of_the_same_looking_person/", "selftext": "", "media": null, "score": 51, "upvote_ratio": 0.96, "comment_count": 3, "over_18": false}, "39": {"id": "174qkif", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Spaceman_the_SkierCO", "link_flair_text": "article", "time": 1697250947.2339902, "created_utc": 1696958165.0, "url": "https://denvergazette.com/outtherecolorado/news/bigfoot-reportedly-spotted-from-train-in-remote-part-of-colorado/article_029dbe02-6789-11ee-9e74-87f48588e08b.html?fbclid=IwAR1-qVGIUb6B5pnobPHJvEhXLLCA-qW2Uap6NbZHLMU4GCGIq4XBqUuX2N8", "title": "Bigfoot reportedly spotted from train in remote part of Colorado", "permalink": "/r/bigfoot/comments/174qkif/bigfoot_reportedly_spotted_from_train_in_remote/", "selftext": "", "media": null, "score": 677, "upvote_ratio": 0.89, "comment_count": 262, "over_18": false}, "40": {"id": "175lvxd", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Discussion ", "time": 1697250947.7400854, "created_utc": 1697050741.0, "url": "https://i.redd.it/6j28k41vemtb1.jpg", "title": "Turns out there's a camper company called \"Sasquatch Expedition Campers\" that's located right by where that recent bigfoot video was taken in Colorado. They even have a mascot costume!", "permalink": "/r/Cryptozoology/comments/175lvxd/turns_out_theres_a_camper_company_called/", "selftext": "", "media": null, "score": 623, "upvote_ratio": 0.98, "comment_count": 39, "over_18": false}, "41": {"id": "1724etq", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "mrfantastic1798", "link_flair_text": "Unidentified", "time": 1697250947.9046922, "created_utc": 1696679066.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1724etq/winged_human/", "title": "Winged human?", "permalink": "/r/Humanoidencounters/comments/1724etq/winged_human/", "selftext": "During the fires that consumed mount Charleston, nevada. My parents drove out to the mountain when the roads were clear. They describe the wildlife to be running around the car as they drove through the open road. My dad told my mom to stop the car and he got out and started walking through the desert. He realizes that the wilderness is running (including snakes and other deadly animals) he witnesses a moose/elk in the distance that was looking at him, but walked off in the direction of the rabbits and other wildlife. As he gets in the vehicle. Both my parents and his father describe seeing a tall man crouched down in front of the car. Wings draped over his back. As he stands and faces them. His wingspan wide enough to cover the entire two lane road lifted him off the ground in 4 swooshes. They described him as muscuclar, 6-8pack, broad shoulders, arms and legs.  but the face was mesmerizing. They couldnt describe his face, but it was not a human. It sounds like a man-bird. The mothman was a topic of discussion for them to decide if it was the mothman.  If anyone has any similar stories about this creature please share with me. I want to understand what they saw.", "media": null, "score": 116, "upvote_ratio": 0.95, "comment_count": 24, "over_18": false}, "42": {"id": "173rmml", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Shell_Crebb", "link_flair_text": null, "time": 1697250948.7533138, "created_utc": 1696857588.0, "url": "https://i.redd.it/akn700isg6tb1.jpg", "title": "Guys I found Moth Man at my doorbell camera!", "permalink": "/r/cryptids/comments/173rmml/guys_i_found_moth_man_at_my_doorbell_camera/", "selftext": "", "media": null, "score": 139, "upvote_ratio": 0.96, "comment_count": 24, "over_18": false}, "43": {"id": "175zfa5", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "omarhm7777", "link_flair_text": null, "time": 1697250949.8637295, "created_utc": 1697089121.0, "url": "https://i.redd.it/swjgkqp9lptb1.jpg", "title": "It keeps getting oddly hilarious..", "permalink": "/r/conspiracy/comments/175zfa5/it_keeps_getting_oddly_hilarious/", "selftext": "", "media": null, "score": 2459, "upvote_ratio": 0.86, "comment_count": 457, "over_18": false}, "44": {"id": "172aayu", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1697250950.2383351, "created_utc": 1696695893.0, "url": "https://i.redd.it/rlyqxrlq3tsb1.jpg", "title": "Whistleblower Meaning: Is David Grusch just like Edward Snowden? Discover the truth behind whistleblowing in this eye-opening video. Are you curious about the meaning and significance of whistleblowers? https://youtube.com/live/hQYYM9x0pew", "permalink": "/r/conspiracyfact/comments/172aayu/whistleblower_meaning_is_david_grusch_just_like/", "selftext": "", "media": null, "score": 4, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "45": {"id": "176cyn6", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "GlobalUfoChannel", "link_flair_text": "Discussion", "time": 1697250952.0633242, "created_utc": 1697132977.0, "url": "https://i.redd.it/0zp6upf57ttb1.jpg", "title": "During the missions, both Phobos 1 and Phobos2 encountered unexplained anomalies and lost communication with Earth. Some speculate that these incidents may be linked to (UFO). Thanks to the Marina Popovich, We have second photograph from Phobos which shows Cigar shape object. What are your thoughts?", "permalink": "/r/ufo/comments/176cyn6/during_the_missions_both_phobos_1_and_phobos2/", "selftext": "", "media": null, "score": 442, "upvote_ratio": 0.92, "comment_count": 95, "over_18": false}, "46": {"id": "174z6kc", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "theyeetedmeat69", "link_flair_text": "Video", "time": 1697250953.6731267, "created_utc": 1696979681.0, "url": "https://v.redd.it/8mv1vkeujgtb1", "title": "Alleged Robert Jacobs ufo video ", "permalink": "/r/UFOs/comments/174z6kc/alleged_robert_jacobs_ufo_video/", "selftext": "Long time lurker, came across this on an Instagram feed. First time I’ve seen someone claim to have the footage Jacobs describes. Has anyone seen this video of the missile before? Could be fake, don’t know why it would be showing up  now in social media with Jacobs telling his story years ago.", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/8mv1vkeujgtb1/DASH_720.mp4?source=fallback", "height": 1098, "width": 720, "scrubber_media_url": "https://v.redd.it/8mv1vkeujgtb1/DASH_96.mp4", "dash_url": "https://v.redd.it/8mv1vkeujgtb1/DASHPlaylist.mpd?a=1699842952%2CMjYyYzlhMGI5MTIzNDQ2OGNlMTRmNTM5MThkOTVjZTQxY2M2M2UxZGRhMjM4NTU5OGI4OWVkMjA1NmE3MmI0OQ%3D%3D&v=1&f=sd", "duration": 49, "hls_url": "https://v.redd.it/8mv1vkeujgtb1/HLSPlaylist.m3u8?a=1699842952%2CYWEzMjhhODI2NzU1ZDY1Njc4MWY4MjE4OWM2NjFhNmEzMDY0YzkxNGZmYThjNDY3MjRlYzQ5YjUwZWIxYTA4NA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3025, "upvote_ratio": 0.94, "comment_count": 390, "over_18": false}, "47": {"id": "1747215", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "E-pluribus-unum195", "link_flair_text": "Discussion :table:", "time": 1697250955.2925813, "created_utc": 1696895933.0, "url": "https://i.redd.it/dp1pjhitm9tb1.jpg", "title": "Main Points from Tom DeLonge’s UFO Film:", "permalink": "/r/aliens/comments/1747215/main_points_from_tom_delonges_ufo_film/", "selftext": "Tom DeLonge has released a \"fictional\" UFO film called \"Monsters of California.\" The film, according to him, contains mostly truths and some \"Easter eggs\" about what he has learned from his government contacts and advisors over the years.\nMajor points from the film (in no particular order):\n• UFOs aren't what people think they are. They're not from other planets. They're coming from time/other dimensions.\n• There is more than one non-human intelligence interacting here, and they don't like each other.\n• Some \"gods\" have helped push humanity forward from time to time throughout the millennia, and some have intentionally steered us into turmoil. Their interactions are documented in ancient texts, or what we call myths and religions.\n• Humanity is a proxy-war and a battle for souls.\n• The paranormal and high strangeness anomalies are directly connected to UFOs—they're highly advanced tech that uses holograms to interact with human consciousness.\n• These \"Others\" have been here from the beginning and are \"gods\" (gods with a little 'g').\n• Belief systems were created by design of the UFO to factionalize humanity.\n• All the world's religions (both ancient and modern) tell the same story at their root. Good vs. evil, right vs. wrong, light vs. dark.\n• There are certain areas across the globe which are paranormal/UFO hotspots that can be and are being tracked.\n• The ones in government that work or have worked in \"the program\" are divided in their views of what UFOs mean for humanity. Some believe the public cannot handle the complexity and disturbing nature of UFOs, and some believe we can.\n• There are non-human biological entities in government possession.\n• A reverse engineering program has been in place since the 40s, and we've made tremendous advancements.\n• South America/Brazil is an important part of the world regarding the phenomenon. (A map is shown at the end of the movie).\n• It matters what human beings choose to think and feel because the universe creates it as a reality.\n• Choosing love, kindness, and compassion over fear, hatred, and anger is far more important than people understand. It has profound spiritual and physical implications.\n• Free will, morality, and consciousness are humanity's greatest weapons.\nFinal quote from the end of the movie:\n\"All possibilities are layered within different waves of energy, and our mind is the only thing that can make them real. So if everything is happening right on top of each other, forces of nature can cause them to bleed into one another. Sometimes that's a good thing. Sometimes it's not. And sometimes machines are even used to interfere with us, and that's not good at all. But if you could calm your mind, choose love over hate, you will connect to the right frequency. Because if we don't, if we tune into darkness and give in to fear, someone else will create a reality here that suits them and not us. So it really doesn't matter if we call ourselves Christian, Muslim, atheist, or just dreamers—that boxes you in and misses the point entirely.\nThere's a lot we've been afraid of. We kept secrets from each other based on fear of the unknown. But I've always thought there was a bright side to all of this. At the end of the day, what if we learn that we all come from the same place? Like one vast field of energy? Because that may be what all these events are truly about.\nWe're not alone, and the government knows a hell of a lot more than they're saying. But guess what, we don't need them. These visitors have been here for thousands of years for all of us to see. So if you're wondering, how have we missed all this happening around us for so long... we haven't. We actually wrote it all down for thousands of years. The story you seek—the entire story, it's right there in front of your eyes hiding in plain sight. A story told with all the world's religions combined.\"\n\nThis post is a simple summary of the film and TDL's beliefs regarding the UFO phenomenon. Irrespective of one's beliefs about UFOs and their intentions, it's good to keep an open mind and respect differing views.\n\nCheers! 🍻🛸", "media": null, "score": 2779, "upvote_ratio": 0.9, "comment_count": 635, "over_18": false}, "48": {"id": "172cjbl", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "quetzalcosiris", "link_flair_text": null, "time": 1697250955.6320229, "created_utc": 1696701584.0, "url": "https://www.usatoday.com/story/news/nation/2023/10/06/states-with-most-ufo-sightings-reports-research-grows/71087920007/", "title": "'We have no explanation': See list of US states with the most reported UFO sightings - USA Today", "permalink": "/r/UAP/comments/172cjbl/we_have_no_explanation_see_list_of_us_states_with/", "selftext": "", "media": null, "score": 127, "upvote_ratio": 0.94, "comment_count": 19, "over_18": false}, "49": {"id": "172gdkl", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "da_FAQs", "link_flair_text": "Request", "time": 1697250956.049559, "created_utc": 1696711448.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/172gdkl/in_honor_of_october_what_is_your_favorite_spooky/", "title": "In honor of October, what is your favorite spooky mystery?", "permalink": "/r/UnresolvedMysteries/comments/172gdkl/in_honor_of_october_what_is_your_favorite_spooky/", "selftext": "Since it is almost Halloween, what mystery has creeped out you the most? Three of mine are:\n\n\nMonkey-man of Delhi In May 2001, reports circulated in New Delhi, India concerning a monkey-like creature that attacked people at night.\n\n\nYou Are Being Impersonated by the Other Voice Guy recorded really creepy phone calls he was getting from a robotic voice repeating vague messages.\n\n\nLights Over Phoenix A series of widely sighted unidentified flying objects observed in the skies over Phoenix on March 13, 1997.\n\n", "media": null, "score": 1207, "upvote_ratio": 0.97, "comment_count": 496, "over_18": false}, "50": {"id": "1746p9g", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "si0gr", "link_flair_text": null, "time": 1697250956.3901427, "created_utc": 1696894936.0, "url": "https://g1.globo.com/google/amp/mg/minas-gerais/noticia/2023/08/09/policia-indicia-por-estupro-suspeito-de-abusar-de-jovem-deixada-na-rua-em-bh-motorista-de-app-responde-por-abandono-de-incapaz.ghtml", "title": "22-year-old Brazilian is raped after being left unconscious in front of her building.", "permalink": "/r/MorbidReality/comments/1746p9g/22yearold_brazilian_is_raped_after_being_left/", "selftext": "Article in Portuguese. Summary: 22-year-old girl goes to a concert with friends in Belo Horizonte, drinks heavily and becomes unconscious. Friend gets her an uber, puts her inside the car and calls her brother to let him know she is going home. Brother falls asleep, does not answer doorbell. Uber driver leaves her, unconscious, in front of her building. 47-year-old man sees her, drags her into a football field and rapes her. Literally failed by 3 men and assaulted by the 4th.", "media": null, "score": 2304, "upvote_ratio": 0.94, "comment_count": 204, "over_18": true}, "51": {"id": "1720z13", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "GravenMortal", "link_flair_text": null, "time": 1697250956.6885726, "created_utc": 1696666311.0, "url": "https://www.wolfenhaas.com/post/the-amityville-horror-defeo-massacre-part-1", "title": "Ronald 'Butch' Defeo murdered his entire family on 13 November 1974. The Defeo Massacre took place in the now-famous Amityville Horror House, kicking off a legacy of terror.", "permalink": "/r/UrbanMyths/comments/1720z13/ronald_butch_defeo_murdered_his_entire_family_on/", "selftext": "", "media": null, "score": 13, "upvote_ratio": 1.0, "comment_count": 0, "over_18": true}, "52": {"id": "175x5tw", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Xvailer", "link_flair_text": null, "time": 1697250956.8749647, "created_utc": 1697081245.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/175x5tw/when_i_was_8_i_learned_piano_wrote_a_riff_i_heard/", "title": "When I was 8 i learned piano, wrote a riff I heard in my dreams and this memory just recently came back to me", "permalink": "/r/Thetruthishere/comments/175x5tw/when_i_was_8_i_learned_piano_wrote_a_riff_i_heard/", "selftext": "Sorry if this doesn't belong in this subreddit, /r/glitch_in_the_matrix didn't allow my story and said I should post elsewhere so this was the next best sub I could think of. \nI have no idea why this memory was lost for a while but it just recently came back to me when I was listening to this band again, when I had completely forgot about the songs existence.\nBut when I was around 7 or 8 years old I wrote a riff on keyboard that I heard in my dreams. I was recently talking to a friend of mine who has the same taste of music as me, and we were talking about bands that we grew up with (primarily being emo/screamo) type music. But we got to talking and he said \"oh well one of my favorite songs of all time is Blessed With a Curse by bring me the horizon\") and I replied with \"Oh I haven't heard it, have it on your phone by chance so I can listen to it?\"\nWhen he played the song, the first riff I kid you not was the riff to the bring me the horizon song and I didn't really grow up with emo music like he did. I grew up mainly in 90s dance and house like daft punk, I didn't get into emo music until my teen years.\nAnyway, when he played that song. I just sat there in disbelief, I always heard that song in my dreams but I heard a piano melody version of it. I would literally hear this song multiple times through out my childhood and it always gave me chills but had a really familiar since of nostalgia for some reason but I never knew why.\nWhat's the meaning behind this? Is this a sign of some kind? Normally when I see stories like these I kind of shrug them off, but after it happening to me I'm convinced somethings wrong here.", "media": null, "score": 25, "upvote_ratio": 0.94, "comment_count": 5, "over_18": false}, "53": {"id": "174jgzv", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "GeneralDavis87", "link_flair_text": null, "time": 1697250957.13139, "created_utc": 1696939424.0, "url": "https://youtu.be/Ae-uYdsUCoo?si=mT8Dp493iN2AYf26", "title": "The Battle for the Marianas (1944) Pacific War film WWII", "permalink": "/r/MorbidHistory/comments/174jgzv/the_battle_for_the_marianas_1944_pacific_war_film/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Battle for the Marianas (1944) Pacific War film WWII movie WW2", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/Ae-uYdsUCoo?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The Battle for the Marianas (1944) Pacific War film WWII movie WW2\"></iframe>", "author_name": "Marvelous Movies", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/Ae-uYdsUCoo/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@Marvelous_Movies"}}, "score": 3, "upvote_ratio": 0.8, "comment_count": 0, "over_18": false}, "54": {"id": "175cuw6", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "AshifyOG", "link_flair_text": null, "time": 1697250957.4244785, "created_utc": 1697027346.0, "url": "https://i.redd.it/m7rbtbyl3htb1.jpg", "title": "Can't risk it", "permalink": "/r/truecreepy/comments/175cuw6/cant_risk_it/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.16, "comment_count": 2, "over_18": false}, "55": {"id": "1768jn6", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "xDreki", "link_flair_text": null, "time": 1697250958.1181, "created_utc": 1697121582.0, "url": "https://v.redd.it/6r2gxxgs9stb1", "title": "And it took that personally... Challenge accepted.", "permalink": "/r/Ghosts/comments/1768jn6/and_it_took_that_personally_challenge_accepted/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/6r2gxxgs9stb1/DASH_480.mp4?source=fallback", "height": 480, "width": 822, "scrubber_media_url": "https://v.redd.it/6r2gxxgs9stb1/DASH_96.mp4", "dash_url": "https://v.redd.it/6r2gxxgs9stb1/DASHPlaylist.mpd?a=1699842957%2CMmUxN2NiNTNjZTllZTZlMzE0MDFhZjUzYWIwNTlmNmY0NzhmODg3MGM5OTkzYWVmNTg5ZDM5MGEzOWUxNzk2OQ%3D%3D&v=1&f=sd", "duration": 36, "hls_url": "https://v.redd.it/6r2gxxgs9stb1/HLSPlaylist.m3u8?a=1699842957%2CMWY1Y2QwZDg4ZDkzM2VlMWM2NGJmNDdmMTk1ODE5ODUxMmMxOTNhN2I3ZTc5YTAxMzQ0OTVjNDE3MGM2MzU4NA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1109, "upvote_ratio": 0.93, "comment_count": 106, "over_18": false}, "56": {"id": "176np46", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "stupidity60", "link_flair_text": "Glitch Pic", "time": 1697250958.319922, "created_utc": 1697162245.0, "url": "https://i.redd.it/tytgg3rnmvtb1.jpg", "title": "How did I do this?(Thrown)", "permalink": "/r/GlitchInTheMatrix/comments/176np46/how_did_i_do_thisthrown/", "selftext": "", "media": null, "score": 51, "upvote_ratio": 0.83, "comment_count": 12, "over_18": false}, "57": {"id": "174c46z", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "454C495445", "link_flair_text": "OG content", "time": 1697250959.1589906, "created_utc": 1696910849.0, "url": "https://i.redd.it/phefm511vatb1.png", "title": "Estimated Bigfoot Populations for Each State/Province in the US/Canada (OC)", "permalink": "/r/bigfoot/comments/174c46z/estimated_bigfoot_populations_for_each/", "selftext": "", "media": null, "score": 312, "upvote_ratio": 0.88, "comment_count": 212, "over_18": false}, "58": {"id": "172c3qs", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Hoax", "time": 1697250959.6750507, "created_utc": 1696700450.0, "url": "https://i.redd.it/rvrsfbejhtsb1.jpg", "title": "The \"Beast of Brunei\" has turned out to be a hoax! A few months before it was initially posted onto the nature identification page, a Swedish filmmaker named Stefan Rydehed had created it as a model", "permalink": "/r/Cryptozoology/comments/172c3qs/the_beast_of_brunei_has_turned_out_to_be_a_hoax_a/", "selftext": "", "media": null, "score": 199, "upvote_ratio": 0.97, "comment_count": 29, "over_18": false}, "59": {"id": "176fy33", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Miw_chupacabra789", "link_flair_text": "Personal", "time": 1697250959.8507223, "created_utc": 1697140839.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/176fy33/my_two_encounters/", "title": "My two encounters", "permalink": "/r/Humanoidencounters/comments/176fy33/my_two_encounters/", "selftext": "My bedroom\nTwo years ago, one night I had trouble sleeping and something felt off. I was in my room. It was near 10 at night.I had looked over to the hallway. There was a woman who I had never seen before at the top of the steps. She was wearing a dress that had spots, and had curly hair. She stared at me just looking at me. She had a calm look on her face. She was not there for long. When she left she just disappeared.\nSnorkeling \nMy second encounter took place last  when I went snorkeling this,was during summer break. So one day when I went to Flordia with my family and we deciding we would go snorkeling. While I am there I went near the rocks. I was looking at the fish for most of the time. Near the end of the trip is when I saw the creature. I then decided I would look in the rocks. I saw a lot of fish then I go look in one specific rock. I then peered in the rock.I thought I saw a small humanoid creature. It did not move. Its face did not look very human it looked somewhat greyish. The creature had big eyes. Once I saw it I decided to swim back to shore. I never did go back to that same area. I then told my family what I saw and they told me that I was probably just mistaking the rocks as things.", "media": null, "score": 14, "upvote_ratio": 0.79, "comment_count": 4, "over_18": false}, "60": {"id": "174k8yn", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "the_orange_alligator", "link_flair_text": null, "time": 1697250960.681961, "created_utc": 1696941860.0, "url": "https://i.redd.it/qrf6oa0efdtb1.jpg", "title": "Since I keep seeing this guy get posted here. THIS CREATURE IS FROM AN ARG. It is not nor was ever said to be an actual sighting", "permalink": "/r/cryptids/comments/174k8yn/since_i_keep_seeing_this_guy_get_posted_here_this/", "selftext": "", "media": null, "score": 121, "upvote_ratio": 0.89, "comment_count": 25, "over_18": false}, "61": {"id": "1750172", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "lboog423", "link_flair_text": null, "time": 1697250961.6600142, "created_utc": 1696981988.0, "url": "https://i.redd.it/rphehjfipgtb1.png", "title": "CNN staging a dramatic live reporting of a barrage of rockets by them. They cut off the footage when 2 men casually walking on the sidewalk with flipflops get into the camera view.", "permalink": "/r/conspiracy/comments/1750172/cnn_staging_a_dramatic_live_reporting_of_a/", "selftext": "", "media": null, "score": 2029, "upvote_ratio": 0.8, "comment_count": 390, "over_18": false}, "62": {"id": "174stba", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "WhoIsJolyonWest", "link_flair_text": null, "time": 1697250962.0000231, "created_utc": 1696963756.0, "url": "http://thereporterwhoknewtoomuch.com/", "title": "The Reporter Who Knew Too Much", "permalink": "/r/conspiracyfact/comments/174stba/the_reporter_who_knew_too_much/", "selftext": "", "media": null, "score": 3, "upvote_ratio": 0.67, "comment_count": 0, "over_18": false}, "63": {"id": "171wp4r", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Ad1714", "link_flair_text": null, "time": 1697250963.326948, "created_utc": 1696650960.0, "url": "https://anomalien.com/disappearance-of-a-hiker-who-found-a-vibrating-cave-near-area-51/", "title": "Disappearance of a hiker who found a vibrating cave near Area 51", "permalink": "/r/ufo/comments/171wp4r/disappearance_of_a_hiker_who_found_a_vibrating/", "selftext": "", "media": null, "score": 411, "upvote_ratio": 0.93, "comment_count": 145, "over_18": false}, "64": {"id": "176g62r", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "republicofzetariculi", "link_flair_text": "Discussion", "time": 1697250964.560314, "created_utc": 1697141412.0, "url": "https://v.redd.it/bsnxlm0rwttb1", "title": "“The finest candlemakers in the world couldn’t even think of electric light”", "permalink": "/r/UFOs/comments/176g62r/the_finest_candlemakers_in_the_world_couldnt_even/", "selftext": "Request the mods to let this up even though it’s not about UFOs directly but it is indirectly connected because scientists nowadays refuse to talk about UFOs they don’t even consider it unless they have a peer reviewed paper in front of them.", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/bsnxlm0rwttb1/DASH_720.mp4?source=fallback", "height": 734, "width": 720, "scrubber_media_url": "https://v.redd.it/bsnxlm0rwttb1/DASH_96.mp4", "dash_url": "https://v.redd.it/bsnxlm0rwttb1/DASHPlaylist.mpd?a=1699842963%2COGI3YzYyNTdmODlmMDcwMmNhYmZkOTkxZWIxNmNkMjhmNTA0Yzg1Y2Y5YzZkZjYyOGQwYmQ0ZWMwMzc1MTdlNQ%3D%3D&v=1&f=sd", "duration": 94, "hls_url": "https://v.redd.it/bsnxlm0rwttb1/HLSPlaylist.m3u8?a=1699842963%2CY2Q0OWE4M2U5N2FiZmMyOGIzOGYzYjYxYTYxMjk1YmQ2MjJlMGRlNjY2MzVjZjlmZDc3OTFmNGNmYTkxYTg4Nw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2929, "upvote_ratio": 0.73, "comment_count": 709, "over_18": false}, "65": {"id": "176637r", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Desperate_Response88", "link_flair_text": "Video", "time": 1697250966.2446501, "created_utc": 1697114593.0, "url": "https://v.redd.it/k8pawdjlnrtb1", "title": "Any info on this video? ''Brazil 1996 alien''", "permalink": "/r/aliens/comments/176637r/any_info_on_this_video_brazil_1996_alien/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/k8pawdjlnrtb1/DASH_1080.mp4?source=fallback", "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/k8pawdjlnrtb1/DASH_96.mp4", "dash_url": "https://v.redd.it/k8pawdjlnrtb1/DASHPlaylist.mpd?a=1699842965%2CMTczMTQyYTNiY2JlODZjZjkwY2YxOTczNGYxMGUxYTM1ZWYyNDQ0MWViNjlmN2JlMzcxZjNiYjY0M2U1ODZiNA%3D%3D&v=1&f=sd", "duration": 28, "hls_url": "https://v.redd.it/k8pawdjlnrtb1/HLSPlaylist.m3u8?a=1699842965%2CNWY4MDhkYWU2Nzk5YTAwODFiZWIxN2Q5YmE2OGQ3Y2ViNTg1NGY1MmZjNDMxYTNlYTBlZjAyZWUzN2U0N2Q4ZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2738, "upvote_ratio": 0.71, "comment_count": 976, "over_18": false}, "66": {"id": "172kkt4", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "quetzalcosiris", "link_flair_text": null, "time": 1697250966.6013992, "created_utc": 1696722450.0, "url": "https://www.thescottishsun.co.uk/news/11343081/paranormal-investigators-public-inquiry-ufo/", "title": "Paranormal investigators demand US-style probe into Scots UFO sightings", "permalink": "/r/UAP/comments/172kkt4/paranormal_investigators_demand_usstyle_probe/", "selftext": "", "media": null, "score": 108, "upvote_ratio": 0.98, "comment_count": 9, "over_18": false}, "67": {"id": "17383lv", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "SalmonsAreForever", "link_flair_text": "Disappearance", "time": 1697250967.1240551, "created_utc": 1696794487.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/17383lv/27yearold_indigenous_woman_goes_missing_after/", "title": "27-year-old Indigenous woman goes missing after leaving scene of accident (Missing and Murdered Indigenous Women/Highway of Tears)", "permalink": "/r/UnresolvedMysteries/comments/17383lv/27yearold_indigenous_woman_goes_missing_after/", "selftext": "Shortly after midnight on June 14, 2013, 27-year-old Immaculate “Mackie” Basil left a house party in Tachi, British Columbia, with her younger cousin Keith and a man named Victor John Louie. The trio boarded a pickup truck and headed to a cabin located in Kuz Che, about 20 kilometres north of Tachi. Keith and Victor later said they were going to grab unused roofing tin to deliver to an elder.\nOne source says the pickup got stuck in mud on the way to the cabin. The trio walked the rest of way and stayed at the cabin for a bit before heading out again to try and free the pickup. Another source says the pickup got stuck on the way back from the cabin. Either way, sources agree the pickup got stuck on Leo Creek Forest Service Road.\nFrom there, Keith and Victor say Mackie became frustrated at their attempt to free the pickup and decided to walk back to Tachi alone.\nThat’s the last time anyone heard from Mackie.\n—\nMackie was born on Dec. 8, 1985. She had three sisters, three brothers and a five-year-old son named Jamison. She was part of the Tl'azt'en Nation and lived in Fort St. James, where she worked as a part-time secretary and a teacher's assistant, when she disappeared. The area is located about 1,000 kilometres north of Vancouver and is part of the Highway of Tears. The HoT is a 719-kilometre stretch of Highway 16 between Prince George and Prince Rupert that has been the location of crimes against many Missing and Murdered Indigenous Women beginning in 1970.\nMackie was not known to party much, drink or do drugs. She had recently separated from Jamison’s father, but the reason for the separation is unknown.\nShe was close to her sisters Ida and Crystal, with whom she grew up in the foster care system. They were the ones who reported her missing on June 17, after Mackie missed their daily calls three days in a row.\n—\nAfter she was reported missing, law enforcement interviewed everyone who was at the party, which was mostly cousins of Mackie’s. Keith and Victor were also given a polygraph test. LE say they were cooperative and not suspicious in any way.\nLE and volunteers conducted ground and air searches of the area, but didn’t find anything. Dogs were brought in as well.\nThe area is mainly forest, with one main highway and several logging roads. It is populated with mountain lions, grizzlies, black bears, coyotes and wolves.\nMackie was wearing grey yoga pants, white shoes and a black hoodie when she went missing. She also had a dark blue iPod Shuffle with white earphones on her.\n—\nThere were two reported sightings of Mackie after she left Keith and Victor. A truck driver said they saw her hitchhike in the area on the morning of June 14, and someone reported seeing her in Saik’uz, 75 kilometres south of Fort St. James. LE determined both sightings were false.\nThe family and LE don’t think she ran away since she had no prior history of doing so and had a loving relationship with her son.\nOne theory is that she succumbed to an animal attack, but LE found no evidence, such as blood, remains or some of her belongings, in the area.\nAnother is foul play. LE say it’s unlikely due to a stranger abduction given the area’s remoteness. That leaves us with Keith and Victor. Family say both men have never been exactly forthcoming about what happened that night. Victor, who was approximately 48 at the time, has a history of violent crime, including sexual assault. At about 10 a.m. on June 14, another cousin of Mackie’s who was at the party said she saw Victor walking down the street in Tachie in wet clothes. She says she found it odd, but didn’t investigate further given she wasn’t aware Mackie was missing. Edit: This cousin also confirmed the accident happened, saying there were broken parts of the truck on the road along with a broken tree.\nSo, what do you think happened to Mackie?\nSources:\nhttps://www.cbc.ca/news/indigenous/first-nation-offers-20k-reward-in-mmiw-case-1.3764106\nhttps://www.todayinbc.com/news/fort-st-james-woman-featured-in-rcmp-missing-women-social-media-campaign/\nhttps://www.princegeorgecitizen.com/local-news/rcmp-still-seeking-answers-to-womans-disappearance-3723697\nhttps://www.myprincegeorgenow.com/31909/news/mackie-basil-still-missing-three-years-later/\nhttps://www.services.rcmp-grc.gc.ca/missing-disparus/case-dossier.jsf?case=2013000129&id=10\nhttps://www.cbc.ca/missingandmurdered/mmiw/profiles/immaculate-basil\nhttps://en.wikipedia.org/wiki/Disappearance_of_Immaculate_Basil", "media": null, "score": 1167, "upvote_ratio": 0.96, "comment_count": 130, "over_18": false}, "68": {"id": "17306l7", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "dromyway", "link_flair_text": null, "time": 1697250967.477132, "created_utc": 1696774508.0, "url": "https://www.actionnews5.com/2023/10/07/thats-what-took-my-baby-7-year-old-girl-dies-while-popping-birthday-balloons/#lnhjocj48kw42p5ck78", "title": "‘That’s what took my baby’: 7-year-old girl (Alexandra Hope Kelly) dies while popping birthday balloons", "permalink": "/r/MorbidReality/comments/17306l7/thats_what_took_my_baby_7yearold_girl_alexandra/", "selftext": "", "media": null, "score": 2042, "upvote_ratio": 0.98, "comment_count": 530, "over_18": true}, "69": {"id": "175rg7e", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "MythUnleashed", "link_flair_text": null, "time": 1697250967.781881, "created_utc": 1697064761.0, "url": "https://youtu.be/yVz49SdUROM", "title": "Tikbalang | Man-Horse of the Forest", "permalink": "/r/UrbanMyths/comments/175rg7e/tikbalang_manhorse_of_the_forest/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Tikbalang | Man-Horse of the Forest", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/yVz49SdUROM?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Tikbalang | Man-Horse of the Forest\"></iframe>", "author_name": "Mythology Unleashed", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/yVz49SdUROM/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@MythologyUnleashed"}}, "score": 3, "upvote_ratio": 1.0, "comment_count": 0, "over_18": true}, "70": {"id": "174ziea", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Marvin_Martians", "link_flair_text": null, "time": 1697250967.938896, "created_utc": 1696980551.0, "url": "/r/Paranormal/comments/1748vv5/i_saw_a_ghost_skelton/", "title": "I SAW A GHOST SKELTON", "permalink": "/r/Thetruthishere/comments/174ziea/i_saw_a_ghost_skelton/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 4, "over_18": false}, "71": {"id": "176x3du", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "roqthecasbah", "link_flair_text": null, "time": 1697250969.1971714, "created_utc": 1697198434.0, "url": "https://v.redd.it/qk1st8bbmytb1", "title": "My office has had drawers and cabinets randomly open for years. I finally caught it on our new security system.", "permalink": "/r/Ghosts/comments/176x3du/my_office_has_had_drawers_and_cabinets_randomly/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/qk1st8bbmytb1/DASH_1080.mp4?source=fallback", "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/qk1st8bbmytb1/DASH_96.mp4", "dash_url": "https://v.redd.it/qk1st8bbmytb1/DASHPlaylist.mpd?a=1699842968%2CNTEwMGI5NGM5NDE2NzRmYjFiZDcwOWM0MzMzYWUzYzhiYzUwMjBhYWIxMTVjMTZlMmRjOTQ4NTA1NTUzMzNhMw%3D%3D&v=1&f=sd", "duration": 20, "hls_url": "https://v.redd.it/qk1st8bbmytb1/HLSPlaylist.m3u8?a=1699842968%2COGNkNmQ1OWVmNWQ4NTI5ZjU3MWRjOGVmNzI2OTcyZGM3YzFhMDVlZWRlYjU3MzBiY2U1NDViMzgzYTc1NzIyYQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 815, "upvote_ratio": 0.85, "comment_count": 201, "over_18": false}, "72": {"id": "17348vh", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Neon-Plural", "link_flair_text": "Glitch Pic", "time": 1697250969.3950222, "created_utc": 1696784727.0, "url": "https://i.redd.it/oqw26z25g0tb1.jpg", "title": "This house amalgam in my neighborhood", "permalink": "/r/GlitchInTheMatrix/comments/17348vh/this_house_amalgam_in_my_neighborhood/", "selftext": "", "media": null, "score": 23, "upvote_ratio": 0.75, "comment_count": 15, "over_18": false}, "73": {"id": "175rhu1", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Hieroklas", "link_flair_text": "analysis", "time": 1697250970.1735137, "created_utc": 1697064887.0, "url": "https://www.reddit.com/gallery/175rhu1", "title": "The Recent Silverton “Sighting”", "permalink": "/r/bigfoot/comments/175rhu1/the_recent_silverton_sighting/", "selftext": "Understandably there has been a lot of hubbub (does anyone use that term anymore?) about the recent video/pictures from the possible sasquatch “sighting” near Silverton, CO this past weekend.  I, Jeff Smith from the Sasquatch Tracks podcast, decided to do some digging and see if I could figure out where this took place.  Based upon information from Mrs. Shannon Parker’s Facebook post (you can find it in a previous r/bigfoot post) and information from other redditors, I think I found where it happened and why that plays into why I think this is a guy in a suit.\nThe first picture is a Google Earth overview showing the southern part of Silverton (notice the oval track…it will be important later) and the entrance to the valley where the train tracks go.  I’ve highlighted the area in question with the requisite Bigfoot Community Red Circle of Truth showing where I believe the subject was when it was sighted.  I assumed the incident occurred in the afternoon, and if you’ve watched the video you know the subject was in full sunlight.  Knowing they were headed south from Silverton to Durango, I was looking primarily at the West facing slopes in the valley.\nThe second picture is a side view, also from Google Earth, showing what I believe are the rock outcroppings above where the subject was sighted, the treeless slope where it was, and the rock field which was to the right of the subject (as you are looking at it).\nThe third picture shows the location of the Sasquatch Expedition Campers business in relation to where the subject was sighted.  It’s less than 1.5 miles as the crow flies.\nThe fourth picture is taken from the camper company’s website.  If you look behind the person in the costume you will see that same oval track I mentioned above.  This picture was taken on the same side of the valley where the subject was spotted this weekend.  I’ve seen the debate on whether the costume in this picture is the same as the one from the video.  I think it’s similar in color, but the hair doesn’t appear to be the same.  However, that doesn’t mean this company might not have more than one costume.\nThis brings me to the last picture.  I have been in contact with Sasquatch Expedition Campers before because, well, they have Sasquatch in their name and they make cool, albeit expensive, campers.  I sent them what I found and that’s how they responded…”We’ve had sightings of him for years, always likes to make an occasional appearance for the train too 🤣”.  While not an outright admission, I would say it could be inferred they are behind it.\nMake of it what you will, but I am fairly sure the camper company is behind this.  I think it’s more of a marketing idea rather than a serious attempt to dupe and hoax.  I think the people who captured the footage are to be commended first for even getting the pics/video and second for sharing it so the rest of us could decide for ourselves.", "media": null, "score": 201, "upvote_ratio": 0.97, "comment_count": 42, "over_18": false}, "74": {"id": "173ycwz", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Question", "time": 1697250970.6974554, "created_utc": 1696874318.0, "url": "https://i.redd.it/zstj0bvju7tb1.jpg", "title": "Are there any cryptids with genuine widespread belief in them by the locals? Like how many Americans believe in black panthers and survivimg Eastern cougars", "permalink": "/r/Cryptozoology/comments/173ycwz/are_there_any_cryptids_with_genuine_widespread/", "selftext": "", "media": null, "score": 196, "upvote_ratio": 0.93, "comment_count": 127, "over_18": false}, "75": {"id": "174qccp", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Misterbaboon123", "link_flair_text": "Unidentified", "time": 1697250970.860954, "created_utc": 1696957598.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/174qccp/a_wildman_unlike_any_other_living_in_peninsular/", "title": "A wildman unlike any other living in peninsular Malaysia", "permalink": "/r/Humanoidencounters/comments/174qccp/a_wildman_unlike_any_other_living_in_peninsular/", "selftext": "I have casually found on an Italian article from late 1990's a report about something incredible happened in peninsular Malaysia in the 1920's. It happened in peninsular Malaysia, Ulu Slim area, to some Sakai Orang Asli local hunters. First, it should be noted they have their own version of Bigfoot, the Jarang Gigi, also known as Orang Mawas, a black to reddish/blondish haired, 10 feet tall orangutanlike ape, most likely a relict population of Gigantopithecus Blacki, and the Orang Pendek (it is not only in Sumatra), its Floresiensis sized relative. However this encounter is not about either of them. \nNow this is what happened : one night, in a Ulu Slim Sakai village, two wildmen broke in and kidnapped 2 men. The village hunters took their blowguns and followed them, however they soon found the half devoured cadaver of one of their tribesmen. Horrified, they went along to fight the cannibalistic ape men. They found the creatures while they were consuming the other one, and they attacked. One of the two creatures fled, the other was taken off guard and was dealt a killing blow from a (likely poisonous) dart, and a little later fell down to his death. What the Sakai hunters found was what is truly remarkable : it was not a giant ape, he was a 6 - 7 feet tall manlike creature with lighter skin than the local people, long black hair and hairier than average body, but most importantly...he had a 6 inches long monkey tail. \nIt was not the first time this nearly human creatures are found in the area, even though they are rare compared to the Jarang Gigi. They are said to have, unlike humans, large brow ridges and no chin, but also, unlike apes, a fully bipedal posture and rudimentary clothing in the form of waist cloths made from tree bark, but apparently they are not formally distinguished by the locals with their own name, and are thus conflated with the Jarang Gigi. It should also be reported how the Jarang Gigi itself, the Malaysian Bigfoot, is said to be bipedal, and occasionally said to have a short monkey tail. \nWhat could that wildman have been ? Nothing from the Hominidae and Pongidae families should have a tail, and it is not a rare malformation because many bipedal, ape like individuals of the area are said to have a short tail. It comes to mind the Vanara from Hindu mythology, originally a forest wildman, later wrongly believed to be a magical, divine race of sentient monkeys, who in spite of their nigh human appearance and human intelligence, had a tail (and, apparently, beast like claws). Any thoughts on this ?", "media": null, "score": 13, "upvote_ratio": 0.93, "comment_count": 3, "over_18": false}, "76": {"id": "1769sag", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "rollingdesigns", "link_flair_text": null, "time": 1697250972.149066, "created_utc": 1697124814.0, "url": "https://i.redd.it/a8baejm9jstb1.jpg", "title": "A ceramic yeti spotted in my snake plant!!", "permalink": "/r/cryptids/comments/1769sag/a_ceramic_yeti_spotted_in_my_snake_plant/", "selftext": "", "media": null, "score": 35, "upvote_ratio": 0.9, "comment_count": 4, "over_18": false}, "77": {"id": "173dt2j", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "lboog423", "link_flair_text": null, "time": 1697250973.244687, "created_utc": 1696809307.0, "url": "https://i.redd.it/y4ouz9o7h2tb1.png", "title": "Here we go...", "permalink": "/r/conspiracy/comments/173dt2j/here_we_go/", "selftext": "", "media": null, "score": 1937, "upvote_ratio": 0.9, "comment_count": 560, "over_18": false}, "78": {"id": "175lytj", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1697250973.6408978, "created_utc": 1697050934.0, "url": "https://youtube.com/live/qAZSXG3dgdY", "title": "Breaking News Live: Whistleblower who helped recover non-human 'biologics' from a UFO crash site", "permalink": "/r/conspiracyfact/comments/175lytj/breaking_news_live_whistleblower_who_helped/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.75, "comment_count": 1, "over_18": false}, "79": {"id": "172ayuk", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "GlobalUfoChannel", "link_flair_text": "Discussion", "time": 1697250975.1185963, "created_utc": 1696697608.0, "url": "https://i.redd.it/jiu4ddn29tsb1.jpg", "title": "Today, it seems that Jonathan Reed is TODAY back on scene! He is even more constant, In 1996 The story became popular across the UFO and alien research community for many years, but was ultimately exposed as hoax. Supposedly he was chased by agents and they made story as a hoax. What do you think ?", "permalink": "/r/ufo/comments/172ayuk/today_it_seems_that_jonathan_reed_is_today_back/", "selftext": "", "media": null, "score": 346, "upvote_ratio": 0.86, "comment_count": 234, "over_18": false}, "80": {"id": "174m1e3", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "JBackerin", "link_flair_text": "Witness/Sighting", "time": 1697250976.6763904, "created_utc": 1696946581.0, "url": "https://v.redd.it/inpa9pbetdtb1", "title": "First time posting", "permalink": "/r/UFOs/comments/174m1e3/first_time_posting/", "selftext": "My mother is on a cruise and captured the following video at approximately 0500 this morning near Baranof Island. Enjoy.", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/inpa9pbetdtb1/DASH_720.mp4?source=fallback", "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/inpa9pbetdtb1/DASH_96.mp4", "dash_url": "https://v.redd.it/inpa9pbetdtb1/DASHPlaylist.mpd?a=1699842975%2CODhmM2M1OGY1ZGUwODBlYzM1MzA0NWY5NDE1Y2Q4ZjFhZmEyMjU1YjljNzhkYTk5ZjI4ZTViNThhMzkxMTAxMw%3D%3D&v=1&f=sd", "duration": 33, "hls_url": "https://v.redd.it/inpa9pbetdtb1/HLSPlaylist.m3u8?a=1699842975%2CN2E1YTZiMzJhNmVkMTM5OTM0MjBiNjdjNGExMDdjNGFkNDJiMTJiMWNhOTA2YTUyZjUwOGRjM2Q4MGVlMjc5Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2776, "upvote_ratio": 0.88, "comment_count": 554, "over_18": false}, "81": {"id": "172e2p1", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "GasRealistic3049", "link_flair_text": "Video", "time": 1697250978.1110108, "created_utc": 1696705353.0, "url": "https://v.redd.it/11nk1jilvtsb1", "title": "Taken near LaGuardia 9/20/23 ", "permalink": "/r/aliens/comments/172e2p1/taken_near_laguardia_92023/", "selftext": "Hey guys. Throwaway because my friends don't need to know my reddit. \nI took this video between Citi field and Laguardia a couple weeks back. \nApologies for the outbursts from all us onlookers.\nOne of my buddies looked up and goes \"huh. what the fuck is that?\" I looked up and saw what looked like a black orb or some sort of object following closely behind a commercial airliner and immediately started filming. Towards the end of the video you can hear a group of passersby stop to ask what we're recording. When we pointed it out they also began staring at it, and we all (10-15 people) watched it go off into the horizon. Afterwards we all agreed it was weird. One of the strangers remarked \"guess I just saw my first ufo!\" Who knows. \nBut from what I know, drones aren't allowed to operate that close to an airport, let alone that close to a commercial jet. Obviously came here to have you guys help rule out plausible explanations. \nMy friend who was in the military and does recreational aviation said I \"may\" have something here. His best guess is that its a military craft operating much, much higher than the commercial craft. He said that's the only plausible explanation he could come up with and said it's a reach either way. \nWhat do you guys make of this? Any similar footage out there? Thanks. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/11nk1jilvtsb1/DASH_1080.mp4?source=fallback", "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/11nk1jilvtsb1/DASH_96.mp4", "dash_url": "https://v.redd.it/11nk1jilvtsb1/DASHPlaylist.mpd?a=1699842977%2CNDI1Y2U1Y2RjMzA4MDJjNDBjMDczZTFlNmNjZjM3NTA5ZTMyMDI0NDZjOThlODA3ZjQ5NmE2ZDFhNTFhODYyYw%3D%3D&v=1&f=sd", "duration": 20, "hls_url": "https://v.redd.it/11nk1jilvtsb1/HLSPlaylist.m3u8?a=1699842977%2CYzg4YjI0YWYxY2ZlMzAzNWExYTk3N2FiNGVjMTlhNTE4MjViMTVkNWYyN2QxMjJlNzE4YTU0MTNkOGFjMTUxMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2624, "upvote_ratio": 0.87, "comment_count": 376, "over_18": false}, "82": {"id": "1779yed", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "jackwilkins97", "link_flair_text": null, "time": 1697250978.4556966, "created_utc": 1697234405.0, "url": "https://v.redd.it/9gn64ng5l1ub1", "title": "Saw this over fields. Any ideas? Had it confirmed by ex military it is not flares", "permalink": "/r/UAP/comments/1779yed/saw_this_over_fields_any_ideas_had_it_confirmed/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/9gn64ng5l1ub1/DASH_720.mp4?source=fallback", "height": 1280, "width": 590, "scrubber_media_url": "https://v.redd.it/9gn64ng5l1ub1/DASH_96.mp4", "dash_url": "https://v.redd.it/9gn64ng5l1ub1/DASHPlaylist.mpd?a=1699842978%2CY2ZmYjg0OTZjNzMzYzIzYmI4MzFiMWFlZDdiOGY3NzljODQxNmVhOWFhM2UxZjM2OThiYjFlZWMzNmZjYzk2NQ%3D%3D&v=1&f=sd", "duration": 74, "hls_url": "https://v.redd.it/9gn64ng5l1ub1/HLSPlaylist.m3u8?a=1699842978%2CYTRjZTY5NGM2MWQwZDg4MjE1MTA0NDFkZWQzNTA5NmVhNGMzMjIxYWVkNDIyN2VhOGU0NjM0N2NmYjJmZWEwMg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 46, "upvote_ratio": 0.81, "comment_count": 36, "over_18": false}, "83": {"id": "173fazx", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "The_Plow_King", "link_flair_text": "Update", "time": 1697250978.988954, "created_utc": 1696813804.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/173fazx/update_on_the_missing_children_from_soul_asylums/", "title": "Update on the missing children from Soul Asylum's Runaway Train: Part Three", "permalink": "/r/UnresolvedMysteries/comments/173fazx/update_on_the_missing_children_from_soul_asylums/", "selftext": "Hey everyone,\nFive years ago, I made two posts with updates to the missing people featured in several versions of Soul Asylum's music video Runaway Train. You can read Part One here and Part Two here.\nIn that time, a number of developments have been made to many of the featured cases, and so I thought it was time to consolidate all of my research (along with several Reddit users whose updates I am grateful for) in the one place.\nThis list is by no means conclusive: there are many versions of the video which are near impossible to find, and some people have next to no available information.\nBackground\nIn 1993, US band Soul Asylum released their critically acclaimed power ballad Runaway Train. Accompanying the song was a music video which featured the names and faces of missing children.\nThere are several versions of the music video. There are three US versions opening with the text: \"There are over one million youth lost on the streets of America\" and the UK version \"100,000 youth are lost on the streets of Britain.\" Several other versions exist; however, some have been taken down due to requests from the families of victims (most notably the Australian version which featured three victims of Ivan Milat). It is has been remarkably difficult trying to find every version of the original videos, and so this list is unfortunately not complete. There were three original versions of the video in the US, totaling 36 missing children shown. The children shown varied with the location of the broadcast, using missing children from that area.\nChildren from the American Videos\nThe American video. One of the three versions.\n- Andrea Durham. Still missing. Andrea was last seen at her family's residence at Royale Apartments at the corner of Colonial Drive and Mayflower Avenue in Fort Walton Beach, Florida, which she shared with her mother and older sister. Her mother and sister left, asking her to vacuum while they were gone. When Andrea's family returned to their residence two hours later, they found it unlocked with no indication of forced entry. Andrea's purse, clothes, makeup and all other personal belongings were undisturbed inside. The vacuum cleaner standing upright in the living room.\n- Aundria Bowman. Resolved. Aundria disappeared from Hamilton, Michigan on March 11, 1989. Prior to her disappearance, she had accused her adoptive father, Dennis Bowman, of sexually abusing her. Her case was listed as a runaway for many years. In January 2020, Dennis confessed to Aundria's murder. At the time, he was already in custody pending trial on charges of murder in the unrelated 1980 murder of a woman in Virginia. In the spring of 2020, Aundria's remains were found in a shallow grave on Dennis's property. He has been charged with murder, child abuse and mutilation of a body in Aundria's case.\n- Byron Page. Still missing. Byron went missing on 29 January 1992 from Los Angeles, California. He was last seen at a bus stop at Overhill and Slauson Streets in Los Angeles and was planning to visit a music warehouse and video store twenty miles away in West Hollywood. Byron never arrived home and has been missing since. Employees at the store do not recall him being there that day (Byron was a regular at the store and familiar with many of the staff).\n- Christopher Kerze. Still missing. Christopher stayed home from school on April 20, 1990. He said he had a bad headache and planned to stay home from school. His father went away on a business trip that day and his mother left him alone at their Eagan, Minnesota residence, after giving him an over-the-counter pain medication for his headache. When they came home, the family's light blue 1988 Dodge Caravan was gone, the family dog was running around loose, and there was a note on the kitchen table from Christopher reading: \"Mom, Something important came up + feeling somewhat better. Back by six. (Unless I get lost.) Love, Chris\" The word \"lost\" in the note was underlined twice. Christopher's mother believes his statement about getting lost was just a reference to the fact that he occasionally got lost while he was driving. Christopher never arrived home and has never been heard from again. He withdrew $200 from his savings account the day he disappeared. The next day, a handwritten note arrived at his parents' home. The note said Christopher had lied about being sick so he could use the family's car to get away \"to not even I know where.\" He said he intended to take his own life and apologised for hurting his family and loved ones. The note was postmarked Duluth, Minnesota; that town is about two and a half hours from Eagan. Two days after Christopher was last seen, the Dodge Caravan was found abandoned on the roadside in Itasca County in northern Minnesota, near the George Washington State Forest and the Chippewa National Forest, about twenty miles north of Grand Rapids, Minnesota. Christopher's grandparents lived in Grand Rapids. Inside the van were the keys and a note from Christopher explaining who owned the van. The family also got a lot of strange calls where the caller would not speak and there would be background noise like a party. Christopher's mother believes the strange calls were from him. They continued for six months before stopping abruptly.\n- Curtis Anthony Huntzinger. Resolved. Curtis disappeared from Blue Lake, California on May 19, 1990. He was originally considered a runaway, but as the years passed police began to suspect foul play in his case. Steven Daniel Hash, a friend of Curtis's family, was charged with voluntary manslaughter in Curtis's case in December 2008. Days later, he attempted to plead guilty, but the judge refused to let him. Hash led police to Curtis's body, which was entangled in tree roots in a shallow grave on the outskirts of Blue Lake.\n- Kimberly Doss. Still missing. Kimberly was living in Houston, Texas at the time of her disappearance. On September 27, she was seen at a Greyhound bus station in Davenport, Iowa. She'd taken the bus from Houston to Davenport to visit her father, but she never arrived at her father's house. Her family never heard from her again. Thursday's Child, a charitable organization that assists homeless or at-risk teenagers, claims they made contact with Kimberly in 1984, two years after her disappearance. They stated Kimberly was working as a prostitute on Hollywood Boulevard in Hollywood, California, under a pimp named James Wiseman. She had straight, bleached blonde hair and was using the name Kimberly Gardner.\n- Duane Fochtman. Still missing. Was last seen in downtown Lincoln City.\n- John Lango. Still missing. John was last seen leaving his family's residence in Pottsville, Pennsylvania at approximately 12:00 a.m. on January 1, 1988. He got into an argument with his girlfriend about where they were going to celebrate the New Year, and they parted ways. Later, while John was drinking with friends at his home, there was an altercation, and the police were called. John said, \"Screw this I'm, out of here.\" He got into a car with other people, possibly to go to a bush party or to the store. He never returned home and has not been heard from again.\n- Wilda Benoit. Still missing. Wilda was last seen at her family's residence in Creole, Louisiana on July 23, 1992. She had just been released from the hospital after a shoulder injury and was under heavy sedation at the time.\n- Martha Wes Dunn. Still missing. Martha was last seen in Daingerfield, Texas on September 5, 1990. There was a theory that Martha and her boyfriend Eric had traveled to Hayworth, Oklahoma. Eric's aunt lived there and there were several reported sightings of the pair there. On September 30, Martha's father got a call from a friend in Durant, Oklahoma; the friend said he'd seen Martha and Eric together and they were \"dirty and hungry,\" and he cleaned them up and gave them food. When police went to Durant to investigate the report, they couldn't find them.\n- Patrick Betz. Still missing. Patrick disappeared from his hometown of Upland, California on January 20, 1988. He told his mother that he was going with a friend to a basketball game at Upland High School. The police initially thought Patrick had run away from home due to a court case. He'd gotten into an altercation with another child at Sierra Vista Elementary School and was required to go to juvenile court about it.\n- Thomas Gibson. Resolved. Thomas was last seen playing in the front yard of his family's residence in rural Azalea, Oregon at approximately 11:30 a.m. on March 18, 1991. Thomas's father, Larry Gibson, then the Douglas County Deputy Sheriff, told authorities he took a jog around the family's property in Azalea during the late morning hours of his son's disappearance. Larry carried a handgun with him to shoot stray cats. Larry claimed he shot at a cat near the area where Thomas was playing but missed the animal. He then continued on his jog and learned his son was missing after returning to the house approximately 45 minutes later. The family summoned law enforcement later in the day to search the property. Larry was told not to report to work at the sheriff's office, but apparently dressed in his uniform and left the property for approximately 25 minutes during the investigation. He stated that his four-year-old daughter witnessed an unidentified couple pull into their driveway and abduct Thomas. Larry said he was checking a local rest area for signs of Thomas and the couple. While members of the community searched for Thomas, Larry sat at home; at one point he told the searchers to give up and go home because it was snowing. Authorities believed that Larry shot at a stray cat and killed the animal, as a deceased cat was located on the Gibsons' property near Thomas's last known location. Investigators believed that the bullet traveled through the cat and struck Thomas as he played, killing him. They theorised that Larry noticed Thomas's body after returning from his jog and buried the child in an effort to conceal the crime. Larry denied this scenario and maintained his innocence throughout the investigation. Larry's estranged wife and his daughter later changed their stories to authorities and said that his daughter witnessed her father hitting Thomas. Larry then put the child's body in a black plastic garbage bag, put the bag in the back of his patrol car and drove away. He was charged with murder in Thomas's case in 1994. Prosecutors argued that Larry had a history of abusing his children and was under stress at the time of Thomas's disappearance, as he had to care for the children while his wife was taking college classes. They theorized that, if he did not accidentally shoot his son, Larry lost his temper and beat the child to death. Larry was ultimately convicted of second-degree manslaughter in 1995.\n- Ginger Sue Hudson. Resolved. A man by the name of Gary Hudson made a comment on the Soul Asylum Youtube video stating \"My sister was featured on this video when she went missing, but was found months later, safe and sound.\" I have not been able to verify the authenticity of it, but on face value it seems legitimate.\n- Elizabeth Wiles. Resolved. Elizabeth was watching MTV at a friend's house when she happened to catch the video. Suddenly she saw her own face on the screen. “It was like, ‘Oh, no, I can’t look!’ she recalls. “I was so scared; I didn’t feel any other emotions.” But as fear gave way to homesickness, Elizabeth phoned home. “I talked to my mom, and we both started crying,” says Elizabeth, who flew home to Arkansas five weeks later. “The video brought me home.”\n- Polly Klaas. Resolved. On October 1, 1993, she was kidnapped at knife point during a slumber party at her mother’s home in California. She was later strangled by Richard Allen Davis and her body was found two months later.\n- Heather Lee Yagle. Resolved. Heather went missing on 7 February 1990 from Largo, Florida aged 16. She was later found alive and well, although there is little information as to why/how she went missing.\n- Christina Ann Wood. Still missing. Christina went missing on 2 December 1991 from Live Oak, Florida aged 15.\n- Emily Tamara Pois. Still missing. Went missing 1992. I found an article for an Emily Tamara Pois, aged 36, missing since 2015. The article states that Pois suffers from \"several mental health issues\" and goes by her maiden name of Harnsberger. I also found a Phoenix arrest record for an inmate named Emily Tamara Pois in Maricopa Country Jail. Her date of birth is listed 9/28/1978, booking date 02/19/2017 on a count of shoplifting.\n- Berenice Espinoza. Still missing. Cannot find any information.\nChildren from the British version\nIt has been remarkably difficult to find a link to the British version which is still working.\n- Mark Bartley. Resolved. A man named Mark Bartley commented on the YouTube video stating \"I am Mark Bartley the first person on the video I am in touch with my family again.\"\n- Lee Boxell. Still missing. Lee was an English schoolboy who went missing on 10 September 1988, aged 15, between Sutton High Street and Selhurst Park Football Stadium in London, England. On the day of his disappearance, Lee met with a friend to window shop before parting company, with Lee saying that he would be attending a football match later in the day. It was the last confirmed sighting of Lee. In 2012, a witness stated that Lee would occasionally attend an unofficial youth club in the annexed of St Dunstan's Church in Cheam known as The Shed. Following extensive enquiries, police discovered that pedophiles were operating in the area at the time Lee disappeared. Further, William Lambert, the St Dunstan's Church graveyard digger who ran The Shed, was jailed for 11 years in 2011 after sexually abusing four girls who attended the club. Coinciding with what would have been Lee's 40th birthday, a show called Crimewatch featured another appeal for information, working on the new theory that Lee attended The Shed on the day of his disappearance instead of the football match. Following this appeal, an allegation of sexual abuse was made which had never before been reported, and police are now working on the theory that \"Lee may have died after intervening to try to stop sexual abuse\" at The Shed.\n- Nicola Payne. Resolved. Nicola went missing on 14 December 1991 from Coventry, England. Payne was on her way to her parents' house from her home and had a six-month-old son at the time of her disappearance. In 2016, two men, Nigel Barwell and his brother-in-law Thomas O'Reilly were found not guilty of her murder. On the afternoon of 14 December, a woman named Louise Sambrook reported to police that she looked out of a window and saw Barwell’s car near a path leading to the river Sowe; “Standing either side of the boot were Nigel Barwell and Thomas O’Reilly. Between them, partly on the lip of the boot, was what appeared to Sambrook to be a full black bin bag. The prosecution suggest that Miss Sambrook was in fact observing the ground sheet of a tent that contained the body of Nicola Payne.” Five days after Payne disappeared, a tent was discovered in undergrowth in Barnell's garden, and in 2014 when the tent was re-examined, hairs found in it were sent for analysis and, due to improved scientific techniques, were linked to Payne. Unfortunately, the hair analysis was discounted in court. Detectives lost key pieces of evidence such as Payne's hairbrush. Further, the tent was incorrectly handled (not logged for one month and then stored for years in an unsealed bag) and so it was impossible to prove that there was no cross-contamination. It is believed that Barnell and O'Reilly are responsible for Payne's murder but escaped prosecution due to these technicalities.\n- Bill Barnett. Still missing. Billy from Holborn, London was due to go to Tenerife with a friend but at the last minute the plan changed, and Billy went ahead alone. He is known to have stayed at the Las Americas resort and seems to have visited the Sergeant Peppers nightclub on several occasions. Billy's friend came out later with his girlfriend and says he saw Billy a couple of times. On one occasion Billy seemed rather the worse for wear and said that he had lost all his money and had nowhere to stay. No one has seen him since then.\n- Kevin Hicks. Still missing. Kevin went missing on 2 March 1986 aged 16 in Croydon, South London. He told his parents that he was going to the local shop to buy some eggs for a home economics exam and left at 8:30pm. At 10pm a witness who knew Kevin saw him heading in the general direction of his house (notably, the store was only a 10-minute walk from the house, however this sighting of Kevin is 1.5 hours after he left). This is the last confirmed sighting of Hicks.\n- Mark Garvey. Still missing. Mark went missing on 2 March 1987 aged 15 from Bootle, Merseyside following an argument with his girlfriend. Following this argument, Garvey told his girlfriend that he was going to the bus stop, which is the last time he was seen (there have been no reported sighting made at all since his disappearance).\n- Susan Callam. Resolved. A woman named Jessica Scott stated on the British YouTube video \"I went to Guides with Susan Callam, one day she wasn't there and then she reappeared just as quick.\" This came in light of a docu-series named \"Searching for Susan\" was released in 1993.\n- Simon Darby. Still missing. I cannot find any information at all other than he went missing in 1989.\n- Ben Needham. Resolved. Ben went missing on 24 July 1991 at 21 months old on the Greek island of Kos. He was believed to have been kidnapped by gypsies known to live in a camp not far from where he and his family were staying. A private investigator did find a young boy years later living amongst the gypsies who resembled a more Anglo looking person than the Romani (he had blue eyes and blonde hair), however it was confirmed that this was not Ben. A \"breakthrough\" of sorts was made in September 2016, when police learned from a man from Kos that Kostantinos Barkas, a digger operator (now deceased), had told him that Ben had died in an accident (having been run over by Barkas who was operating a heavy vehicle on a construction site) and that he had hidden the body in building waste. Police began an excavation search and in July 2017 announced that traces of blood (a genetic \"profile indicative of human blood decomposition\") were found on a fragment of a sandal as well as on soil from inside a toy car, both items believed to have belonged to Ben. Whilst Ben has yet to be found, police are confident that the Barkas' confession is accurate and the likely conclusion.\n- Louise Kay. Still missing. Louise has been missing since 1988 (aged 18) when she was last seen dropping off a friend in her dad's distinctive gold Ford Fiesta with one white door, after a night out in Sussex, UK. Police have suspected Peter Tobin in her disappearance, as he was living nearby at the time (it should be noted that police/investigators and amateur sleuths have attempted to link Tobin to a plethora of missing/murdered persons cases despite very tenuous links) Having said that, Tobin was charged with the murders of Dinah McNicol and Vicky Hamilton who were featured in Part One of this writeup. Search teams spent two weeks excavating areas in and around Tobin's former home in Brighton, with no evidence or links to Kay's disappearance being found. Interestingly, a lead Detective has stated publicly that Kay may be buried in a garden by a home not yet searched by police, stating \"Very sadly, the local ­authority, who own the premises, won’t allow us to search the address.\" The home was owned by Tobin at the time of Kay's disappearance.\n- Dinah McNicol & Vicky Hamilton. Resolved. Both Dinah and Vicky were found in Scottish serial killer Peter Tobin's garden in Margate in 2007, buried with 15-year-old Vicky Hamilton.\n- Andy Gooch. Resolved. Andy was clubbed to death with a metal bar by his friend, Andrew Firth, after an argument about money and drugs, then buried in another friend's garden. Firth then went to comfort Andy’s mother and helped her look for him. He later confessed to his murder.\nChildren from the Australian version\n- Samantha Knight. Resolved. Samantha went missing on August 19, 1986, from Bondi, Sydney Australia. Sixteen years later, Michael Guider, who was in prison serving 16 years for sexually abusing 11 children in Sydney, admitted to another prisoner that he had snatched Knight from Bondi and drugged her. He had planned to take photos of her but when he returned from the store, she was dead on his couch. Guider said he panicked and buried her body somewhere before moving it later on. He eventually pleaded to manslaughter and has yet to reveal the location of her body.\n- Alan Fox and Anneke Adriaansen. Still missing. They were last seen in Byron Bay. The two were known to be hitchhiking at the time. After 27 years a Coroner in a Coronial Inquest declared them both legally dead, however their bodies have never been found.\n- Elizabeth Herfort. Still missing. Was last seen on 13 June 1980 leaving the Australian National University Bar in Canberra, Australia. A person matching Herfort’s description was seen hitchhiking on the south bound carriageway leading to Commonwealth Avenue in Canberra. It is believed that this same person was then given a lift in a motor vehicle along Commonwealth Avenue to the intersection of Coronation Drive in Canberra. She has not been seen since. Tenuous links have been made to the disappearance of two nurses the night before Herfort’s in Parramatta, Sydney, although it is highly unlikely that the disappearances are linked.\n- Andrew David Robinson. Still missing. Went missing on 14 March 1989 from New South Wales, Australia. He left his Lawson home on foot telling his wife that he was going to a friend’s house. He has not been seen since.\n- Tavanti Piras. Still missing. Went missing from Castle Hill, Sydney Australia on 26 July 1990, last seen by his father, Augusto Piras. It is believed his mother may have taken him to Thailand.\n- Warren Long. Still missing. Went missing from Drummoyne, Sydney Australia on 15 March 1993 age 20. He was last seen leaving his place of work. It’s been noted that his car and a brief note were found at Watson’s Bay by his friends on March 17, 1993, however I can’t find the contents of that note. Some sources have him erroneously listed as being missing since 2003. There have been possible sightings of him in Queensland.\n- Ryan Keen-Coffield. Resolved. From the article: \"A three-year custody battle ended at Sydney Airport last night when Yvonne Keen arrived home from the United States with her son Ryan. The mother and son flew into Sydney from Los Angeles after a US court gave Ms. Keen permission to bring her son home. Five-year-old Ryan Keen-Coffield was last on Australian soil three years ago, before he was allegedly kidnapped and smuggled overseas by his American father John Coffield. A two-month legal battle ended when a US Appeals Court rejected an application by Coffield to keep the boy in America. Coffield allegedly abducted Ryan, then aged two, from the former de-facto couple’s home in Sydney’s eastern suburbs in June 1991. After an intensive, three-year international search, a tip-off on March 30 lead to Coffield’s arrest at the Ohio farming community of Portage County. Coffield, 42, who was arrested for “interfering with the custody of an Australian child.\"", "media": null, "score": 972, "upvote_ratio": 0.99, "comment_count": 83, "over_18": false}, "84": {"id": "172xcvc", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "sodium-borohydride", "link_flair_text": null, "time": 1697250979.3451958, "created_utc": 1696766165.0, "url": "https://www.theguardian.com/world/2019/mar/28/canada-grizzly-bear-attack-mother-baby-investigation", "title": "Valerie Theoret and her infant daughter Adele were mauled to death by a grizzly bear while the family was out camping in Yukon, Canada. An autopsy of the bear revealed it had accidentally consumed a porcupine due to food shortage for hibernation, causing damage to it's digestive tract.", "permalink": "/r/MorbidReality/comments/172xcvc/valerie_theoret_and_her_infant_daughter_adele/", "selftext": "", "media": null, "score": 1854, "upvote_ratio": 0.98, "comment_count": 118, "over_18": true}, "85": {"id": "177awsw", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "sasbergers", "link_flair_text": null, "time": 1697250979.7171175, "created_utc": 1697236997.0, "url": "https://www.youtube.com/watch?v=U5_wzjf0PUE", "title": "Most Famous Cursed and Haunted Cars", "permalink": "/r/UrbanMyths/comments/177awsw/most_famous_cursed_and_haunted_cars/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Most Haunted and Cursed Cars", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/U5_wzjf0PUE?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Most Haunted and Cursed Cars\"></iframe>", "author_name": "The Strangest", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/U5_wzjf0PUE/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@TheStrangest"}}, "score": 1, "upvote_ratio": 1.0, "comment_count": 1, "over_18": true}, "86": {"id": "174e7t2", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "SpookyAngel66", "link_flair_text": null, "time": 1697250981.1059778, "created_utc": 1696918621.0, "url": "https://i.redd.it/60s92qx9ibtb1.jpg", "title": "Stanley Hotel Concert Hall taken in August", "permalink": "/r/Ghosts/comments/174e7t2/stanley_hotel_concert_hall_taken_in_august/", "selftext": "", "media": null, "score": 566, "upvote_ratio": 0.81, "comment_count": 139, "over_18": false}, "87": {"id": "176smi4", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Important-Following5", "link_flair_text": "Glitch Pic", "time": 1697250981.326337, "created_utc": 1697180061.0, "url": "https://i.redd.it/pir54vwn3xtb1.jpg", "title": "Shading calculations has been lowered apparently", "permalink": "/r/GlitchInTheMatrix/comments/176smi4/shading_calculations_has_been_lowered_apparently/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.42, "comment_count": 2, "over_18": false}, "88": {"id": "171yrhh", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "SwollenSandwich", "link_flair_text": "TV show", "time": 1697250982.405317, "created_utc": 1696658191.0, "url": "https://www.reddit.com/r/bigfoot/comments/171yrhh/i_stopped_watching_shows_about_finding_bigfoot/", "title": "I stopped watching shows about finding bigfoot", "permalink": "/r/bigfoot/comments/171yrhh/i_stopped_watching_shows_about_finding_bigfoot/", "selftext": "I love the legend and speculate just about as much as anyone but I came to the realization while watching and anticipating the crews to find bigfoot that in fact if they ever do, I will hear it on the news or see it on the internet before any of these pre taped shows air their “findings” Thank you for coming to my Ted talk", "media": null, "score": 195, "upvote_ratio": 0.94, "comment_count": 136, "over_18": false}, "89": {"id": "1769l6f", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1697250983.0084739, "created_utc": 1697124303.0, "url": "https://i.redd.it/roclwzavhstb1.jpg", "title": "In 1948 a family walking down a highway at night spotted a large spider in Leesville Louisiana. They said it was hairy and about the size of a washtub. It crossed the road and disappeared into the brush", "permalink": "/r/Cryptozoology/comments/1769l6f/in_1948_a_family_walking_down_a_highway_at_night/", "selftext": "", "media": null, "score": 179, "upvote_ratio": 0.92, "comment_count": 64, "over_18": false}, "90": {"id": "175cnsr", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Kindly-Car-2658", "link_flair_text": null, "time": 1697250984.0008736, "created_utc": 1697026728.0, "url": "https://i.redd.it/m2i4dsmqfktb1.jpg", "title": "Would Klimpaloon, the magical old-timey bathing suit that lives in the Himalayas, count as a cryptid?", "permalink": "/r/cryptids/comments/175cnsr/would_klimpaloon_the_magical_oldtimey_bathing/", "selftext": "", "media": null, "score": 34, "upvote_ratio": 0.72, "comment_count": 23, "over_18": false}}}