{"_default": {"1": {"id": "16wz050", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "UniversalSurvivalist", "link_flair_text": null, "time": 1696646119.7529948, "created_utc": 1696160686.0, "url": "https://i.redd.it/jfvrbo3kwkrb1.jpg", "title": "Goodbye middle-class podcasters, hello ministry of truth", "permalink": "/r/conspiracy/comments/16wz050/goodbye_middleclass_podcasters_hello_ministry_of/", "selftext": "", "media": null, "score": 2856, "upvote_ratio": 0.86, "comment_count": 494, "over_18": false}, "2": {"id": "16wd5sl", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Internal_Move", "link_flair_text": null, "time": 1696646120.245795, "created_utc": 1696096241.0, "url": "https://v.redd.it/vsh8smj4hfrb1", "title": "Does anyone know what this heat source is from on z 0 0 m earth?", "permalink": "/r/conspiracyfact/comments/16wd5sl/does_anyone_know_what_this_heat_source_is_from_on/", "selftext": "", "media": null, "score": 5, "upvote_ratio": 0.86, "comment_count": 0, "over_18": false}, "3": {"id": "16ztmvr", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "quetzalcosiris", "link_flair_text": "Article", "time": 1696646122.2758193, "created_utc": 1696441439.0, "url": "https://www.newsweek.com/extraterrestrial-video-footage-can-earn-you-1million-ring-1832138", "title": "Video doorbell company Ring offers $1,000,000 grand prize for capturing unaltered video evidence of a real extraterrestrial lifeform using their Ring device - Newsweek", "permalink": "/r/ufo/comments/16ztmvr/video_doorbell_company_ring_offers_1000000_grand/", "selftext": "", "media": null, "score": 721, "upvote_ratio": 0.96, "comment_count": 110, "over_18": false}, "4": {"id": "16xgw6e", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "External_Platypus_56", "link_flair_text": "Discussion", "time": 1696646123.7728179, "created_utc": 1696203655.0, "url": "https://i.redd.it/x5b0z6jbgorb1.jpg", "title": "Christopher K. Mellon on X", "permalink": "/r/UFOs/comments/16xgw6e/christopher_k_mellon_on_x/", "selftext": "Potential life out there according to Chris Mellon. Pretty exciting stuff considering the people he knows and his past experience in high levels of government.\nLink to tweet: https://x.com/chriskmellon/status/1708518873081778460?s=46&t=1UDWvFbKrQhgVun7YOnIwA", "media": null, "score": 6863, "upvote_ratio": 0.93, "comment_count": 721, "over_18": false}, "5": {"id": "16xurcw", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "MangCrescencio", "link_flair_text": "Question :snoo_thoughtful:", "time": 1696646125.3841975, "created_utc": 1696247917.0, "url": "https://i.redd.it/i33z9sfx3srb1.jpg", "title": "Does this fit the bill?", "permalink": "/r/aliens/comments/16xurcw/does_this_fit_the_bill/", "selftext": "", "media": null, "score": 4070, "upvote_ratio": 0.86, "comment_count": 501, "over_18": false}, "6": {"id": "16xcd83", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "MeansToAnEndThruFire", "link_flair_text": null, "time": 1696646125.9073668, "created_utc": 1696193197.0, "url": "https://www.dailywire.com/news/uap-caucus-denied-select-committee-disclosure-act-being-debated-in-house", "title": "\"...sources have said that Chair of the House Permanent Select Committee on Intelligence Rep Mike Turner(R-OH)—district includes Wright-Patterson AirForce Base, and received $200,000 from individuals/PACs from defense industry in the 2022 election cycle — has “tried to kill” the UAP Disclosure Act,\"", "permalink": "/r/UAP/comments/16xcd83/sources_have_said_that_chair_of_the_house/", "selftext": "", "media": null, "score": 181, "upvote_ratio": 0.96, "comment_count": 4, "over_18": false}, "7": {"id": "16y5rar", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "milehighmystery", "link_flair_text": "Disappearance", "time": 1696646126.4614284, "created_utc": 1696274753.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16y5rar/in_1996_stella_evon_disappeared_walking_home_from/", "title": "In 1996, Stella Evon disappeared walking home from her sister’s apartment. She is one of the hundreds of missing or murdered indigenous women (MMIW) in Alaska alone", "permalink": "/r/UnresolvedMysteries/comments/16y5rar/in_1996_stella_evon_disappeared_walking_home_from/", "selftext": "Stella Anastasia Evon was born on February 11, 1979, in Bethel, Alaska. She was raised in a multigenerational home and was particularly close to her older sister. Stella was an auntie and loved spending time with her family, often staying at her sister’s apartment nearby. \nIn 1996, Stella was 17 and lived in her family home in Bethel. Her grandmother also lived in the home, located across the street from the police station. She also had friends living in Anchorage and would occasionally travel to visit. \nThe disappearance\nEarly Sunday morning on September 29, 1996, Stella was partying with friends at a residence in Bethel. She had been out with the same friends the evening before and was ready to tell them good night. She left the residence to go home sometime between 3 and 4 a.m. \nStella arrived home and found that the front door of her house was locked. She attempted to wake up her sleeping grandmother inside the house but was unsuccessful. Since the home was across the street from the police station, Stella walked over and requested help from a police officer. \nWhen the office was unable to wake up her grandmother, he offered Stella a ride into town. She accepted and the two got in the officer’s squad car. They proceeded to drive the two-and-a-half-mile distance to her sister’s apartment complex in downtown Bethel. \nStella’s older sister, who is unnamed in all sources, lived in a studio apartment in the Bethel Native Corp. Unit, also known as the BNC apartment complex. \nThe officer dropped Stella off at the BNC apartments at 4:30 a.m. She only planned on staying for a short time until she was sure her grandmother was awake. However, less than an hour later Stella decided to leave her sister’s apartment and walk back home.\nBetween 5 and 6 a.m., Stella left on foot and walked southeast towards her home. Stella’s older sister watched as she walked down the street and faded into the darkness of the morning. This was the last confirmed sighting of Stella.\nThere is little information available regarding the investigation into Stella’s disappearance. Her family searched for any clues but were unable to locate her. She was thought to be in the local Bethel area, or possibly the Anchorage, Alaska area, but has not been sighted in either since disappearing. Aside from considering Stella to be missing under “suspicious circumstances”, there are no statements or records from law enforcement that indicate whether an official search took place. \nIn 2009, an investigator with the Alaska State Troopers’ Cold Case Unit reviewed the case file. In a 2010 interview with SitNews in Ketchikan, AK, the investigator said he believes someone in Bethel knows about the disappearance and urged them to come forward. From what little information is available, it appears as though Stella’s disappearance was always considered involuntary, and she was never mis-classified as a runaway, which was a common occurrence at the time. \nStella’s cousin, Juliet, gave in interview in 2015 featured in the Canadian newspaper, The Whitehouse Star. Juliet described Stella as a “very kind, very fun person” who was always laughing and loved everybody. Stella’s family offered a $5,000 reward fund for information about her disappearance, though Juliet said her family was trying to raise money to increase the amount. Stella’s sister has never stopped looking for her.\nStella Evon is of Yup’ik Eskimo descent. She stood just under 5 feet tall. She has brown eyes and thick, curly black waist-length. Her ears are double pierced. On the morning she disappeared, Stella was wearing a dark blue hoodie sweatshirt with a Georgetown University logo across the front, along with a brown leather jacket, blue jeans, and black shoes.\nBased on data collected from multiple law enforcement agencies and various databases, in 2021, there were 149 unsolved cases of missing indigenous women and girls in Alaska. (source)\nSources:\nhttps://charleyproject.org/case/stella-anastasia-evon\narticle from The WhiteHorse Star in 2015\nhttps://www.justicefornativepeople.com/2016/01/stella-evon-missing-from-alaska-since.html\nWhere is Stella? Cold Case Unit Seeking Clues\nhttps://coreysobell.medium.com/the-disappearance-of-17-year-old-stella-evon-3df1bda8544c\nhttps://www.nativewomenswilderness.org/mmiw\nhttps://dataforindigenousjustice.com/", "media": null, "score": 1096, "upvote_ratio": 0.98, "comment_count": 67, "over_18": false}, "8": {"id": "16zojee", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "morbidology", "link_flair_text": null, "time": 1696646127.1089547, "created_utc": 1696429325.0, "url": "https://morbidology.com/the-american-horror-story-death-of-scott-mcmillan/", "title": "3 year old boy was found dead covered in bruises, cuts & puncture wounds. His mother & her boyfriend admitted to using home made weapons on him, hanging him upside down by his feet & beating him until he died.", "permalink": "/r/MorbidReality/comments/16zojee/3_year_old_boy_was_found_dead_covered_in_bruises/", "selftext": "", "media": null, "score": 2608, "upvote_ratio": 0.98, "comment_count": 308, "over_18": true}, "9": {"id": "16zdkf9", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "chubachus", "link_flair_text": "Medical", "time": 1696646127.3158126, "created_utc": 1696393416.0, "url": "https://upload.wikimedia.org/wikipedia/commons/2/20/Diorama_showing_a_dissection_at_Montpellier_in_the_1300s%2C_En_Wellcome_L0058035.jpg", "title": "\"Based on an illustration in Treatise of Anatomy by Guy de Chauliac (c. 1300-68), a French surgeon, this diorama shows a dissection taking place at the University of Montpellier, France.\"", "permalink": "/r/Jessicamshannon/comments/16zdkf9/based_on_an_illustration_in_treatise_of_anatomy/", "selftext": "", "media": null, "score": 41, "upvote_ratio": 0.95, "comment_count": 1, "over_18": true}, "10": {"id": "170ijq1", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "verystrangeshit", "link_flair_text": null, "time": 1696646127.5264802, "created_utc": 1696513882.0, "url": "https://i.redd.it/wx5icp6s2esb1.jpg", "title": "The Giant of Kandahar, who attacked a patrol of Green Berets in Afghanistan, killing one.", "permalink": "/r/UrbanMyths/comments/170ijq1/the_giant_of_kandahar_who_attacked_a_patrol_of/", "selftext": "", "media": null, "score": 24, "upvote_ratio": 0.94, "comment_count": 1, "over_18": true}, "11": {"id": "16y6s4y", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "iamtortos", "link_flair_text": null, "time": 1696646127.7457654, "created_utc": 1696277091.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/16y6s4y/coincidence_or_god_really_listened/", "title": "Coincidence or God really listened?", "permalink": "/r/Thetruthishere/comments/16y6s4y/coincidence_or_god_really_listened/", "selftext": "Sorry for any grammatical mistake.\nThis is the event when I was about 13 years old. There was an old type of computer in our house whose monitor was like an old TV. At that time flat LED screens were in trends. I wanted that flat LED monitor but I didn't tell this to my parents. \nIf I talk about my childhood habits, I belong to a religious family and used to worship God every evening during my childhood. One day a great desire arose in my mind, I thought I should have a flat screen monitor and then I went to do the evening worship as usual.\nWhile doing worship, I was thinking of getting a new monitor and then the most unexpected thing happens.\nAs soon as I came out of the worship room, I saw that my father and elder brother were coming into the room with a flat screen LED. They told me that they went to one of my uncles And one of his friends had an extra monitor, so he gave it to us. I think god really heard me that day or it could be a big coincidence. \nBut even today i realize how all this happened so quickly. A second after i finished the worship, my father came with the monitor. Do god really exist and listening to us all time?", "media": null, "score": 45, "upvote_ratio": 0.68, "comment_count": 131, "over_18": false}, "12": {"id": "17006wq", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "ToeExcellent7247", "link_flair_text": null, "time": 1696646127.9318595, "created_utc": 1696457169.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/17006wq/weird_friend_i_had_twothree_years_ago/", "title": "Weird friend i had two/three years ago", "permalink": "/r/LetsNotMeet/comments/17006wq/weird_friend_i_had_twothree_years_ago/", "selftext": "hi reddit, ive been scared to tell this story to anyone not involved because i am always petrified she'll end up finding her way back to me, but on here, and in this subreddit i dont think she will.\ntrigger warning for grooming and stalking\n​\ntwo or three years ago, i met this girl thru mutual friends. she seemed like, amazing, she was so kind and eager to be friends with me, she'd give me presents, and compliments, so much. too much almost. now in this friendship i was developing with her, she'd talk about kidnapping me and having her to herself. obviously, you tell a traumatized naive 16 year old that she'll think its a joke, which is exactly what i did. after a while she started to get oddly sexual with me (i was in a very committed relationship at that time too.) asking if she could feel me up when we met because she didnt know what boobs felt like, or saying how her truck bed was perfect for sex under the stars in a field. mind you shes a year and 11 months older than me. i eventually moved to be with my friend group, unaware that she also lived here, but went to school with my friends. we were all friends with her, and they all have their sides of what happened that i wont recount, as its their story to tell. \nonce i moved here, she'd try and come see me everyday, even after she turned 18 and i was 16 almost 17. she even bought me three pairs of booty shorts for christmas with the note \"cant wait to see you in these, i picked the perfect colors ;)\". i had been uncomfortable with her advances from the start and had even told her on multiple occasions that i was uncomfortable, but it didnt stop her advances. even trying to manipulatively convince me to leave my partner at the time. once i started to pull away emotionally from her, she chewed me out, threatening to kill herself or shoot up her school if i didnt wanna be friends with her. \nonce new years rolled around, and i couldnt handle the constant at this point harassment i was getting from her, i finally told my friends what was happening with her. they told me i was actively being groomed. the gifts, the compliments, the unwavering obsession with me. it made me sick, so me and my roommate finally decided to cut ties with her, blocking her on everything and having one of my parents tell her she was not welcome near me or the house again. \nshe was PISSED, she started to drive by my house or near my street almost every day after she got out of school, even at one point deciding to do a burnout very loudly at my friends house because she knew i was at their house. she would ask my friends about me and ask if i done ignoring her. once she found out i got told i was groomed by her, everything switched. she hated me, said i ruined her life, lead her on, forced her to smoke weed, she even started saying i sent her nudes and started to sexually flirt with her first, all of those not true in any way. she was telling these and so many other things about me to complete strangers at her school too. she was so mad at me, even on my 17th birthday tweeting that she wished id just die already. all her anger, or anything she had said about me would come back to me obviously, as she was actively talking to or engaging with my friends. \nit had been months since i had heard about her or anything she had said about me, i was finally content but that paranoia i had was still strongly there, and terrified.\ni was going to a concert for one of my favorite bands ever, and i was even happier about it because they were playing in a city near me. i had tweeted about getting tickets, and just how excited i was about it. me and my roommate go to the concert, and we're having an amazing time during the openers, i go out to get a cup of water and out of the corner of my eye i see her. she hated this band, she even bashed me for liking them so much. knowing that i brushed my worry off and went back into the concert venue. once the openers left and the band started played me and my roommate we're having SUCH a good time. then during the third or fourth song i turn around and see her so close it was uncomfortable. my body threw me into a panic attack on instinct, and me and my best friend had to leave the concert immediately. it was horrifying, and im still petrified to go to concerts in my state honestly. \ni havent heard anything about her or her whereabouts since then besides hearing she got admitted into a mental hospital for saying some fucked shit to a friend of hers.\nsorry for such a long story, thank you to anyone to who read, and to that girl, i truly hope we never meet again. ", "media": null, "score": 148, "upvote_ratio": 0.94, "comment_count": 34, "over_18": true}, "13": {"id": "16zf8nu", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "CanadianClassicss", "link_flair_text": null, "time": 1696646128.1313255, "created_utc": 1696398965.0, "url": "https://watchdocumentaries.com/taxi-to-the-dark-side/", "title": "Taxi to the Dark Side (2007 best documentary award winner) - How the US employed torture and inhumane treatment during the early 2000s", "permalink": "/r/MorbidHistory/comments/16zf8nu/taxi_to_the_dark_side_2007_best_documentary_award/", "selftext": "", "media": null, "score": 15, "upvote_ratio": 1.0, "comment_count": 3, "over_18": false}, "14": {"id": "16zowpz", "locked": false, "subreddit": "crimescene", "stickied": false, "category": "Crime", "author": "GoreGirl89", "link_flair_text": null, "time": 1696646128.340842, "created_utc": 1696430243.0, "url": "https://www.reddit.com/gallery/16zowpz", "title": "Russian construction worker", "permalink": "/r/CrimeScene/comments/16zowpz/russian_construction_worker/", "selftext": "", "media": null, "score": 1339, "upvote_ratio": 0.98, "comment_count": 96, "over_18": true}, "15": {"id": "170e74b", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Visual_Command_3635", "link_flair_text": null, "time": 1696646128.5843763, "created_utc": 1696500708.0, "url": "https://www.reddit.com/r/truecreepy/comments/170e74b/a_couple_of_years_ago_i_heard_my_neighbour_die/", "title": "A couple of years ago I heard my neighbour die", "permalink": "/r/truecreepy/comments/170e74b/a_couple_of_years_ago_i_heard_my_neighbour_die/", "selftext": "I live in the same neighborhood since I was born, Its not tiny but not big either so most of us know eachother for years and obviously the closer the neighbours the more we know eachother.\nIn front of our house, a little bit to our right used to live a older couple, the man from what I remember was in a hospital for awhile so in the house it was just the older lady. Lovely lady, always remembered our birthdays and used to give us stuff like lemons, or vegetables.\nOne day I was home alone when I heard screaming \"help, I need someone\", so I went to the balcony (it was on the opposite side of the house from the entrance and from where the lady lived) and I saw nothing besides another neighbour in the balcony in the building next to my house meaning she heard it too. Couple hours passed and my came home crying saying my neighbour died underneath her own car. In my head the thought of \"could I have done anything to help her if I went to the entrance instead of the balcony?\" Came a lot and I still think about sometimes. \nThe thing is I was barely a teen back then, maybe 14 and I was kinda scared tbh.", "media": null, "score": 45, "upvote_ratio": 0.93, "comment_count": 12, "over_18": false}, "16": {"id": "171iw2x", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "SeikoStarsong", "link_flair_text": null, "time": 1696646128.7740698, "created_utc": 1696614534.0, "url": "https://www.reddit.com/r/threekings/comments/171iw2x/looking_for_wish_granting_rituals/", "title": "Looking for wish granting rituals", "permalink": "/r/threekings/comments/171iw2x/looking_for_wish_granting_rituals/", "selftext": "Looking for any kind of ritual that can grant me a wish, and also summoning entities that can grant wishes.", "media": null, "score": 5, "upvote_ratio": 0.86, "comment_count": 2, "over_18": false}, "17": {"id": "170p72d", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "3_T_SCROAT", "link_flair_text": null, "time": 1696646129.7017496, "created_utc": 1696530056.0, "url": "https://i.redd.it/wp9632mvefsb1.png", "title": "What do think are the best and worst ghost hunter shows?", "permalink": "/r/Ghosts/comments/170p72d/what_do_think_are_the_best_and_worst_ghost_hunter/", "selftext": "", "media": null, "score": 5721, "upvote_ratio": 0.93, "comment_count": 695, "over_18": false}, "18": {"id": "16xzlsb", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Away_Perception_9083", "link_flair_text": "Glitch Pic", "time": 1696646130.0883963, "created_utc": 1696260432.0, "url": "https://i.redd.it/luw0qrd55trb1.jpg", "title": "I did not buy a second one of this shirt. I’ve had a giant pile of laundry forever and I finally tackled part of it", "permalink": "/r/GlitchInTheMatrix/comments/16xzlsb/i_did_not_buy_a_second_one_of_this_shirt_ive_had/", "selftext": "", "media": null, "score": 136, "upvote_ratio": 0.84, "comment_count": 41, "over_18": false}, "19": {"id": "16wo803", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Sasquatchballs45", "link_flair_text": "what is it?", "time": 1696646131.2006845, "created_utc": 1696124269.0, "url": "https://v.redd.it/chz5lcp9whrb1", "title": "Sent to me by a friend on our hunting lease. Honobia OK", "permalink": "/r/bigfoot/comments/16wo803/sent_to_me_by_a_friend_on_our_hunting_lease/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/chz5lcp9whrb1/DASH_720.mp4?source=fallback", "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/chz5lcp9whrb1/DASH_96.mp4", "dash_url": "https://v.redd.it/chz5lcp9whrb1/DASHPlaylist.mpd?a=1699238130%2COTFkZjg3N2E3NWVjNzNhMWNiNmM4ZjA3MmJkNjRjNmI1ODA1NDA3MDZiYTA0NmEwODQ0OTMwZjBiMGVkNjcyNw%3D%3D&v=1&f=sd", "duration": 13, "hls_url": "https://v.redd.it/chz5lcp9whrb1/HLSPlaylist.m3u8?a=1699238130%2CNmVlMmU1NjYwODQ2MzAxNzg3NDJmM2UzM2U4Y2JmY2M2MTA4Y2QzYjdjMWZhODk0ZjMzZDViYzU3ZTQyMzQ0Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3717, "upvote_ratio": 0.91, "comment_count": 632, "over_18": false}, "20": {"id": "16w4asi", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "undead_david", "link_flair_text": null, "time": 1696646131.9762394, "created_utc": 1696072849.0, "url": "https://i.redd.it/1qiw8uedndrb1.jpg", "title": "My girlfriend mad this and it hangs in our living room. What cryptid should she make next.", "permalink": "/r/Cryptozoology/comments/16w4asi/my_girlfriend_mad_this_and_it_hangs_in_our_living/", "selftext": "", "media": null, "score": 243, "upvote_ratio": 0.98, "comment_count": 24, "over_18": false}, "21": {"id": "16ydpyv", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Talking_Strange", "link_flair_text": "Humanoid", "time": 1696646132.1594203, "created_utc": 1696293546.0, "url": "https://i.redd.it/f2awp9vlvvrb1.jpg", "title": "My Experience with “the others”", "permalink": "/r/Humanoidencounters/comments/16ydpyv/my_experience_with_the_others/", "selftext": "I recently contacted Nick Pope via Email and asked to be pointed towards the right people who would take my case seriously and help me. Those people happen to be MUFON.\nTomorrow I have my first interview via phone call with a doctor from MUFON who will look into my case. I’m excited that finally someone will take me seriously! \nAfter many years of debating wether my experiences were real or not I recently listened to a podcast which featured Tom De Longe speaking about “consciousness” and how it’s all connected to the UFO/UAP phenomena. This podcast confirmed in my head that my experiences not only happened but were also linked to what mr De Longe spoke about.\nThey first made contact with me when I was 13 and didn’t leave me alone till I was 21. This creatures were intrusive and left me traumatised for years. \nEvery time they made contact I was left drained of energy, angered and with severe migraines.\nI will soon be sharing my experiences in detail. That will be after tomorrow’s interview.\nUntil then this is a sketch of how this things look like, and yes it looks like a shadow person ;)", "media": null, "score": 313, "upvote_ratio": 0.95, "comment_count": 59, "over_18": false}, "22": {"id": "16xx4zr", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "LatterRequirement316", "link_flair_text": null, "time": 1696646133.267872, "created_utc": 1696254546.0, "url": "https://i.redd.it/7w8obbennsrb1.jpg", "title": "Expect a lot of fake AI cryptids… i cant even tell this is AI.", "permalink": "/r/cryptids/comments/16xx4zr/expect_a_lot_of_fake_ai_cryptids_i_cant_even_tell/", "selftext": "", "media": null, "score": 256, "upvote_ratio": 0.92, "comment_count": 87, "over_18": false}, "23": {"id": "16ydxcz", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "callmebaiken", "link_flair_text": null, "time": 1696646134.781295, "created_utc": 1696294089.0, "url": "https://i.redd.it/mov8pqg8xvrb1.jpg", "title": "Travis Kelce got the Illuminati Level-Up!", "permalink": "/r/conspiracy/comments/16ydxcz/travis_kelce_got_the_illuminati_levelup/", "selftext": "Sunday night football showed how fake their \"relationship\" is. Cutting to her right before commercial, then the commercial is Taylor Swift's Upcoming theatrical release (never a sure thing these days). Then the next commercial was Kelce selling Pfizer Covid vaccines. Now he's pushing moribund Bud Light that stubbed their toe with the transsexual influencer campaign.", "media": null, "score": 1855, "upvote_ratio": 0.82, "comment_count": 383, "over_18": false}, "24": {"id": "16xgbu5", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "weareIF", "link_flair_text": null, "time": 1696646135.271073, "created_utc": 1696202272.0, "url": "https://youtube.com/watch?v=R4zD5y9y0to&si=MiND32mlXbKlI5-y", "title": "Hollow Earth entrance found. The story of Admiral Richard E. Byrd", "permalink": "/r/conspiracyfact/comments/16xgbu5/hollow_earth_entrance_found_the_story_of_admiral/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Hollow Earth entrance found. The story of Admiral Richard E. Byrd", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/R4zD5y9y0to?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Hollow Earth entrance found. The story of Admiral Richard E. Byrd\"></iframe>", "author_name": "Mystery and Truth Unveiled", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/R4zD5y9y0to/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@MysteryandTruthUnveiled"}}, "score": 4, "upvote_ratio": 0.71, "comment_count": 3, "over_18": false}, "25": {"id": "170kzd2", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "secretfuck30", "link_flair_text": null, "time": 1696646136.8964226, "created_utc": 1696519948.0, "url": "https://i.redd.it/dsye3ertkesb1.jpg", "title": "1870 - Mt. Washington, New Hampshire. Dubbed as \"The oldest UFO photograph ever taken.\"", "permalink": "/r/ufo/comments/170kzd2/1870_mt_washington_new_hampshire_dubbed_as_the/", "selftext": "It was the subject of bidding on eBay in 2002. The photo was purchased for $385.00 by Samuel M. Sherman, who was the President of Independent-International Pictures Corp.\nManipulating photos during that timeframe would have been incredibly difficult. There were no known flying objects in 1870. This is the original \"Stereo\" (Stereoscopic) photo.", "media": null, "score": 612, "upvote_ratio": 0.93, "comment_count": 105, "over_18": false}, "26": {"id": "16xjwzw", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "necromancer010", "link_flair_text": "Video", "time": 1696646138.3099122, "created_utc": 1696211657.0, "url": "https://v.redd.it/o04jllx04prb1", "title": "Various pilots sharing to air traffic seeing “various lights”", "permalink": "/r/UFOs/comments/16xjwzw/various_pilots_sharing_to_air_traffic_seeing/", "selftext": "This video is from 11 months ago; where various pilots call air traffic in LA seeing “multiple lights above them”. One of the pilots state they are “much higher” then they were, and “they’re going around circles”\nThe L.A. center replies to the pilots “you’re not entering any military airspace or anything “. \nThe L.A. centre then asks where they are which the pilot replies “at least 5000/10000 ft above us” \nVery interesting part:\nThe L.A. Center asks the pilot: “are they just white lights?”\nWhich the pilot replies: “they just keep going circles. I was an F-18 pilot in the marine corps and I, im telling ya, i’ve done many intercepts, ive never seen anything like it.\nFurthermore, later in the video another pilot calls saying he sees bright light off the north and more.\nWanted to share with you all. I found this extremely interesting.", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/o04jllx04prb1/DASH_720.mp4?source=fallback", "height": 1056, "width": 720, "scrubber_media_url": "https://v.redd.it/o04jllx04prb1/DASH_96.mp4", "dash_url": "https://v.redd.it/o04jllx04prb1/DASHPlaylist.mpd?a=1699238137%2CMjFhMmYyY2U3ZGFkZjRmZmVjYjdhNzdjMTc5OTljNTk0OTQ3ZTgyZjg5MzRkMDAxZTY3Zjc5ZTk0MDc1N2M3YQ%3D%3D&v=1&f=sd", "duration": 234, "hls_url": "https://v.redd.it/o04jllx04prb1/HLSPlaylist.m3u8?a=1699238137%2CNmZhZmRjNDY0ZWQxYmNhY2I3OGEyZDFmOTc1MTcyZTM5ZWExOGNlMmI5YzYzYTRjNjE5Y2ZlYTNjYWE5YTk2MQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3349, "upvote_ratio": 0.97, "comment_count": 231, "over_18": false}, "27": {"id": "16xkbye", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "DomFilms", "link_flair_text": "Video", "time": 1696646140.3757856, "created_utc": 1696212761.0, "url": "https://v.redd.it/v9bi26vd7prb1", "title": "If this was tech from the 80s, imagine the billions of R&D that has gone into similar tech. Aliens? Prob just Lockheed Martin", "permalink": "/r/aliens/comments/16xkbye/if_this_was_tech_from_the_80s_imagine_the/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/v9bi26vd7prb1/DASH_1080.mp4?source=fallback", "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/v9bi26vd7prb1/DASH_96.mp4", "dash_url": "https://v.redd.it/v9bi26vd7prb1/DASHPlaylist.mpd?a=1699238138%2CMDk4OWRlMmJlMzNmMjU0ZTNiMmY2NjdjN2ZmYzhkM2RkY2I4ZGI3OWZlYWM1NDNjZDVmMWFhNTM3ZDIzZTM3Mw%3D%3D&v=1&f=sd", "duration": 86, "hls_url": "https://v.redd.it/v9bi26vd7prb1/HLSPlaylist.m3u8?a=1699238138%2CYjNlNTZmNmYxMTIwNzA5YjYxNGFkYTY1NjllNThjZTRiZGQ0MTM1MDg3NmNhNzRlYTQ4ZGJkNjU4ZTA4OTY0Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2424, "upvote_ratio": 0.92, "comment_count": 325, "over_18": false}, "28": {"id": "171nmcj", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "quetzalcosiris", "link_flair_text": null, "time": 1696646140.8537643, "created_utc": 1696626059.0, "url": "https://www.independent.co.uk/news/world/americas/ufo-uap-reports-maryland-nasa-b2425327.html", "title": "What the heck is happening? Almost 2,000 UFO sightings — and that’s just over Maryland - The Independent", "permalink": "/r/UAP/comments/171nmcj/what_the_heck_is_happening_almost_2000_ufo/", "selftext": "", "media": null, "score": 130, "upvote_ratio": 0.91, "comment_count": 39, "over_18": false}, "29": {"id": "16y3c63", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "Basic_Bichette", "link_flair_text": "Update", "time": 1696646141.374867, "created_utc": 1696269187.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16y3c63/1989_murder_of_krista_martin_of_wichita_kansas/", "title": "1989 murder of Krista Martin of Wichita, Kansas solved; killer identified as Paul Hart", "permalink": "/r/UnresolvedMysteries/comments/16y3c63/1989_murder_of_krista_martin_of_wichita_kansas/", "selftext": "On October 1, 1989 a concerned friend checked on 20-year-old Krista Martin at her apartment in Wichita, Kansas only to discover that she had been beaten to death. At autopsy it was determined that she had also been sexually assaulted, although her body had been found clothed. Law enforcement did what it could, but in an era before affordable and wildly available DNA testing not much could be done at the time to identify the perpetrator. It seems that her murder didn’t receive the media attention similar crimes attracted; the few reports that were published over the years tended to link Ms. Martin's murder to the BTK case despite there being little similarity between the two.\nIn 2020 evidence that had been collected at the time of the attack was sent to Othram, who developed a DNA profile of the perpetrator and passed it on to the FBI for forensic genealogical research. The suspect whose DNA was found on her remains has now been identified as Paul Hart, whose surviving immediate relatives live in Arkansas. Hart died in 1999 in a traffic accident in Memphis; the Sedgwick County District Attorney said in a statement that were he still alive he would have been charged with her murder.\nI don't see a mention of this case on this subreddit but a poster to /u/kansascoldcases/, /u/crimecakes/, was a friend of Ms. Martin and has put together a series of podcasts on this case. I hope this resolution brings her and all of Ms. Martin's family and friends a measure of peace. \n\nhttps://dnasolves.com/articles/krista-martin-wichita/\nhttps://www.kwch.com/2023/10/02/wichita-police-identify-suspect-34-year-old-homicide-case/", "media": null, "score": 987, "upvote_ratio": 0.98, "comment_count": 63, "over_18": false}, "30": {"id": "16yqy2t", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "Anaelepse", "link_flair_text": null, "time": 1696646142.0480223, "created_utc": 1696337071.0, "url": "https://www.reddit.com/r/MorbidReality/comments/16yqy2t/in_2003_38_year_old_joyce_vincent_died_in_her/", "title": "In 2003, 38 year old Joyce Vincent died in her London flat watching TV, and her body lay undisturbed until almost 3 years later when city officials came to repossess the apartment due to unpaid rent.", "permalink": "/r/MorbidReality/comments/16yqy2t/in_2003_38_year_old_joyce_vincent_died_in_her/", "selftext": "​\nhttps:\\/\\/en.wikipedia.org\\/wiki\\/Joyce_Vincent", "media": null, "score": 2525, "upvote_ratio": 0.99, "comment_count": 236, "over_18": true}, "31": {"id": "16xypej", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "verystrangeshit", "link_flair_text": null, "time": 1696646142.411995, "created_utc": 1696258247.0, "url": "https://i.redd.it/9d1xu99nysrb1.jpg", "title": "Dicyanin - was a dye made from coal-tar by Walter John Kilner. He claimed the dye could make goggles that caused auras to become visible. Some say it was made illegal after WW2. Others claim to make glasses with it and use it as a window into the supernatural realm of ghosts and demons.", "permalink": "/r/UrbanMyths/comments/16xypej/dicyanin_was_a_dye_made_from_coaltar_by_walter/", "selftext": "", "media": null, "score": 8, "upvote_ratio": 0.75, "comment_count": 4, "over_18": true}, "32": {"id": "16x8935", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "StupdSexyDanCampbell", "link_flair_text": null, "time": 1696646142.6304018, "created_utc": 1696183872.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/16x8935/strange_experience/", "title": "Strange experience", "permalink": "/r/Thetruthishere/comments/16x8935/strange_experience/", "selftext": "Last year was a difficult time for me as I experienced the loss of a friend suddenly and my mother was involved in an accident where a person was killed, though she was not at fault. I began to have repressed traumatic memories begin surfacing of when I was a child of domestic violence and substance abuse and began questioning my self-worth and ability to be a good enough father for my children. I started experiencing rolling panic attacks and developing crippling anxiety, specifically OCD and agoraphobia. I had an indescribably intense fear of death, mostly centered around hell, even though I was no longer a practicing catholic. Things were spiraling and I was growing worse by the day. \nOne night, as suddenly as anything can be, i went from asleep to awake. However, it wasn’t my body that was awake, but rather my consciousness. I was simply aware. I could not see or feel. I felt no anxiety, fear or happiness, only consciousness. It was as if I simply existed within the ether. Weightlessness. Disembodied. What I did feel in that awareness was a feeling of being completely content. There was nothing but peace. It was a moment of reprieve and solace when I was fighting my hardest. Fear of anything seemed the most absurd thing I could imagine. I eventually came back into my body, so to speak. It was a completely fluid and seamless transition. I was actually terrified briefly, but when I woke it felt like I had experienced something special. \nWhat I believe is I somehow experienced my true spirit or being. The thing that I am, that lives behind my eyes and in my heart, but is routinely silenced by my ego. For whatever reason, my fear of death was diminished greatly as my being feels as natural as anything else. I’m meant to be here. I don’t know my role, I don’t know my purpose, I don’t know God. I do however know that not knowing is ok because at my center I am of the universe and I belong. \nI have never had the sensation again. The closest thing I’ve found to it is what Ram Dass and the others who talk about universal consciousness and interconnectedness.\nHas anyone ever experienced this? I’m completely open to it being anything. Glorified sleep paralysis, starting lexapro, stress, whatever. \nHowever the lesson remains.", "media": null, "score": 42, "upvote_ratio": 0.98, "comment_count": 15, "over_18": false}, "33": {"id": "16y6nk5", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Pumpkin_piE6848", "link_flair_text": null, "time": 1696646142.8280902, "created_utc": 1696276817.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/16y6nk5/a_creepy_bicycle_man_in_the_fields/", "title": "A creepy bicycle man in the fields", "permalink": "/r/LetsNotMeet/comments/16y6nk5/a_creepy_bicycle_man_in_the_fields/", "selftext": "This story happened a while ago but it still messes with my mind. Sidenote: I live in a quiet countryside  where is usually nothing happening. I'm a 18 years old girl who can easily walk around my hometown alone without even being scared because it's really safe here. Basically no crimes. \nSo, as usual, me and my dog went for a walk one evening. It was nice weather outside so I decided to go for a nearby field. I usually let my dog out of her leash there so it was fun for both of us, she's a nice dog and always comes when I call for her. We get to the field and everything is going really really well and nothing seems off, except I have this kind of odd feeling in my gut that I never usually have, the last time I had the same feeling when I was eight years old and we were driving at night with my family. I had the same feeling then and I told it to my parents \"I feel like something is wrong, you should be careful\" I said something like that. They slowed down because I was oddly serious at the moment, a minute after I said it a deer came out of nowhere and we would've crushed if we had gone by the same speed as a minute before. We were all shocked and my mom thanked me, I still remember it like it was yesterday. \nHowever, in the field, ten years later, I get the same gut feeling. \"Whatever\" I think and keep going completely ignoring it. We roll around the fields and a nearby forest until the sunset starts to set. I put my dog back to her leash and decide to leave from one of the tiny paths that go through a small forest (it's the quickest way to my home). It's not a popular way to go but it's quick. As I'm walking along that path I suddenly spot a silhouette in the end of the road just before the forest starts. I think nothing of it at that point and just keep walking but after just a little while I have a strong gut feeling and stare at the silhouette for a while, it's then that I notice that the silhouette is staring at me without moving. I just think that maybe they were waiting for someone, because at first the silhouette looked like a child's. But as I got closer I noticed that it wasn't a child but a grown man who was riding difficulty looking child's bicycle. It was a blue-green boys bicycle, his legs were way too long for it and his whole body looked like he was forcing himself to ride it. It was really unsettling sight. Still, my dumbass didn't want to turn around and have a couple of kilometers waste of time and even though it was creepy looking I still thought \"maybe he's waiting for someone that comes from my way?\". But every step i take he follows me with intense expression. I'm only like a twenty meters away from him when he starts to do a weird 'jumps' on his bike, smiling the ugliest and the most unsettling smile I've ever seen, just staring at me with wide eyes. He kinda looks like he was expecting something and is so excited about it that he needs to jump. He looks like he's in his fifties or something, very long and thin legs and arms, bald and that creepy unsettling smile. That's when my alarm rings went on, I glanced behind me and no one was there, it was just me, a 18 years old small girl with her fluffy (definitely not a guard) dog. I turn around 360' and start to jog where I came from, 'just in case'. I glanced at him and sighed in relief when I noticed he wasn't following me or anything, I thought that maybe he wasn't waiting for me after all and called myself stupid and a scaredy cat. I was so wrong. \nMy adrenaline starts to slow down again as I'm in the middle of the fields and I still see no sign of him following me. I let my dog out of her leash again and she starts to run around. I'm nearly at the end of the field (I only have a kilometer or sum a forest part before I get to my home after the field part) when my dog spots a rabbit or deer or some interesting thing and flies towards it, I panic because she has never done that before and yell for her. I yell plenty of times for her loudly and finally she comes back. I'm relieved that nothing happened to her but but as I put her back to her leash I notice something form the corner of my eye. The freaking bald long legs is biking towards me, he's not looking at the ground when he bikes, but me. Freak out wasn't enough to express my feeling in that moment. I have never seen a human who looks so crazy. More than crazy. what surprised me the most was that he was biking through a field, and I can tell you it is not a easy field to even walk sometimes. It has muddy ponds that you need to jump over but that psycho just biked through them. He was struggling A LOT to bike there but somehow managed to still do that, I didn't watch for another second behind me because I just started running. I ran so freaking full speed (and I have asthma) that I saw black and nearly collapsed, my lungs hurt so bad that I thought I was dying but the adrenaline kept my blood running and my legs too. Once I glanced behind me and he was there, struggling badly to keep up his full speed on the field grounds with that ugly white smile and the way too little bike. After that I just ran like crazy until I found a house, hid in their yard without even minding that I was in someone else's yard. It didn't matter to me in that moment at all. I waited a while with my breathing stuck in my throat, but he didn't come. I was planning to yell as loudly as I could if he found me but he never did. At some point the adrenaline started leaving my system and I left my hiding spot. I ran again until I reached an area which had multiple people in their yards so I would have help if I saw him again. But I didn't. I typed 911 into my phone but couldn't bring myself to call, mostly because I had no proof and I didn't want my parents to find out because they are overprotecting so I wouldn't probably leave my house anymore (I still live with them sidenote). I've been paranoid after this incident, my dog was frightened too. I guess she noticed something was really off too. I swear to god that I will always ALWAYS listen to my gut when it's telling me something from now on. I'm still scared of him, I've expected to randomly spot him in some area and what he could've done to me. I can't forget his awful smile. I feel like he's gonna jump on my window one night and do what he wants to me. I feel paranoid and helpless, I'm still thinking about calling the police.", "media": null, "score": 54, "upvote_ratio": 0.88, "comment_count": 17, "over_18": true}, "34": {"id": "16yzcz2", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "dannydutch1", "link_flair_text": null, "time": 1696646143.0285175, "created_utc": 1696357329.0, "url": "https://www.dannydutch.com/post/the-execution-of-dafydd-ap-gruffydd", "title": "On this day in 1283, Dafydd ap Gruffydd, a genuine Prince of Wales, was executed. 🏴󠁧󠁢󠁷󠁬󠁳󠁿 Edward Longshanks (Edward I) decided an example needed to be made of Dafydd and had him hung drawn and quartered.", "permalink": "/r/MorbidHistory/comments/16yzcz2/on_this_day_in_1283_dafydd_ap_gruffydd_a_genuine/", "selftext": "", "media": null, "score": 4, "upvote_ratio": 0.75, "comment_count": 0, "over_18": false}, "35": {"id": "16x6ey8", "locked": false, "subreddit": "crimescene", "stickied": true, "category": "Crime", "author": "AutoModerator", "link_flair_text": "META", "time": 1696646143.2701528, "created_utc": 1696179630.0, "url": "https://www.reddit.com/r/CrimeScene/comments/16x6ey8/monthly_discussion_thread_october_2023/", "title": "MONTHLY DISCUSSION THREAD! | October 2023", "permalink": "/r/CrimeScene/comments/16x6ey8/monthly_discussion_thread_october_2023/", "selftext": "Welcome to the weekly discussion thread, come and talk about anything you'd like!\nA new discussion thread is posted on the first day of each month at 1 PM EST.", "media": null, "score": 20, "upvote_ratio": 0.82, "comment_count": 15, "over_18": true}, "36": {"id": "170assa", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "MisterMysteriesYT", "link_flair_text": null, "time": 1696646143.5219507, "created_utc": 1696487566.0, "url": "https://youtu.be/TWVpDwe37N4", "title": "What Happened to the Fort Worth Missing Trio?", "permalink": "/r/truecreepy/comments/170assa/what_happened_to_the_fort_worth_missing_trio/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "What Happened to the Fort Worth Missing Trio? | Unsolved", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/TWVpDwe37N4?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"What Happened to the Fort Worth Missing Trio? | Unsolved\"></iframe>", "author_name": "Mister Mysteries", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/TWVpDwe37N4/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@Mister_Mysteries"}}, "score": 7, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "37": {"id": "171reth", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Assistance_Salty", "link_flair_text": null, "time": 1696646143.7086494, "created_utc": 1696635526.0, "url": "https://www.reddit.com/r/threekings/comments/171reth/rituals_are_awesome/", "title": "Rituals are awesome", "permalink": "/r/threekings/comments/171reth/rituals_are_awesome/", "selftext": "If I had a kid or if I had access to death sprits, could he or I bring my soul or a loved one back to life in another body?\nAre there rituals that can bring someone back from death?( Friend, Family Member or a pet?", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "38": {"id": "16xquo6", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "JudasPenguin", "link_flair_text": null, "time": 1696646144.6608782, "created_utc": 1696234168.0, "url": "https://v.redd.it/ot2w1m12zqrb1", "title": "Checkmate, skeptics. Good luck debunking this", "permalink": "/r/Ghosts/comments/16xquo6/checkmate_skeptics_good_luck_debunking_this/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/ot2w1m12zqrb1/DASH_480.mp4?source=fallback", "height": 854, "width": 480, "scrubber_media_url": "https://v.redd.it/ot2w1m12zqrb1/DASH_96.mp4", "dash_url": "https://v.redd.it/ot2w1m12zqrb1/DASHPlaylist.mpd?a=1699238143%2CNDE1YTUyZTA5YjhkMzEzOWE1ZTQ2YmU5ZTg4NTVlNWRhYzZhZDZmYTIxYTFjODc4Zjc5OTA5ZjRhZTNlOTVhNw%3D%3D&v=1&f=sd", "duration": 11, "hls_url": "https://v.redd.it/ot2w1m12zqrb1/HLSPlaylist.m3u8?a=1699238143%2CZWU2NDBlMzgwOWZmNjI3ZWRkYWY5ZGQyZDU2OWIyMjA4NjdiYWY3ODk1MDRkNjg1YTNmNGRjM2U3NDc1N2U2OA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1977, "upvote_ratio": 0.95, "comment_count": 103, "over_18": false}, "39": {"id": "16xk2f8", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Deuce_Deucee92", "link_flair_text": "Glitch Pic", "time": 1696646144.9618413, "created_utc": 1696212055.0, "url": "https://i.redd.it/71w51mwa5prb1.jpg", "title": "This row of cars at Costco today", "permalink": "/r/GlitchInTheMatrix/comments/16xk2f8/this_row_of_cars_at_costco_today/", "selftext": "", "media": null, "score": 68, "upvote_ratio": 0.92, "comment_count": 8, "over_18": false}, "40": {"id": "16x76fa", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "BleDStream", "link_flair_text": "Legitimately Skeptical", "time": 1696646146.0831294, "created_utc": 1696181386.0, "url": "https://i.redd.it/1iduhgx3mmrb1.jpg", "title": "Well was Sasquatch on Noah's ark?", "permalink": "/r/bigfoot/comments/16x76fa/well_was_sasquatch_on_noahs_ark/", "selftext": "", "media": null, "score": 619, "upvote_ratio": 0.97, "comment_count": 119, "over_18": false}, "41": {"id": "1700qd4", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Nosferatu517", "link_flair_text": null, "time": 1696646146.7505019, "created_utc": 1696458458.0, "url": "https://i.redd.it/81x9s91xh9sb1.jpg", "title": "You're the diver in this pic. What do you do?", "permalink": "/r/Cryptozoology/comments/1700qd4/youre_the_diver_in_this_pic_what_do_you_do/", "selftext": "", "media": null, "score": 211, "upvote_ratio": 0.95, "comment_count": 132, "over_18": false}, "42": {"id": "16y64nx", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "BooneThorn", "link_flair_text": null, "time": 1696646147.999182, "created_utc": 1696275600.0, "url": "https://i.redd.it/z5qtmha9eurb1.jpg", "title": "My latest little mummified fairy", "permalink": "/r/cryptids/comments/16y64nx/my_latest_little_mummified_fairy/", "selftext": "They still need their wings", "media": null, "score": 84, "upvote_ratio": 0.92, "comment_count": 13, "over_18": false}, "43": {"id": "16wite0", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "awalakaiehu", "link_flair_text": null, "time": 1696646149.1997368, "created_utc": 1696110235.0, "url": "https://i.redd.it/ehm0bncjqgrb1.jpg", "title": "For those saying I was lying about the price of milk where I live", "permalink": "/r/conspiracy/comments/16wite0/for_those_saying_i_was_lying_about_the_price_of/", "selftext": "Here's a gallon of milk at my local Time's Supermarket on Oahu. Actually costs more than my estimate of $11-12.", "media": null, "score": 1824, "upvote_ratio": 0.9, "comment_count": 688, "over_18": false}, "44": {"id": "16xand9", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "WhoIsJolyonWest", "link_flair_text": null, "time": 1696646149.700944, "created_utc": 1696189269.0, "url": "https://youtu.be/eeIvuKTVzRU?si=eAqSt4ISx8lXkDCQ", "title": "The History of Mental Torture in the USA: Alfred W. McCoy at NoTORTURE.org", "permalink": "/r/conspiracyfact/comments/16xand9/the_history_of_mental_torture_in_the_usa_alfred_w/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The History of Mental Torture in the USA: Alfred W. McCoy at NoTORTURE.org", "type": "video", "thumbnail_width": 480, "height": 200, "width": 267, "html": "<iframe width=\"267\" height=\"200\" src=\"https://www.youtube.com/embed/eeIvuKTVzRU?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The History of Mental Torture in the USA: Alfred W. McCoy at NoTORTURE.org\"></iframe>", "author_name": "Our Hidden History", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/eeIvuKTVzRU/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@OurHiddenHistoryRevealed"}}, "score": 3, "upvote_ratio": 0.81, "comment_count": 0, "over_18": false}, "45": {"id": "16yv2gp", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "quetzalcosiris", "link_flair_text": "Article", "time": 1696646151.3059154, "created_utc": 1696347260.0, "url": "https://www.thesun.co.uk/tv/24248691/netflix-viewers-convinced-aliens-real-encounters/", "title": "Netflix viewers 'convinced aliens are real' after binging new UFO doc Encounters", "permalink": "/r/ufo/comments/16yv2gp/netflix_viewers_convinced_aliens_are_real_after/", "selftext": "", "media": null, "score": 562, "upvote_ratio": 0.87, "comment_count": 122, "over_18": false}, "46": {"id": "16zoc4o", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Sketch_Crush", "link_flair_text": "Clipping", "time": 1696646152.8234217, "created_utc": 1696428828.0, "url": "https://v.redd.it/vfpgpqrv17sb1", "title": "Friendly reminder that Lockheed Martin uploaded this to their own youtube channel...", "permalink": "/r/UFOs/comments/16zoc4o/friendly_reminder_that_lockheed_martin_uploaded/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/vfpgpqrv17sb1/DASH_1080.mp4?source=fallback", "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/vfpgpqrv17sb1/DASH_96.mp4", "dash_url": "https://v.redd.it/vfpgpqrv17sb1/DASHPlaylist.mpd?a=1699238151%2CNjdmMWY4MzNhYjQyYWMyNzc5ZDkzMzcwNjBjNjAzNGRmY2I1YTE5MTU4MTM0ZTAzOTlkZmFkODA5Y2E4MjNlNA%3D%3D&v=1&f=sd", "duration": 19, "hls_url": "https://v.redd.it/vfpgpqrv17sb1/HLSPlaylist.m3u8?a=1699238151%2CMWVmZTkyMDYxNmM5NTU3YTg0NjU0NTg5NzhhMzBlYmUwODkzMWQyMTNiMDY3YzA4YTNiZTZjNzc2NzlhODM2OA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3258, "upvote_ratio": 0.9, "comment_count": 323, "over_18": false}, "47": {"id": "16xe7ss", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "EuphoricEye3900", "link_flair_text": "Video", "time": 1696646154.5285177, "created_utc": 1696197413.0, "url": "https://v.redd.it/hbllo7jpxnrb1", "title": "Who remembers the frantic caller on Art Bell's show who was supposedly working at Area 51?", "permalink": "/r/aliens/comments/16xe7ss/who_remembers_the_frantic_caller_on_art_bells/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 250, "fallback_url": "https://v.redd.it/hbllo7jpxnrb1/DASH_220.mp4?source=fallback", "height": 214, "width": 320, "scrubber_media_url": "https://v.redd.it/hbllo7jpxnrb1/DASH_96.mp4", "dash_url": "https://v.redd.it/hbllo7jpxnrb1/DASHPlaylist.mpd?a=1699238153%2CYmI1ZDkwNzcyYmU5YWY1MzhkY2RlMzdiMDY4MzJlYmMzOTI3YWQ1NDM0NjcwNTlhMDJkMDZiYzZkMDBlYjI0Nw%3D%3D&v=1&f=sd", "duration": 345, "hls_url": "https://v.redd.it/hbllo7jpxnrb1/HLSPlaylist.m3u8?a=1699238153%2CMjg2YjhlZjA5YjkwMzMyNTVjZWM5OTM0OGU3Yzk3YTU3MTQ5NGE4MDRkMGJmN2JiYmQ1YTgzMjY3Mjk1ZDYwMw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2367, "upvote_ratio": 0.89, "comment_count": 540, "over_18": false}, "48": {"id": "16y5x4n", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Unlikely-Ad7905", "link_flair_text": null, "time": 1696646155.3368087, "created_utc": 1696275124.0, "url": "https://www.reddit.com/r/UAP/comments/16y5x4n/status_of_uap_disclosure_act_oct_2_2023/", "title": "STATUS OF UAP DISCLOSURE ACT - OCT 2 2023", "permalink": "/r/UAP/comments/16y5x4n/status_of_uap_disclosure_act_oct_2_2023/", "selftext": "HOW DO I MAKE THIS POST STAY AT THE TOP OF THE SUB FOR A WEEK???\nH.R.2670 has passed the house, it does not include the UAPDA23. Since it didn't exist when the House voted.\nS.2226 has passed the senate, it does include the UAPDA23.\nThe two bills will be reconciled next, and the UAPDA23 MAY GET CUT from the final bill.\nCALL YOUR SENATOR & CONGRESSMAN TO BE SURE IT DOES NOT GET CUT!", "media": null, "score": 120, "upvote_ratio": 0.96, "comment_count": 7, "over_18": false}, "49": {"id": "170swyl", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "qqqqqqquuuuuuzzzzz", "link_flair_text": null, "time": 1696646155.9462032, "created_utc": 1696538925.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/170swyl/will_mystery_of_missing_news_anchor_jodi/", "title": "Will mystery of missing news anchor Jodi Huisentruit finally be unravelled after thirty years? New details emerge of 'fling' she had with man she met just ten days before she disappeared and photograph reveals location of their final date", "permalink": "/r/UnresolvedMysteries/comments/170swyl/will_mystery_of_missing_news_anchor_jodi/", "selftext": "\nPI Steve Ridge says he has information about Jodi Huisentruit's disappearance\n\n*The journalist vanished from her Iowa home in 1995 and hasn't been seen since\n*PI Steve Ridge says she was in a 'fling' with a man she met 10 days before she disappeared\nThe 30-year mystery of how news anchor Jodi Huisentruit disappeared may finally be solved, after new details about a secret fling with a mystery man she met just ten days before she vanished have emerged. \nJodi Huisentruit overslept for her job as an anchor at Mason City, Iowa news station KIMT on June 27, 1995, when a co-worker called to check up on her.\nThe 27-year-old assured her colleague that she would rush into the station in time for her 6am broadcast.\nShe was never heard from again, and was formally declared dead in 2001, though Iowa cops consider the case active and open. \nBut a crack PI claims he has previously unreported information about a fling with a man from out of state that the journalist met just ten days before she went missing, as well as a photograph showing the site of her final date before her disappearance.\nArticle:\nhttps://www.dailymail.co.uk/news/article-12596719/Will-mystery-missing-news-anchor-Jodi-Huisentruit-finally-unravelled-thirty-years-New-details-emerge-fling-man-met-just-ten-days-disappeared-photograph-reveals-location-final-date.html", "media": null, "score": 985, "upvote_ratio": 0.94, "comment_count": 184, "over_18": false}, "50": {"id": "16yfbmo", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "Alarming-Purchase-70", "link_flair_text": null, "time": 1696646156.632155, "created_utc": 1696297972.0, "url": "https://www.reddit.com/gallery/16yfbmo", "title": "Before and after photo of an Iranian child soldier buried alive during the Iran-Iraq war:", "permalink": "/r/MorbidReality/comments/16yfbmo/before_and_after_photo_of_an_iranian_child/", "selftext": "Just to provide a hint of how insane this war was, here is a text from a page written by a US correspondent attached to Iraqi forces during the Iran-Iraq war: \nThere were very few shots fired, and only a handful of artillery barrages. They were hardly needed, given the creative killing methods devised by the Iraqi army for the occasion.\n“You wait until nighttime, and you will see how we are killing these Iranian dogs,” an Iraqi officer said with a broad grin. “We are frying them like eggplants.”\nHe then took us on a tour of dozens of thick electrical cables his troops had lain through the marshy battlefield, a spaghetti network that snaked in and out of the patchwork of lagoons. He showed us the mammoth electric generators that fed the exposed power lines from positions just behind the Iraqi front lines. And, when the Iranian Revolutionary Guards made their regular evening advance, the officer and his men demonstrated the macabre genius of their invention.\nIraqi gun batteries fired just enough artillery to force the Revolutionary Guards from their marsh boats, and, when hundreds of them had been forced to continue their advance through the lagoons on foot, the men manning the Iraqi generators flipped a few switches and sent thousands of volts of electricity surging through the marshland.\nWithin seconds, hundreds of Iranians were electrocuted.\nBut the horror show did not end there. The following morning, Iraqi troops began another grisly routine that the officer called “the morning road detail.”\nThey made their way through the marshes, gathering up the dead Iranian soldiers like dynamite fishermen harvesting a day’s catch. Working methodically, the Iraqis piled the corpses on top of one another in the water in head-to-toe stacks, five bodies high and five across.\nTogether, the human piles formed long rows, the width of a troop truck, the top layers above the water’s surface. Each row extended in a straight line through the marshes from the Iraqis’ positions toward the Iranian border. Finally, the rows were sprinkled with lime and covered over with a foot-thick tier of desert sand.\nIt was the Iraqi method of road building, using the bodies of their enemies to construct assault routes for tanks and trucks.", "media": null, "score": 2448, "upvote_ratio": 0.99, "comment_count": 120, "over_18": true}, "51": {"id": "170be00", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "YaOIBLFudanshi69", "link_flair_text": null, "time": 1696646157.0106995, "created_utc": 1696489806.0, "url": "https://www.reddit.com/r/UrbanMyths/comments/170be00/haunted_places_in_eastern_north_carolina/", "title": "Haunted Places In Eastern North Carolina", "permalink": "/r/UrbanMyths/comments/170be00/haunted_places_in_eastern_north_carolina/", "selftext": "I'm looking for spooky ghost stories to hunt down and explore this halloween, but i haven't any luck finding any that i can explore freely without a tour guide on an old ship. Specifically are there any haunted asylums? Does eastern north carolina have any out in the wild ghost stories to check out?", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 1, "over_18": true}, "52": {"id": "16ynf36", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Daredevil_2_1", "link_flair_text": "Ghosts/Apparitions", "time": 1696646157.1945522, "created_utc": 1696326261.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/16ynf36/was_it_really_there/", "title": "Was it really there ?", "permalink": "/r/Thetruthishere/comments/16ynf36/was_it_really_there/", "selftext": "Hey guys just  I'm new to reddit and found this subreddit and thought to share a creepy incident which me and my friends had back then 8 years ago. \nSo I was in the 9th grade when this thing happened. Usually after our school ended I used to go to the tuition with my 2 friends. Our tuition class was situated in small jungle area, we would come to the class exactly at 6pm. Actually it was a haunted place bcz of some people had experienced really creepy incidents there even our teacher had said us that it was really dangerous, also she had an unusual experience there. There were just 2 street lights there bcz of it's remoteness, it used to be too dark when we had to get back to home. \nBut we didn't experienced such things there bcz we friends used to have fun there playing, talking and all. \nAnd one day this happens, a junior friend of mine wanted to go to the washroom badly so he went outside the class compound to pee we all usually used to go outside only. So when he was peeing he turns his face to right side, there was a small house which was empty and nobody lives there it's windows were broken we so  can see inside everything, there was no light it was fully dark there. \nWhen he turned his face to the right he saw a figure of an adult kid whose face was too creepy, & only the head and a hand was visible when he was watching there and the figure was calling my friend by gesturing from hand. My friend was shivering and he came running to our teacher and said everything wt had happened with him. \nHe didn't came to the class for 2 days he had fever bcz of that incident. \nAfter that me and my bestie were saying he might have hallucinated. Bcz we were teenagers at that time we didn't cared much abt these things and we both me and my bestie decide to have a tour around that haunted house. A friend of mine had a phone and he said us to record the whole thing. We said okay and went on for it, it was 8pm. \nWe both were recording everything in the house from the outside and making fun of it saying \"hey ghost where are you we are here to see you.\" \nAnd we walked around the house recording everything, it was fully dark and our flashlight was on. Lastly we go back of the house and I felt something went like a flash when I saw the camera, but I ignored it and from back there we could see our remaining friends standing there for us outside the class compound. \nAt the end of the tour when we were calling our friends from back of the house saying them see nothing is here and were also whistling while end of the video recording. Then we came back to the class. Ready to watch the video and we both remember the video was abt 8 to 9 minutes. But when we saw the video the video was ended in just 2 minutes while we were heading towards the back of the house as I said I felt something flashed in the camera, and as the flash came  the video was ended there itself. And also we both before starting the video had assured and checked it twice if the video recording is on or not, so we don't have the doubt abt had we started the video or not. \nTill now we talk abt  that day and still we feel creepy abt it. Now we do feel it was really there..", "media": null, "score": 16, "upvote_ratio": 0.91, "comment_count": 1, "over_18": false}, "53": {"id": "16xs6y5", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "GeneralDavis87", "link_flair_text": null, "time": 1696646157.5703447, "created_utc": 1696239266.0, "url": "https://youtu.be/__A3YyHL2Q4?si=WALpNhKpe3chGxAi", "title": "1st Marine Division in Action at Bunker Hill North Korea", "permalink": "/r/MorbidHistory/comments/16xs6y5/1st_marine_division_in_action_at_bunker_hill/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "1st Marine Division in Action at Bunker Hill North Korea", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/__A3YyHL2Q4?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"1st Marine Division in Action at Bunker Hill North Korea\"></iframe>", "author_name": "The Federal File", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/__A3YyHL2Q4/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@TheFederalFile"}}, "score": 3, "upvote_ratio": 0.8, "comment_count": 0, "over_18": false}, "54": {"id": "170u5fb", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Pale_Satisfaction798", "link_flair_text": null, "time": 1696646158.0103102, "created_utc": 1696541801.0, "url": "https://www.reddit.com/r/truecreepy/comments/170u5fb/if_the_government_asked_for_americans_to/", "title": "If the government asked for Americans to volunteer their fingerprints, would you comply or refuse?", "permalink": "/r/truecreepy/comments/170u5fb/if_the_government_asked_for_americans_to/", "selftext": "Maybe even DNA.. the Charlotte Sena case got me thinking, I wonder how beneficial a larger database of fingerprint records could be. It could help to rule people out, identify Jane/john does, prove guilt or innocence, deter criminals, and much much more.\nView Poll", "media": null, "score": 0, "upvote_ratio": 0.32, "comment_count": 20, "over_18": false}, "55": {"id": "16x5ult", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "PauxFas", "link_flair_text": null, "time": 1696646159.154919, "created_utc": 1696178244.0, "url": "https://i.redd.it/ihw25c8lcmrb1.jpg", "title": "Disturbing ghost photo discussed on Reviewing History podcast, what do you guys think?", "permalink": "/r/Ghosts/comments/16x5ult/disturbing_ghost_photo_discussed_on_reviewing/", "selftext": "", "media": null, "score": 450, "upvote_ratio": 0.86, "comment_count": 145, "over_18": false}, "56": {"id": "16vxozf", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Throwwaway879", "link_flair_text": "Glitch Pic", "time": 1696646159.4781897, "created_utc": 1696048919.0, "url": "https://i.redd.it/s8w3my62obrb1.jpg", "title": "Text from 2116", "permalink": "/r/GlitchInTheMatrix/comments/16vxozf/text_from_2116/", "selftext": "", "media": null, "score": 39, "upvote_ratio": 0.89, "comment_count": 10, "over_18": false}, "57": {"id": "170hfel", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "The_Critical_Cynic", "link_flair_text": "PGF", "time": 1696646160.6054258, "created_utc": 1696510818.0, "url": "https://v.redd.it/me3qc6hq3asb1", "title": "Video analysis of Patterson–Gimlin film show brings previously unseen details to light. Does this further authenticate the film for you?", "permalink": "/r/bigfoot/comments/170hfel/video_analysis_of_pattersongimlin_film_show/", "selftext": "", "media": null, "score": 468, "upvote_ratio": 0.95, "comment_count": 170, "over_18": true}, "58": {"id": "16yup4e", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Discussion ", "time": 1696646161.107057, "created_utc": 1696346381.0, "url": "https://i.redd.it/7udk722q80sb1.jpg", "title": "There have been reports of an unidentified animal in Fresh Pond, Cambridge Massachusetts. Loren Coleman was asking if anyone had more info on the sighting", "permalink": "/r/Cryptozoology/comments/16yup4e/there_have_been_reports_of_an_unidentified_animal/", "selftext": "", "media": null, "score": 162, "upvote_ratio": 0.97, "comment_count": 32, "over_18": false}, "59": {"id": "170lrbx", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Friskydingo001", "link_flair_text": null, "time": 1696646162.3789415, "created_utc": 1696521883.0, "url": "https://i.redd.it/vaz3tgrkqesb1.jpg", "title": "Mokele-Mbembe", "permalink": "/r/cryptids/comments/170lrbx/mokelembembe/", "selftext": "Hello! Don’t know if anyone’s interested or not but I just uploaded a video on the cryptid creature from the African Congo called the Mokele-Mbembe. A brontosaurus like creature that’s supposedly still encountered today. Would be honored if you guys would check out the video and let me know what you think? \nhttps://youtu.be/EhLRCrso68Y?si=kKRq3scH7yl8UepZ", "media": null, "score": 64, "upvote_ratio": 0.79, "comment_count": 37, "over_18": false}, "60": {"id": "16yqklw", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Own-Landscape-8586", "link_flair_text": null, "time": 1696646163.7849212, "created_utc": 1696336031.0, "url": "https://www.reddit.com/gallery/16yqklw", "title": "Canada is the new China", "permalink": "/r/conspiracy/comments/16yqklw/canada_is_the_new_china/", "selftext": "", "media": null, "score": 1758, "upvote_ratio": 0.87, "comment_count": 394, "over_18": false}, "61": {"id": "171jy4s", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1696646164.193564, "created_utc": 1696617033.0, "url": "https://youtube.com/live/hQYYM9x0pew", "title": "Whistleblower Meaning: Are people like David Grusch, Bob Lazar, Edward Snowden, Jack Teixeira, and your UFO leader Jeremy Corbell (NOT) a true whistleblower?", "permalink": "/r/conspiracyfact/comments/171jy4s/whistleblower_meaning_are_people_like_david/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "62": {"id": "16w4a0d", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Long_Welder_6289", "link_flair_text": null, "time": 1696646165.7816763, "created_utc": 1696072776.0, "url": "https://i.redd.it/e68ohnj5ndrb1.jpg", "title": "My thoughts after episode 2 of encounters", "permalink": "/r/ufo/comments/16w4a0d/my_thoughts_after_episode_2_of_encounters/", "selftext": "So this is my thought after watching episode two of encounters and also having heard this from other cases around the globe where nhi has conveyed a message saying we are on the wrong path with technology and we are destroying the planet. As our technology grows we are surely going to do less damage and maybe even reverse the damage we have caused if we still have enough time. Maybe the reason for all the disclosure is they are forcing us to stop withholding the technology in energy production (which we have probably had for decades but witheld to protect the world econony) so we can stop and reverse climate change.", "media": null, "score": 554, "upvote_ratio": 0.9, "comment_count": 202, "over_18": false}, "63": {"id": "16ztkr3", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "quetzalcosiris", "link_flair_text": "News", "time": 1696646167.1879218, "created_utc": 1696441298.0, "url": "https://www.newsweek.com/extraterrestrial-video-footage-can-earn-you-1million-ring-1832138", "title": "Video doorbell company Ring offers $1,000,000 grand prize for capturing unaltered video evidence of a real extraterrestrial lifeform using their Ring device - Newsweek", "permalink": "/r/UFOs/comments/16ztkr3/video_doorbell_company_ring_offers_1000000_grand/", "selftext": "", "media": null, "score": 3085, "upvote_ratio": 0.93, "comment_count": 338, "over_18": false}, "64": {"id": "16x0nl7", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "HS_illustrator", "link_flair_text": "Video", "time": 1696646168.7501915, "created_utc": 1696165415.0, "url": "https://v.redd.it/9r47qbmq7lrb1", "title": "Nostalgia, a postcard from Alpha Centauri, I tried to immagine how Sun may look like from an hypothetical planet orbiting Alpha Centauri A, Hope you will enoy!", "permalink": "/r/aliens/comments/16x0nl7/nostalgia_a_postcard_from_alpha_centauri_i_tried/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/9r47qbmq7lrb1/DASH_720.mp4?source=fallback", "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/9r47qbmq7lrb1/DASH_96.mp4", "dash_url": "https://v.redd.it/9r47qbmq7lrb1/DASHPlaylist.mpd?a=1699238167%2CZjA1MTQ1ZGY4YThlNjFkY2JhNjEzZmM2ZjM5NDBmZDVlODhkMzUwN2ZmYTg1ZGI0MTAwNjVmOTk1YWM5YjFjZA%3D%3D&v=1&f=sd", "duration": 122, "hls_url": "https://v.redd.it/9r47qbmq7lrb1/HLSPlaylist.m3u8?a=1699238167%2CNWJkM2Q1NGFiYzk2ZmQ1NjZjMmE4MzAwM2NhMjI0Yjk3OGM1YzM2NjkzN2U4NDZkZWJkZGM1ZmE1NTgwNGZmOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2323, "upvote_ratio": 0.96, "comment_count": 159, "over_18": false}, "65": {"id": "16zewgv", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "samexi", "link_flair_text": null, "time": 1696646169.2279656, "created_utc": 1696397800.0, "url": "https://youtu.be/kwsWAQ9sJZE?si=phFwWnZyJeTBZFyS", "title": "Mainstream documentary channel Yes Theory made an great piece about the subject and Grusch", "permalink": "/r/UAP/comments/16zewgv/mainstream_documentary_channel_yes_theory_made_an/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "7 Days With The Man Claiming Aliens Exist (under oath in congress)", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/kwsWAQ9sJZE?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"7 Days With The Man Claiming Aliens Exist (under oath in congress)\"></iframe>", "author_name": "Yes Theory", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/kwsWAQ9sJZE/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@YesTheory"}}, "score": 89, "upvote_ratio": 0.89, "comment_count": 30, "over_18": false}, "66": {"id": "16vy86v", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "source-commonsense", "link_flair_text": "Murder", "time": 1696646169.8324642, "created_utc": 1696050730.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16vy86v/sigrid_stevenson_was_murdered_while_playing_piano/", "title": "Sigrid Stevenson was murdered while playing piano on campus at The College of New Jersey in 1977. Despite the brutality of the crime, no suspects have ever been named.", "permalink": "/r/UnresolvedMysteries/comments/16vy86v/sigrid_stevenson_was_murdered_while_playing_piano/", "selftext": "On September 4, 1977, college student Sigrid Stevenson was found dead on the main stage of Kendall Hall, a performance theater on the campus at The College of New Jersey (then called Trenton State College). She was 25 years old. A talented pianist and aspiring music teacher, Sigrid was known for her love of playing the piano and was known to sneak into Kendall Hall for rehearsals.\nSigrid was found naked, wrapped in the piano cover, lying face-down. She had been bludgeoned to death with a blunt object. The damage was so severe, and the scene so bloody, that she could only be identified by her hair.\nIt was four days before classes were supposed to start.\nSigrid In Life: The Free-Spirited Pianist\nSigrid Stevenson was known as a free spirit who favored a bohemian lifestyle and loved being on the move. Originally from California, Sigrid was an accomplished pianist, whose love of playing the instrument was central to her life. She was originally from California, but had previously lived in New Jersey for a few years when her father taught at Princeton University. She was enrolled at Trenton State College in pursuit of a master’s degree in music, with ambitions to one day teach music.\nThose who knew Sigrid praised her independence—beyond what was expected of young women in the 70’s—and creativity. Close friends and family called her “Ziggy.” Their firsthand accounts paint a picture of an expressive soul who took pride in her individualism and didn’t feel an obligation to follow the status quo.\nTo those outside her circle, Sigrid was known as someone very comfortable being alone. She was friendly, but reserved; a laid-back wanderer but not a partier. Classmates described her as cautious and reserved, but friendly and kind when she opened up. Everyone knew her as an accomplished musician, and the sounds of her playing piano in the Allen Drawing Room or ABE residence halls were familiar on campus. \nSigrid did have a reputation for staying in university buildings after hours. Her green bike would often be chained up outside—a telltale sign.\nDuring her summer travels, Sigrid carried a sketchbook everywhere. She sold drawings of cityscapes to supplement her tight budget; to fund her education. After speaking with those who knew her, a campus newspaper article eulogized Sigrid as “an expressive soul who never let financial constraints impede her love of life.”\nSigrid’s Final Days\nIn the summer months before her death, Sigrid hitchhiked across the United States and Canada before making her way to NJ for the fall semester. There are some conflicting reports about Sigrid’s living situation at the time of her death. Earlier that summer, Sigrid rented a room from Trenton Stage professor Dr. Alan Lutz. She moved out at the beginning of August.\nAt the time of her death, the campus newspaper, The Signal, reported that Sigrid rented a room from another local professor, Dr. Stanley Austin. This is incorrect, and The Signal later issued a correction. In fact, Dr. Austin was the one who identified Sigrid’s body after she was found. He was a supervisor of graduate music study at the college at the time, and would have known her. It’s still important to note this, however, because it’s been frequently misreported that she was living with the Austin family.\nA third report, which feels important to mention though not much is out there about it, claims that Sigrid was dating a volunteer fireman from Ewing Township, NJ and may have been staying, or planned to stay, with him. Besides quick mentions in early articles about the murder, nothing else is publicly known about this fireman. Of note, Sigrid’s friends said in police interviews at the time of her death that they didn’t think she had a boyfriend and didn’t seem interested in dating.\nBecause Sigrid was well-known to hang around campus—and the theatre specifically—after hours, there was also speculation that Sigrid did not have a permanent home at the time and was sleeping in the theatre while waiting for the campus dorms to open in a few days.\nI personally believe this is the most logical conclusion: that Sigrid was between places to live after her vacation ended, and she was waiting out the last few days before the semester officially started. Money was tight for her, and I could see someone who was already comfortable with hitchhiking across the country choosing to take a chance instead of shelling out for rent, more travel, or a hotel.\nSeptember 4, 1977: The Night of the Murder\nIt was September 4th, the Sunday of Labor Day weekend and very few people were on campus. Earlier in the day—or the previous night, based on a few conflicting reports that I don't feel totally comfortable ruling out—Sigrid attended a performance of a play on campus titled, “J.B.”\nRegardless of when the performance took place, the cast and crew of J.B. were the last ones known to be in the building on the day of Sigrid's death. They departed around noon and locked up behind them. Sigrid remained on campus until she made her way back to Kendall Hall that evening.\nKendall Hall was one of the original buildings on campus, built in 1932 and still used for music and stage productions to this day. It was locked—but not very securely. Sigrid had been known to sneak in at night to play the piano often. She preferred the one on the Kendall Hall stage because it was used less often than the practice pianos available in the music building.\nEvidence suggests that Sigrid was playing the piano in the last moments of her life.\nShortly before midnight, campus police officer Steven Kokotajlo noticed an unattended bicycle chained up outside Kendall Hall while patrolling. The building was locked when he entered to investigate the auditorium.\nSigrid’s body was discovered on stage. She was nude and lying face down, poorly covered with a white canvas dustcover for the nearby piano. Sigrid had been bludgeoned to death with a blunt object. Blood was pooling on stage, and splattered against her sheet music. The damage was so severe, and the scene so bloody, that she could only later be identified by her hair.\nHer jeans were found folded neatly. Some think this could imply she was playing piano in the nude, taking advantage of the freedom afforded by an empty theater in the quietest hours of the night.\nSigrid had not been robbed or sexually assaulted. There was no known motive, no murder weapon, no real evidence—especially since DNA analysis wasn’t what it is today—and no suspects.\nThe Investigation & Response\nWith very little to go on, investigators questioned over 100 people and issued several dozen polygraph tests to students, staff, and at least one member of campus police. A search for a murder weapon took place at the nearby Lake Ceva two weeks after the murder, but nothing turned up. By December, the trail had gone cold enough that investigators sought outside help from psychologists at the University of Pennsylvania, private investigators, and (self-described) “noted psychic” Sidney Porcelian.\nThis also amounted to zero leads.\nOn campus, the response was…minimal. College officials prepared the 1,100 entering class members by providing them with a piece of paper with safety advice such as, “lock your door, even if you will be gone only a few minutes” and “lock your door when sleeping or taking a nap.” The stage in Kendall Hall continued to be used for performances throughout the year, including a concert by The Kinks just two months later.\nFall, winter, and spring came and went. At the end of the academic year, the university memorialized Sigrid with a brief recap of her murder in the 1978 yearbook.\nIt was barely more than 100 words. Her name was misspelled.\nToday, the College of New Jersey has no plaques in remembrance of Sigrid Stevenson on campus; no scholarships in her name; no benches, piano or otherwise, are dedicated in her memory. The story of her death became an urban legend on campus, and Sigrid Stevenson was reduced to a ghost story about phantom piano music used to scare freshmen.\nSigrid’s parents both passed away without learning anything else about who murdered their daughter.\nNo suspect has ever been named in her case.\nThe Main Theories\nObviously, the lack of major suspects, DNA evidence, or a murder weapon makes it difficult to form a solid theory on this case. The TCNJ campus is fairly contained and set apart from the surrounding residential areas. Sigrid also died the Sunday night of Labor Day Weekend—so the campus was much more deserted than just regular ‘end of break’ deserted.\nThere has been some speculation that the campus police officer who discovered the crime scene could have been the perpetrator. This is also what a private investigator and the psychic consultant have implied—but that likely has more to do with a lack of suspects than any credibility on their end.\nThe full cast and crew of the “J.B.” play were questioned extensively, and none were pursued as suspects.\nIf you have any information about what might have happened to Sigrid Stevenson in 1977, please reach out to the Ewing Township Police Department.\nSources\n\nhttps://web.archive.org/web/20210912040712/https://tcnjsignal.net/2011/10/04/grad-student-killed-in-kendall-in-%e2%80%9977-the-unsolved-story/\nhttps://www.nytimes.com/1977/09/07/archives/trenton-state-students-cautioned-after-murder.html\nhttps://weirdnj.com/stories/garden-state-ghosts/murdered-music-major-haunts-college-of-nj-trenton-state/\nhttps://www.nj.com/mercer/2014/09/unsolved_mystery_37-year-old_tcnj_cold_case_intrigues_filmmaker_who_wants_answers.html\nhttps://www.courierpostonline.com/story/opinion/readers/2016/11/09/letter-students-death-should-remembered-better/93477186/\nhttps://www.courierpostonline.com/story/news/local/new-jersey/weird-nj/2016/10/30/weird-nj-murdered-student-haunt-tcnj/92929174/\n", "media": null, "score": 736, "upvote_ratio": 0.98, "comment_count": 114, "over_18": false}, "67": {"id": "16wgtc6", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "ReferenceLong2546", "link_flair_text": null, "time": 1696646170.5291364, "created_utc": 1696105321.0, "url": "https://www.reddit.com/r/MorbidReality/comments/16wgtc6/in_2000_4_yearsold_lauren_key_passed_away_after/", "title": "In 2000 4 years-old Lauren Key passed away after fallen from a cliff, in 2015, it is revelead that her own father, Cameron Brown murdered her to avoid child support.", "permalink": "/r/MorbidReality/comments/16wgtc6/in_2000_4_yearsold_lauren_key_passed_away_after/", "selftext": "​\nhttps://preview.redd.it/mctjndhvbgrb1.png?width=290&format=png&auto=webp&s=e439cb1736d910c1375e3a0e90abd56a92c40ad4", "media": null, "score": 2440, "upvote_ratio": 0.99, "comment_count": 131, "over_18": true}, "68": {"id": "16zw15q", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Gkbuck", "link_flair_text": null, "time": 1696646171.086596, "created_utc": 1696447247.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/16zw15q/weird_beeping_noises_at_night/", "title": "weird beeping noises at night", "permalink": "/r/Thetruthishere/comments/16zw15q/weird_beeping_noises_at_night/", "selftext": "I live in West Los Angeles and last night i was in bed on my phone when i heard a weird beeping sound. I have an electric scooter that i lock to the staircase railing so i thought someone might be trying to steal it so i got up and looked out the kitchen window but no one was there. The beeping persisted -- it would be 2 beeps, then 2 error sounds, then 2 wee woo, repeat. That's the best way i can describe it. When i went outside, it stopped. A few moments later, I heard a doorknob jiggle and as I had been texting my roommate, I stepped out of the kitchen expecting her to come out of her room but she didn't and all doors remained shut. When she finally did come out of her room a few minutes later I asked if she'd opened her door a few minutes before and she said no and that she'd only just gotten up. That's what really freaked me out. So we asked our neighbors downstairs for their ring footage and they said that the footage was missing from 11:30-12:30, the exact time all of this was happening.\nI'm wondering if anyone might have a suggestion in terms of extra safety tips but also, if the sequence of rings might ring a bell with anyone. I know my description is kinda bad, but it's the best I can do.\nbeep example: https://www.youtube.com/watch?v=Xhkg5VS1AYc\nerror example: https://youtu.be/0M3PYZ7fCZ4?si=pmWlthuHyTecZdpy&t=4\nwee wee (lol) example: https://www.youtube.com/watch?v=FWNFxOk-fyY", "media": null, "score": 14, "upvote_ratio": 0.89, "comment_count": 5, "over_18": false}, "69": {"id": "16wdjw5", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "ryes31", "link_flair_text": null, "time": 1696646173.1760633, "created_utc": 1696097205.0, "url": "https://v.redd.it/0y0idyosnfrb1", "title": "Saw this after checking the security camera in our kitchen", "permalink": "/r/Ghosts/comments/16wdjw5/saw_this_after_checking_the_security_camera_in/", "selftext": "We were sitting in the living room and heard a noise, like a magnet falling off of the fridge or something. I walked over and saw the cap was off this bottle of Simply Lemonade, then tried to recreate the noise with it and it sounded the same. Thought maybe the cap was just laying loosely on the bottle and slid off on its own, but then checked the video and saw how it literally just flew off with some force.\nI then assumed ahh maybe it had something to do with built up pressure in the bottle somehow, but then you do see a little flash on the top of the cap right before it flies off. I’m always a skeptic and have never had something happen to me I could explain away, so I’m curious to see what other people might think about it.", "media": {"reddit_video": {"bitrate_kbps": 450, "fallback_url": "https://v.redd.it/0y0idyosnfrb1/DASH_270.mp4?source=fallback", "height": 270, "width": 342, "scrubber_media_url": "https://v.redd.it/0y0idyosnfrb1/DASH_96.mp4", "dash_url": "https://v.redd.it/0y0idyosnfrb1/DASHPlaylist.mpd?a=1699238172%2CNzdkZjBkMmU4ZWM5YzYxZGIxZDMwY2JhZTRjMGQyNzcxYjFmZDg5NjQxNTBmN2RiMGJmYzViYzNhOGY4OWFhZg%3D%3D&v=1&f=sd", "duration": 5, "hls_url": "https://v.redd.it/0y0idyosnfrb1/HLSPlaylist.m3u8?a=1699238172%2CMjYyZDNhNmQ0ZmFiZDFlOGM1NDAxZjU3NjQ4ZjY2ZGYxNTlhMGQwMmZiZTc4YzZiY2JiZDA1NmZjM2YzZjQxMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 286, "upvote_ratio": 0.84, "comment_count": 98, "over_18": false}, "70": {"id": "16ymnzp", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "teorosso", "link_flair_text": "Glitch Pic", "time": 1696646173.45747, "created_utc": 1696323332.0, "url": "https://i.redd.it/obaascb0cyrb1.png", "title": "Third floor loading", "permalink": "/r/GlitchInTheMatrix/comments/16ymnzp/third_floor_loading/", "selftext": "", "media": null, "score": 30, "upvote_ratio": 0.84, "comment_count": 2, "over_18": false}, "71": {"id": "16zc65l", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Nathannyil", "link_flair_text": "art", "time": 1696646174.4714837, "created_utc": 1696389097.0, "url": "https://i.redd.it/7uwmpgxpr3sb1.jpg", "title": "Recent drawing I did for Inktober.", "permalink": "/r/bigfoot/comments/16zc65l/recent_drawing_i_did_for_inktober/", "selftext": "", "media": null, "score": 200, "upvote_ratio": 0.98, "comment_count": 15, "over_18": false}, "72": {"id": "170or53", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "0todus_megalodon", "link_flair_text": "Lost Media and Evidence ", "time": 1696646175.1794317, "created_utc": 1696529026.0, "url": "https://i.redd.it/bmm5rsarbfsb1.jpg", "title": "The long-necked seal (Phoca mutica) was first described in 1681 based on a skin that is now lost", "permalink": "/r/Cryptozoology/comments/170or53/the_longnecked_seal_phoca_mutica_was_first/", "selftext": "", "media": null, "score": 146, "upvote_ratio": 0.99, "comment_count": 24, "over_18": false}, "73": {"id": "16xmqiy", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "SuccessfulAd8810", "link_flair_text": null, "time": 1696646176.4360023, "created_utc": 1696219749.0, "url": "https://www.reddit.com/r/cryptids/comments/16xmqiy/does_anyone_here_remember_lost_tapes_on_animal/", "title": "Does anyone here remember “Lost Tapes” on Animal Planet in like 2009?", "permalink": "/r/cryptids/comments/16xmqiy/does_anyone_here_remember_lost_tapes_on_animal/", "selftext": "I’ve been into cryptids since I was like 9. But I was wondering if anyone actually remembers this show? Cause I used to watch this show all the time (against my parents wishes lol) and the only episode that actually scared the living shit outta me was the Dover Demon. Anyway, just curious if anyone remembers this show?", "media": null, "score": 57, "upvote_ratio": 0.96, "comment_count": 20, "over_18": false}, "74": {"id": "16zkzju", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "PepeLives00", "link_flair_text": null, "time": 1696646177.6767304, "created_utc": 1696419864.0, "url": "https://i.imgur.com/Uwc7IOx.jpg", "title": "It’s Simple", "permalink": "/r/conspiracy/comments/16zkzju/its_simple/", "selftext": "", "media": null, "score": 1520, "upvote_ratio": 0.73, "comment_count": 351, "over_18": false}, "75": {"id": "170pd1c", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1696646178.0943055, "created_utc": 1696530452.0, "url": "https://youtube.com/live/rduvLcVEJVw", "title": "The Lalaurie Mansion vs Lizzie Borden House | What's The Bigger Story?", "permalink": "/r/conspiracyfact/comments/170pd1c/the_lalaurie_mansion_vs_lizzie_borden_house_whats/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 0.67, "comment_count": 1, "over_18": false}, "76": {"id": "16zb4n8", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Nightshade09", "link_flair_text": "Article", "time": 1696646179.6563406, "created_utc": 1696386212.0, "url": "https://anomalien.com/pentagons-religious-beliefs-halted-alien-research-claims-ufo-researcher/", "title": "Pentagon’s religious beliefs halted alien research, claims UFO researcher", "permalink": "/r/ufo/comments/16zb4n8/pentagons_religious_beliefs_halted_alien_research/", "selftext": "", "media": null, "score": 502, "upvote_ratio": 0.94, "comment_count": 188, "over_18": false}, "77": {"id": "16yuzxj", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "quetzalcosiris", "link_flair_text": "Article", "time": 1696646181.1474571, "created_utc": 1696347084.0, "url": "https://www.thesun.co.uk/tv/24248691/netflix-viewers-convinced-aliens-real-encounters/", "title": "Netflix viewers 'convinced aliens are real' after binging new UFO doc Encounters", "permalink": "/r/UFOs/comments/16yuzxj/netflix_viewers_convinced_aliens_are_real_after/", "selftext": "", "media": null, "score": 2627, "upvote_ratio": 0.85, "comment_count": 698, "over_18": false}, "78": {"id": "16zvgkf", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "quetzalcosiris", "link_flair_text": "News :illuminati:", "time": 1696646182.7196977, "created_utc": 1696445841.0, "url": "https://www.newsweek.com/extraterrestrial-video-footage-can-earn-you-1million-ring-1832138", "title": "Video doorbell company Ring offers $1,000,000 grand prize for capturing unaltered video evidence of a real extraterrestrial lifeform using their Ring device - Newsweek", "permalink": "/r/aliens/comments/16zvgkf/video_doorbell_company_ring_offers_1000000_grand/", "selftext": "", "media": null, "score": 1915, "upvote_ratio": 0.96, "comment_count": 86, "over_18": false}, "79": {"id": "16yqz6x", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "toolsforconviviality", "link_flair_text": "AMA", "time": 1696646183.2829995, "created_utc": 1696337152.0, "url": "https://www.reddit.com/r/UAP/comments/16yqz6x/ryan_graves_ama_tonight_8om_est_youtube/", "title": "Ryan Graves AMA Tonight (8om EST, YouTube)", "permalink": "/r/UAP/comments/16yqz6x/ryan_graves_ama_tonight_8om_est_youtube/", "selftext": "Via The Merged email distribution list:\n/// AMA WITH RYAN GRAVES\nRyan Graves will be LIVE tomorrow night (October 3rd) at 8pm EST on YouTube doing an Ask Me Anything episode (AMA).\nBe sure to tune in and join us.\nhttps://mergedpodcast.us21.list-manage.com/track/click?u=a74fd6c08471116181c431ec3&id=24e61ccb7c&e=4788e16506", "media": null, "score": 63, "upvote_ratio": 0.96, "comment_count": 4, "over_18": false}, "80": {"id": "16w9hta", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "Speckled_Milk", "link_flair_text": "Murder", "time": 1696646183.8788514, "created_utc": 1696087035.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16w9hta/mother_and_son_found_strangled_with_rope_at_their/", "title": "Mother and son found strangled with rope at their home in Omaha, Nebraska | 1979 UNSOLVED", "permalink": "/r/UnresolvedMysteries/comments/16w9hta/mother_and_son_found_strangled_with_rope_at_their/", "selftext": "On April 24th, 1979, near Omaha, Nebraska, a woman named Pinkey Foster was worried about her adult daughter Deroshia after not hearing from her all day. Deroshia was 26 years old and a single mom to her 7-year-old son, Kamal.\nDeroshia and Kamal lived in a small, 1-½-story house in the Clifton Hills neighborhood, 10 minutes outside of downtown Omaha.\nWhen Pinkey hadn’t heard from her daughter all day Monday, she and three others decided to go over to Deroshia’s house on Tuesday and check on them.They stopped by Deroshia’s neighbor’s house to borrow her spare key and let themselves in the front door.\nWhat Pinkey and the others discovered was a nightmare. On his bedroom floor was 7-year-old  Kamal, dead, still wearing his pajamas, apparently strangled with a rope around his neck.\nThey left the scene and immediately called police.\nWhen police searched the Matthews home, they also found the deceased body of 26-year-old Deroshia, partially clothed, suffocated and strangled on a water bed in the basement. Just like her son, Deroshia still had a rope around her neck.\nAccording to an article published in The Lincoln Star newspaper the following day, the Matthews home was “ransacked” but there “didn’t appear to be a violent struggle”. Drawers were pulled out and papers were all over the place.\nAccording to Homicide Lieutenant Foster Burchard, the last known contact with Deroshia was her mother Pinkey, who spoke with her on the phone “early on Monday” but Kamal never made it to school that day and he didn’t do his normal paper route Monday evening.\nIt’s uncertain whether or not the front door to the Matthews home was actually locked when Pinkey arrived Tuesday morning and discovered the crime scene, but the back door was locked and bolted from the inside. \nThe other people that accompanied Pinkey to the crime scene were Deroshia’s cousin (Velma Strong), Velma’s husband J.C.,and a Mrs. Martin, one of Deroshia’s former coworkers and friends.\nAccording to Deroshia’s friend and former coworker, Mrs. Martin, the living room was “all torn up”, the front window was “up”, and the tv was still playing.\nDeroshia had been unemployed since February after resigning from her job as a classroom aide and crossing guard for the nearby school.\nKamal’s biological father lived in California and his parents were never married.\nAccording to an article in the Lincoln Journal Star newspaper from January 2004, a man named Louis M. Walker, also known as Abdul Malik Husain, was arrested in connection to the murders, based on a tip placed in 2003. Louis would have been about 21 years old at the time of the murders. But there have been no new updates since Walker’s arrest and the case remains cold.\nIf you have any information regarding Deroshia and Kamal’s case, please contact Omaha Police 402-444-5656\nhttps://police.cityofomaha.org/cold-case-details?cid=37&caseTitle=Deroshia+Matthews+%2F+Kamal+Matthews", "media": null, "score": 664, "upvote_ratio": 0.98, "comment_count": 79, "over_18": false}, "81": {"id": "170lzzw", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "PlantZenGuy", "link_flair_text": null, "time": 1696646184.5353105, "created_utc": 1696522465.0, "url": "https://lawandcrime.com/crime/i-saw-my-children-but-i-didnt-feel-them-father-recounts-horrifying-moments-he-realized-his-entire-family-had-been-killed-by-estranged-wife-in-double-murder-suicide/", "title": "‘I saw my children but I didn’t feel them’: Father recounts horrifying moments he realized his entire family had been killed by estranged wife in double murder-suicide.", "permalink": "/r/MorbidReality/comments/170lzzw/i_saw_my_children_but_i_didnt_feel_them_father/", "selftext": "", "media": null, "score": 2283, "upvote_ratio": 0.98, "comment_count": 174, "over_18": true}, "82": {"id": "16y4qdb", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Nuna11y", "link_flair_text": null, "time": 1696646187.285054, "created_utc": 1696272366.0, "url": "https://www.reddit.com/r/Ghosts/comments/16y4qdb/modern_phones_nowadays_have_great_cameras_so/", "title": "Modern phones nowadays have great cameras so shouldn't the quality of these supposed ghost videos be of good quality? I mean 2023 is so much different from 2000 and why is it that these ghosts seem to always peek at corners or disappear at a glance?", "permalink": "/r/Ghosts/comments/16y4qdb/modern_phones_nowadays_have_great_cameras_so/", "selftext": "", "media": null, "score": 158, "upvote_ratio": 0.92, "comment_count": 83, "over_18": false}, "83": {"id": "170l0ap", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "piirtoeri", "link_flair_text": "Glitch Vid", "time": 1696646187.6017697, "created_utc": 1696520012.0, "url": "https://v.redd.it/cxb5gturkesb1", "title": "I think this chipmunk broke from the chirps", "permalink": "/r/GlitchInTheMatrix/comments/170l0ap/i_think_this_chipmunk_broke_from_the_chirps/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/cxb5gturkesb1/DASH_1080.mp4?source=fallback", "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/cxb5gturkesb1/DASH_96.mp4", "dash_url": "https://v.redd.it/cxb5gturkesb1/DASHPlaylist.mpd?a=1699238187%2CYmY0YzJmMzE0M2VhNDFiOGEzMzFiMDNkZTUyYWRhMzJjNDNjMDhjYjc4YjQyMzg2NGU1ZDM0OTMwMDc1ODM3OA%3D%3D&v=1&f=sd", "duration": 45, "hls_url": "https://v.redd.it/cxb5gturkesb1/HLSPlaylist.m3u8?a=1699238187%2CNTZhZWYwYmZlMTBkYTdkMWQ0ZDYxNjQ3NGY2M2U0ZTkxYTliMDY5ZWNhMjk3M2M1NzY0ZWYxYWQ1YTQ1Mzg1ZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 22, "upvote_ratio": 0.79, "comment_count": 4, "over_18": false}, "84": {"id": "16wvyh9", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "WeirdMushroom1399", "link_flair_text": "sierra sounds", "time": 1696646188.6752963, "created_utc": 1696150022.0, "url": "https://www.reddit.com/r/bigfoot/comments/16wvyh9/the_sierra_sounds_translated_to_english/", "title": "The Sierra Sounds Translated to English", "permalink": "/r/bigfoot/comments/16wvyh9/the_sierra_sounds_translated_to_english/", "selftext": "Hey everyone, first time poster and I will say I'm not sold Bigfoot is real. But as an avid outdoorsman I do find the topic fascinating true or not I find the unknown and unusual to be a fun rabbit hole to explore.\nSpecifically, I've always been curious about the Sierra Sounds. They seem authentic, vocally odd and worth exploring. So I spent the past few hours inputting all of Scott Nelson's linguistics research and data into ChatGPT4. You can find that information here: https://www.nabigfootsearch.com/Bigfootlanguage.html\nChatGPT was prompted with full context of the sierra sounds hunters, locations, the scenario, time and given the assumption that these two creatures communicating were in fact Bigfoot. I also asked for data and other observations from the recordings.\nPS- If this violates the rules mods feel free to remove it.\nHere's what ChatGPT's AI came up with:\n0:4.5 (W) (W) - [Alerting others, drawing attention]\n0:8.62 (W) (W) (W) - [Acknowledging alert, readiness signal]\n0:15.11 RAM HO BÄ RÜ KHÄ HÜ - [\"Humans spotted below.\"]\n0:16.70 WAM VO HÜ KHÖ KHU′ - [\"Should we approach or observe?\"]\n0:17.52 NÖ U PLÄ MEN TI KHU - [\"No. Stay hidden, observe silently.\"]\n0:18.82 NÄR LÄ - [\"They seem unaware of us.\"]\n0:20.21 NA GÖ KÜ STEP GÄ KÜ BLEM - [\"They have some objects with them.\"]\n0:21.25 Ü KÜ DZJÄ - [\"Stay low and hidden.\"]\n0:21.76 FRrÄP E KHÜK LE - [\"Let’s not alarm them, stay quiet.\"]\n0:22.65 ÜN Ï KÜ O GÜ AKH (int) - [\"What are they doing with those objects?\"]\n0:23.85 DÖ WÄÏ NÖ (dr) - [\"Unsure. Just watch for now.\"]\n0:24.52 MÜ Ï FWI KÖ PÏ KHU′ SJ? - [\"Any idea how long they'll stay?\"]\n0:31.43 (ma) HU Ö NÖ> KHÄ HÜ - [\"Cannot tell. Just be patient and observe.\"]\n0:32.95 PLEN DÜTSJ TISJ - [\"Let’s remain quiet and observe.\"]\n0:33.61 SÏ DZJAÖ GLÖ PÜ MËKH - [\"They are talking amongst themselves.\"]\n0:34.90 PÄ KHÏ KÖ DÜ TÜ SEKSÏ - [\"We should avoid being seen.\"]\n0:35.88 WA HEP DÜ TSJE DÜ FU HEP - [\"They are acting cautiously.\"]\n0:36.95 (ma) FI KÜ ÄÏ> KHÜ′ - [\"Let’s wait until they are resting.\"]\n0:44.80 FÄ LIP ÄBÄSJ KHU′ - [\"Move without making sounds.\"]\n0:45.03 NE VER GÖ ? ÖM KHU′ - [\"Do you think they will stay overnight?\"]\n0:47.03 FÖ WÄ Ï> - [\"Signal if you notice any changes.\"]\n0:48.08 WA KHU? KVÄM - [\"Is it safe to move closer?\"]\n0:49.16 ITS KÄÏM VÄR US FO RI ZIS TENS - [\"They seem to be settling for the night.\"]\n0:51.27 MÖ> FER BÏ KEN JÄ Ä VÄÖN SÏ RYK MI RO GHAP – GÏ GO WYP - [\"We'll decide the next action based on their movement.\"]\n0:53.66 MÏ WÄTSJ FYD PLËN FYD NÜ AÖ> KHE KHU′ - [\"Wait till they sleep, then we decide.\"]\n0:55.34 NÖ ÄÏ ÄKHSJ HÜ - [\"We will retreat once they are settled.\"]\n0:57.13 (h) Come on, boy. - [Human communication: Calling someone over.]\n0:58.04 (h) Come on, let’s eat. - [Human communication: Suggesting to eat.]\n1:00.93 BÏ KAER FYL NAÖ PRÖS GYD - [\"They are eating something.\"]\n1:01.87 NÖÄ Ö JA LET KHE - [\"Keep watching, observe their habits.\"]\n1:02.99 MÖÏ PISJ FE KHE KHU′ - [\"Stay alert, don’t make any sound.\"]\n1:11.58 KHU BEK - [\"They are relaxing.\"]\n1:12.63 KHËÄ KHU′ - [\"We should remain silent and hidden.\"]\n1:13.77 Ä LÄF - [\"Patience.\"]\n1:14.46 MÖ VE KHÜ - [\"We continue observing.\"]\n1:14.86 LAF KHU′ - [\"Let’s not interact.\"]\n1:15.35 NÖ KHÏÄ - [\"Just wait and watch.\"]\n1:16.01 KHÖ VË ÄER ZÏ RÄ KIL WÄ KÜ ′ÜSJ - [\"We should leave without being detected.\"]\n1:17.49 BÜ GÄ TÄÏSJ KHU′ - [\"Quietly retreat, ensuring we are not detected.]\nObjective Observations from Transcript:\nRepeated Morphemes: “KHU′” and “HÜ” are repeated often.\nVaried Pitch & Tone: There seems to be variation in pitch and tone, possibly indicating questions, statements, or exclamations.\nImmediate Responses: Some responses are immediate, suggesting an interactive conversation.\nConclusion:\nThe transcript resembles a form of communication that is more complex than typical primate vocalizations but doesn't exhibit the full complexity and structure of human language. It suggests a kind of communication that might be more advanced than what is observed in known non-human primates but not as advanced or structured as human language.\nAnyhow I had fun and hope you did too.", "media": null, "score": 167, "upvote_ratio": 0.88, "comment_count": 58, "over_18": false}, "85": {"id": "16ybpna", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "justa-human", "link_flair_text": null, "time": 1696646189.6191196, "created_utc": 1696288290.0, "url": "https://www.reddit.com/gallery/16ybpna", "title": "How did the canines with mange even be apart of the chupacabra myth?", "permalink": "/r/Cryptozoology/comments/16ybpna/how_did_the_canines_with_mange_even_be_apart_of/", "selftext": "Also where tf did the wings come from?", "media": null, "score": 139, "upvote_ratio": 0.88, "comment_count": 48, "over_18": false}, "86": {"id": "170ltd4", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "RevSquatchFultz", "link_flair_text": null, "time": 1696646190.9780276, "created_utc": 1696522020.0, "url": "https://v.redd.it/25h58aze4zrb1", "title": "Is Bigfoot an interdimensional being?", "permalink": "/r/cryptids/comments/170ltd4/is_bigfoot_an_interdimensional_being/", "selftext": "", "media": null, "score": 54, "upvote_ratio": 0.73, "comment_count": 67, "over_18": false}}}