{"_default": {"1": {"id": "1i5vtn5", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Admirable-Carry4069", "link_flair_text": null, "time": 1737773505.8051767, "created_utc": 1737394607.0, "url": "https://www.reddit.com/r/ufo/comments/1i5vtn5/trump_has_no_plan_to_disclose_shit/", "title": "Trump has no plan to disclose shit", "permalink": "/r/ufo/comments/1i5vtn5/trump_has_no_plan_to_disclose_shit/", "selftext": "He just said we're going to drill drill drill for gasoline and make more cars.  I'm done. Going to go drink myself to oblivion.", "media": null, "score": 1884, "upvote_ratio": 0.85, "comment_count": 787, "over_18": false}, "2": {"id": "1i8g3i7", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "CreditCardOnly", "link_flair_text": "Disclosure", "time": 1737773506.9612863, "created_utc": 1737671597.0, "url": "https://i.redd.it/i64bg7ysltee1.jpeg", "title": "Senator Chuck Schumer responds to President Trump’s JFK executive order: “Now do UFOs.”", "permalink": "/r/UFOs/comments/1i8g3i7/senator_chuck_schumer_responds_to_president/", "selftext": "", "media": null, "score": 14061, "upvote_ratio": 0.89, "comment_count": 1075, "over_18": false}, "3": {"id": "1i7qsik", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Rybofy", "link_flair_text": "Video", "time": 1737773508.1171863, "created_utc": 1737592546.0, "url": "https://v.redd.it/jzv78wuq2nee1", "title": "New UFO documentary coming soon called, ‘The Age of Disclosure’.", "permalink": "/r/aliens/comments/1i7qsik/new_ufo_documentary_coming_soon_called_the_age_of/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/jzv78wuq2nee1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 474, "width": 854, "scrubber_media_url": "https://v.redd.it/jzv78wuq2nee1/DASH_96.mp4", "dash_url": "https://v.redd.it/jzv78wuq2nee1/DASHPlaylist.mpd?a=1740365507%2CZTUxMzU2NTdjNDRiMTVhMDQ5YjZiMTk5ZTNiYjI0NzhhMzk3MjEwMDI4ZjA0M2RjZDU2ZTEzYTc4YTY3ZDQ3OQ%3D%3D&v=1&f=sd", "duration": 164, "hls_url": "https://v.redd.it/jzv78wuq2nee1/HLSPlaylist.m3u8?a=1740365507%2COTg0ZTY3MzkyODA3NjAzOThhN2ZiMmRjMDNiZTU5ZDY0NDA0OGY0ZTcwNWFiNzBiMzQzOTQyOTIxYTJjYzA4OA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3975, "upvote_ratio": 0.88, "comment_count": 530, "over_18": false}, "4": {"id": "1i7o0fp", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Documentary", "time": 1737773509.2884378, "created_utc": 1737585109.0, "url": "https://v.redd.it/rd1iui72emee1", "title": "Trailer for a new UAP documentary coming soon: \"The Age of Disclosure\" (Ft. Dr. Eric Davis, Col. Karl Nell, Fmr CIA Officer Jim Semivan, Dr. Hal Puthoff, Fmr DNI James Clapper Jr., ret. Rear Admiral Tim Gallaudet, Jay Stratton, Lue Elizondo, Sen. Mike Rounds, Sec of State Marco Rubio, and much more)", "permalink": "/r/UAP/comments/1i7o0fp/trailer_for_a_new_uap_documentary_coming_soon_the/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/rd1iui72emee1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 640, "scrubber_media_url": "https://v.redd.it/rd1iui72emee1/DASH_96.mp4", "dash_url": "https://v.redd.it/rd1iui72emee1/DASHPlaylist.mpd?a=1740365508%2CM2NiZmMzNzM5NGQzOTBhMDViMDQwMzgzZjQzZjMzOGIwYWY4YTU2ZjFmZWM3ZDBlYTc3NzQ5MjIwYjlmYWQyMA%3D%3D&v=1&f=sd", "duration": 167, "hls_url": "https://v.redd.it/rd1iui72emee1/HLSPlaylist.m3u8?a=1740365508%2CZjY0YTQ0ZmExNmIyMWFhNTBhNjkyZjM5YjY3OTIzMWVhNDRmMzBlMmVkMGY3ODI0NjdlODVmYjBjNzUwOGEzMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 582, "upvote_ratio": 0.96, "comment_count": 57, "over_18": false}, "5": {"id": "1i62nks", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "kingrobin", "link_flair_text": null, "time": 1737773510.2714622, "created_utc": 1737411045.0, "url": "https://i.redd.it/c4e6m7t138ee1.jpeg", "title": "Anyone else feeling a bit unnerved that these were the guys sitting up front at the inauguration with the president's family, in front of the actual govt?", "permalink": "/r/conspiracy/comments/1i62nks/anyone_else_feeling_a_bit_unnerved_that_these/", "selftext": "Seems there's some foreshadowing here.", "media": null, "score": 5167, "upvote_ratio": 0.93, "comment_count": 801, "over_18": false}, "6": {"id": "1i11ljy", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnthonyofBoston", "link_flair_text": null, "time": 1737773510.411319, "created_utc": 1736843409.0, "url": "/r/holofractal/comments/1i0ui7z/reminder_i_am_the_only_person_that_predicted/", "title": "Reminder: I am the only person that predicted October 7th and also remotely viewed Hamas's massive rocket arsenal days in advance in exact detail.  I have undeniable proof", "permalink": "/r/conspiracyfact/comments/1i11ljy/reminder_i_am_the_only_person_that_predicted/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.38, "comment_count": 4, "over_18": false}, "7": {"id": "1i5gtuz", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "dankness8", "link_flair_text": "book", "time": 1737773510.9569943, "created_utc": 1737343039.0, "url": "https://www.reddit.com/gallery/1i5gtuz", "title": "This should be our community book club book!", "permalink": "/r/bigfoot/comments/1i5gtuz/this_should_be_our_community_book_club_book/", "selftext": "Saw a post where this book is recommended so I bought it. About halfway done! The scary stuff hasn’t happened yet", "media": null, "score": 462, "upvote_ratio": 0.98, "comment_count": 102, "over_18": false}, "8": {"id": "1i7m1q4", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "12ysusamigos", "link_flair_text": null, "time": 1737773511.8973808, "created_utc": 1737580136.0, "url": "https://i.redd.it/y7mqbiek1mee1.jpeg", "title": "comparisons with a basking shark and the Zuiyo-Maru Creature", "permalink": "/r/Cryptozoology/comments/1i7m1q4/comparisons_with_a_basking_shark_and_the/", "selftext": "", "media": null, "score": 664, "upvote_ratio": 0.97, "comment_count": 59, "over_18": false}, "9": {"id": "1i60zhj", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Johanharry74", "link_flair_text": "U.F.O. Humanoid", "time": 1737773512.0387464, "created_utc": 1737406931.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1i60zhj/otherworldly_close_encounters_along_the_roads_in/", "title": "Otherworldly close encounters along the roads in Finland. Part 2", "permalink": "/r/Humanoidencounters/comments/1i60zhj/otherworldly_close_encounters_along_the_roads_in/", "selftext": "Let us continue with the second part of more finnish road side mysteries...\nA hitchhiker not of this world.\nBetween Puolanka and Oulu, Northen Finland, August 1962.\nMany people around the world have reported strange and otherwordly people along the roads. Some of them have even been stopping cars and asking for a ride. This is such a report from Finland and it happened to two young men in the early 60’s.\nIlmari Karunto was a man from Helsinki who was having a road trip vacation in Northern Finland together with a friend. It was a warm, sunny day in August, and after a stop to take a swim in a lake, the two friends decided to drive from Puolanka to Oulu. When they had been driving some 50 km (31 miles) from Puolanka, Karunto, who sat beside the driver, noticed a short man, at the side of the road. He had dark loose-fitting clothes and on his head he had something that looked like a dark brown beret and on his feet was white boots. With his hands up he signaled the men to stop and asked for a ride to a forest trail 5 km (3 miles) away. Karunto moved to the back seat and they began to drive.\nThe two men stopped to pick up a strange looking hitchhiker...\nIn the back seat Karunto started to wonder about the appearance of the strange man they picked up. His head was larger than usual, mouth broad and thin and nose quite big. His skin had a slightly greyish tone and the eyes were black and round. And when he happened to watch the man’s eyes from the side mirror of the car, he saw to his astonishment that the man’s eyelids closed from down to up. The man seemed to notice Ilmari’s observation and put sunglasses on, and Karunto now saw that he had six, thin, grey-brown fingers. Karunto’s friend did not seem to notice anything unusual about the stranger, but Karunto was now a little upset and asked where in Finland the man was living. This question seemed to make him thoughtfull, but then Karunto heard, like in his brain, that the stranger was not from Finland, but travelled around the world. Almost at once after this the trail came to sight and the man stepped out, thanked once again politely and began to walk along the forest trail. Karunto suggested to his friend that they should follow the mysterious man for a short moment.\nWhen the man had walked some 50 meters (55 yards) he came to a pile of brushwood some 3 meters (10 feet) high – and jumped on top of it and ”walked”over it. ”Look, he can levitate!”, said Karunto in awe to his friend, but they spoke yet nothing of the observation during the following car trip. Both men were very disturbed over what had just happened, but they decided to continue their journey.\nA metallic saucer shaped thing passed right above their heads.\nAfter a while they heard a humming noise, which became louder. Suddenly the car's engine started to cough, then stopped altogether. When they stepped outside, they saw a large round disc shaped object, perhaps 6 meters (20 feet) in diameter, fly low over their car at 5 - 6 meters (17-20 feet), make a wide turn and then disappear from sight. When they had recovered from the shock of this sighting, they tried to turn on the ignition of their car again and it started without problem. They continued their road trip and the next day they saw a small article in a local newspaper about a light phenomenon that people had seen flying northwards.\nSource: Tapani Kuningas - Ufoja suomen taivaalla (\"UFO:s over finnish skies\")\nThe mysterious hitchhiker.\nEvijärvi, western Finland, October or November 1968.\nHelge Lindroos is a Finnish E.T. contactee and experiencer. He has been involved in several UFO sightings and encounters with aliens over the years. This is a peculiar story that happened to him when he was traveling in his car through Finland in the fall of '68 and it is another finnish story about a mysterious hitchhiker.\nHelge was going to drive down to Helsinki in southern Finland from Haapajärvi and on the way there he passed through the community of Evijärvi. (anecdote: many places in Finland have \"järvi\" in their names and it means \"lake\"). It was about 11 pm when he passed the village, and soon after he saw a man standing at the side of the road, and he seemed to be a completely ordinary person. However, he was quite short (170 cm/ 5.6 feet), but had a normal build and was properly dressed. Helge felt and urge to help and stopped the car and the man just jumped in without a word.\nAlmost as soon as they started driving, Helge Lindroos felt wierd electric vibrations through his body. The hitchhiker did not talk much and the only thing he said was: ”ILLAX!”, and he said it out loud. This was a word Helge did not understand or what it meant. But after a while the stranger then told him that he was not from this planet, but came from outer space, and he had been visiting Mars and had then landed on Earth only a short time before. He said that there were thousands like him on Earth, but that they did not reveal themselves to all humans, since some people “are still afraid of aliens.” Helge felt a little uncomfortable now, but the mysterious man told him to relax and assured him that he meant no harm. The man then explained that they were only here to protect humanity from destruction by ourselves.\nThe mysterious hitchhiker didnt say much except the strange word \\\"ILLAX!\\\".\nAt some unspecified point during the journey, the stranger asked Helge to stop the car. He parked at a rest area and the hitchhiker got out. Lindroos removed the car key and was going to get something to eat, since he got some sandwiches and a thermos of coffee in the trunk. When he stepped out of the car he saw that the stranger had vanished. Helge could see in every direction for 50 meters (55 yards) in the desolate rest area and beyond that was forest. But the hitchhiker was nowhere in sight, and the fastest sprinter in the world could not have covered the distance in just a few seconds. Helge felt very uneasy over the whole situation, and for several weeks after this encounter, he still often felt electric vibrations throughout his body and he was not himself. Helge Lindroos had a sensation that the mysterious man would one day return to meet him…\nSource: Tapani Kuningas and Ilkka Serra\nThe craft on the snowy road.\nTimovaara, eastern Finland, December 27 1973.\nOlavi Kolehmainen from Polvijärvi was doing the night shift and was plowing the Timovaara road from snow. It was a small gravel road through the Karelian forest. When he came close to the Lipasvaara crossing at little over three o´clock in the morning, he noticed a strange steel-grey object about 4 meters wide (13 feet), which was standing on the road. The object was not emitting any light. Kolehmainen stopped his truck at a distance of 40 to 50 meters (44 - 55 Yards) and looked around to get some hint of what it was.\nA metallic craft landed on the snowy road right in front of the man and his snow plow truck. (credit to Jim Lawrence for adding the truck)\nAfter about a minute a hatch opened on the side of the object and against the bright light inside the object he could see first one, then two white clad, human like figures who were looking out from the opening. Kolehmainen realised this was no ordinary vehicle, and began to fear he would be abducted, as he had read in the stories, so he closed the truck’s door and waited in the cabin with a knife in his hand. (As the Timovaara road is very narrow he could not turn his truck round and escape.)\nTimovaara Road is a small gravel route through a vast birch and pine forest. (source: Google Maps)\nHowewer, after some ten to fifteen seconds of mutual staring from him and the beings, the hatch was closed and a wining or buzzing sound could be heard. The sound became louder and some kind of smoke came from the object, after which it started to rise. The ascend continued and it vanished up on the sky towards the north. Kolehmainen listened to the object’s distancing sound for a minute and then he stepped down onto the ground and went up to the place where the object had been. Three landing marks could be seen on the snow.\nSources: Illkka Serra, David Webb, Albert Rosales\nAlien ”cops” stop the car.\nBetween Ylistaro and Lapua, western Finland, October 2 1980.\nThe time was 11:23 at night and a 23-year old man was driving from Vaasa towards Lapua on road 64, in order to have a late meal with friends at a local well known grill bar. When he was at the outskirts of Lapua near a small hill, he saw a bright light coming from the sky. It came closer to his position and suddenly the surroundings was lighten up and a glowing, disc-shaped, solid, object descended 10 meters (33 feet) in front of his car. The witness could not remember if he himself stopped the car or if somehow the object did it. The contours of the object were quite clear, it was a craft of some sort, and it somehow glowed and was appearing to be very hot. The craft was as broad as the road, about 6 meters (19.7 feet) and it had two white lights, one on each end of the hull, but no other details could be seen.\nThree beings from the glowing craft apporoached the witness car on the left side.\nThe craft hovered about half a meter (1.6 feet) obove the road surface, when suddenly two lights became visible in the middle of the object and three beings stepped out. The witness described them as quite human-like, but a little smaller and shorter. He did not see any ears or hair, but the eyes were very small. The humanoids walked towards him and came up to the left side door of the car - and that was all the witness could recall of the event. The next thing he remembered was that he was driving his car into the parking lot of the grill bar, but it was already closed as four hours had passed and it was now in the middle of the night. It was not very far to the grill bar and it should not have taken four hours to drive there. What happened during the missing time the witness had no memory of.\nSource: Mervi Virtanen\nAbducted by Tall Whites(?) and Greys.\nLempäälä, south west Finland, spring 1992.\nIt was a spring evening in 1992 and 18-year-old Sami Taustila from Nokia was driving on the highway through Lempäälä. He was driving from Tampere and there were very few cars on the road this evening. Suddenly he noticed two red orbs of light over a railway bridge crossing the road. Soon the two orbs were joined by two more and then they were four and they flew in a diamond-shaped formation a little bit in front of him. Sami estimated the globes to be 2 meters (6.5 feet) in diameter and they hovered at a height of approximately 20 meters (65 feet) above the ground. Then he saw that on both sides of his car were several groups of light globes, 4 red orbs in each group. Sami was obviously worried, but continued to drive. After a while the globes moved to the side of his car and flew right next to it. Sami stopped his car on the highway, but did not get out of it. That's when it happened, and he saw a blue light inside the car:\n\"I don't know how it happened, but I was somehow moved outside of the car. Maybe it was done through the side window of the car? But after that there are no memories.” Sami Taustila told a newspaper reporter who interviewed him.\nWhen Sami got near the railway bridge he looked up and saw two red glowing orbs in the sky ahead. (source: YLE)\nWhen Sami woke up again, he was in his car on the highway. Almost 24 hours had passed and he had no idea what had happened during all this time. What happened during the lost hours, Sami would then find out through hypnosis 30 years later:\nWhen Sami regained consciousness, he noticed that he was inside what appeared to be a craft. He looked around and realized he was in some sort of cockpit. But he was not alone. In front of him he saw dark shapes. His blurred vision now improved and he could see a humanoid woman in front of him. She was around 2 meters (6.5 feet) tall. She had milky white skin, long white hair and a beautiful, friendly smile. Sami noticed that she was communicating with him telepathically, for no spoken language from the mouth was used. She explains that he should not be afraid and that they come from what we humans call \"the Pleiades\" (the group of stars is also called \"the seven sisters\" and is located in the Taurus constellation 440 light years away from Earth). On a raised platform, Simo could also see three shorter gray beings with large heads and dark almond-shaped eyes. There was a lot of advanced technology and displays on the ship that Simo didn't understand.\nSoon Simo felt the craft was beginning to descend and he could see a large unknown city below him. Now two other beings approached him. These two seemed to be humans like himself. “Welcome home!” they said. It seemed like they knew him or knew who he was, but Simo didn’t recognize these people.\nThe Tall Greys showed Sami a lot of \\\"cool stuff\\\" as he phrased it himself during an interview.\nSoon the ship arrived at a hangar in a large building and there Simo met more tall, white humanoids. Again he was assured not to be afraid and that they would not harm him. Simo was put in front of a display and they showed a lot of \"cool stuff\" in his own words. The colors on the screens were very strong and impressive. The beings then told Simo that now he must decide if he wanted to return to Earth. The other option was for the beings to take him to their home planet. The humanoids said he was one of them (?!). Simo felt a warmth and belonging from them and felt that he enjoyed being there with them, but said that he had to go home and could not leave his family on earth. Soon after this, Simo lost consciousness again, and when he woke up again, he was sitting in his car, which was on the side of the road in Lämpääla. He continued his journey to Nokia and arrived to his home and his worried parents many hours later.\nSimo Taustila had thus lost a day without him knowing what had happened during all those hours. This is a phenomenon we have seen so many times before. This is a typical and classic \"Missing time\" event. And like similar cases, exciting details emerged during hypnosis. Simo has never been particularly interested in UFOs and similar paranormal phenomena and he seems to be a person with both feet on the ground. Of course, it is not out of the question that he made it all up, but he seems to be an honest person and not one to make up stories...\nSources: TV-show from YLE: ”Ufotutkijat” (UFO-investigators), Newspaper ”Helsingin Uutiset”.\nSami is pointing out the place where he saw the orbs more than 30 years ago, to an investigator from Finnish TV. (source: YLE)\nThe Mantis-being in the window.\nSouthern Finland, November 2016 and September 2017.\nThis report came from a witness who had two strange sightings within a year. This happened while he was driving around on smaller lonely country roads in southern Finland.\nCase 1:\nIt was an evening in November 2016 and the man was on his way to Mäntsälä. On the way there, he drove on the country road through the quiet community of Ohkolantie. Shortly after he had passed the village, he suddenly saw in the glow of the car's headlights a strange creature crossing the road in front of him. It was grey, and with a long narrow head, large eyes and long, slender legs. It ran very quickly across the road on four legs. The man was sure it was not an animal and it was like no creature he had seen before. Later he found a picture of a cryptid online that he thought was similar. When he mentioned this to his friends, it was one of them who had also seen a similar looking creature once, when he was out driving.\nWhat kind of creature did the man see that was running across the road? Was it something otherwordly, a unknown cryptid or just a bear or wolf with Mange disease? (Bear with Mange on photo)\nCase 2:\nThe man was out driving again. It was at dawn one morning in September 2017 and he was driving on the old country road from Jokela towards Nurmijärvi. On this stretch there was an old, abandoned house that stood right next to the road. The man often drove this road and almost always slowed down a little to look at the derelict house, and he often wondered who lived there once upon a time.\nThis morning the sun's rays were reflected in the window of the deserted, old house. And that's when he saw something that really scared him. Downstairs, he saw a pale gray, human-sized creature with a triangular head and enormous eyes peering out of one of the windows. As he looked at the creature, he felt its gaze bore into his mind. It was difficult to explain how it was experienced, according to the man. He sped away from the scene. The man did not dare to drive on this road for a long time afterwards. But after a while he dared to pass the old house again, and he never saw the creature more after this. According to UFO investigators, UFO phenomena had also been reported in the area around Nurmijärvi during the same time.\nAn otherwordly Mantis-like creature was seen in one of the windows of the old, derelict house as the witness passed by in his car.\nThese are two cases that make you wonder a little. What did the man actually see? Could it be that it was only animals he saw, but in the poor light and with a little vivid imagination, it turned out to be horrible creatures instead? Did someone make a prank and put a doll in the window? We don't know, and according to the man, he was sure that these were not ordinary animals or dolls that he saw.\nSource: Fufora", "media": null, "score": 36, "upvote_ratio": 0.94, "comment_count": 9, "over_18": false}, "10": {"id": "1i7056w", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Gxnjitsu", "link_flair_text": "Question", "time": 1737773512.361703, "created_utc": 1737511902.0, "url": "https://i.redd.it/7t2eyoayegee1.jpeg", "title": "Caught this on backdoor cam", "permalink": "/r/cryptids/comments/1i7056w/caught_this_on_backdoor_cam/", "selftext": "Hey everyone! Was looking through my backdoor camera photos while I was away on vacation, and found this thing in only a single shutter fram, I may be able to get all of the frames if you all wanna see as well. What could this even be? I'm in upper Washington if that helps", "media": null, "score": 1422, "upvote_ratio": 0.88, "comment_count": 345, "over_18": false}, "11": {"id": "1i5b021", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "dewey70", "link_flair_text": null, "time": 1737773512.5421643, "created_utc": 1737325655.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1i5b021/did_someone_just_pass_through_me/", "title": "Did Someone Just Pass Through Me??", "permalink": "/r/Thetruthishere/comments/1i5b021/did_someone_just_pass_through_me/", "selftext": "Several years ago I lost a Facebook friend, we'll call him Stan. Stan lived in the Carolinas. We had never met in person but did chat occasionally. He passed quiet unexpectedly.\nA year or so before his passing, we started sharing strange coincidences. I mentioned an obscure actor in a blog and he mentioned the same actor in an unrelated post. Probably the oddest thing: I made a video and was looking for an example of a late-70s color pallet. I chose a Coppertone ad for the browns and pastels. As I was working on the animation, Stan posted the exact same ad on Facebook. I asked him what compelled him to do it and he said it just sort of called to him.\nAfter he passed, I was telling my mother about all the strange coincidences we shared. As I was doing that, I \"felt\" something rush through me. It was like a sudden, brief but very strong gust of air. I freaked out and stood and looked around. My mother, concerned, said she didn't see anything. \nWas it him, just stopping by to say goodbye?", "media": null, "score": 35, "upvote_ratio": 0.89, "comment_count": 1, "over_18": false}, "12": {"id": "1i5fjmj", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Feral_doves", "link_flair_text": null, "time": 1737773512.688995, "created_utc": 1737338878.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1i5fjmj/date_invited_me_to_a_fake_barbecue_and_then/", "title": "Date invited me to a fake barbecue and then wouldn’t let me leave, house had a ‘soundproof music studio’ in the basement ", "permalink": "/r/LetsNotMeet/comments/1i5fjmj/date_invited_me_to_a_fake_barbecue_and_then/", "selftext": "I’m so sorry this is so long, maybe I included too much detail, I don’t know, I don’t post very often. I’ll put a tldr at the end.\nThis took place a while ago (2015ish) but I’ll probably never forget it. I (around 21 at the time, f) was still fairly new in my city. I had just gotten out of a bad relationship, wasn’t in the best place mentally and didn’t know a lot of people in town besides my ex and his friends. I was on a dating/hookup app looking for people to hang out casually with, maybe find a fwb or something. I had matched with a 25 year old guy, ‘Simon’. We talked sporadically in the app for a few days. He explained he was in a band and living in a house with his bandmates. He sent me their music, it was just audio on YouTube with a heavily edited still image of four or five guys playing rock instruments, one of them looked like him. The music was an interesting combination of styles and not really for me, but whatever, he seemed like a nice enough guy. He stopped replying for a few days and I figured that was that, moved on. \nThen one day I was at work and got a message from him saying sorry he’d been so busy and inviting me to a barbecue with his friends and bandmates in their yard. He had explained that their ‘band manager’ was providing them the house to live in. Based on the lack of views on the YouTube video and the fact I only saw one photo of him playing in the band I figured he was probably exaggerating the ‘band manager’ thing. I thought it was more likely something along the lines of a bar manager friend giving them a discount on rent in exchange for being a house band at their bar or something and didn’t think much of it beyond that. \nNormally I would have just said no to going to a barbecue alone at the home of someone I really didn’t know. But I was really bored and figured I might be able to overcome some social anxiety and maybe even make some female friends there since he made it sound like a pretty big party. I put the neighbourhood he gave me into maps and it was a suburban are with lots of families as far as I knew. I figured being in a yard on such a nice summer day wouldn’t be overly risky because lots of neighbours would be outside. Plus it was just a few train stops away from my workplace and I was off in a few hours.\nI did tell him I wasn’t overly comfortable with the idea since I didn’t know him well, but I would stop by for a bit if I didn’t need to go inside the house at all. He said that was totally fine which made me feel a lot better. I even made sure to not drink anything for the rest of my shift so I wouldn’t be risking needing to go inside to use the bathroom. I was anxious about just showing up to a BBQ with people I didn’t know at all, as he implied that the event was already underway, plus I would’ve had a hard time finding a specific address from the backyard side so I asked Simon if he could meet me at the train station since he said it was a quick walk anyway. He agreed to do that and I let him know when I was leaving work and what time maps said the train would get to his station. \nI sent Simon a message to tell him that I had arrived at the train station around 5:30 after I looked around and couldn’t find him. He told me he was running behind and to just start walking toward the neighbourhood. I was about halfway across the massive train station parking lot when I saw him slowly wandering toward me. I recognized his clothes (wearing bellbottoms when they were not common, especially for men) and long hair from far away, but up close his face looked pretty different from his photos. It might’ve been some heavy duty editing, I don’t even know, but he kinda looked like a different guy. Older looking than the ‘25 year old’ guy in the photos by 5-10 years, maybe used photos of his brother or something, I don’t even know, it was before AI. This was the first real red flag, but I brushed it off. Maybe he’s just self conscious, maybe he smokes a lot and doesn’t wear sunscreen and hasn’t taken pictures in a while (all of his pictures looked candid so I figured he wasn’t much of a selfie guy). And besides, I’m mostly here to make friends anyway so I shouldn’t judge his appearance so harshly. He was also clearly already drunk but a lot of my ex’s friends were heavy drinkers so that didn’t seem strange, he’s hosting a BBQ after all. \nThe second red flag came shortly after when we arrived at the front door. I reminded him that I wasn’t comfortable going inside the house, but he assured me we would just have to walk through to get to the back yard. Ok fine. It wasn’t the kind of neighbourhood where you could just walk around the house to get to the back yard, we would’ve had to back track to the main road to go down the alley directly to the backyard. I figured he just forgot what I said about not wanting to go inside and didn’t want to cause a bunch of trouble so I went with it.\nWe got in the house and he immediately closed the door and locked the deadbolt and knob behind me. I didn’t think that was tooo weird since nobody was hanging out inside and a lot of people are just in the habit of locking the door when they come in, but it did still give me the heebie jeebies for some reason. Then Simon then told me he’d really like to give me a tour of the house. I politely declined and reminded him that l was just there for the BBQ. He said that he and his bandmates had worked really hard to get the house and he was really proud of it. At that point I was getting really skeptical because usually when guys would tell me things that seemed a bit far fetched they’d let the truth slip by the time they got me to their house.\nBut still, I convinced myself that I was being unreasonable, I was already in the stupid house anyway. He insisted it’d be quick. Not the wisest choice, I know. But I was pretty good at explaining away red flags so at this point Simon still mostly had a dopey stoner art guy kind of vibe as far as I was concerned. He really didn’t seem like a threat, just an insecure oddball who sucks at communicating and fibs a bit. Not unlike my ex who was definitely emotionally and verbally abusive but it never escalated past that. I figured at worst he’d get handsy and I’d get called a prude for not sleeping with him. I didn’t have a lot of self worth at the time obviously so I went with it.\nThe tour started pretty uneventfully other than that the decor in the common areas was obviously chosen by a middle aged Martha Stuart enthusiast and not a bunch of guys in a band or their fake band manager. I didn’t know if this should make me feel better or worse. On one hand he was clearly lying, but on the other it made me think it was probably just someone’s mom’s house and she was out of town and he didn’t wanna tell me he lived at (a friend’s parent’s) home and didn’t actually have a paying job. Again, total red flag, but I could rationalize it at the time. \nThe bedroom doors were all closed, bathroom was unremarkable. He then showed me the kitchen and I finally saw through the window that there was nobody in the backyard. There weren’t even BBQ supplies around. No burgers thawing on the counter, no cocktail supplies lying around, nothing. I asked him where everyone was and why he lied about the BBQ, and he told me that his bandmates were on tour still, they were just running behind due to van trouble but they should be back any minute so we could start the party. I asked him why he wasn’t on tour with them if he’s in the band. I don’t even remember what his answer was to that because it didn’t make any sense. At this point I’m out of mental gymnastics to convince myself that this guy isn’t just completely full of shit, and I’m really freaked out (took me long enough. I’m smarter now don’t worry). \nI started trying to figure out a way to get out of this situation. I hoped that once he was done the tour we could go outside, even just for a minute, and I’d just leave. I’d been in some sketchy situations in the past, but luckily nothing so bad that they tried very hard to physically stop me when I walked away in a semi-public place, I just wasn’t comfortable doing it inside the house. I knew this guy was full of shit but I had no idea how much worse it would get. \nI instinctively pretended to believe his bullshit. He offered me a beer, I said no thanks because I had to work in the morning. He said ok and cracked one for himself. Then he wanted to take the tour downstairs, I could see from the top of the stairs that the basement was the dark and creepy kind with really small windows, so I refused. I asked if we could go back outside. He said after the tour. I tried to argue about going into the basement, told him I have a spider phobia, don’t like basements, etc. (all lies but anything that wouldn’t let him realize that HE was what I was afraid of). He started to get agitated about my reluctance, so I figured it would be better to just let him show me the damn basement and then hopefully we could go outside because I really didn’t know what else to do. \nThe basement was fairly unremarkable. Couch, tv, elliptical. Until I noticed something that gave me chills. The house was probably built in the 1990s or late 80s at the absolute earliest, but I saw a door that looked just like the heavy, foam lined door to the cold storage room in my grandma’s house. The kind that only open from the outside. It was just a smaller version of the big metal doors on commercial walk-in fridges, it looked really out of place in this house. \nI would absolutely not go anywhere near that door. He opened it and told me it was their ‘soundproof music studio’. I looked inside from a few meters away. It did indeed look soundproof, it was about the size of a bedroom and I could see a few guitars and amps in it. Mattress toppers on the walls. No drum kit or recording equipment that I could see. He insisted I go inside to get a better look. He was standing outside the door motioning for me to go inside. Holy shit the alarm bells are really going off now. At this point I realized I could totally die here if I’m not careful and I turned around to run up the stairs. He closed the door and followed me, asking what’s wrong, acting like I’m being all unreasonable for not wanting to see his soundproof ‘music studio’. So I’m realizing that this is a way sketchier situation than any of my ex’s bullshit and I’m freeaaaked right out.\nAt that point my main objective was getting out of the house. The front and back doors were both closed and locked so if I tried to run he’d be able to get to me before I could get the locks open. The bathroom did not have a window. The house had a convoluted floor plan that I wasn’t familiar with and he was much bigger than I am. He was the tall lanky type, who can run fast even if they’re out of shape and smoke a pack a day. I pretended that I was ok with hanging out with him in the hopes that he’d chill out a bit. We made smalltalk for a few minutes, he cracked another beer and thankfully he calmed down. I desperately mentioned yet again that it was beautiful outside and suggested we go sit in the yard while we wait. He said no and started to get agitated that I wanted to leave already. I told him that I could stay but I’d just really like to smoke a cigarette. He told me that we could smoke cigarettes inside, and pointed to a cereal bowl full of cigarette butts. Goddamn it. We sat down at the table and lit some cigarettes. As he was smoking he started rolling a joint, which he promptly lit as soon as his cig was done. He offered me some and I said no thanks. He insisted so I took the smallest puff I could. I’m a pretty seasoned weed smoker but I pretended to cough excessively and told him I’m a novice so that’s more than enough for me. For a liar himself he thankfully wasn’t very good at picking up on the lies of others.\nAfter we smoked he asked if I’d like to watch a movie until his bandmates get back. I told him that I was really looking forward to spending the day outside and suggested we go for a walk or visit the park. Ideas he did not like or appreciate. At this point i was trying to keep as much distance as possible between us but he stayed close enough to me that I could smell the beer on his breath. He grabbed me by the waist and and I backed away and asked about the BBQ food to try and change the subject and make him think I still believed what he was telling me. He started to get angry again, and sternly reiterated that his bandmates should be home any minute, and my anxiety was absolutely through the roof. I tried to calm him down again with generic small talk.\nNow I don’t know how I got so lucky, but the next thing that happened might’ve saved me. Simon went to the fridge to get another beer and pulled out an empty box. At this point he’s getting even more pissed off than before, so I went out on a limb and suggested we go get some more beer ‘for the party’. Because I was out of ideas. I was terrified that it would enrage him even more to suggest, once again, that we leave the house, but I had to try. Thankfully though, his eyes lit up with the possibility that I could actually be down to drink with him and he agreed. \nAs we were walking to the liquor store I still didn’t really have a plan because I was no longer comfortable just walking away from this fucking menace in this weirdly desolate suburb. But I was extremely relieved to be out of that house. I walked with him to the liquor store and when we got there told him I didn’t need to go inside if he was just gonna go grab some beer. He insisted that I had to go inside, at that point I was so stressed and frazzled I just went with him and hoped that a good opportunity to leave would arise. \nWhen we got inside the liquor store he asked what kind of beer I wanted. I reminded him that I had to work tomorrow and didn’t want to drink much. He demanded to know what kind of beer I wanted so I just named the first one that came to mind. We went to pay, the cashier was kind of an asshole so I didn’t ask for help. I probably should’ve but I panicked and didn’t. I hoped there might be somebody in the parking lot who might help me if I made a scene, but there was nobody. I really regretted not asking the liquor store guy for help, but also remembered the times my ex told people I was crazy so they wouldn’t take me seriously. Liquor store guy definitely seemed like he would’ve fell for that, so probably for the best I didn’t expect him to help me. \nI had one last idea before I took my chances just trying to run and/or scream. There was a drugstore across from the liquor store, I told Simon I had to go buy a toothbrush or some shit that vaguely implied I might stay over. He eagerly agreed to this but tried to follow me into the store. I told him that you’re not allowed to bring beer into a drugstore. I don’t know if that’s even true, I really doubt it’s any kind of law, but luckily this drunk douchebag believed it and agreed to wait outside. \nNow, my naive ass thought maybe I could just wander around in this drugstore for long enough and he would either get the hint or get sketched out or bored and leave. But no, I must’ve wandered around the store for at least half an hour and this jackass is still just standing there staring in the window. This creep didn’t even have his phone out, every time I checked if he was still there he was just staring through the window looking for me. I didn’t feel like I had anybody I could call in the city to come help me, the cops here don’t usually take things like this very seriously, and the store workers looked like they were mostly high school students and I didn’t want to drag them into this so I really didn’t feel like I had a lot of options. After being in there for so long I was surprised he didn’t come in to see what was taking me so long. I thought maybe I could lose him in the aisles and sneak out of the store if he did come in but nope. \nI ended up hovering around the tills and waited until a big group of friendly looking people were paying. I followed them out of the store and immediately told Simon to leave me alone and go home. I said it firmly and loudly enough to imply that I would make a scene if need be. Simon looked at the people getting in their car, who where now pausing and looking at us because I had nearly yelled at him, and then he just turned around and left. It was bizarrely anticlimactic, which I was very thankful for. I ran to the train station, which thankfully was in a different direction than his house from the store, and I never heard from him again. When I got home his app profile had either blocked me or been deleted. \nYears later after I stopped compartmentalizing the whole thing I wish I would have reported him or something. It bothers me to wonder if he tried it again with someone else but made sure the fridge was stocked first. But at the time I didn’t think anybody would take me seriously, I was embarrassed of my choices, and I just wanted to move on from the whole thing. Plus, all I really had was a (likely fake) first name and a general idea of where the house was, which probably wasn’t even his. \nI’ll probably never know any more than I do now, and maybe that’s for the best. Anyway, ‘Simon’, you lying pos, let’s not meet.\nTLDR: In my early 20s I met a man on a hookup app and agreed to go to a barbecue he and his bandmates were hosting at their house in the suburbs. When I met up with him he was really drunk, looked different from his photos, his bandmates were nowhere to be found, and the decor in the house didn’t look like it was theirs. He locked the door and got angry every time I asked to go outside. After a tour of the house that included a ‘soundproof music studio’ and no evidence of a barbecue, I was able to escape by suggesting we visit the liquor store together after he ran out of beer; and telling him to leave me alone once we were around a group of people.", "media": null, "score": 2058, "upvote_ratio": 0.97, "comment_count": 104, "over_18": true}, "13": {"id": "1i5rvkn", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "HamletX95", "link_flair_text": null, "time": 1737773512.8201728, "created_utc": 1737384796.0, "url": "https://i.redd.it/icwcinpzw5ee1.jpeg", "title": "Parker–Hulme murder case - two best friends made created a fantasy realm called 'the fourth world.' They became inseparable and when they were about to be separated due to the toxic relationship, they killed one of the parents hoping this would lead to the other set of parents to adopt the other. ", "permalink": "/r/truecreepy/comments/1i5rvkn/parkerhulme_murder_case_two_best_friends_made/", "selftext": "", "media": null, "score": 104, "upvote_ratio": 1.0, "comment_count": 4, "over_18": false}, "14": {"id": "1i5l2c5", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Dry_Leader443", "link_flair_text": null, "time": 1737773512.9432664, "created_utc": 1737358884.0, "url": "https://www.reddit.com/r/threekings/comments/1i5l2c5/just_led_a_friend_through_red_door_yellow_door/", "title": "Just led a friend through Red Door, Yellow Door, here’s what happened.", "permalink": "/r/threekings/comments/1i5l2c5/just_led_a_friend_through_red_door_yellow_door/", "selftext": "So, I was at a sleepover with my friend, and he really wanted us to do these so called \"scary games.\" I wasn't interested because paranoia and stuff can get to me a lot. He said that i could do a tame game without any consequences, (i suppose he didn't do enough research) Red Door Yellow Door. I agreed and we started. It took him 20 seconds to start. First, he saw a Yellow, Purple, and Red Door. He went through the purple door, and he saw a hall with doors. Then, he saw another purple door. He went through it, another hall. Next, he went through a red door and saw a destroyed classroom, with a desk with blood on it. We got out, then went through a green door. He saw a room with paint. We weren't interested in painting, so we left. He then went through a white door that had a void in it. We stepped out. We went through another white door with a void that we backed out of. Finally, once we went back in the hall, he saw the headless man, the one that ends the game. I got him up. Afterwards, we talked about the experience. He said he saw a lot of clocks, hallucinations of them after the game but also one in the class room during the game. Also, randomly while we were watching a movie, the song \"Tip Toe Through the Tulips\" randomly started playing, one we had set up on amazon music to play single player musical chairs but supposedly, he hadn't touched his phone since and didn't start playing that song. Amazon music wasn't even open.\nI'd like to know more about the story of this game, it there is one, and the meaning behind the events that we went through. I'll edit this if there's any updates. And if you're suspicious on the authenticity of this story, i get it, it's the internet. But how would I benefit from lying. ", "media": null, "score": 17, "upvote_ratio": 0.96, "comment_count": 2, "over_18": false}, "15": {"id": "1i6kwij", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "dinosprinkles27", "link_flair_text": "Caught on Camera 🎥 ", "time": 1737773513.376916, "created_utc": 1737472760.0, "url": "https://v.redd.it/e08oej4k6dee1", "title": "Voice at the end of this video says \"come find it\"", "permalink": "/r/Ghosts/comments/1i6kwij/voice_at_the_end_of_this_video_says_come_find_it/", "selftext": "Right before the video ends, you can hear it whisper. I was completely alone. Now I wonder if that's why he was being so antsy (he's not usually demanding like that).", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/e08oej4k6dee1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/e08oej4k6dee1/DASH_96.mp4", "dash_url": "https://v.redd.it/e08oej4k6dee1/DASHPlaylist.mpd?a=1740365513%2COTcxODM4YTAzYTFhYjY3ZDE3OGNhNTRjNGE1M2EyMTEyOWMzMmM4ZDM5ZjQ0NzgzNzVhNTYyMzBjNjkzMjM3Mw%3D%3D&v=1&f=sd", "duration": 11, "hls_url": "https://v.redd.it/e08oej4k6dee1/HLSPlaylist.m3u8?a=1740365513%2CMDVlYjE0MGQxMDI5NDZiZTAzNGE2MTdiZWFhY2NhMzM5MmUyMTM5N2Y0OTNmMDk2ZDAxZjQxOTdlMWNkOTA2Nw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 431, "upvote_ratio": 0.86, "comment_count": 145, "over_18": false}, "16": {"id": "1i5rzqf", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Impulslve", "link_flair_text": "Glitch Vid", "time": 1737773513.5892036, "created_utc": 1737385099.0, "url": "https://v.redd.it/e0u0pfxwx4ee1", "title": "Doppelganger ", "permalink": "/r/GlitchInTheMatrix/comments/1i5rzqf/doppelganger/", "selftext": "", "media": null, "score": 2254, "upvote_ratio": 1.0, "comment_count": 34, "over_18": false}, "17": {"id": "1i4moxs", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "SkrydiS_", "link_flair_text": "Discussion", "time": 1737773514.7427073, "created_utc": 1737249627.0, "url": "https://i.redd.it/cpsujjp2rude1.jpeg", "title": "This is it. The clearest photo of a NHI UAP.", "permalink": "/r/ufo/comments/1i4moxs/this_is_it_the_clearest_photo_of_a_nhi_uap/", "selftext": "", "media": null, "score": 1245, "upvote_ratio": 0.84, "comment_count": 1245, "over_18": false}, "18": {"id": "1i66xxj", "locked": true, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "amvion", "link_flair_text": "Government", "time": 1737773516.5202973, "created_utc": 1737422583.0, "url": "https://v.redd.it/1uzmctv919ee1", "title": "Trump just told his Chief of Staff Susie Wiles on the fly to \"immediately\" find out for him what the drone scare was so he can tell the people.", "permalink": "/r/UFOs/comments/1i66xxj/trump_just_told_his_chief_of_staff_susie_wiles_on/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/1uzmctv919ee1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/1uzmctv919ee1/DASH_96.mp4", "dash_url": "https://v.redd.it/1uzmctv919ee1/DASHPlaylist.mpd?a=1740365515%2CZGMxM2NhMzU0ODg1M2Y3YzQ2NzM0MTQ3YjU5ZTZjNzEzNjZkNmQ5ZTFjNjBlMjQxY2IxN2U1MTdhM2QyYjkwOQ%3D%3D&v=1&f=sd", "duration": 34, "hls_url": "https://v.redd.it/1uzmctv919ee1/HLSPlaylist.m3u8?a=1740365515%2CZjAyMmE2ODZmNmY4ODUzMjgxYjFjMGFhMzA3MmM2ZWE3OWI1MmVhNjVhYzE1NzRhYTYxOWYzMjljZWYwZWU3OA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 11044, "upvote_ratio": 0.79, "comment_count": 1506, "over_18": false}, "19": {"id": "1i7u227", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "coachlife", "link_flair_text": "Video", "time": 1737773517.7588744, "created_utc": 1737602219.0, "url": "https://v.redd.it/uiypw23ivnee1", "title": "\"We have evidence of non-human intelligence\" - Owner of Skinwalker Ranch", "permalink": "/r/aliens/comments/1i7u227/we_have_evidence_of_nonhuman_intelligence_owner/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/uiypw23ivnee1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 852, "width": 480, "scrubber_media_url": "https://v.redd.it/uiypw23ivnee1/DASH_96.mp4", "dash_url": "https://v.redd.it/uiypw23ivnee1/DASHPlaylist.mpd?a=1740365516%2CNDgwNGE2YjQyMTlhYjQxNDU1NTA5NzljMWJlNzM1YjkyNTJmY2QwNDQxNDgxM2Q5OTBiMTMyMGQ2ZjgyMjdhOA%3D%3D&v=1&f=sd", "duration": 193, "hls_url": "https://v.redd.it/uiypw23ivnee1/HLSPlaylist.m3u8?a=1740365516%2CMmE2MjYwNDYwNmI0MTkyM2ZkZmE0NGQwZjIzOGE2MDAxYTg2OTE3MDE5ZDAxODczNmMwZTMzN2VmZDdmYTQxOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2833, "upvote_ratio": 0.9, "comment_count": 539, "over_18": false}, "20": {"id": "1i8391n", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "mactan400", "link_flair_text": null, "time": 1737773518.6893563, "created_utc": 1737638641.0, "url": "https://x.com/highpeaks77/status/1882274353834078699?s=46", "title": "Former CIA Director Mike Pompeo explains here why he was against releasing the JFK files.   He also says that he’s seen the UFO Files and that “We’ve got bigger problems…”", "permalink": "/r/UAP/comments/1i8391n/former_cia_director_mike_pompeo_explains_here_why/", "selftext": "", "media": null, "score": 557, "upvote_ratio": 0.8, "comment_count": 325, "over_18": false}, "21": {"id": "1i8d2a6", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "truth_sleuther", "link_flair_text": null, "time": 1737773519.7599895, "created_utc": 1737663963.0, "url": "https://i.redd.it/lf4nxdv3zsee1.jpeg", "title": "Trump Signs Order To Release JFK/RFK/MLK Files", "permalink": "/r/conspiracy/comments/1i8d2a6/trump_signs_order_to_release_jfkrfkmlk_files/", "selftext": "Now let’s see if it’s the whole file and that it shows government involvement ", "media": null, "score": 5087, "upvote_ratio": 0.94, "comment_count": 801, "over_18": false}, "22": {"id": "1i486ug", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "traphope", "link_flair_text": "photo", "time": 1737773520.4215946, "created_utc": 1737209062.0, "url": "https://i.redd.it/ftj73xbgerde1.jpeg", "title": "Cade’s Cove ", "permalink": "/r/bigfoot/comments/1i486ug/cades_cove/", "selftext": "I took this picture probably in 2011 or 2012 at Cade’s Cove outside Gatlinburg Tennessee. I was just taking a picture of the deer and didn’t notice what was in the background until later.", "media": null, "score": 307, "upvote_ratio": 0.94, "comment_count": 80, "over_18": false}, "23": {"id": "1i8n4vw", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Emeraldsinger", "link_flair_text": "Discussion ", "time": 1737773521.021019, "created_utc": 1737692374.0, "url": "https://i.redd.it/nmrumazdbvee1.jpeg", "title": "Since pretty much everyone in this sub has denounced the existence of Bigfoot (and variations of such), what about the Florida skunk ape? Has this photo ever been debunked?", "permalink": "/r/Cryptozoology/comments/1i8n4vw/since_pretty_much_everyone_in_this_sub_has/", "selftext": "", "media": null, "score": 423, "upvote_ratio": 0.91, "comment_count": 243, "over_18": false}, "24": {"id": "1i4zc3w", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "The_Real_Dogday14", "link_flair_text": "Shadow Person", "time": 1737773521.1695836, "created_utc": 1737296068.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1i4zc3w/humanoid_shadow_updated/", "title": "Humanoid shadow (updated)", "permalink": "/r/Humanoidencounters/comments/1i4zc3w/humanoid_shadow_updated/", "selftext": "the year: all I know is that it was a couple years back, if I'm correct, it was during summer - fall\nPlace: Thorney Park, wroughton, Swindon (my house)\nSo I'm not sure if I'm delusional or not, I was chilling in my bedroom, I look behind me, there's my staircase to downstairs, so one time I look at these stairs, and I see a ghostly shadow just whizz past from the left wall to the right, then it vanishes through the wall, never to be seen again, but, like later that same day, my brother sees what I saw, then he said he heard thumps like someone was walking up the stairs, but this was FUCKING CLEAR AS DAY, but no-one was on the stairs at these times, for all I know, this thing had no face and it travels faster than any human, but I caught a glimpse of it, not on camera, to be sure, this actually happened.\nLink to original will be in comments", "media": null, "score": 8, "upvote_ratio": 0.76, "comment_count": 1, "over_18": false}, "25": {"id": "1i7xs88", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "TraumaQu33n13", "link_flair_text": null, "time": 1737773521.4807637, "created_utc": 1737615814.0, "url": "https://i.redd.it/iu1izynxzoee1.jpeg", "title": "Thought this sub would appreciate my new tattoo! Start of my cryptid leg sleeve.", "permalink": "/r/cryptids/comments/1i7xs88/thought_this_sub_would_appreciate_my_new_tattoo/", "selftext": "", "media": null, "score": 685, "upvote_ratio": 0.99, "comment_count": 24, "over_18": false}, "26": {"id": "1i6w7um", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "NoCommunication7", "link_flair_text": "Theory/Debunking", "time": 1737773521.6357906, "created_utc": 1737500871.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1i6w7um/a_feeling_of_familarity_with_things_that_youve/", "title": "A feeling of familarity with things that you've never used or places you've never been to before?", "permalink": "/r/Thetruthishere/comments/1i6w7um/a_feeling_of_familarity_with_things_that_youve/", "selftext": "Does anyone feel this? i get it occasionally, sometimes it's with a picture or something i've bought or a place i go to, it's not really a deja vu as it is a 'i've been there before' and it feels like it was in a previous era of your life, or sometimes it's backed up by an unverifiable vague memory.\nAs a few examples, for many years i had a picture of a room from the titanic as my desktop wallpaper, so i saw it quite a bit, every time i saw it i swear i felt a deeper connection, it wasn't like i was looking at a picture taken in a ship that sunk well over 100 years ago now, it felt like i was looking at a picture of a house or a car we used to have.\nAnother example, before i got my first cloak, i had a vague memory of wearing one as a kid, but so vague that it was unverifiable, i also had the same feeling long before i started wearing ties.\nMore recently i was playing fishing planet, doing float fishing, for those unaware this game has a nifty indicator on the screen that lets you see what your tackle is doing, for float fishing it displays a red/black bobber, then i got the vaguest of memories, that i played with fishing floats as a kid, and i distinctly remember the sound of hollow plastic clinking, but it's again so vague!\nI've had this with some other things too, this sort of supernatural familiarity, like a liminal space, in fact it often surprises when i experience something that's not how i expected it.", "media": null, "score": 28, "upvote_ratio": 0.9, "comment_count": 10, "over_18": false}, "27": {"id": "1i72q8s", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Ohiobound03", "link_flair_text": null, "time": 1737773521.7688553, "created_utc": 1737519255.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1i72q8s/psycho_following_me_while_delivering_for_doordash/", "title": "Psycho following me while delivering for DoorDash", "permalink": "/r/LetsNotMeet/comments/1i72q8s/psycho_following_me_while_delivering_for_doordash/", "selftext": "This just happened a few hours before posting. I'm currently off of work and decided to deliver for DoorDash to get some money on the side. I was on my way to deliver someone's food when I accidently almost hit this guy while changing lanes. I don't know if I just didn't see him or if he like sped up to get in front of me or whatever, but he took it very personally. I went back into the left lane, and he sped up and break checked me, then I stopped at a red light, and he got out of his car and hit my window. The light turned green, so I just sped off, and then he pulled up next to me at the next light. He was shouting at me a bunch of nonsense so when the light turned green, I sped off again, and I thought I lost him. I delivered the food and decided to go home. On my way home, he found me and pulled up next to me, shouting again. I called my Dad while I tried to lose him again. Eventually, I pulled into a gas station, and he drove off. My Dad came and we talked. while we were talking, I saw a car that looked like him drive by, but I'm not sure if it was him or not. After that, my Dad and I drove home. So, to the psycho with anger issues that looks a lot like CaseOh, let's not meet.", "media": null, "score": 76, "upvote_ratio": 0.92, "comment_count": 9, "over_18": true}, "28": {"id": "1i8g45x", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "dangerdangerman", "link_flair_text": null, "time": 1737773521.8854406, "created_utc": 1737671643.0, "url": "https://i.redd.it/p90ynhfxltee1.jpeg", "title": "In October 1928, the discovery of 30-year-old Elfrieda Knaak, found severely burned in the basement of the Lake Bluff, Illinois Town Hall, sent shockwaves through the community. Dubbed the “Furnace Girl,” the circumstances surrounding her death remain a mystery.", "permalink": "/r/truecreepy/comments/1i8g45x/in_october_1928_the_discovery_of_30yearold/", "selftext": "On the morning of October 30, 1928, in the quiet village of Lake Bluff, Illinois, an ordinary day took a sinister turn. Chief of Police Barney Rosenhagen and municipal worker Chris Louis arrived at the town hall, which also served as the police station and firehouse. The building was unusually cold, prompting Barney to send Chris to check the furnace. What Chris discovered would leave the town reeling for decades.\nChris unlocked the cellar doors leading to the furnace room. Inside, he encountered a dark, human-like figure slumped in a corner. Believing he had seen a ghost, Chris fled and alerted Barney. The two men returned, only to be confronted by a horrific reality. The figure spoke, saying, “I’m cold.” It was Elfrieda Knaak, a 30-year-old woman from Deerfield, Illinois, severely burned and naked. Barney wrapped her in a blanket and summoned help.\nElfrieda was a well-known figure in Deerfield, one of eleven children born to Dr. Theodore Knaak, a respected local physician. At the time of her death, she was working as a door-to-door encyclopedia salesperson. On October 29, she had attended a sales meeting in Chicago, phoning her family afterward to inform them she’d return home shortly. However, a broken-down bus diverted her route to Lake Bluff, where her movements became a mystery.\nInvestigators discovered Elfrieda in a furnace room with two heating units. The smaller, gravity-fed water boiler was identified as the source of her burns. Her personal items, including her watch and shoes, were found nearby, but most of her clothing was missing. Burn marks and ash remnants suggested her head and body had been in contact with the boiler’s hot coals. She suffered third-degree burns on 30% of her body, with devastating injuries to her hands, feet, and head. Despite these injuries, Elfrieda clung to life for three days, during which she offered cryptic statements to detectives, alternately claiming responsibility for her injuries and hinting at foul play.\nElfrieda’s fragmented words included, “I did it, it was me,” as well as references to a “Hitch” and statements like, “He pushed me down” and “Why did they do it?” Despite her confession, questions about the involvement of others lingered. She succumbed to her injuries on November 2, leaving behind more questions than answers.\nPolice focused their investigation on Charles “Hitch” Hitchcock, a local speech instructor and town watchman. Elfrieda had taken his speech classes, leading to speculation about a potential relationship. Charles, a married father of four, denied any personal connection to Elfrieda and provided an alibi, supported by a doctor’s confirmation of his recent ankle injury. His wife, Estelle, also vouched for him but admitted she could not confirm his whereabouts on the night of October 29. Other individuals connected to Elfrieda were also scrutinized. Among them were a violin instructor who shared studio space with Charles and a spiritualist who visited Elfrieda in the hospital. Letters from a “B. Lock”, traced to a Mrs. Roch from Libertyville, hinted at a deeper relationship, but investigators found no evidence linking these individuals to the incident. Even Elfrieda’s best friend, Marie Mueller, who harbored feelings for Charles, was questioned without result.\nAmid these inquiries, detectives uncovered a potential clue in Elfrieda’s home. A book titled Christ in You contained an underlined passage about “the purifying power of pain” and “The Refiner’s Fire,” suggesting she may have been influenced by spiritual or religious beliefs about suffering. This finding bolstered the theory of suicide, but inconsistencies in the case continued to trouble the Knaak family.\nUnexplained bloodstains on the furnace room door and the locked state of the room when Chris discovered Elfrieda raised doubts about the official narrative. The family hired a private investigator, but no new evidence emerged. Over the years, multiple individuals falsely confessed to the crime, including a chauffeur, a self-proclaimed occultist, and a man claiming to be an Egyptian hypnotist. All were eventually dismissed as hoaxes.\nThe mystery deepened when crucial evidence, including the coroner’s report, autopsy photos, and items from the furnace room, disappeared in the 1980s after the death of a police chief. This loss rendered further investigation impossible.\nAdding another layer of intrigue, Marie Mueller married Charles Hitchcock 14 years after Elfrieda’s death. Following Charles’ passing in 1964, Marie’s niece revealed that Marie had confessed to a romantic involvement involving herself, Elfrieda, and Charles, and claimed to know the truth about Elfrieda’s death. However, Marie refused to share details, leaving these assertions unverified.\nToday, the tragic death of Elfrieda Knaak remains an unsolved mystery. The combination of circumstantial evidence, conflicting testimonies, and missing records ensures that the truth of what happened that night in Lake Bluff’s furnace room may never be known. Her story continues to haunt the small town and serves as a reminder of the enduring enigma surrounding one woman’s untimely demise.", "media": null, "score": 34, "upvote_ratio": 0.97, "comment_count": 1, "over_18": false}, "29": {"id": "1i4gjfv", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "TheAlphaAkuma", "link_flair_text": null, "time": 1737773522.017921, "created_utc": 1737231988.0, "url": "https://www.reddit.com/r/threekings/comments/1i4gjfv/in_need_of_some_assistance/", "title": "In need of some assistance ", "permalink": "/r/threekings/comments/1i4gjfv/in_need_of_some_assistance/", "selftext": "Greetings everyone.\nI do not know if this is the correct subreddit to post about the problem or rather the difficulty i am currently having but any and all helps would greatly be appreciated.\nRecently there have been lots of paranormal or rather evil activities happening in my household, in our couture we call them Jinn, as in an evil entity made of fire like a demon in western colture, i have tried everything i could think of such as burning sage and commanding them to leave but to no avail therefore the last place i could think of was reddit.\nIf there is anyway or ritual or something that i can do to make them stop and leave us for good?\nThank you all.", "media": null, "score": 5, "upvote_ratio": 0.86, "comment_count": 16, "over_18": false}, "30": {"id": "1i609j9", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "belt_fed8", "link_flair_text": "Captured Apparition ", "time": 1737773522.4367156, "created_utc": 1737405188.0, "url": "https://www.reddit.com/gallery/1i609j9", "title": "Do t know what I got here . What do yall think?", "permalink": "/r/Ghosts/comments/1i609j9/do_t_know_what_i_got_here_what_do_yall_think/", "selftext": "", "media": null, "score": 401, "upvote_ratio": 0.95, "comment_count": 70, "over_18": false}, "31": {"id": "1i69l2y", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "coachlife", "link_flair_text": "Glitch Vid", "time": 1737773522.6703615, "created_utc": 1737430640.0, "url": "https://v.redd.it/wj5ina5bp9ee1", "title": "Any idea what this is?", "permalink": "/r/GlitchInTheMatrix/comments/1i69l2y/any_idea_what_this_is/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/wj5ina5bp9ee1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 474, "scrubber_media_url": "https://v.redd.it/wj5ina5bp9ee1/DASH_96.mp4", "dash_url": "https://v.redd.it/wj5ina5bp9ee1/DASHPlaylist.mpd?a=1740365522%2CN2Y3NWNlYmU5YTE1ZTM0ZGY1NzdiMDQ2NDU3ZDg0M2JjNTdjZjlkZjIxMGUyZTJmZTM0ZTU4ZTNlM2Q5NGEyNA%3D%3D&v=1&f=sd", "duration": 24, "hls_url": "https://v.redd.it/wj5ina5bp9ee1/HLSPlaylist.m3u8?a=1740365522%2CODExY2I2ODJmMWJhN2ZkNGMzNWJhMWFlNjVmM2I0MDI3MjEyN2U3ZGRmODZlYzFjZTFlODM2OTk5MjUzMGU3YQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 559, "upvote_ratio": 0.9, "comment_count": 295, "over_18": false}, "32": {"id": "1i7lvxy", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Ad1714", "link_flair_text": null, "time": 1737773523.7514255, "created_utc": 1737579737.0, "url": "https://www.dailymail.co.uk/sciencetech/article-14309337/interactive-drone-sightings-map-new-jersey-trump.html", "title": "New Jersey drones are BACK as interactive map shows activity ramping up... after Trump promised to release truth", "permalink": "/r/ufo/comments/1i7lvxy/new_jersey_drones_are_back_as_interactive_map/", "selftext": "", "media": null, "score": 1074, "upvote_ratio": 0.94, "comment_count": 149, "over_18": false}, "33": {"id": "1i4mq9e", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "CreditCardOnly", "link_flair_text": "Disclosure", "time": 1737773524.9600623, "created_utc": 1737249742.0, "url": "https://v.redd.it/kxdzvrs9rude1", "title": "Full NewsNation video of the \"egg\" UAP", "permalink": "/r/UFOs/comments/1i4mq9e/full_newsnation_video_of_the_egg_uap/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/kxdzvrs9rude1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/kxdzvrs9rude1/DASH_96.mp4", "dash_url": "https://v.redd.it/kxdzvrs9rude1/DASHPlaylist.mpd?a=1740365524%2CMTViMTMxMDU2OWRlNzlhYjYxMzdlNjRjYzhiNTEzMTRkZjY1NzQxZTk4ZGVmMDQ3NGFhOTNhNzI5YjBjMzhkYw%3D%3D&v=1&f=sd", "duration": 78, "hls_url": "https://v.redd.it/kxdzvrs9rude1/HLSPlaylist.m3u8?a=1740365524%2CNWQ5ZWNhZmJmYTBkMGM0OTFjYTU3OTEwMTI3NDQwY2ZjYzQ3OGU5ODJmOWUwNDM5MjcwZjI5MWU2MzdiMmMxNA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 8654, "upvote_ratio": 0.77, "comment_count": 5785, "over_18": false}, "34": {"id": "1i5gtku", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "broadenandbuild", "link_flair_text": "Discussion :table:", "time": 1737773526.3237526, "created_utc": 1737343015.0, "url": "https://www.reddit.com/r/aliens/comments/1i5gtku/message_to_ross_coultart_dont_tell_the_community/", "title": "Message to Ross Coultart: Don’t tell the community not to treat this like “entertainment” when you guys present it like “entertainment”", "permalink": "/r/aliens/comments/1i5gtku/message_to_ross_coultart_dont_tell_the_community/", "selftext": "Ridiculous, and gas lighting statement from you and your colleagues with respect to the “egg”. If you don’t want people to treat this like entertainment, STOP FUCKING HYPING THIS UP LIKE IT’S SOME MOVIE TRAILER. The backlash is the fault of the people who treat this like it’s entertainment— you included. Take responsibility for your stupidity.", "media": null, "score": 1424, "upvote_ratio": 0.89, "comment_count": 206, "over_18": false}, "35": {"id": "1i4oa2g", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Head-Computer264", "link_flair_text": null, "time": 1737773527.2856812, "created_utc": 1737254666.0, "url": "https://www.reddit.com/r/UAP/comments/1i4oa2g/egg_video_analysis_serious/", "title": "Egg video analysis serious ", "permalink": "/r/UAP/comments/1i4oa2g/egg_video_analysis_serious/", "selftext": "Does anyone know what a 150' long military rope that is used for helicopter lifting looks like? How much would that rope weigh? I've seen climbing ropes and I've seen military fast ropes, they are very different. I'm trying to visualize what a rope used to lift heavy objects by helicopter would look like, and does it match the video?\nBased on the rope and tarp on the video, and the description of the egg being 20' long, does what we see make sense? Are tarps commonly used to lift odd shaped objects by helicopter? What size tarp could that be in the video? \nAnything else that can be gleaned by looking at the video more closely? Any way to determine height from ground? Is the rope always 150', or can it be retracted? \nEdit: link to full video https://youtu.be/3dtA9w5ldHw?si=CSQlhLSR6-I8SpwO\nThank you all for the interesting discussions, lots of good info being shared despite the thread being downvoted. ", "media": null, "score": 391, "upvote_ratio": 0.92, "comment_count": 326, "over_18": false}, "36": {"id": "1i614xr", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "valerianandthecity", "link_flair_text": null, "time": 1737773528.5756867, "created_utc": 1737407295.0, "url": "https://i.redd.it/weqq7zonr7ee1.jpeg", "title": "Why Did He Do This?", "permalink": "/r/conspiracy/comments/1i614xr/why_did_he_do_this/", "selftext": "", "media": null, "score": 4660, "upvote_ratio": 0.82, "comment_count": 2907, "over_18": false}, "37": {"id": "1i8tw24", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "zak-jackson", "link_flair_text": "humor", "time": 1737773529.6369092, "created_utc": 1737720408.0, "url": "https://i.redd.it/enq6de2ymxee1.jpeg", "title": "Photobombed in Lincoln City, OR", "permalink": "/r/bigfoot/comments/1i8tw24/photobombed_in_lincoln_city_or/", "selftext": "", "media": null, "score": 290, "upvote_ratio": 0.94, "comment_count": 7, "over_18": false}, "38": {"id": "1i7q3jn", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "HPsauce3", "link_flair_text": null, "time": 1737773530.2364442, "created_utc": 1737590638.0, "url": "https://www.reddit.com/gallery/1i7q3jn", "title": "Mysterious Old Sea Monster Photos", "permalink": "/r/Cryptozoology/comments/1i7q3jn/mysterious_old_sea_monster_photos/", "selftext": "", "media": null, "score": 310, "upvote_ratio": 0.89, "comment_count": 74, "over_18": false}, "39": {"id": "1i56uqj", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "OutsidetheCanvas", "link_flair_text": "Art", "time": 1737773530.7327058, "created_utc": 1737315336.0, "url": "https://i.redd.it/s0et941960ee1.jpeg", "title": "My Favorite Cryptid Painting to Date", "permalink": "/r/cryptids/comments/1i56uqj/my_favorite_cryptid_painting_to_date/", "selftext": "", "media": null, "score": 314, "upvote_ratio": 1.0, "comment_count": 15, "over_18": false}, "40": {"id": "1i69qdy", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Fast-Writer2422", "link_flair_text": null, "time": 1737773530.899536, "created_utc": 1737431116.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1i69qdy/drones_in_virginia/", "title": "Drones in Virginia ", "permalink": "/r/Thetruthishere/comments/1i69qdy/drones_in_virginia/", "selftext": "Hello, I'm in Virginia near DC 20 MINUTES AWAY, as I'm typing, theres alot of \"drone\" activity or I don't know what the fuck, there was a white light blinking 2 times every 3 seconds behind a plane. These are the same sightings as reported from the new Jerseys drones, what in the hell am I looking at you tell me\"", "media": null, "score": 25, "upvote_ratio": 0.87, "comment_count": 6, "over_18": false}, "41": {"id": "1i92b2y", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Lala922", "link_flair_text": null, "time": 1737773531.0381703, "created_utc": 1737743340.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1i92b2y/tourists_in_target/", "title": "Tourists in Target", "permalink": "/r/LetsNotMeet/comments/1i92b2y/tourists_in_target/", "selftext": "Context: I am (was, this was several years ago) a 35 year old blonde, white, petite Italian American with barely 2 year old twins.  Now, I may be biased, but my boy/girl twins are exceptionally cute but weirdly, do not even look related.  My son, in particular, got a lot of attention due to his strawberry blonde hair and giant blue eyes. \nSo I head out to target with my twinsies, park slightly far away from the main entrance because I like to be close to where you can bring the carts back and there was not a ton of cars in this row.   As I am getting out, me and another couple who parked near me, smile at each other, as their son is clearly the same age as my kids.   Dad is a BEAR of a man, huge, beard for days, arms like tree trunks.\nAs I am walking around target, looking at all the things we don't need, I vaguely notice two couples who are in a lot of the same areas as me.  They aren't speaking English, if I was going to guess, they were possibly Russian but I couldn't really tell. \nFast forward I get on line behind one of the couples, My daughter is in the seat part of the cart and my son is in the wide open part.   Out of nowhere, the lady from the couple behind me is all up in my cart and my person space.  The couple in front of me, after paying. Doesn't get out of the way.  (weird, move over guys, wtf are you doing?)  The lady behind me, leans Completely over my cart. and places herself in between me and my son.  I have literally  no idea what she doing.  Still. It seems like her main objective was to block my eyeline to him.  \nI have my hands on my daughter,  but I can't even see my son. She's a big lady.  She is quite obviously very much too close to my children.  She is leaning totally over my cart to the point that her body  is like resting on both sides of it.  Again> I CANT EVEN SEE my child anymore who up until  two mins ago was less than 10 inches away from me. \nI had asked her to back up when she started inching closer, but she just responded in her native language.   I gestured to show her what I meant.  I repeatedly ask her to please move, excuse me, etc. I am obviously trying to get her to move away from my children.  Even if you don't speak the same language, pretty clear what the point of the message I was making is.  \nShe blatantly ignores me. I'm trying to lean around her to grab my son and throw him onto the conveyor belt just to get him away from this couple...bc seriously, what are you trying to do here??\nShe refuses to move, and I can't get to my son. This continues to go on for several minutes.  We aren't even checked out bc I have items in my cart I can't reach.  I am also blocked in on the other side by this other couple who are standing completely on top of me. \nAt this point, I am full on yelling at the women to get the fuck away from my kid.  I finally grab my cart and Smash it as hard as I can into her and she starts yelling at me  in ? and backs up just enough for me to grab my son.  Whose now hysterical.\nThe 16 year old cashier was useless even though the whole time I was screaming at her to call security. \nTHE BEAR from earlier sees this all taking place, and rushes himself and his family over to my side,  He manages to push the other couple away from me and we basically ditch all my attempted purchases and he gets me and my twins back to our cars safely.  Him and his wife followed me for a bit onto the highway to make sure we weren't being followed by any other cars. \nSo to the tourists at target who attempted to.... I don't know what you were attempting .....but you raised ALL MY MAMA RED FLAGS and you are lucky I didn't smash my keys into your face bc that was my next move.  Lets not meet \nand to the Papa Bear who was the only reason I felt like I got out of that target safely.  THANK YOU", "media": null, "score": 50, "upvote_ratio": 0.92, "comment_count": 5, "over_18": true}, "42": {"id": "1i6agfr", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Substantial-Fig-6392", "link_flair_text": null, "time": 1737773531.2653625, "created_utc": 1737433479.0, "url": "https://www.reddit.com/r/threekings/comments/1i6agfr/in_need_of_a_ritual_to_offer_something_of_myself/", "title": "in need of a ritual to offer something of myself to get what I want back", "permalink": "/r/threekings/comments/1i6agfr/in_need_of_a_ritual_to_offer_something_of_myself/", "selftext": "i’m serious about this i’m not joking. looking for a ritual to do to get some personal things and i’m serious this isn’t a joke \nI tried to kms and was unconscious for a day and I think my soul went to hell so I need to offer smt physical if I want more.\nany ritual for this? and what I need to offer? I don’t know if this is the right sub but please help?", "media": null, "score": 2, "upvote_ratio": 0.54, "comment_count": 4, "over_18": true}, "43": {"id": "1i8p8jz", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "H-Nash5", "link_flair_text": "Captured Apparition ", "time": 1737773531.7060754, "created_utc": 1737700049.0, "url": "https://www.reddit.com/gallery/1i8p8jz", "title": "In 2019, on a trip to Savannah, GA, we photographed what appears to be an apparition of a little boy.", "permalink": "/r/Ghosts/comments/1i8p8jz/in_2019_on_a_trip_to_savannah_ga_we_photographed/", "selftext": "In 2019, I was visiting Savannah, GA, where I was born, with my family and touring the squares and famously reported haunted sites. We had taken many photos, but it was when we were reviewing the photos that we noticed something in the window that we had not seen with our own eyes. It was at the infamous Benjamin Wilson House at 432 Abercorn Street, claimed to be one of the most haunted houses in Savannah. As we zoomed in we saw what appeared to be an image of a child in the window.  It seems to be a little boy to me. Afterwards I took another look with my eyes only to find no such image. There are fabled rumors of children dying tragically in that house. At the time we visited it was boarded up, fenced off with signs posted. Do you see what I see? Feel free to share your thoughts.", "media": null, "score": 396, "upvote_ratio": 0.86, "comment_count": 68, "over_18": false}, "44": {"id": "1i7wfd3", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "NotUrAverageTM", "link_flair_text": "Glitch Pic", "time": 1737773531.930524, "created_utc": 1737610329.0, "url": "https://i.redd.it/ol5adpemjoee1.jpeg", "title": "Cold air exhaust?", "permalink": "/r/GlitchInTheMatrix/comments/1i7wfd3/cold_air_exhaust/", "selftext": "", "media": null, "score": 115, "upvote_ratio": 0.92, "comment_count": 31, "over_18": false}, "45": {"id": "1i482tb", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "2_Large_Regulahs", "link_flair_text": "Discussion", "time": 1737773533.1067927, "created_utc": 1737208727.0, "url": "https://i.redd.it/l1kwwnggdrde1.jpeg", "title": "This painting from 1350 shows two egg-shaped objects in the sky with occupants inside. If this is the type of craft Jake Barber reveals tonight it means they've been here for hundreds of years. ", "permalink": "/r/ufo/comments/1i482tb/this_painting_from_1350_shows_two_eggshaped/", "selftext": "", "media": null, "score": 862, "upvote_ratio": 0.89, "comment_count": 197, "over_18": false}, "46": {"id": "1i7nk5n", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "Disclosure", "time": 1737773534.3690894, "created_utc": 1737583972.0, "url": "https://v.redd.it/2qjyutzucmee1", "title": "Jay Stratton, former director of UAP Task Force (Dave Grusch's former boss) just admitted on camera that he is a first hand witness to Non-Human Intelligence - \"I have seen with my own eyes non-human craft and non-human beings\".", "permalink": "/r/UFOs/comments/1i7nk5n/jay_stratton_former_director_of_uap_task_force/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/2qjyutzucmee1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/2qjyutzucmee1/DASH_96.mp4", "dash_url": "https://v.redd.it/2qjyutzucmee1/DASHPlaylist.mpd?a=1740365533%2CZWJiMWJkMTgyN2NlZDUyOTE2OGIwOGZjYzczY2Q5YmZkODU4ZmFkNjE3ZDg4MmZkMjdmYzAyMGQ4MjhiYjczMg%3D%3D&v=1&f=sd", "duration": 12, "hls_url": "https://v.redd.it/2qjyutzucmee1/HLSPlaylist.m3u8?a=1740365533%2CODQwN2E2OTBkMGVlMDc0YTFkN2JjOGEzZDY0NzU0N2E5MmY4NWE2NWIwZTE5ZjMxZGYxOTcwNzExZDM4MTcwNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 8492, "upvote_ratio": 0.86, "comment_count": 1521, "over_18": false}, "47": {"id": "1i4yboe", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Siciliano777", "link_flair_text": "Image 📷", "time": 1737773536.1531847, "created_utc": 1737292986.0, "url": "https://ibb.co/TBdBzbX", "title": "THIS is what a 20-foot egg shaped UFO might look like.", "permalink": "/r/aliens/comments/1i4yboe/this_is_what_a_20foot_egg_shaped_ufo_might_look/", "selftext": "If they had released a picture last night that looked more like this to support that unimpressive video, it would have been a COMPLETELY different story.\nEverything in the scene is consistent with a retrieval, not a laughable clip of an egg shaped object being lowered onto the ground in the middle of nowhere, with no support troops on the ground. It's ridiculous.\nAnd the scale of the object seemed way off (a lot smaller than 20 feet), with inconsistent shadows, like the one to the right of the egg which would NOT be the shadow cast from a light shining down from above.\nSo when people ask, \"What the hell were you expecting?\" \nSomething like this! ", "media": null, "score": 1154, "upvote_ratio": 0.85, "comment_count": 388, "over_18": false}, "48": {"id": "1i8q8f9", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "r3f3r3r", "link_flair_text": null, "time": 1737773536.9880233, "created_utc": 1737704320.0, "url": "https://www.reddit.com/r/UAP/comments/1i8q8f9/this_full_length_interview_with_jake_barber_that/", "title": "This full length interview with Jake Barber that NN is airing now...", "permalink": "/r/UAP/comments/1i8q8f9/this_full_length_interview_with_jake_barber_that/", "selftext": "is a simply Bob Lazar calibre of material. This is immediately becoming top 5 interviews around the UFO/UAP topic I have listened to and I've been in this for 20 years now.\nHe was just an operator, yes, but the links, references that are made in this interview is like a goldmine for ufologists. Also, it seems he has been investigating this on his own for few years before coming forward. Many things were hinted / mentioned / rumoured before, but he is confirming this stuff and adds new stuff.\nThe fact that he has this company is cementing his testimony for me. It means the guy is totally invested in what he is saying and that he believes it himself. He seems not only to be talking the talk, but also walking the walk.\nhttps://www.youtube.com/watch?v=t37-SKj4rtY", "media": null, "score": 336, "upvote_ratio": 0.93, "comment_count": 157, "over_18": false}, "49": {"id": "1i7twyo", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "ketamineXpille", "link_flair_text": "Rule 6", "time": 1737773537.9367163, "created_utc": 1737601783.0, "url": "https://i.redd.it/wevxp473unee1.png", "title": "A big hard pill.", "permalink": "/r/conspiracy/comments/1i7twyo/a_big_hard_pill/", "selftext": "", "media": null, "score": 3758, "upvote_ratio": 0.82, "comment_count": 548, "over_18": false}, "50": {"id": "1i3zsb9", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Deeznutsthe5th", "link_flair_text": "wants your opinion", "time": 1737773538.5822616, "created_utc": 1737175081.0, "url": "https://www.reddit.com/gallery/1i3zsb9", "title": "Opinions?", "permalink": "/r/bigfoot/comments/1i3zsb9/opinions/", "selftext": "I was fly fishing in Utah and I was taking photos of the scenery and not until the following year I was looking through them and I noticed something in the background and it jumped out at me and gave me a spook because I saw a face jump out at me. I took 2 photos of the same area and noticed a difference in them in the second photo the face seems to have an eye shine and perhaps a tooth showing. I would love to hear some opinions!", "media": null, "score": 286, "upvote_ratio": 0.73, "comment_count": 280, "over_18": false}, "51": {"id": "1i56ill", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "VladimirIsachenko", "link_flair_text": "Info", "time": 1737773539.2146995, "created_utc": 1737314496.0, "url": "https://i.redd.it/55p0ozqe30ee1.png", "title": "A picture taken by a Russian woman back in March 2012, This photo is possibly considered to be one of the iconic Russian Bigfoot photographs. Is this bigfoot carrying a baby?", "permalink": "/r/Cryptozoology/comments/1i56ill/a_picture_taken_by_a_russian_woman_back_in_march/", "selftext": "", "media": null, "score": 266, "upvote_ratio": 0.76, "comment_count": 175, "over_18": false}, "52": {"id": "1i7k79d", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "jacquestrap66", "link_flair_text": "Meme / Humor", "time": 1737773539.6893594, "created_utc": 1737575588.0, "url": "https://i.redd.it/lhv25fhbolee1.jpeg", "title": "Umm... Pets?", "permalink": "/r/cryptids/comments/1i7k79d/umm_pets/", "selftext": "What the hell kind of pet is that?😂", "media": null, "score": 203, "upvote_ratio": 0.96, "comment_count": 29, "over_18": false}, "53": {"id": "1i49e8s", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Zhoana", "link_flair_text": "Theory/Debunking", "time": 1737773539.855839, "created_utc": 1737212667.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1i49e8s/a_light/", "title": "A light", "permalink": "/r/Thetruthishere/comments/1i49e8s/a_light/", "selftext": "Hello everyone, \nI thought I’d share my experience that I had investigated from time to time to try and make sense of it, so far found a few interesting things around this theme but no conclusions. \nTo share my experience:\nI was about 12/13 when I was in a very place in my live, I was filled with rage and negative thoughts, I had an abuse father and I was planning to kill him, the reason I’m sharing this is to share my state of mind at the time. I always liked drawing and I kept drawing dead people and fascinated with death. \nOne day I was at home drawing, and while I used to draw just black / white and red, that day I started to draw a flower that’s when I noticed that was odd, was colorful. My drawing process I don’t always think of what to draw I let my imagination flow. When I started to notice that was odd, I saw what seemed to be a  Spotlight very bright light in front of me, and it spoke. \nI was fully awake, and it felt ancient it didn’t speak with actual words I don’t know how to explain but was in my mind, sometimes it would speak through projecting images instead. It asked if it could come in, I don’t recall my exact reaction I remember thinking if it could be a bad choice to say yes, but agreed to let it come in even not understanding exactly what it meant, it was in front of me. I think I agreed because it didn’t seem like a threat. \nI recall very little of what we talked, I remember bits and pieces it did tell me in the end I was meant to forget. I will try to describe it the best way I can.\nWhen I agreed to let it in, I felt a huge overwhelming powerful feeling of love, truly loved in a deep and infinite way. Next I asked it if it was an angel ( I went to catholic school but I wasn’t religious, still not) to which it replied no. I asked if it was God, to which it replied no. I asked what it was, and it showed me, but I don’t understand it, it seemed like a very ancient being, older than what I could imagine time is. Like if it existed before time existed. \nI asked more things, curiosities of a 12 year old, why is there so much pain the world? Why are we here? Whats the point of all this? To which it replied I don’t remember all the answers, I distinctly remember seeing parts of the world like if it was in real time, some appeared to be just visions. In the end it went away, I remember my mom coming into the room and thinking why cant she see it? That’s how I realize it was in my head. \nWhen it went away it told me one day I was going to try to kill myself and not to do it, it made me promise I wouldn’t, to which I did. Such thought never entered my head at that time. Also it asked me not to waste time trying to learn more about it and move on, to which I agreed and finally once it left I felt clean inside, like all the negativity was washed away. This experience was very deep for me, it changed who I was since then. I remember asking if I would see it again but don’t remember the answer, most likely was no because I never saw it since then.\nI did try to kill myself many years later I remember promising I wouldn’t and thats how I’m still here. I also failed to not try and find more information about what that was, I did look for more people who might of seen the same and found odd connections. To which I will share. Also writing this to try and find others who came across the same being, or similar. ", "media": null, "score": 19, "upvote_ratio": 0.91, "comment_count": 8, "over_18": false}, "54": {"id": "1i7rbqf", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "tastyspark", "link_flair_text": null, "time": 1737773540.009217, "created_utc": 1737594063.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1i7rbqf/being_stalked_by_neighbour/", "title": "Being stalked by neighbour", "permalink": "/r/LetsNotMeet/comments/1i7rbqf/being_stalked_by_neighbour/", "selftext": "I'm really starting to freak out. This all started in early December, he called to my house at 5:45am accusing him of being p*phile and, saying I was shouting all over the apartment block telling everyone. Not true.\nI'd never met this guy before, he lives downstairs and I never go past his house. \nFast forward: few weeks later he knocked on my next door neighbour's house and said he was waiting for me. Neighbour told him to go away and not come back, this was midnight. \nToday: I went to bed it had been a long day but I'd asked my neighbour to leave it at my door. He dropped tnem off at 6pm and sent a text saying he had left the cable there for me.\nI woke up then, around 22:45 because someone knocked on my door. \nI shouted \"who is it??\" 3 times. No reply.\nSo I opened the door and there was a bag sitting there with satin nightdress, satin night gown, chocolates and a phone case. \nDude is evolving am I'm shitting myself living here now ", "media": null, "score": 30, "upvote_ratio": 0.79, "comment_count": 26, "over_18": true}, "55": {"id": "1i536cp", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "TheMordorian", "link_flair_text": "Personal Encounter ", "time": 1737773540.647195, "created_utc": 1737306269.0, "url": "https://www.reddit.com/r/Ghosts/comments/1i536cp/i_saw_my_dead_neighbour_walk_in_the_house/", "title": "I saw my dead neighbour walk in the house.....", "permalink": "/r/Ghosts/comments/1i536cp/i_saw_my_dead_neighbour_walk_in_the_house/", "selftext": "So recently I have lost 3 neighbours in the last 3 months. Two due to cancer and 1 due to sepsis. It's been a sad time for me as I knew them growing up and which the lady that I saw lives or did lived in a bungalow. Her husband is only there now.\nAs I was coming down stairs to make a cup of tea, I went to the sink to fill the kettle to which I saw a figure in a cream jumper walk into the middle bungalow. It was only a split second and which it disappeared.\nI knew it was the lady in the bungalow who sadly passed checking up on her bereaved husband. \nIt's a bittersweet experience", "media": null, "score": 298, "upvote_ratio": 0.98, "comment_count": 27, "over_18": false}, "56": {"id": "1i6ea2x", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Prince100001", "link_flair_text": "Glitch Gif", "time": 1737773540.915501, "created_utc": 1737448856.0, "url": "https://v.redd.it/9b6t94wr5aee1", "title": "I would leave immediately", "permalink": "/r/GlitchInTheMatrix/comments/1i6ea2x/i_would_leave_immediately/", "selftext": "", "media": null, "score": 62, "upvote_ratio": 0.96, "comment_count": 8, "over_18": false}, "57": {"id": "1i89n13", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "total_alk", "link_flair_text": null, "time": 1737773542.170977, "created_utc": 1737655505.0, "url": "https://www.reddit.com/r/ufo/comments/1i89n13/burchett_says_aliens_have_underwater_bases_on/", "title": "Burchett says aliens have underwater bases on Earth", "permalink": "/r/ufo/comments/1i89n13/burchett_says_aliens_have_underwater_bases_on/", "selftext": "Rep. Tim Burchett (R-Tenn.) said Wednesday he believes aliens have underwater bases on Earth.\n“I just think travelin’ light years, I think it happens. I think it’s possible in the vastness of God’s great universe. I mean, light years, you know, the light from those stars that we see at night left there before the time of Christ,” Burchett said on former Rep. Matt Gaetz’s (R-Fla.) One America News show, in a clip highlighted by Mediaite.\nIn April, Burchett implied in the wake of a classified briefing on Unidentified Anomalous Phenomena (UAP), also known as UFOs, that the government is purposefully concealing information on them to the American public.\n“I think there’s a cover-up,” Burchett said at the time.\n“There are tens of millions of dollars that we’ve spent investigating these things. We’ve had departments tell us that they have recovery units, but they won’t release full reports. Everything’s covered up,” Burchett added.\nIn the summer of 2023, following a series of hearings during which multiple whistleblowers alleged the government hid information about ultra-high-tech craft of foreign or extraterrestrial origin, Burchett asked the intelligence community’s inspector general to further investigate the claims.\n“When they tell me something’s moving at hundreds of miles an hour underwater, and our capabilities … and these things, this one was, it was large as a football field underwater. And this was a documented case, and … and I have an admiral telling me this stuff,” Burchett said Wednesday.\nIn 2023, Burchett also headed up an effort to start a UAP caucus in the House, and he is a part of a group of lawmakers from both parties that have consistently pushed for greater transparency from officials in the military on government knowledge on UAP.\nsource: https://thehill.com/homenews/house/5102361-tim-burchett-aliens-earth/", "media": null, "score": 587, "upvote_ratio": 0.92, "comment_count": 196, "over_18": false}, "58": {"id": "1i87tpu", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "FeathersOfTheArrow", "link_flair_text": "Disclosure", "time": 1737773543.4264362, "created_utc": 1737651036.0, "url": "https://i.redd.it/btvm382owree1.png", "title": "Greenewald spitting facts", "permalink": "/r/UFOs/comments/1i87tpu/greenewald_spitting_facts/", "selftext": "I'm awfully tired of promises, paid documentaries and \"trust me bro\" testimonials.", "media": null, "score": 4298, "upvote_ratio": 0.88, "comment_count": 707, "over_18": false}, "59": {"id": "1i67jq8", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Ill-Speed-7402", "link_flair_text": "News :illuminati:", "time": 1737773544.9761155, "created_utc": 1737424383.0, "url": "https://v.redd.it/qwyr08do69ee1", "title": "Trump just told his Chief of Staff Susie Wiles on the fly to \"immediately\" find out for him what the drone was. “I would like to find out what that was and tell the people.” “I can’t see that being possible (adversaries) before then you would see things blowing up but we will find soon.\"", "permalink": "/r/aliens/comments/1i67jq8/trump_just_told_his_chief_of_staff_susie_wiles_on/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/qwyr08do69ee1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/qwyr08do69ee1/DASH_96.mp4", "dash_url": "https://v.redd.it/qwyr08do69ee1/DASHPlaylist.mpd?a=1740365543%2COGU1OTFlYjJhYWQwNTY1YzRhMmI2YmFkYWZhMjRjNmZlMGMzZmQzOTM2MGNhYzI4YTE5YTFmZDdiM2JlY2MwYw%3D%3D&v=1&f=sd", "duration": 34, "hls_url": "https://v.redd.it/qwyr08do69ee1/HLSPlaylist.m3u8?a=1740365543%2CMjM5ZTA2ZDM3MThjNjMwMTI0YjY3MDFkNzBjYjY3ZTVkYTNhM2E4YTFjMjM5YjhjY2U1MDY4MTgyYTEwZDcxMA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1140, "upvote_ratio": 0.86, "comment_count": 290, "over_18": false}, "60": {"id": "1i8jk9d", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": null, "time": 1737773545.856541, "created_utc": 1737681214.0, "url": "https://www.google.com/amp/s/www.newsmax.com/amp/politics/chuck-schumer-donald-trump-ufo/2025/01/23/id/1196299/", "title": "Schumer Calls on Trump to Declassify UFOs", "permalink": "/r/UAP/comments/1i8jk9d/schumer_calls_on_trump_to_declassify_ufos/", "selftext": "", "media": null, "score": 332, "upvote_ratio": 0.98, "comment_count": 9, "over_18": false}, "61": {"id": "1i6mhsf", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "External-Noise-4832", "link_flair_text": "Rule 6", "time": 1737773547.4630256, "created_utc": 1737476867.0, "url": "https://i.redd.it/8w23ndxridee1.jpeg", "title": "Memory hole.", "permalink": "/r/conspiracy/comments/1i6mhsf/memory_hole/", "selftext": "Wikipedia - The 1985 MOVE bombing, locally known by its date, May 13, 1985, was the bombing and destruction of residential homes in the Cobbs Creek neighborhood of Philadelphia, Pennsylvania, United States, by the Philadelphia Police Department during an armed standoff with MOVE, a black liberation organization. As Philadelphia police attempted to evict MOVE members from a house, they were shot at. Philadelphia police then dropped two explosive devices from a helicopter onto the roof of the occupied house. For 90 minutes, the Philadelphia Police Department allowed the resulting fire to burn out of control, destroying 61 previously evacuated neighboring homes over two city blocks and leaving 250 people homeless. Six adults and five children were killed in the attack, with one adult and one child surviving. A lawsuit in federal court found that the city used excessive force and violated constitutional protections against unreasonable search and seizure.", "media": null, "score": 3587, "upvote_ratio": 0.96, "comment_count": 349, "over_18": false}, "62": {"id": "1i6cv8w", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "armedsquatch", "link_flair_text": "Not Bigfoot", "time": 1737773548.3213882, "created_utc": 1737442452.0, "url": "https://i.redd.it/sr41jdufoaee1.jpeg", "title": "This trail cam pic is just to amazing not to share", "permalink": "/r/bigfoot/comments/1i6cv8w/this_trail_cam_pic_is_just_to_amazing_not_to_share/", "selftext": "Decided to put out some extra kibble for a murder of crows I’ve been training during this crazy cold snap here in the PNW and do a shake down of a new trail  cam.  It just my 15yr old cat but it may be the coolest pic I’ve ever taken. ", "media": null, "score": 258, "upvote_ratio": 0.83, "comment_count": 49, "over_18": false}, "63": {"id": "1i46s2d", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "jakarta_guy", "link_flair_text": null, "time": 1737773548.9532416, "created_utc": 1737204249.0, "url": "https://x.com/Coelacanthuss/status/1880214933155266866?t=Mau5_9XWoTAQI_E4-sluBg&s=19", "title": "A Coelacanth was caught recently ", "permalink": "/r/Cryptozoology/comments/1i46s2d/a_coelacanth_was_caught_recently/", "selftext": "", "media": null, "score": 228, "upvote_ratio": 0.92, "comment_count": 54, "over_18": false}, "64": {"id": "1i7ea46", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "diaperfeast", "link_flair_text": "Art", "time": 1737773549.5306892, "created_utc": 1737561303.0, "url": "https://i.redd.it/umjda1kuhkee1.jpeg", "title": "Children of Frogman", "permalink": "/r/cryptids/comments/1i7ea46/children_of_frogman/", "selftext": "I’ve been working on a Frogman comic book.", "media": null, "score": 159, "upvote_ratio": 0.98, "comment_count": 10, "over_18": false}, "65": {"id": "1i8ehaq", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Sudden_Assumption553", "link_flair_text": "Ghosts/Apparitions", "time": 1737773549.6853354, "created_utc": 1737667474.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1i8ehaq/ghost_and_the_moving_ball_old_man/", "title": "Ghost and the moving ball + old man", "permalink": "/r/Thetruthishere/comments/1i8ehaq/ghost_and_the_moving_ball_old_man/", "selftext": "I don't know if it's true, these stories have been told by family that has happend to me. Still a fun story to tell.\nIf you believe children can see ghosts...\nAt an extremely young age, playing kick to kick on a footy field. My uncle and I were out alone. The winds are sometimes pretty strong in the area but not strong enough move an object as heavy as a ball. \nWhen my uncle kicked the ball to me, I kicked it weirdly (Not as all towards my uncle). As doing so A man is just on a stroll taking a shortcut through the park. \n\"Kick it here over here\" As a child in an intense game of kick to kick would ask a person passing by. \nBut only, that man was apparently never there, invisible. I have no idea what I saw, or how I was the only one able to see something? \nBut proof it was actually there, when i kicked that ball, it slowly stopped, than started rolling towards back to me. \nThat ghost was so polite. \nSmaller story: \nI spoke to an old man in my room, the house I grew up in were surrounded by elderly. The man was kind, we'd causally speak about each other's days, I came out telling my mum about my imaginary friend whom was a bit too real. ", "media": null, "score": 12, "upvote_ratio": 0.93, "comment_count": 2, "over_18": false}, "66": {"id": "1i6yc85", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Bubbly_Argument5886", "link_flair_text": null, "time": 1737773549.8273528, "created_utc": 1737506663.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1i6yc85/man_in_the_bushes/", "title": "Man in the bushes", "permalink": "/r/LetsNotMeet/comments/1i6yc85/man_in_the_bushes/", "selftext": "So this story takes place about a year ago.Me and my bf who at the time just turned legal age was strolling down a recreational park path.Now bare in mind it wasn't late,around 7pm,but in england in winter it gets dark around 4ish.Funnyily enough we was having a debate (this will come back up later) and speaking quite loud and stupidly even in the pitch black wasn't at all paying attention to our surroundings(stupid i know) but we have done the same walk out of the recreational park 3 times a week for the last month.\nAround 10 mins into the 30 minute walk back into our little towns town center and any point of civilisation we started hearing leaves crunch.Now I'm an extremely paranoid person like i'm still afraid to sleep in the dark but he isn't so i chose to ignore it and pretend i didn't hear anything it was a animal though from what i can remeber the steps was way to heavy to be done by a animal in England.So we continued to have our conversation while i pushed it to the back of my mind.The problem with the conversation was the context was relating to back when i was 14.i was vividly discussing about 14,painting a picture without specifiying i'm not a child.I stand at 5'3 whereas my bf is 6,4 But both clearly sound immature and i can and have easily be mistaken for 14-15 still.In the height of discussion we end up stopping on the path (another stupid fault of our own i know but for a miniute so i didn't hear anything and almost chalked it up to paranoia).\nThe leaves behind thick bushes started crunching again.My boyfriend decided to get his flashlight up on his phone and try see through the trees while i stand back facing away from them about 150cm apart from him.i was still talking assuming he didn't see anything since he was staring trying to lean over bushes for abit.He then says no come on let's just walk faster to be safe and forcefully moves me along.After only five minutes of speed walking we make it back near civilisation.catching my breath i ask if he seen anything.Now in the light i can see how pale his face is,then he proceeds to tell me.This is his words from what i can remember,\"I honestly couldn't see anything but while you was chattin.The footsteps was moving away from me towards your direction.Like they was going foward just away from me,something shined off my flash light and i panicked and dragged you along.\"\nHe's since tried to peaceafy my mind saying ye it was a animal,it could have been.Though the consistency of the steps and the fact a blinding light didn't scare a animal off,such as deer, infact made it come closer makes me believe it was something or someone more sinister.So creepy individual hiding in bushes let's not meet again.", "media": null, "score": 17, "upvote_ratio": 0.77, "comment_count": 2, "over_18": true}, "67": {"id": "1i4d3ht", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Captaincourt17", "link_flair_text": null, "time": 1737773550.588347, "created_utc": 1737222752.0, "url": "https://i.redd.it/3gp23ql5jsde1.jpeg", "title": "A music box that hasn’t been touched in years (it’s on a high up shelf for display) randomly played one note while I was in my bedroom, by myself.", "permalink": "/r/Ghosts/comments/1i4d3ht/a_music_box_that_hasnt_been_touched_in_years_its/", "selftext": "There are two music boxes on the shelf. One is a snow globe with a carousel horse inside it and the other is a carousel horse (see attached picture). I haven’t touched them in years. My room is a normal temperature, not too cold and not too hot. It was not from the TV because I replayed the scene that was playing when I heard the note and it didn’t play again. It was not from my phone. My phone was on silent and there also weren’t any new notifications. Why would this happen? I didn’t have anyone close to me recently pass. Just looking for a reasonable explanation. I don’t recall ever having an experience similar to this in this house and I’ve lived here my whole life. \nThanks in advance! ", "media": null, "score": 154, "upvote_ratio": 0.9, "comment_count": 33, "over_18": false}, "68": {"id": "1i69bj1", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "theauggieboy_gamer", "link_flair_text": "Glitch Pic", "time": 1737773550.8751113, "created_utc": 1737429790.0, "url": "https://www.reddit.com/gallery/1i69bj1", "title": "Sign duplication glitch? (Yes, there’s more off camera)", "permalink": "/r/GlitchInTheMatrix/comments/1i69bj1/sign_duplication_glitch_yes_theres_more_off_camera/", "selftext": "", "media": null, "score": 47, "upvote_ratio": 0.75, "comment_count": 17, "over_18": false}}}