{"_default": {"1": {"id": "1g7rf1q", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "uapinvestigations1", "link_flair_text": null, "time": 1729911508.0766816, "created_utc": 1729400895.0, "url": "https://i.redd.it/thu4jihrguvd1.jpeg", "title": "Every night ", "permalink": "/r/ufo/comments/1g7rf1q/every_night/", "selftext": "", "media": null, "score": 2500, "upvote_ratio": 0.99, "comment_count": 52, "over_18": false}, "2": {"id": "1gb3s6q", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "random_access_cache", "link_flair_text": "Discussion", "time": 1729911510.0016017, "created_utc": 1729779689.0, "url": "https://www.reddit.com/r/UFOs/comments/1gb3s6q/friendly_reminder_that_videos_that_are_now/", "title": "Friendly reminder that videos that are now acknowledged to be real by the US government, were leaked a decade earlier to a conspiracy forum, where they were convincingly \"debunked\"", "permalink": "/r/UFOs/comments/1gb3s6q/friendly_reminder_that_videos_that_are_now/", "selftext": "On 3rd Feb 2007, a member of a well known conspiracy forum called AboveTopSecret posted a new thread claiming to be an eyewitness to the Nimitz event. This thread can be found here:\nhttps://www.abovetopsecret.com/forum/thread265697/pg1\nA day later the same user posts another thread, this time with a video of the actual event. Here's the link to the original post:\nhttps://www.abovetopsecret.com/forum/thread265835/pg1\nIn this thread, what you see is an effort by the community to verify/debunk the video, pretty much identical to what we see in this sub. Considering many inconsistencies, suspicious behavior by the poster, and a connection to a group of German film students who worked on CGI of a spaceship, the video was ultimately dismissed as a hoax.\nConsider the following quotes from participants in that thread:\n\"The simple fact is that the story, while plausible, had so many inconsistencies and mistakes in that it wasn't funny. IgnorantApe pretty much nailed it from the start. The terminology was all wrong, the understanding of how you transfer TS material off the TS network was wrong, timelines were out, and that fact that the original material was misplaced is beyond belief. That the information was offered early, but never presented despite requests from members, is frankly insulting to our intelligence.\"\n\"His “ cred “ as an IT technician was questioned because he displayed basic ignorance regards quite simple IT issues [...] His vocabulary , writing style , idioms , slag etc was questioned – because I do not believe that he is an American born serviceman [ naval ]\" \nAnd most importantly, see this comment on the first page to see how this video was ultimately dismissed to be a hoax, following a very logical investigation:\nhttps://www.abovetopsecret.com/forum/thread265835/pg1#pid2927030\nIn short, the main conclusion is that the video was hosted on a site directly related to a group of German film students, with at least one of their project involving CGI of a spaceship. Together with OP's own inconsistencies, it is not hard to see why that the video is fake was virtually a fact.\nAs we now all know, this is the video that a decade later would appear on the New York Times (at this point canonical) article (link to the original NYT article), prompting the US Government to eventually acknowledge the videos are real. At this point I don't think it's even up to debate.\nThe idea that a debunked video from a conspiracy forum from 2007 would end up as supporting proof at a public congress hearing about UFOs with actual whistleblowers is, to say the least, mind boggling. It is fascinating to go through the original threads and see how people reacted back then to what we know is now true. It is honestly quite startling just how strong was the debunk (I believe most of us would come to the same conclusion today if it wasn't publicly acknowledged by the US).\nI feel this may be the most crucial thing to take into account whenever we are considering videos related to this topic. Naturally, we want to verify the videos we're seeing: we need to be careful to make sure that we do not deem a fake as something real. But one thing we are sometimes forgetting is to make sure that we are not deeming something real as fake.\nReal skepticism is not just doubting everything you see, it's also doubting your own doubt, critically. We all have our biases. Media claiming to depict UFOs should be examined carefully and extensively. The least we can do is to accept that a reasonable explanation can always be found, which is exactly how authentic leaks were dismissed as debunked fakes, following a very logical investigation.\nAsk yourself sincerely: what sort of video evidence will you confidently accept as real? If the 5 observables are our supposed guidelines (although quite obviously we can accept that most authentic sightings most likely don't have them), would a video that ticks all these boxes convince you it's real? Or would you, understandably, be more tempted to consider it to be a fake considering how unnatural to us these 5 observables may seem?\nThe truth most likely is already here somewhere, hiding in plain sight. This original thread should be a cautionary tale. A healthy dose of skepticism is always needed, but just because something is likely to be fake does not mean it is fake, and definitely does not mean it's \"debunked\".\nWe should all take this into account when we participate in discussions here, and even moreso we should be open to revisit videos and pictures that are considered to be debunked, as a forgettable debunked video back then would eventually become an unforgettable historical moment on the UFO timeline. There is not a single leak that the government would not try to scrub or interfere with, and this should be always taken into account. Never accept debunks at face value, and always check the facts yourself, and ask yourself sincerely if it proves anything. If it does - it often does - then great. If not, further open minded examination is the most honest course of action.", "media": null, "score": 5032, "upvote_ratio": 0.84, "comment_count": 1152, "over_18": false}, "3": {"id": "1g81lws", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "I_knowthetruth", "link_flair_text": "Discussion :table:", "time": 1729911512.8670142, "created_utc": 1729439021.0, "url": "https://i.redd.it/2fam2nr4mxvd1.jpeg", "title": "Opinion: If aliens walk among us, there is 100% chance one was in this room observing. ", "permalink": "/r/aliens/comments/1g81lws/opinion_if_aliens_walk_among_us_there_is_100/", "selftext": "It’s fun to think about. If you were an alien, wouldn’t you want to see first hand what we know? ", "media": null, "score": 3615, "upvote_ratio": 0.88, "comment_count": 636, "over_18": false}, "4": {"id": "1g8lwxf", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "233C", "link_flair_text": null, "time": 1729911513.3421457, "created_utc": 1729504413.0, "url": "https://www.eurasiantimes.com/suspected-hi-speed-russian-uavs-spy-on-german/?amp", "title": "Suspected Hi-Speed Russian UAVs Spy On German Nuclear Power Plant; Police Drone Fails To Catch-Up (August 2024)", "permalink": "/r/UAP/comments/1g8lwxf/suspected_hispeed_russian_uavs_spy_on_german/", "selftext": "", "media": null, "score": 115, "upvote_ratio": 0.93, "comment_count": 9, "over_18": false}, "5": {"id": "1g7yqc7", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Dazzling_Industry719", "link_flair_text": null, "time": 1729911514.6525524, "created_utc": 1729430982.0, "url": "https://i.redd.it/i8yyqj68ywvd1.jpeg", "title": "Sad Truth", "permalink": "/r/conspiracy/comments/1g7yqc7/sad_truth/", "selftext": "", "media": null, "score": 6142, "upvote_ratio": 0.92, "comment_count": 121, "over_18": false}, "6": {"id": "1gahyzl", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Vib_ration", "link_flair_text": null, "time": 1729911514.9354055, "created_utc": 1729708656.0, "url": "/r/u_SoColdSZA/comments/18xusu4/introduction_to_life_force/", "title": "Introduction to Life Force", "permalink": "/r/conspiracyfact/comments/1gahyzl/introduction_to_life_force/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.67, "comment_count": 0, "over_18": false}, "7": {"id": "1g7yf73", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Molech996", "link_flair_text": "PGF", "time": 1729911515.9113052, "created_utc": 1729430049.0, "url": "https://i.redd.it/jm29f5tdvwvd1.jpeg", "title": "On this day,the Patterson-Gimlin film was filmed in Northern California in 1967.", "permalink": "/r/bigfoot/comments/1g7yf73/on_this_daythe_pattersongimlin_film_was_filmed_in/", "selftext": "", "media": null, "score": 1145, "upvote_ratio": 0.99, "comment_count": 48, "over_18": false}, "8": {"id": "1g8r5w5", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "stillish", "link_flair_text": "Sightings/Encounters ", "time": 1729911516.9969616, "created_utc": 1729521295.0, "url": "https://i.redd.it/t5djacwre4wd1.jpeg", "title": "Man-eating Sturgeon of Lake Shasta", "permalink": "/r/Cryptozoology/comments/1g8r5w5/maneating_sturgeon_of_lake_shasta/", "selftext": "There's plenty of lore surrounding Mt Shasta but this topic is unrelated to the Aliens and ancient migration of the Lemurians.\nI used to live in the area and was told a story from some locals about a dive team that went into the lake to search for the body of a girl that drowned. The story is that one of the divers was grabbed and pulled into a cave in the wall of the lake by a giant sturgeon, witnessed by the other divers. They said there was an article in the local papers about it at the time but I haven't been able to dig it up. Does anyone else have any information on these supposed giant sturgeon big enough to eat men in Shasta Lake or evidence supporting the claim of the diver being eaten?", "media": null, "score": 5379, "upvote_ratio": 0.97, "comment_count": 233, "over_18": false}, "9": {"id": "1ga1v19", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Glittering-Cat7523", "link_flair_text": "Bedroom", "time": 1729911517.256201, "created_utc": 1729656990.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1ga1v19/michelin_man_was_examining_me_in_my_sleep/", "title": "michelin man was examining me in my sleep.", "permalink": "/r/Humanoidencounters/comments/1ga1v19/michelin_man_was_examining_me_in_my_sleep/", "selftext": "Hey guys, a few weeks ago (mid/late September or early October) I woke up because my foot felt really weird and I saw something at the foot of my bed bent over as it held my big toe. I fell asleep right after but it freaked me out really bad, no one was in my room and it was about 4:00am or so. It looked like a michelin man but about 5’5-5’7 and had a dome shaped helmet with tubes in the back that led to the back of its suit. I’m not sure if I’ve posted under the right flare but this really had me upset for a while and I haven’t seen it again or felt anything since I’ve been praying (I’m a Christian) and rebuking the devil and anything that’s not made in the lord’s image. It’s like 12:12pm rn but I can draw what I saw to the best of my ability and post it tomorrow if anyone is interested. Bonus, about 5 years ago, my dad and I were driving down a gravel road to pick my big brother up from work and as we turned a corner I saw what looked like a child sized (2-3 foot tall) stick bug run behind a fire hydrant and haven’t seen anything since. I’ve got a few more stories too if anyone is interested. (This happened this year (2024 in Ontario Canada)", "media": null, "score": 58, "upvote_ratio": 0.94, "comment_count": 42, "over_18": false}, "10": {"id": "1gaj3oo", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "porkchop-666", "link_flair_text": null, "time": 1729911518.0647838, "created_utc": 1729711830.0, "url": "https://i.redd.it/jmms6g1c5kwd1.jpeg", "title": "My Daughter made this Wendigo costume", "permalink": "/r/cryptids/comments/1gaj3oo/my_daughter_made_this_wendigo_costume/", "selftext": "My daughter made this for Halloween this year. ", "media": null, "score": 312, "upvote_ratio": 0.93, "comment_count": 28, "over_18": false}, "11": {"id": "1g93uge", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "ThenArrival2367", "link_flair_text": "Legend/Folklore", "time": 1729911518.2534707, "created_utc": 1729552754.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1g93uge/skinwalker_experience/", "title": "Skinwalker experience?", "permalink": "/r/Thetruthishere/comments/1g93uge/skinwalker_experience/", "selftext": "I don’t know when exactly this was, maybe 2-3 years ago, I can’t remember the time of year but it was deathly cold.\nI grew up in a small seaside town, and I lived in the most isolated part of town, and there wasn’t another house for at least half a kilometre. \nAround my house was a fairly densely wooded area which had a dog walking trail which led up to a vast array of fields\nWhich I walked my white German shepherd, Polar, every day. \nPolar was an absolute enormous dog, I’m 6’2 and when he jumps up at me he can lick my face. So I always felt safe walking around him at night, despite me being a big dude.\nNow, one night I was walking polar, and it was uneventful until when I started to walk back. My phone was on 4-5% something like that, and it was pitch black. \nI couldn’t see a damn thing, not even my dog if it wasn’t for his lighted up collar.\nSo I turned my phone flash on to illuminate my trail back to my house,\nEven though I had a good 15 minutes to walk before I came off trail. I knew this battery wasn’t going to last, but I knew where I was going so I wasn’t too worried.\nPolar then started furiously drag on his lead and it started me so much it almost lifted me off my feet but I managed to restrain him, but he was going absolutely apeshit at something on the other side of the woods. I tried to calm him down but it took absolutely forever to get him to stop barking. I tried to carry on but I kept hearing movement amongst the foliage in the woods, maybe just a squirrel I thought. I was wrong.\nI heard a horrific howling noise coming from around 30-40 away from us. It sounded so distorted and just wrong, it didn’t sound like any animal id ever heard in my life, it was too loud to be an animal, but it sounded too deliberately evil to be an one. I hightailed it out of there, polar by my side, absolutely sprinting for the hills. I heard loud, quick footsteps behind me, and I thought someone was chasing us trying to scare us, and at this point my phone was on 1% and with that I used the battery I had to see what was behind us\nI don’t even know how to describe what I saw but every part about this ‘thing’ was long, its arms, legs, neck, everything. It was running on two feet, but with a weird sort of limp, then it would crawl on all fours and then get up again. It was horribly thin. Its decaying skin or fur was wrapped tightly over its bones, and it absolutely terrified me, but what scared me the most is when i saw that the creatures face, looked exactly like my dog.\nI managed to get home safely, but I couldn’t sleep, and despite how lovely my dog is, I don’t look at him the same.", "media": null, "score": 23, "upvote_ratio": 0.82, "comment_count": 7, "over_18": false}, "12": {"id": "1g7gy4p", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Sparkly_Tiara24", "link_flair_text": null, "time": 1729911518.4614158, "created_utc": 1729366985.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1g7gy4p/i_quit_dealing_after_i_was_mugged/", "title": "I quit dealing after I was mugged.", "permalink": "/r/LetsNotMeet/comments/1g7gy4p/i_quit_dealing_after_i_was_mugged/", "selftext": "I'm not proud of any of this.\nI have a big family and we’re super close. When I was in high school, my aunt was dating this guy who seemed really wealthy, but no one really knew what he did. I think anyone could have guessed though.\nI asked my aunt to introduce me to her boyfriend and we talked about how I could work for him.\nWithout going into too much detail, he let me work for him. I sold to some people I knew. I went to high school in an area where there was a lot of drugs. I knew a few boys who claimed they were already using this stuff. I offered to sell it to them. And surprisingly, they had really big orders for me. I didn’t ask any questions. I just went along with it.\nI was making about $3,000 a month from this. Not enough to retire or anything, but definitely more than most 17-year-olds made. I never made a point to flaunt my money or anything. I think I kept it well hidden. At least I thought I did. What bothers me is that there's no way of knowing.\nOne Saturday morning, I walked over to my friend’s house for a birthday party. Not a wild one or anything, just a cute little breakfast. On my way home, this guy I’d never seen before pulled over and got out of the car. He was well dressed and a bit older.\nWhen he got out of his car, I thought he was a cop. He was acting like a cop. I was ready to surrender because I didn't think I could make an escape. But then he pulled out a switchblade and said to give him my purse.\nHe said something like “don’t act dumb, girl. I know you have money. It’s okay; we can make this easy if you just give me your purse.”\nAgain, I can't really explain this but that just felt like such a cop-like think to say.\nI don’t know if you’ve ever been in that kind of situation; I hope you haven’t. But you kind of just freeze when someone surprises you like that. It’s not really fear. Your body doesn’t know how to react. I almost think my body didn't let me get too scared, because if it did, then I'd have a heart attack, like my body said \"wait until it's safe, then panic.\"\nFirst, I think I felt relieved that he wasn’t actually a cop—thank goodness for that! Second, when he said it was okay and that we could make it easy, it actually calmed me down a bit.\nSo I managed to say “Okay, can I just give you my cash? My purse has my phone and pictures and other stuff.”\nHe said ok that. I opened my purse and took out all the cash. I had about $200. He watched me closely as I did it.\nHe took the money, said something like \"if you tell anyone, I will find out,\" and he left. I felt really calm the rest of the walk home.\nThe next morning, it hit me that I had been mugged. That’s when the panic set in. I started shaking and crying.\nEven as I'm writing this story now, it gives me chills. I had never seen that guy before. When he said “I know you have money,” I don’t know if he meant he knew about my dealing or if he was just trying to scare me.\nHonestly, I'm really glad this all happened because it made me get out of that business at the right time. Things were only going to get more dangerous from there. It’s still scary thinking about it, but that guy saved me without even realizing it.\nI told my aunt's boyfriend what happened and that I was too scared to keep doing this trade anymore. He told me to send all my customers to him instead. I did and that was the end of it for me. It's been almost 10 years now and I haven’t looked back since!", "media": null, "score": 109, "upvote_ratio": 0.93, "comment_count": 7, "over_18": true}, "13": {"id": "1g9k0z0", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "sasbergers", "link_flair_text": null, "time": 1729911518.9978602, "created_utc": 1729608728.0, "url": "https://i.redd.it/kpv82z3rmbwd1.jpeg", "title": "The last photograph of Vicki Weaver before she was killed by an FBI sniper 22 Aug 1992 in the Ruby Ridge standoff. It was taken by USMS surveillance the morning of 21 Aug 1992 and was evidence at the subsequent trial.", "permalink": "/r/truecreepy/comments/1g9k0z0/the_last_photograph_of_vicki_weaver_before_she/", "selftext": "", "media": null, "score": 257, "upvote_ratio": 0.98, "comment_count": 14, "over_18": false}, "14": {"id": "1g8qznk", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Feisty_Lime8450", "link_flair_text": null, "time": 1729911519.2424803, "created_utc": 1729520837.0, "url": "https://www.reddit.com/r/threekings/comments/1g8qznk/red_door_yellow_doorexperience/", "title": "Red door yellow door-experience", "permalink": "/r/threekings/comments/1g8qznk/red_door_yellow_doorexperience/", "selftext": "My friend and I played this game in the afternoon earlier today. At first, we tried using our voices (with me as the guide and Friend as the traveller) and nothing happened. But when I was the traveller and she was the guide, I felt my arms growing very heavy, as if someone was pushing down on them.\nThen, we decided to use voice recordings instead, with Friend as the guide. I saw one white door in a white room, and went through it. There, I saw a room with doors from the floor to the ceiling. I went through one of them, and I ended up in a corridor with hotel carpet on the ground. I joked that it looked a little like the backrooms. The moment Friend asked me if there was anyone else there, I saw a shadowey figure charging at me, then screamed at her to wake me up.\nWhen we tried again with me as the guide, Friend did not see any doors, but felt as if, in her own words, 'the gravity was (is) wrong, as if I am meant to be standing up'. I'm thinking of trying it again now.\nThe weird thing is, I've actually seen the shadow figure before, when I did a ritual to see ghosts. When I visualised my childhood home, it was in the living room/kitchen (the two rooms were connected.) I'm not sure if that has anything to do with it, though.", "media": null, "score": 14, "upvote_ratio": 0.95, "comment_count": 0, "over_18": false}, "15": {"id": "1gbdp5i", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Biffsmack", "link_flair_text": "Captured Apparition ", "time": 1729911520.0991886, "created_utc": 1729804750.0, "url": "https://i.redd.it/si321ismtrwd1.jpeg", "title": "My mum managed to capture the \"Black Abbott\" at St Mary's Abbey in York, UK.", "permalink": "/r/Ghosts/comments/1gbdp5i/my_mum_managed_to_capture_the_black_abbott_at_st/", "selftext": "Apparently, after getting some more information, he's known to wander the ground just carrying on with his own Routine! If you can't see him, he's in front of the tree on the left.", "media": null, "score": 1995, "upvote_ratio": 0.93, "comment_count": 195, "over_18": false}, "16": {"id": "1g9nvu7", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ShacloneMan91", "link_flair_text": "Glitch Pic", "time": 1729911520.4512339, "created_utc": 1729618273.0, "url": "https://i.redd.it/kerio815fcwd1.jpeg", "title": "Caught the aurora 2 weeks ago and saw a weird X in the sky", "permalink": "/r/GlitchInTheMatrix/comments/1g9nvu7/caught_the_aurora_2_weeks_ago_and_saw_a_weird_x/", "selftext": "", "media": null, "score": 1483, "upvote_ratio": 0.97, "comment_count": 74, "over_18": false}, "17": {"id": "1g73bo3", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "uapinvestigations1", "link_flair_text": null, "time": 1729911521.90013, "created_utc": 1729321327.0, "url": "https://i.redd.it/h31phiy5wnvd1.jpeg", "title": "What do you think this UFO was? ", "permalink": "/r/ufo/comments/1g73bo3/what_do_you_think_this_ufo_was/", "selftext": "", "media": null, "score": 1342, "upvote_ratio": 0.89, "comment_count": 970, "over_18": false}, "18": {"id": "1g86bq2", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "shogun2909", "link_flair_text": "News", "time": 1729911524.3922017, "created_utc": 1729451179.0, "url": "https://v.redd.it/cpm1t0f8myvd1", "title": "In his first public appearance since May, Nell reiterates his assertion that the Non-Human Intelligence phenomenon is real & has had a long-standing interaction with humanity", "permalink": "/r/UFOs/comments/1g86bq2/in_his_first_public_appearance_since_may_nell/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/cpm1t0f8myvd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1234, "scrubber_media_url": "https://v.redd.it/cpm1t0f8myvd1/DASH_96.mp4", "dash_url": "https://v.redd.it/cpm1t0f8myvd1/DASHPlaylist.mpd?a=1732503522%2CMjUzODdiNGI1MDM5MGJhZGVmZjJkZDQ4OWY2OTI5MDBkYzBkM2EyOGQ1OGY3NmJkYWJhOTgxZjhjNDRhN2E4OQ%3D%3D&v=1&f=sd", "duration": 465, "hls_url": "https://v.redd.it/cpm1t0f8myvd1/HLSPlaylist.m3u8?a=1732503522%2CMzE2NDdkMjU4YzIxNmMzNGM5MzgyOGVlZjE3YmY5NDZmZjMwYzIzNjI0OWFkMzc0ZDg3Y2JjZjNiZGZlNDYxOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4144, "upvote_ratio": 0.88, "comment_count": 625, "over_18": false}, "19": {"id": "1g8k98l", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "littlespacemochi", "link_flair_text": "Video", "time": 1729911527.00115, "created_utc": 1729496630.0, "url": "https://v.redd.it/7of0iyffd2wd1", "title": "Danny Sheehan reveals the location of a UFO base", "permalink": "/r/aliens/comments/1g8k98l/danny_sheehan_reveals_the_location_of_a_ufo_base/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/7of0iyffd2wd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 652, "width": 1280, "scrubber_media_url": "https://v.redd.it/7of0iyffd2wd1/DASH_96.mp4", "dash_url": "https://v.redd.it/7of0iyffd2wd1/DASHPlaylist.mpd?a=1732503524%2CYjA3ZmE5OGM1MDc2ODBlMTE4ZWRiYjMyMjUyMGYzNzQzYTJmZDg3NTk0ODliMmFkMDBkNGQ1OTE0MWFiNmZmNA%3D%3D&v=1&f=sd", "duration": 54, "hls_url": "https://v.redd.it/7of0iyffd2wd1/HLSPlaylist.m3u8?a=1732503524%2CYjQ2OTU4MTE0ZmUyZWM3NTAwODEyM2IwNDQ1ZDBkZTk2YWNlZjZiYmJjODZiMjM2ZmNmMWU0ZDE4NmExZTJkMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2388, "upvote_ratio": 0.88, "comment_count": 647, "over_18": false}, "20": {"id": "1g7urra", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": null, "time": 1729911527.6349993, "created_utc": 1729415935.0, "url": "https://i.redd.it/7r59oixjovvd1.png", "title": "WELCOME TO GLOBAL DISCLOSURE DAY 🌎 🛸 YouTube livestream begins at 10:00am PST | 1:00pm EST | 7:00 PM CET - Join us for this worldwide event! Speakers include Ross Coulthart, Karl Nell, Lue Elizondo, Danny Sheehan and many more.", "permalink": "/r/UAP/comments/1g7urra/welcome_to_global_disclosure_day_youtube/", "selftext": "", "media": null, "score": 89, "upvote_ratio": 0.87, "comment_count": 31, "over_18": false}, "21": {"id": "1gatlqw", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Millennial_Lotus", "link_flair_text": null, "time": 1729911528.9734042, "created_utc": 1729741342.0, "url": "https://i.redd.it/vasa4v43lmwd1.jpeg", "title": "Makes me wonder", "permalink": "/r/conspiracy/comments/1gatlqw/makes_me_wonder/", "selftext": "", "media": null, "score": 5710, "upvote_ratio": 0.89, "comment_count": 246, "over_18": false}, "22": {"id": "1g7bdsx", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Sassy_Samsquanch_9", "link_flair_text": "video", "time": 1729911529.9732263, "created_utc": 1729351736.0, "url": "https://v.redd.it/04likkjgdqvd1", "title": "Loud growls recorded in \"Bigfoot Bend\", a remote area in North Alabama.", "permalink": "/r/bigfoot/comments/1g7bdsx/loud_growls_recorded_in_bigfoot_bend_a_remote/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/04likkjgdqvd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/04likkjgdqvd1/DASH_96.mp4", "dash_url": "https://v.redd.it/04likkjgdqvd1/DASHPlaylist.mpd?a=1732503529%2CMjkyMzJiNzM4M2MwYTQyMDMwOTJiM2E2MGZmZTRlYTk1YTk2ZWIyMmRkOGQ0MjM3NTIzZmE5ZmZmOTNhN2MwNA%3D%3D&v=1&f=sd", "duration": 76, "hls_url": "https://v.redd.it/04likkjgdqvd1/HLSPlaylist.m3u8?a=1732503529%2CNmI5YzY4MGIyM2ZmMDI0MjJkY2Q1YTcwMGQyMTA5NTYxMWYwM2QwZjg5OTgwMzhlNjI5ZTBmMTJmOTg3N2M5MA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 802, "upvote_ratio": 0.89, "comment_count": 260, "over_18": false}, "23": {"id": "1g7xzdy", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "BrickAntique5284", "link_flair_text": "Info", "time": 1729911530.7320151, "created_utc": 1729428693.0, "url": "https://i.redd.it/onr4838frwvd1.jpeg", "title": "On this day, the Patterson-Gimlin film was filmed in Northern California in 1967 and allegedly filmed a Bigfoot ", "permalink": "/r/Cryptozoology/comments/1g7xzdy/on_this_day_the_pattersongimlin_film_was_filmed/", "selftext": "https://en.m.wikipedia.org/wiki/Patterson%E2%80%93Gimlin_film", "media": null, "score": 1293, "upvote_ratio": 0.97, "comment_count": 267, "over_18": false}, "24": {"id": "1gaka30", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "5bkahle", "link_flair_text": "Unidentified", "time": 1729911531.0151408, "created_utc": 1729714773.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1gaka30/strange_encounter_south_central_wi/", "title": "Strange Encounter South Central WI", "permalink": "/r/Humanoidencounters/comments/1gaka30/strange_encounter_south_central_wi/", "selftext": "The weekend of 10/11/24 my friends and I set out for a camping trip in Lake Kegonsa State Park located in Stoughton , WI. While finishing up some geocaching on a hiking trail near the outhouses, we encountered something/someone strange. You can enter the trail after crossing the path of another trail that enters the forest. The trail we were on circled a prairie that laid in the middle of the trail and was surrounded by forest. \nThe sun was low in the sky, it had to have been roughly 6pm. The sun was just above the tree line as we started our hike. As we were at our last geocache of the night, the sun had just gone behind the tree line and it was beginning to get dark. But we could still see without the assistance of flashlights. \nThe forest went silent, no more sounds of the bugs around us or birds that have been active all day. It approached us with a whistle, a bone chilling whistle. Our entire group went silent and no one said a word, until we heard a second whistle. This second whistle was more broken up than the first, and in the slightly tipsy state I was in, I thought it had to be a human whistle as it was not perfect. To that I responded with a pretty stern “Hello” hoping for an explanation as to why our group got whistled at twice. “I thought you were dogs” a voice said as it rounded the trail towards up. \nAs he passed our group, I noticed I could not make a face out on this person, but chalked it up to nerves and being distracted. As a group we agreed while it was a strange encounter, we should not panic but took it as a sign to get off the trail. \nThis is where it gets even more weird.  \nAll 4 of us in the group kept our eyes peeled for anything as we made out way back to the car. When suddenly, this creature (calling it a creature as it surely was not human) suddenly appeared on the edge of the trail closest to the woods. Staring blankly to the field in front of it, that would have been to our right. And in the flattest, driest tone it said “who’s that guy”. Everyone in our group kept walking as I answered “the same guy from earlier?” As I assumed it was talking about my boyfriend who was behind the group. We had never been so silent on the walk back to the car. Checking behind our shoulders and our surroundings constantly.\nWe made it back to our campsite where we decided due to the time of the day, it would be best to wait to pack up until morning. \nWhile we were debriefing our experience, I told my friends how in neither encounter I could not make out a face. \nBeing a female hiker, I make a point to gather some facial features of anyone I cross on the trail as a just incase. \nNo one in our group could identify a face. And in our own ways we described how the face on this thing was not a human face. It seemed to almost have a blurred effect over what should have been a human face. All of us seen the same thing, you could tell where eyes, nose and mouth should have been. But there was none on this creature. \nBeing that it whistled and was unidentifiable, we are convinced to have encountered a skinwalker. They just are not relevant in that area of Wisconsin. \nIt was a long night at the campsite with the impending feeling of being watched. I’m spiritually inclined and feel I took the necessary steps of protecting our campsite for a secured nights sleep. But I have had strange encounter since. I’m willing to explain the encounters had since that night if asked. \nAnd ideas?", "media": null, "score": 57, "upvote_ratio": 0.91, "comment_count": 29, "over_18": false}, "25": {"id": "1g87lus", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "PARADUAX", "link_flair_text": null, "time": 1729911531.728775, "created_utc": 1729454502.0, "url": "https://i.redd.it/l4ekl9y5wyvd1.jpeg", "title": "MOTHMAN ", "permalink": "/r/cryptids/comments/1g87lus/mothman/", "selftext": "My submission for Monstober day 19 Cryptid I’ve always been a mothman fan ", "media": null, "score": 256, "upvote_ratio": 0.99, "comment_count": 4, "over_18": false}, "26": {"id": "1g8kbtz", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Lihiiii", "link_flair_text": null, "time": 1729911531.9413917, "created_utc": 1729496972.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1g8kbtz/shadow_person/", "title": "Shadow person ", "permalink": "/r/Thetruthishere/comments/1g8kbtz/shadow_person/", "selftext": "Last night, I had an experience I can’t fully explain, and for someone like me—who doesn’t believe in paranormal things—that’s saying something. I’m a rational person, and for me, everything has a logical explanation.\nIt was around 2:30 AM, dead of night, when I woke up with this strange, eerie feeling that I was being watched. As I blinked myself awake, I saw a shadowy figure sitting at the edge of my bed. The room was pitch black, but I could clearly make out this dark silhouette. What made it even weirder was that my cat, who never sleeps in the bedroom—let alone on the bed—was lying down by my feet. That alone felt off.\nThe figure was sitting at the edge of the bed ,near the cat, and what freaked me out was that it looked like it was petting my cat. My cat wasn’t acting freaked out either, it was just staring at this shadow. At first, I thought maybe it was my boyfriend, who had woken up and was petting the cat. But when I looked beside me, he was fast asleep. My next thought was that maybe it was an intruder, but the more I stared at the figure, the more unsettling it became.\nI rubbed my eyes, trying to shake off the haze, assuming I was dreaming or half-asleep. But the figure didn’t vanish. I grabbed my glasses, hoping it would bring some clarity, but it was still there. Almost looked like it was pulsing. I just kept trying to focus my vision hard, hoping it would disappear, and it's just in my head.\nWhile I'm still in disbelief , I pulled away from this figure, sitting down on the bed, rubbing my eyes repeatedly, the being pulled the hood of what looked like a jacket over its head.\nThen it stood up—slowly—and it started growing taller, looming by the door. I was frozen, just staring at it, my mind racing to find some rational explanation. But this thing was towering over me, becoming something more than just a shadow. \nThat’s when I fully woke up, wide awake and panicked. I shook my boyfriend, scared, shouting, “There’s something here! Something is watching us!” He woke up in a daze and said there was nothing there. I asked him if he really didn’t see it, and he just kept saying, “There’s nothing there, what are you seeing??\"\nMeanwhile, my cat, who never does this, squeezed in between us, trying to get as close as possible, almost like it was frightened too.. seeking our cuddles and attention, or maybe trying to calm me down?\nThe shadowy figure didn’t leave. It just stood there, taunting me, almost like it was dancing or messing with me. I was still frozen, thinking, Am I losing it? What was happening didn’t feel possible.\nMy boyfriend told me to turn on the light. I did, and the second the light filled the room, the figure vanished. But my cat was still staring, its eyes locked onto the same spot where the figure had been, and following it around in the room, like he was tracking something invisible.\nI don’t know what to think of it. I’ve never believed in ghosts, or shadow people, or anything like that. I’ve always dismissed those kinds of stories. But this… I can’t shake it. It felt too real. It WAS real. I feel like I saw something I wasn’t supposed to.\nI don’t know what it was. I’ve never believed in this stuff, and now I feel completely insane. Any idea what it could’ve been?", "media": null, "score": 19, "upvote_ratio": 0.86, "comment_count": 8, "over_18": false}, "27": {"id": "1g97ryb", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "SharkT33tth", "link_flair_text": null, "time": 1729911532.155069, "created_utc": 1729564354.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1g97ryb/creepy_man_chasing_me_and_my_friend/", "title": "Creepy man chasing me and my friend", "permalink": "/r/LetsNotMeet/comments/1g97ryb/creepy_man_chasing_me_and_my_friend/", "selftext": "Hi there! I’ve told a few of my friends this story before and i did get advice about posting it on here by a few friends, so lets begin. (I also apologise as English is not my first language)\nI was about 13 when this happened, and i lived right on the beach, if you walked about 1.5km down the beach from my house you would get to a place where some ocean would be left behind to form a sort of lake, where me and a lot of my friends liked to hang out, next to it were two dirt roads. Anyways, i had a German shepherd, and my mother used to kick me out of the house every weekend for a few hours to go play with the dog, which i did not mind, there was a cliff above the beach which you could take to walk to the lake which was overlooking the beach, but covered in forest, and on that day it was particularly hot, so i chose to spare me and my dog a hot walk and walk up in the forest, I’ve done this many times before and wasn’t afraid at all. As i was walking i hear muffled footsteps behind me, my dog was up far ahead of me off leash and i quickly realised that someone had to be sneaking up behind me because it was near impossible to walk on the dry foliage silently here, i quickly made run for it to the exit of the forest seemingly hearing the footsteps become audible behind me, no worries i was out at the lake now, it was plain , open and i could already spot a girlfriend of mine there.\nMy dog was already in the water as i went to greet my friend, when we notice a large man approach us, he must have been close to 2 metres and very slim, he started talking to us both very kindly, and without knowing any better we both were polite to him, i at the time did not associate the footsteps with this man but later grew to. He asked a lot about us, where we were from, if anyone was here with us and so on, and slowly slowly me and my friend got creeped out, we said our goodbyes saying we had to go off to meet our other friends and moved to a further distance down the lake, we sat down for a bit and started talking when my dog started growling, she never used to growl so this took me by surprise, i looked to see what she was growling at and low and behold the man was standing around 50 metres behind us, me and my friend had caught on now and moved again, same thing, but he was closer now. We were getting freaked out by now, we were being followed and we were all alone,my friend called her mother to come pick us up, though she was at least an hour away, that meant we were stuck with this creep for a hour or so. Joy. \nThe more we moved the more he came closer, i had leashed my dog by now as she was going completely rabid at this man, every time we looked at him he smiled back, as if we were some sort of close friends, he tailed us for a while until we saw my friends mothers car arrive at the dirt road, now this road was about 200 metres from us, and to get there we had to cross where the man was standing, we were terrified. Her mother saw the situation starting running over, which caught the mans attention, which meant it was our time to dash. I don’t think any time in my life have i run that far that fast, my dog was running with us as i let her leash go, and when we got to the car we hastily ran in, as the man ran towards us. We stayed in the car while my friends mother called 112 and waited inside the car, the man throwing rocks and wailing at us, eventually running off as police arrived. When the police arrived they questioned everyone and went looking for the man but never found him, I’m still terrified he’s in that forest, waiting for me. I didn’t know that day my friend would be there, and I don’t know what would have happened if she wasn’t there. I didn’t have a phone or any form of contact and I’m pretty sure if he wold have gotten me he would have won against my dog.\nSo to the creepy man who stalked me and tried to catch me and my friend, let’s not meet again.", "media": null, "score": 91, "upvote_ratio": 0.99, "comment_count": 4, "over_18": true}, "28": {"id": "1gb4m4r", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "verystrangeshit", "link_flair_text": null, "time": 1729911532.339993, "created_utc": 1729781856.0, "url": "https://i.redd.it/mkzrwvkjxpwd1.png", "title": "Elon Musk shared this image two years ago of a spaceship ark escaping Earth, taking 'Beings of Earth' while humans are held at gunpoint.", "permalink": "/r/truecreepy/comments/1gb4m4r/elon_musk_shared_this_image_two_years_ago_of_a/", "selftext": "", "media": null, "score": 53, "upvote_ratio": 0.73, "comment_count": 30, "over_18": false}, "29": {"id": "1gahor4", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Stunning-Hawk-5087", "link_flair_text": null, "time": 1729911532.5387623, "created_utc": 1729707958.0, "url": "https://www.reddit.com/r/threekings/comments/1gahor4/anyone_know_what_i_found/", "title": "Anyone know what I found?", "permalink": "/r/threekings/comments/1gahor4/anyone_know_what_i_found/", "selftext": "Hello everyone, not sure if this is the best place to ask, but I’m curious as to what my coworkers and I found at work today. I’m an ocean rescue lifeguard and today we found 2 blue bags which looked to be animal sacrifice. One bag was closed so we did not look inside of it. However the other bag was slightly open and we saw that it contained a Canadian goose (we think) with a stake in it, a mullet in its back, as well as corn and some other things we could not make out. We no longer have possession of the bags as we buried them in the sand. If anyone has any ideas as to what it is I’d love to hear!", "media": null, "score": 12, "upvote_ratio": 0.83, "comment_count": 1, "over_18": true}, "30": {"id": "1g7qskf", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "No-Initial5621", "link_flair_text": "Caught on Camera 🎥 ", "time": 1729911533.3599517, "created_utc": 1729398351.0, "url": "https://www.reddit.com/gallery/1g7qskf", "title": "Caught this on my trail cam last night what do y’all think it is?!", "permalink": "/r/Ghosts/comments/1g7qskf/caught_this_on_my_trail_cam_last_night_what_do/", "selftext": "", "media": null, "score": 1583, "upvote_ratio": 0.89, "comment_count": 522, "over_18": false}, "31": {"id": "1g920f4", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Familiar_Cattle7464", "link_flair_text": "Glitch Pic", "time": 1729911533.6803706, "created_utc": 1729547762.0, "url": "https://i.redd.it/v7gn8h2hl6wd1.jpeg", "title": "Looked out my window and saw this weird turn made by what I assume was a plane", "permalink": "/r/GlitchInTheMatrix/comments/1g920f4/looked_out_my_window_and_saw_this_weird_turn_made/", "selftext": "", "media": null, "score": 802, "upvote_ratio": 0.97, "comment_count": 71, "over_18": false}, "32": {"id": "1g8ikxi", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "uapinvestigations1", "link_flair_text": null, "time": 1729911535.2849286, "created_utc": 1729489060.0, "url": "https://i.redd.it/edcg2m9xq1wd1.jpeg", "title": "When? ", "permalink": "/r/ufo/comments/1g8ikxi/when/", "selftext": "", "media": null, "score": 1085, "upvote_ratio": 0.98, "comment_count": 41, "over_18": false}, "33": {"id": "1gaehb0", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "News", "time": 1729911537.5007524, "created_utc": 1729700115.0, "url": "https://v.redd.it/6mxcxkur5jwd1", "title": "The Pentagon Responds Publicly to the Issue of UAP Incursions at Sensitive Military Installations", "permalink": "/r/UFOs/comments/1gaehb0/the_pentagon_responds_publicly_to_the_issue_of/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/6mxcxkur5jwd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 718, "width": 1280, "scrubber_media_url": "https://v.redd.it/6mxcxkur5jwd1/DASH_96.mp4", "dash_url": "https://v.redd.it/6mxcxkur5jwd1/DASHPlaylist.mpd?a=1732503535%2CMGExMWNjNDk3YmJiMTc0ZDk2YzM3NjM1ZjMyOGM3Mjg2NzNmYTAwMTk1YjI0NDI3Yzg3MDBmNGUzZDNhMDk0Zg%3D%3D&v=1&f=sd", "duration": 131, "hls_url": "https://v.redd.it/6mxcxkur5jwd1/HLSPlaylist.m3u8?a=1732503535%2CNzkyZDM2MGExYWExN2UzNjVlN2I0YjI2YmNjY2ViNjQ0Njk1M2FjNTJjOGEzNzU2Yzk0YWI2ZGJiYzhlNzYyYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3831, "upvote_ratio": 0.89, "comment_count": 946, "over_18": false}, "34": {"id": "1ganum4", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "gartlandish", "link_flair_text": "Discussion :table:", "time": 1729911539.7592578, "created_utc": 1729724095.0, "url": "https://www.reddit.com/gallery/1ganum4", "title": "4 Chan leak screen caps", "permalink": "/r/aliens/comments/1ganum4/4_chan_leak_screen_caps/", "selftext": "", "media": null, "score": 2389, "upvote_ratio": 0.95, "comment_count": 398, "over_18": false}, "35": {"id": "1gb7ujm", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": null, "time": 1729911540.3938384, "created_utc": 1729789951.0, "url": "https://v.redd.it/8q8ibvi9kqwd1", "title": "Julian Dorey Podcast #245 with Danny Sheehan - Out Now!", "permalink": "/r/UAP/comments/1gb7ujm/julian_dorey_podcast_245_with_danny_sheehan_out/", "selftext": "", "media": null, "score": 67, "upvote_ratio": 0.9, "comment_count": 15, "over_18": false}, "36": {"id": "1g9ebd2", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "External-Noise-4832", "link_flair_text": "Rule 10 Reminder", "time": 1729911541.5957665, "created_utc": 1729590499.0, "url": "https://i.redd.it/l5uvis0k4awd1.jpeg", "title": "Just remember this when you vote!", "permalink": "/r/conspiracy/comments/1g9ebd2/just_remember_this_when_you_vote/", "selftext": "Link to first tweet\nLink to second tweet", "media": null, "score": 3595, "upvote_ratio": 0.75, "comment_count": 1018, "over_18": false}, "37": {"id": "1g7s9ck", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "WaterRresistant", "link_flair_text": "equipment", "time": 1729911542.5802038, "created_utc": 1729404500.0, "url": "https://v.redd.it/y8awsgfhruvd1", "title": "The quality I imagine to see instead of blobsquatch", "permalink": "/r/bigfoot/comments/1g7s9ck/the_quality_i_imagine_to_see_instead_of/", "selftext": "x125 zoom lens ", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/y8awsgfhruvd1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 354, "width": 640, "scrubber_media_url": "https://v.redd.it/y8awsgfhruvd1/DASH_96.mp4", "dash_url": "https://v.redd.it/y8awsgfhruvd1/DASHPlaylist.mpd?a=1732503542%2CNzcwOTg0N2FmN2JmZDhmMDFlOGRkYWNmZDVmMTNjMDNkZjJlNzU3YjAxNGJjOTcxZGE3ZjAyZTNlZGRiOGNjZQ%3D%3D&v=1&f=sd", "duration": 23, "hls_url": "https://v.redd.it/y8awsgfhruvd1/HLSPlaylist.m3u8?a=1732503542%2CN2FlYjBkYzg1YzYzY2NlYzY3ZjMzYTZjN2Y4YWM4NmU3MzNlMDhjODI4OTlmMzJhOWU4YzlhOTI1OTJjY2FlZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 763, "upvote_ratio": 0.98, "comment_count": 145, "over_18": false}, "38": {"id": "1ga8o36", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "our_girl_in_dubai", "link_flair_text": "Sightings/Encounters ", "time": 1729911543.43017, "created_utc": 1729684478.0, "url": "https://www.reddit.com/gallery/1ga8o36", "title": "UK zoo asking what this creature is", "permalink": "/r/Cryptozoology/comments/1ga8o36/uk_zoo_asking_what_this_creature_is/", "selftext": "https://people.com/zoo-asks-for-help-identifying-mysterious-winged-horned-creature-8732400", "media": null, "score": 1003, "upvote_ratio": 0.95, "comment_count": 104, "over_18": false}, "39": {"id": "1g9mem3", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Johanharry74", "link_flair_text": "U.F.O. Humanoid", "time": 1729911543.6626115, "created_utc": 1729614644.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1g9mem3/humanoid_close_encounter_cases_from_the_nordic/", "title": "Humanoid close encounter cases from the Nordic countries - Part 8", "permalink": "/r/Humanoidencounters/comments/1g9mem3/humanoid_close_encounter_cases_from_the_nordic/", "selftext": "Back with another set of cases from the Nordic countries. This time it will be a little different and we will have 5 stories. Iceland is added this time with an intresting case. It is not often we see reports from this remote Island in the North Atlantic. But it seems to be UFO and ET activity there as well. Though a story from Norway is first on the list...\nAn airplane not of this world.\nHolsenøy outside Bergen, Norwegian west coast, July 1965.\nA 52 year old woman from Bergen had a summer cabin on an island just north of the city. She had vacation and it was around 2 PM that day. The weather was clear and sunny and it was 25 degrees (77 degrees F) in the air. It was a very nice and warm summer day and the woman was sitting inside the cabin, because it was shade there, and she was reading a weekly magazine. Then she glanced out the window and saw a bright light over the neighbor's flagpole. The light was bright like a yellow sun and the distance was around meters (90 feet). The height of the object above the ground was then approximately 15 meters (45 feet). The woman saw that the light was now heading towards her and she could see the outlines better. She thought it looked like a small propeller plane, but without a propeller. It also had no tail fin or identity markings. As it came closer, she could see the pilot clearly now. He looked like a slender boy, had a large head in relation to his body and large, dark eyes. On his big head he had some sort of helmet and his hands rested on what looked like a steering wheel. The pilot sat under a Plexiglass hood (or so it looked like). The woman thought she saw that the pilot's skin appeared pale, but the sharp light yellowed the whole man and the object. She estimated the length of the craft to be 3 – 4 meters (9 – 12 feet), and it had a black nose and dark bottom.\nThe woman saw a strange airplane hovering outside her window, with a strange being inside. (source: sketch made by the witness)\nThe object stood still and hovered outside the woman's window at a height of 3 meters (9 feet) for just a few seconds, while the pilot stared at her with a curious look. Throughout the unusual encounter, the woman felt paralyzed. But suddenly she came to her senses and slammed her clenched hand on the table and exclaimed: \"Oh, No!\". Then the pilot jerked and the strange “airplane” began to move again. The woman then ran out into the garden to take a closer look at the object. But by then the craft was already a bit up in the air again and at the height of a nearby mountain peak and then it swung out over the water towards Håvøysund. After that it accelerated upwards and then rose vertically, until it disappeared out of sight in the sky. During the entire time as the “airplane” took off and rose towards the sky, a whining sound was heard. After the encounter with the craft, the woman experienced a numb feeling throughout her body, as well as flickering in her eyes which she thought was due to her looking into the bright light.\nThe woman has always been critical of UFO:s and almost did not want to believe what she saw. She also didn't tell anyone what she had been through, because she didn't want to risk people thinking she was weird or stupid. It would be until 1973 before she told her son about her experience. He persuaded her to report her sighting to UFO-Norway. The son believed what she told him and did not think that his own mother was hallucinating. And he also implied that she had nothing to gain by lying about this.\nSources: UFO – Temahefte 2 - Norske nærkontakter av 3. Grad\nThe alien factory ”worker”.\nForsheda, southern Sweden, January 28 1979.\nLars Eriksson (not his real name) worked as a repairman at Forsheda rubber factory, and he was responsible for the maintenance of heating boilers and fans in the buildings. This Sunday he had started work at 5:15 PM, and would work his shift for three hours. He was almost the only one in the factory area this Sunday evening. Until about 6 PM everything was calm and as usual, but then suddenly the steam boiler stopped for an unknown reason. Lars was very surprised and he went and checked all the valves. There was nothing wrong with these as far as he could see. Then he went to the electrical cabinet and looked, and suddenly the heat boiler also stopped.\nEriksson made many attempts to start the boilers, but nothing happened. And no steam escaped in the pipes. Standing at the control panel, he saw that it was indicated that a ventilation fan on the third floor had also stopped. The repairman had worked at the factory for 16 years and had never seen so many machines shut down at the same time and then fail to start again. Something was very strange, he thought. The next moment the power went out! And the power cut affected not only the factory, but the whole of Forsheda. The whole village was now in darkness. But the power was only gone for a short while, and when the power came back on, the boilers and fans also started without Eriksson's involvement. Impossible according to himself.\nThe witness is pointing towards where he saw the small humanoid that evening. (source: UFO-Information)\nWhen the power came back on it was 6:15 PM.The repairman checked that everything was working again, then went to the pump house which was 700 meters (765 yards) away, a little outside of the factory gates, to start the cooling water pump again to the factory. When he got halfway, he saw a small dark figure 25 - 30 meters (75 - 90 feet) away. At first he thought it was a little boy of 7-8 years. The figure was on its way from the factory buildings towards the power station. Lars Eriksson wondered how this child got into the area, when all the gates to the factory were locked. \"Did he climb over the fence or was he the son of another employee who was also here working this Sunday evening?\", the man thought.\nWhen Lars Eriksson got closer to the figure, it stopped and raised its right hand. Lars also stopped and thought the mysterious boy was greeting him. The man greeted back in the same way and then tried to take a few steps forward. But it didn't work. He was as if paralyzed and could not move. He wasn't sure if it was because he didn't want to move or couldn't, but it was a strange feeling he was in. When the \"boy\" then turned around, it dawned on Lars that maybe this wasn't a human. The being turned in a very strange way. It was a hovering motion, with one foot slightly off the ground, followed by the other. When the figure turned around, he had slipped in the snow, which Lars then saw when he examined the tracks.\nThe repairman saw a short figure in the yard, who he at first thought was a small child. (artistic impression)\nAfter the turn, the humanoid took a giant step that Lars Eriksson measured at a whopping 1.5 meters (5 feet). Then it continued quickly away with meter-long (3 feet) shots. The figure now had its back to Lars and he could see that it had something like a square helmet on its head, which reached to the shoulders. Apart from the helmet, Lars could describe the humanoid as 1 meter (3 feet) tall with a normal build for its size and wearing black clothes. Lars could not determine if it was a \"space suit\" that completely covered the body that the figure was wearing. It was poorly lit in the area here and it was not possible to see the being clearly. But the being had a strange forward bent posture as it jumped forward, sort of leaning forward.\nAs the humanoid reached what turned out to be a landing site, several things happened. At the same time Lars heard a sizzling sound, his paralysis lifted and he was able to move again. The being now jumped up, and then it almost looked as if he lay down and hovered, as it were, in the air some distance from the ground. Lars perceived it as if the creature had jumped into an invisible craft. The sizzling sound now increased in strength and became a strong whining. The humanoid now took off from the ground in a semi-recumbent position inside his invisible or transparent ship, and rode between some large fir trees in the forest next to the factory. The whining grew fainter and fainter, and the figure then disappeared into the sky like a dot.\nFootprints from the alien found in the snow. (source: UFO-Information)\nWhen the alien disappeared with its craft, Lars ventured forward and examined the footprints. He could see that the humanoid appeared to have had grooved soles on the shoes that were wider in the front than the back. The footprints were approximately 16 cm (6.3 inches) long and the tracks in the snow were 8 millimeters (0.3 inches) deep. Another strange thing Lars noticed was that the being seemed to be afraid of a frozen piece of rubber lying on the ground in the snow near the invisible ship. The humanoid had cautiously moved closer in circles, like an animal circling something it is afraid of or curious about. The being had finally shown courage and stepped forward and kicked the piece of rubber lightly with its foot. But this was just a theory, Lars pointed out. Where the invisible UFO was, there were also four tracks. Four circles in a perfect square. The man assumed it was a trace of the craft's landing gears. Lars investigated the site quite thoroughly, but unfortunately there were no tracks in the snow preserved until the next day. A short while after Lars's encounter with the alien, a snowplow came into the area and shoveled away all traces and evidence. However, the driver of the snowplow confirmed that he saw strange tracks in the snow, but did not think much of it.\nThis is another one of many UFO and alien cases where there is only one witness. One can choose to believe these stories or not, but unfortunately they are not enough proof that extraterrestrials are here. And in the case of Lars Eriksson and the humanoid he met, unfortunately the traces of the meeting were swept away immediately. Timely? Yes, skeptics may think so. Unlucky for those who believe in the story. But anyway, when Lars told his colleagues and managers what he had seen and been through, no one believed him. Even his wife didn't believe what he said. So it was not an easy time for Lars. He went around thinking a lot about the meeting and he wondered if it had really happened or if he had gone mad. In addition, he was teased at work. He became known in the village as the strange guy who saw UFO:s and aliens. He was also a member of the community church and it was in this circle that the harassment was worst according to Lars himself. The Christian Church, if any, should be the last to throw stones at the innocent, people who are different or people who had been through hard times.\nSource: UFO-Information Jubileumsnummer 1969-1979.\nMap of the encounter. (source: UFO-Information)\nMidnight guests.\nEspoo, southern Finland, Summer of 1987.\nA female student who lived in a house together with her parents in a town outside of Helsinki, woke up after midnight from a wierd sensation. It was as if something was pulling her or calling her. She sat up in bed and looked around, and she thought about these strange feelings for a few minutes. After a while she felt hungry and went down the stairs to the ground floor. She made a small sandwich in the kitchen, and then went out into the living room while she was eating it. To her surprise, she then saw three strange standing creatures curiously watching her from outside the glass patio door that led out to the porch and garden.\nThe woman saw that the beings were about 1 meter tall (3 feet) and they had a very large head in relation to their thin body. They had very large eyes, like eggs, and they were completely black. They had no hair on their heads and no ears, their noses were only two holes and their mouths were only like thin, narrow lines. Their fingers were very long and she managed to count them to 3 or 4. The humanoids had light grey or beige skin, but were not naked. They were dressed in tight-fitting dark green or blue-gray jumpsuits.\nThe young woman was hungry and was having a midnight snack when she found out she was not alone. Something was watching her from outside. (artistic impression)\nBehind the beings about 20 – 30 meters (60 – 90 feet) away in the garden, the woman could see a strange craft parked in the grass. The bottom was resting on the ground. It was metallic in color and slightly oval in shape, about 3 meters (9 feet) wide. Yellow and red lights flashed all around the hull.\nThe woman stood as if paralyzed and looked at the humanoids and the craft for a minute. She was terrified. Then the \"spell\" was broken and she forced herself to move and she ran upstairs and into her room in a panic and threw herself onto the bed and hid under the blankets. She lay there for a long time, trembling and trying to calm herself. Finally the shock wore off and the fatigue took over and she fell asleep.\nThe next morning she went straight out into the backyard to see if she could find any traces of the terrible event from the night. But she couldn't see anything. But on the other hand, she saw traces in the years to come, because the grass did not want to grow in the place where the craft had stood.\nSource: Mervi Virtanen\nThe little folks on the glacier.\nLangeness Fjord, Iceland, January 12, 1993.\nIceland is known for its legends about the little people such as Fairies, Elves, Gnomes, Trolls and other things that go all the way back to the Viking Age. One of the most famous mythical beings of the small island country are the Elves called Huldufólk*.* These creature lives underground in rocks and caves and prefer to stay away from humans*.*\nBut there aren't that many registered UFO cases or reports of extra-terrestrials from the island. However, people sometimes see UFO:s here as well and most activity of that kind is centered around Langeness Fjord and many UFO:s have been reported by Icelandic Airlines pilots over the years. The US Navy once sighted three large UFO:s in the vicinity of Iceland. And Icelandic fishermen often report seeing strange craft emerge from or dive into the water around them, some of the craft were even quite large. A big, black triangle was also allegedly observed at one point. Reports of equipment malfunction on the fishing boats when they are around these objects is also common.\nArtistic impression of a fishingboat outside the coast of Iceland.\nThere are stories of Icelanders placing food for the little folks, especially those on the Snaefellsjokull glacier. These creatures that live here are described as small and short and with gray skin. Here we see something that could be connected to the well-known Gray aliens. There are also other connections between the little people of Iceland and aliens. In many stories when people meet the little people, it is often reported that they take out a magic wand and the person is immediately paralyzed and unable to move. This is a phenomenon we know all too well from many cases of encounters with extraterrestrial beings. Many therefore believe that the little folks that people have seen for hundreds of years are actually in fact our dear ET:s. Yes, Iceland is indeed a land of mysteries in many ways…\nThere are many legends of little folks on Iceland. One of these people are the \\\"Huldufolk\\\" elves, who lives underground. (source: Goblinglade)\nDuring the winter of 1992-1993 there were much UFO-activity reported over the whole North Atlantic, from the Orkney Island in Scotland, Faroe Islands and up to Iceland. It was at this time that the famous incident with the missing UK Fighter Jet near Orkney Islands occurred. It met a UFO, went missing and was later found intact in rough terrain on a small Island where it couldn’t have landed. Unfortunately, the pilot was never found. During this period, there was also a rumour about an American warship encountered a UFO and completely vanished along with her crew, around the waters of Iceland. Other rumours from the winter of 92 - 93 suggested that Russian and NATO naval forces teamed up around Iceland to hunt for unknown submerged USO ”fast movers”.\nThe following story below is something as unusual as an Icelandic humanoid case. Unfortunately, however, there is not much information available about this sighting. But this is also from the UFO-Hotspot area around Langeness Fjord.\nThere had been bad weather over of Iceland for a longer period in the beginning of January 1993 and local people had also reported a lot of UFO activity in the area around Langeness in connection with this. Authorities now also received several calls that people had seen a group of small (shorter than a human), mysterious beings in gray that had wandered around the glacier in the area. But they were seen at a distance and no one got close enough to see who they were or what they looked like. So were these beings aliens or were they really just ordinary people like tourists behaving strangely? …Or was it perhaps the little people from the legends? Who knows…\nSources: Tony Dodd, UFO Magazine Vol. 12 # 4, Sacramento Press – The Little People of Iceland by Paul Roberts, https://www.ufoinsight.com/supernatural/folklore/snaefellsjokull-incident-little-grey-people-iceland\nDuring winter 1992-93 a lot of UFO:s was reported on Iceland. Even reports of aliens came in. Like these humanoids that were seen on the Langeness glacier. (artistic impression)\nA frightening late night encounter.\nHillerød, eastern Denmark, October 10, 2002.\nHillerød is a small town on Zealand island in eastern Denmark. The place has old origins and is home to Scandinavia's oldest Renaissance castle, Frederiksborg, a beautiful building from the 16th century. And it is in this town that a 25-year-old woman (who wishes to remain anonymous) had a terrifying, otherworldly experience one late autumn evening.\nThe woman had been visited by a female friend this evening and they had eaten some good food, drank some wine, talked and played music. When the friend was going home, the 25-year-old woman followed her to the bus stop, which was a short distance away. They had the 25-year-old's dog on a leash with them. At the bus stop they hugged and said goodbye. The bus arrived and the friend left with it.\nAfter that, the woman started walking home with her dog. The time was then 11:13 PM. She remembered the time because that was when the bus left. She and the dog walked home through residential areas and small green areas, not thinking about anything in particular. They had been walking for 10 minutes, when in front of them they suddenly saw someone or something standing still and watching them, about 25 meters (75 feet) away on the pathway. This strange thing or creature was 150 cm (5 feet) tall, had gray-brown skin (but it was hard to tell in the dark). It was slender and had long limbs. The head was bald and the eyes were as big as an old Danish 5 Kroner coin. The woman and the dog stood completely still and were surprised, when the creature suddenly emitted a terrible sound. It sounded like metal rattling or being set in motion. It was hard to describe what it sounded like and it was the closest the woman could come.\nThe 25-year old woman and her dog encountered a terrifying creature on their way home. (artistic impression)\nThe 25-year-old woman just stood petrified and stared at the creature for almost 2 minutes. The dog growled low all the time on a stretched leash. The creature also just stood still and looked at them strangely with its head tilted. After that, the woman's paralysis stopped and she and the dog ran home in terror, as fast as they could. They couldn't see the creature behind them anymore, but they ran all the way home and up into the apartment and locked the door. The woman's boyfriend wondered what had happened. She tearfully told what she had been through. She was completely terrified and sat on the couch with a blanket around her and just shivered. The woman claims to be clairvoyant/ medium and she has seen some visions and heard many strange things of various supernatural kinds. Never has any of this scared her. But this was the worst thing she had experienced in her entire life and she had never been so afraid before.\nSo what did the 25-year-old woman see this late night? Did someone just dress up and think it was fun to scare people? Or was it a real physical unknown being she encountered, looking a bit like a typical Gray alien? Perhaps, with the help of her sensitivity to the supernatural, she could see things that others could not? Or was it just her unusual abilities playing tricks on her and she thought she was seeing something that was really only in her head?\nSource: UFO Sandheden", "media": null, "score": 47, "upvote_ratio": 0.94, "comment_count": 18, "over_18": false}, "40": {"id": "1g8ac68", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "oldcatlady13", "link_flair_text": null, "time": 1729911544.4181256, "created_utc": 1729461736.0, "url": "https://i.redd.it/dwtap3dohzvd1.jpeg", "title": "Happy National Sasquatch Awareness Day", "permalink": "/r/cryptids/comments/1g8ac68/happy_national_sasquatch_awareness_day/", "selftext": "", "media": null, "score": 231, "upvote_ratio": 0.99, "comment_count": 6, "over_18": false}, "41": {"id": "1gblf1f", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Historical-Pickle-71", "link_flair_text": null, "time": 1729911544.6336715, "created_utc": 1729828147.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gblf1f/dark_figure_in_bathroom/", "title": "Dark figure in bathroom", "permalink": "/r/Thetruthishere/comments/1gblf1f/dark_figure_in_bathroom/", "selftext": "Back when I was i think 12, I stayed up real late one night like around 4-5am I know it was around that time because Adult Swim would go back to Cartoon Network around that time and I distinctly remember seeing bugs bunny so I know it was looney tunes on, so I was laying in bed across from my door, I used to sleep with my door open and the bathroom would be right next to my room. I didn’t like the dark that much back then so I used to always keep the light on in there. I was sitting there in bed when suddenly something moved past the hallway into the bathroom, I was looking at the tv so I didn’t notice who went in and assumed it was my brother who probably needed the bathroom but before I knew it the bathroom light just shuts off. Usually, when we turn off the light in there you’d hear a click from the switch but there wasn’t one and from there I saw it. I saw a dark figure slowly peek through the bathroom right at me once the light was off, it was completely pitch black except for my TV so couldn’t see what I was looking at, I was completely frozen stiff and wanted to say something but couldn’t it looked back at me for several seconds but it felt like minutes and suddenly it leaves into the hallway. I was completely paralyzed with fear and tired to talk myself into believing my brother was the one who did it or that he had one of his friends over because his room was in that direction. The next day I asked my brother if he was the one who turned the light off or if he had someone over that day and he looked at me confused and told me he had no idea what I was talking about. It couldn’t have been my parents because my bed was in front of their door and it was shut. I’m 26 now and I still think about that to this day what that figure was and why it hasn’t happened to me since.", "media": null, "score": 12, "upvote_ratio": 0.87, "comment_count": 2, "over_18": false}, "42": {"id": "1gaz8oc", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Right_Sheepherder374", "link_flair_text": null, "time": 1729911544.8372812, "created_utc": 1729765174.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1gaz8oc/a_roommate_situation_that_turned_into_a_nightmare/", "title": "A Roommate Situation That Turned into a Nightmare ( I’m French)", "permalink": "/r/LetsNotMeet/comments/1gaz8oc/a_roommate_situation_that_turned_into_a_nightmare/", "selftext": "My name is Jules, and this story happened in 2022. At the time, I was a business school student, but my English skills left much to be desired. To improve, I decided to take a gap year and move to Toronto, Canada, for intensive language courses. Since the costs were high, I found a shared apartment with other students. It had three bedrooms, and one was still empty, waiting for another student to move in. My roommate, Sandro, was a Swiss German: tall, almost two meters and 120 kilos, but also very friendly. We quickly became friends.\nA few weeks later, Sandro told me he was going on a week-long road trip through Canada’s national parks. He was set to leave on a Saturday morning, while I had been informed that the new student would arrive that same day around 3 PM. Sandro left the apartment at 10 AM, leaving me alone to wait for the new arrival.\nHours went by. 3 PM, then 4 PM, 8 PM, 10 PM… Still no one. I grabbed a bite to eat, watched a show on Netflix, and eventually decided to go to bed. Around midnight, I was suddenly awakened by knocks on the apartment door. I heard someone coming in. “That must be the new student,” I thought to myself, before hearing an unfamiliar voice explaining the apartment’s layout. I stayed in my room, too tired to go out, and fell back asleep.\nBut, a few minutes later, there were knocks on my door. Once. Then a second time, ten minutes later. Thinking there might be a problem, I eventually got up. I found myself face to face with a young Japanese woman, around 25 years old. I quickly explained a few details about the apartment, we exchanged Instagram handles, and then each of us went back to our rooms for the night.\nIn the following days, she often asked me to accompany her when taking the bus or subway. I gladly helped, showing her the stops and the good spots for getting around, and then returned to my routine, between classes and gym sessions. But gradually, something strange started to happen. Every evening when I came back, she would always be talking to me, either by message or when we bumped into each other in the apartment. The situation became increasingly heavy.\nThen, one evening, while lying on my bed, I noticed a figure on the shared balcony, right in front of my bedroom window. She was leaning against the railing, staring at me. Her gaze was piercing, unsettling. When she realized I had seen her, she quickly turned away and went back into her room. I shivered but tried to convince myself it was just a coincidence.\nLater, around midnight, as I turned off the lights to fall asleep, I glanced out the window… She was still there, standing, watching me. Our eyes met again, and she vanished instantly.\nThe scene repeated itself the following nights. Every evening, I would catch her watching me from the balcony, always at the same time, always with that fixed gaze. And every time, she disappeared as soon as she realized I had noticed her. But the night before my departure, the situation took an even more disturbing turn.\nOne morning, I had to get up particularly early for an appointment. It was 5:30 AM when I left my room; the entire apartment was shrouded in darkness, except for the faint light filtering from under the bathroom door, where I was brushing my teeth. Suddenly, I heard a noise behind me. The young woman emerged from her room, silent, her footsteps softly echoing on the wooden floor. She knew I was there, she saw the light under the door.\nI froze, a chill running down my spine. There I was, in my underwear, toothbrush in hand, wondering what she wanted. But instead of turning back, she opened the bathroom door and came in, sitting on the closed toilet, facing me. She didn’t say a word. She just sat there, motionless, her gaze locked onto mine, with a blank, almost empty expression.\nThe scene dragged on for long, icy seconds, where the silence grew oppressive. Then, slowly, I gathered myself and left the room, closing the door behind me. I returned to my room very slowly, trying to show that I didn’t understand what was going on, but her English was too poor for us to have a proper conversation.\nIn the days that followed, I became increasingly cautious, watching her every move, but she continued to observe me every evening from the balcony, like a disturbing shadow in the night. Until, on the night before my departure, things took an even more terrifying turn.\nI was having dinner in my room when I saw her again through the window, staring intensely inside. I looked away, hoping she would leave. Then, later that night, around 3 AM, I woke up suddenly from a nightmare. I turned my head, and there she was, still on the balcony, her eyes wide open, fixed on me.\nMy blood ran cold. This time, she didn’t look away; she remained motionless, like a statue. Then, abruptly, she turned and started running inside the apartment. My heart pounded. I rushed to lock my door, and I buried myself under the covers, hoping it was all just a bad dream.\nA few seconds later, I heard footsteps behind my door, then an attempt to open it, gently at first, then more forcefully. She was pressing on the handle, trying to get into my room. Panicked, I remained still, holding my breath. And then, everything went silent again. I heard nothing more.\nShe must have gone back to her room, but the night felt endless.\nI returned to France the next day; she was no longer in the apartment. I think she was just fascinated to see a European—after all, I don’t have a typical build, especially not for a Japanese person… I can bench press over 150 kilos, hehe.\nAnyway, I also thought she might have been looking for an adventure with me or trying to steal my passport.\nTake care, everyone; this story is entirely true, I still have the apartment’s address, the school’s name, etc.", "media": null, "score": 64, "upvote_ratio": 0.9, "comment_count": 13, "over_18": true}, "43": {"id": "1gbezw9", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Feisty_Lime8450", "link_flair_text": null, "time": 1729911545.2250023, "created_utc": 1729808287.0, "url": "https://www.reddit.com/r/threekings/comments/1gbezw9/dark_reflectionhelp/", "title": "Dark reflection-help", "permalink": "/r/threekings/comments/1gbezw9/dark_reflectionhelp/", "selftext": "I did dark reflection about an hour ago and nothing has really happened yet. I'm not really sure if I remember breathing on the mirror or not. Would it be safe to do the ritual again just in case? Or would it be bad to do it twice? Plus, how could I smash a mirror in an easier way? It took several tries and I don't have a hammer. Thank you!", "media": null, "score": 4, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "44": {"id": "1g8ak4z", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "thercery", "link_flair_text": "Famous Haunts (Famous Ghosts)", "time": 1729911545.8438587, "created_utc": 1729462346.0, "url": "https://www.reddit.com/gallery/1g8ak4z", "title": "Apparition of Little Girl in St. Augustine Lighthouse", "permalink": "/r/Ghosts/comments/1g8ak4z/apparition_of_little_girl_in_st_augustine/", "selftext": "Allegedly this is one of the three daughters of a Lighthouse Keeper, all three of whom drowned. \nThis photo is sourced from the new Garrett Watts ghost-hunt at the Lighthouse video on youtube, during which he was shown the photo by employees of the historical building.\nIncluded an empty shot of the place, as well as a version of the ghost photo with upped contrast, light, and sharpness.\nWhat do y'all think?", "media": null, "score": 777, "upvote_ratio": 0.96, "comment_count": 63, "over_18": false}, "45": {"id": "1g8j7cr", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "HolidayGirly", "link_flair_text": "Glitch Pic", "time": 1729911546.1731293, "created_utc": 1729491753.0, "url": "https://i.redd.it/iyo31dbxy1wd1.jpeg", "title": "I took a picture while on a bus and the car's wheel is invisible", "permalink": "/r/GlitchInTheMatrix/comments/1g8j7cr/i_took_a_picture_while_on_a_bus_and_the_cars/", "selftext": "", "media": null, "score": 621, "upvote_ratio": 0.96, "comment_count": 26, "over_18": false}, "46": {"id": "1gamv7j", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "smile_kinky", "link_flair_text": null, "time": 1729911547.6280544, "created_utc": 1729721375.0, "url": "https://i.redd.it/h56dzvfqxzgb1.jpg", "title": "I encourage everyone to just watch the first two episodes of the X-Files! With everything going on and with the recent disclosure they were on the mark back in the day", "permalink": "/r/ufo/comments/1gamv7j/i_encourage_everyone_to_just_watch_the_first_two/", "selftext": "", "media": null, "score": 761, "upvote_ratio": 0.95, "comment_count": 107, "over_18": false}, "47": {"id": "1gat0mt", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Individual_Cloud935", "link_flair_text": "Photo", "time": 1729911549.7640784, "created_utc": 1729739358.0, "url": "https://www.reddit.com/gallery/1gat0mt", "title": "New photos from the UFO archive ", "permalink": "/r/UFOs/comments/1gat0mt/new_photos_from_the_ufo_archive/", "selftext": "Hi people, I went through the Photographs from, Case File Nos. 4750 - 12615, May 2, 1957-February 1969 and ISO Files (2 of 2) and snapped screenshots of the photos wich i found the most interesting. I would recommend everybody too look it up themselves, because you can't see the whole photos on the screenshots. Gonna make a 2 post so I can post all of the photos, you can only post 20 in one post. Here they are. ", "media": null, "score": 3626, "upvote_ratio": 0.94, "comment_count": 326, "over_18": false}, "48": {"id": "1g825oh", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "lilmayo", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1729911551.884552, "created_utc": 1729440447.0, "url": "https://www.reddit.com/gallery/1g825oh", "title": "i came here for beer 🛸🇩🇪🍺", "permalink": "/r/aliens/comments/1g825oh/i_came_here_for_beer/", "selftext": "oktoberfest wuz lit", "media": null, "score": 1833, "upvote_ratio": 0.98, "comment_count": 62, "over_18": false}, "49": {"id": "1g714wg", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Dear-Captain1095", "link_flair_text": null, "time": 1729911552.4349682, "created_utc": 1729312158.0, "url": "https://youtu.be/3Hr0YZdgmIM?feature=shared", "title": "CBS morning report on UAP incursions over military bases ", "permalink": "/r/UAP/comments/1g714wg/cbs_morning_report_on_uap_incursions_over/", "selftext": "Pretty cool to see some mainstream coverage of this issue. Seems like it’s being framed as a potential national security concern. I applaud the journalist for covering this important story. ", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Inside growing drone threat the U.S. faces with multiple breaches of restricted airspace", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/3Hr0YZdgmIM?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Inside growing drone threat the U.S. faces with multiple breaches of restricted airspace\"></iframe>", "author_name": "CBS Mornings", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/3Hr0YZdgmIM/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@CBSMornings"}}, "score": 60, "upvote_ratio": 0.95, "comment_count": 12, "over_18": false}, "50": {"id": "1gbego2", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "preetshahi", "link_flair_text": null, "time": 1729911553.6567247, "created_utc": 1729806831.0, "url": "https://i.redd.it/tjl3ziltzrwd1.jpeg", "title": "REMINDER: Pizzagate is real!", "permalink": "/r/conspiracy/comments/1gbego2/reminder_pizzagate_is_real/", "selftext": "SS: \nHere is the original article: https://nypost.com/2023/11/14/media/ex-editor-in-chief-of-the-recount-charged-with-child-pornography/\nNever Forget. ", "media": null, "score": 3151, "upvote_ratio": 0.88, "comment_count": 334, "over_18": false}, "51": {"id": "1gagpmb", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "014648", "link_flair_text": "semi-related", "time": 1729911554.40952, "created_utc": 1729705585.0, "url": "https://v.redd.it/i7wqsewn6hwd1", "title": "It’s gonna be hard for any new Bigfoot footage to be deemed legit", "permalink": "/r/bigfoot/comments/1gagpmb/its_gonna_be_hard_for_any_new_bigfoot_footage_to/", "selftext": "", "media": null, "score": 560, "upvote_ratio": 0.92, "comment_count": 72, "over_18": false}, "52": {"id": "1g9t8dy", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Brycer1ley1933", "link_flair_text": "Question", "time": 1729911555.1530662, "created_utc": 1729631488.0, "url": "https://www.reddit.com/gallery/1g9t8dy", "title": "What Do Y’all Think The Mongolian Death Worm Could Possibly Be?", "permalink": "/r/Cryptozoology/comments/1g9t8dy/what_do_yall_think_the_mongolian_death_worm_could/", "selftext": "", "media": null, "score": 653, "upvote_ratio": 0.97, "comment_count": 115, "over_18": false}, "53": {"id": "1gav66c", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Short_and_Plastic", "link_flair_text": null, "time": 1729911556.1607609, "created_utc": 1729746967.0, "url": "https://i.redd.it/9425rr5s1nwd1.jpeg", "title": "Point Pleasant, WV 1966", "permalink": "/r/cryptids/comments/1gav66c/point_pleasant_wv_1966/", "selftext": "", "media": null, "score": 200, "upvote_ratio": 0.99, "comment_count": 8, "over_18": false}, "54": {"id": "1g7vpep", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Cultural_Figure_1480", "link_flair_text": null, "time": 1729911556.3752522, "created_utc": 1729420123.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1g7vpep/floating_apple/", "title": "Floating apple ", "permalink": "/r/Thetruthishere/comments/1g7vpep/floating_apple/", "selftext": "When I was a kid I saw a floating apple and in a few seconds the apple was set on fire does anyone have a similar experience like this? (where they saw a floating apple and within a few seconds it was set on fire then it was gone.)", "media": null, "score": 5, "upvote_ratio": 0.6, "comment_count": 4, "over_18": false}, "55": {"id": "1gaqq8e", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "elebee3", "link_flair_text": null, "time": 1729911556.5671217, "created_utc": 1729732282.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1gaqq8e/schizophrenic_ex_family_friend_stalking_and/", "title": "Schizophrenic ex family friend stalking and threatening my family and i'm scared. Help", "permalink": "/r/LetsNotMeet/comments/1gaqq8e/schizophrenic_ex_family_friend_stalking_and/", "selftext": "Hey reddit!\nI genuinely don't know how to summarize this so I apologize for the length.\nI'm also not sure if this is the appropriate place for a post like this. This is very real, i'm not a great writer, this isn't meant to be a thrilling read, I just need input. \nChanging lots of details for anonymities sake. \nImportant context,\nPaul was a long time friend of one of my parents. It seemed like around the time this all started he stopped taking his medication. I actually had no idea about his disorder prior to the beginning of this whole situation. \nThis has been going on for almost two years now. I live with my parents and sibling. \nEarly 2023:\n- shows up at our house, appears to be on drugs? Police are called and after a while he is driven home\n- his friend, (my dad, we'll call him ron) goes to Paul's house to check on him. \n- Finds his meds, notices he's not himself. Witnesses him hitting his cat, is also not feeding it properly. \nHeres where it gets tricky,\n(I'll admit this is where we went wrong) \n   Ok, imagine your best friend of many years has a debilitating mental illness, stops taking their meds, beats their pet. And you think, hey until they get back on their meds, i'm going to take their pet because I love my friend and I don't want them to hurt the animal they obviously love. (When on their meds)\nThis was a bad Idea, because even in that circumstance you are not allowed to just take someones pet. We loved his cat and we tried to make the best decision for him and his cat at the time. \nFollowing this, \n- hundreds of texts sent to both parents, very angry scary ramblings\n- Eventually I get some texts as well\n- Lots of facebook posts calling us the villains, we try to look into getting him admitted into a psych ward, doesn't work out because he's an adult and they cant force him to stay\n- Sends a friend to try and break into our house in broad daylight \n(RIGHT after we change the locks because he threatened this prior) \n- By now we have a caseworker who we've explained the situation to. He understands but says its not worth the struggle and suggests a mediated returning of Pauls pet.\n- We do this despite being worried for the cats well-being\n- Ironically he texts me after the fact, saying we were right to take his cat\n(I wish I still had this message but I think I blocked him over text at some point and cant find it) \n- Think its over?! Well think again stupid\nSide note; the amount of texts we got during this time, was actually insane. They were all very angry, implied and even outright stated some very scary stuff. \nAdditionally, many of the texts we would get, or posts made to scare and defame us were very jumbled and not well written, which seems to be par for the course for someone with schizophrenia according to our caseworker.\nThe new problem:\nWhen you are friends with someone for over 20 years, you gift them things, they gift you things. That is also true about Paul and Rons friendship. \nExactly a year after it happened:\n- I get a text with some very colorful language asking for his stuff back. I don't respond because thats what i've been instructed to do\nThis past week:\n- we have had two letters DRILLED, not taped or pasted, onto our back door within the span of a few weeks. This is the least time between contact since the very start of this ordeal. The letters were threatening, scrawled in big harsh lettering. This is what pushed me to make this post.\nNow->\nWhen this initially became a problem the police told us all to cut contact and to never interact with him for any reason, even to give borrowed and gifted stuff back. \nI'm starting to think thats a bad idea.\nDo we just give the stuff we know we were lent back? The main item being asked for is something we DO NOT HAVE. \nI don't believe someone in this state of mind can just be reasoned with but maybe they can? For the past year I have had this constant lingering anxiety and I'm sick of it.\nI'm posting this here because I cant think of any good outcome from anything we try to do to solve this situation. He knows where we live, he has means to support himself without working, seems to act normal when the situation calls for it. Maybe people with Schizophrenia or people who know others with the disorder can chime in? Frankly i'm just scared. We have means of defending ourselves, we are getting a porch camera, but I kinda just feel like i'm waiting around for the situation to escalate. I'm scared of the unpredictability of someone with that disorder. We have contacted the police, they basically cant do anything, we don't meet the criteria to file for a report online. \nTLDR; old family friend has been threatening us and showing up to our door step at late hours periodically for nearly two years and it seems to be getting worse", "media": null, "score": 57, "upvote_ratio": 0.92, "comment_count": 22, "over_18": true}, "56": {"id": "1gbyjze", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "omar802", "link_flair_text": null, "time": 1729911557.8726609, "created_utc": 1729874136.0, "url": "https://www.reddit.com/gallery/1gbyjze", "title": "Took a random picture at the Stanley Hotel in Estes Park, Colorado. Then I saw this thing in the mirror. ", "permalink": "/r/Ghosts/comments/1gbyjze/took_a_random_picture_at_the_stanley_hotel_in/", "selftext": "What do you guys think? Dirty mirror or Demon? ", "media": null, "score": 293, "upvote_ratio": 0.75, "comment_count": 191, "over_18": false}, "57": {"id": "1g9pxo4", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "autistic_heaven", "link_flair_text": "Glitch Pic", "time": 1729911558.192121, "created_utc": 1729623329.0, "url": "https://i.redd.it/mwnmnfb6ucwd1.jpeg", "title": "Devs need to fix the sky", "permalink": "/r/GlitchInTheMatrix/comments/1g9pxo4/devs_need_to_fix_the_sky/", "selftext": "", "media": null, "score": 316, "upvote_ratio": 0.99, "comment_count": 9, "over_18": false}, "58": {"id": "1gboddp", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "uapinvestigations1", "link_flair_text": null, "time": 1729911559.7187188, "created_utc": 1729839840.0, "url": "https://i.redd.it/4klcp42zpuwd1.jpeg", "title": "Never forget Roswell ", "permalink": "/r/ufo/comments/1gboddp/never_forget_roswell/", "selftext": "", "media": null, "score": 243, "upvote_ratio": 0.98, "comment_count": 21, "over_18": false}, "59": {"id": "1gahey7", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "DJBullek", "link_flair_text": "Photo", "time": 1729911561.8192887, "created_utc": 1729707290.0, "url": "https://www.reddit.com/r/UFOs/comments/1gahey7/cigar_shaped_ufo_from_todays_photo_document/", "title": "Cigar Shaped UFO from today's photo & document release at National Archives", "permalink": "/r/UFOs/comments/1gahey7/cigar_shaped_ufo_from_todays_photo_document/", "selftext": "Cigar Shaped UFO\nLink to the source of this photo:\nhttps://catalog.archives.gov/id/446391567?objectPage=106\nhttps://catalog.archives.gov/id/446391567?objectPage=110\nand other photos/documents:\nhttps://catalog.archives.gov/id/23857152\nPT. 2: https://www.reddit.com/r/UFOs/comments/1gampbg/ufo_photos_us_national_archives_todays_release/\nPT.3(final): https://www.reddit.com/r/UFOs/comments/1gb16rn/ufo_photos_us_national_archives_todays_release/\nThere are also some pretty compelling photos, especially those with radar scans.\nI will post them below:\nhttps://preview.redd.it/j1x6jx7s8kwd1.jpg?width=2048&format=pjpg&auto=webp&s=68a6db2e33a2544b69c84c7efb6fe33aa77433e0\nhttps://preview.redd.it/eopwlx7s8kwd1.jpg?width=2048&format=pjpg&auto=webp&s=23e2209db7304873f3ae7ef8897a5dbcbe95574a\nhttps://preview.redd.it/x8lqpw7s8kwd1.png?width=688&format=png&auto=webp&s=4a69cfecd06c1252ed70de45e0700a1268122035\nhttps://preview.redd.it/cwhfpt7s8kwd1.jpg?width=1600&format=pjpg&auto=webp&s=ce5b960713ccb50573c476dbb00edece101356c0\nhttps://preview.redd.it/aq2vwu7s8kwd1.jpg?width=1600&format=pjpg&auto=webp&s=cb75ddc65abce544552cb09199444b04cf5fd302\nhttps://preview.redd.it/k6myh18s8kwd1.jpg?width=1800&format=pjpg&auto=webp&s=d87041b3ef1b94533914ca8e9adb4995f84d0de4\nhttps://preview.redd.it/eubi77419kwd1.png?width=1800&format=png&auto=webp&s=d262efe7212fddda58b1da903ee1071bdb4dab2f\nhttps://preview.redd.it/l3k6p9y09kwd1.png?width=3512&format=png&auto=webp&s=91490e7d4f30e95b69eeb7d43d4854e2901434c0\nhttps://preview.redd.it/5zqxes9i9kwd1.png?width=2748&format=png&auto=webp&s=53b07a320a7701339a3c9871189ec9489a072ef3\nhttps://preview.redd.it/ijotrjju8kwd1.png?width=1760&format=png&auto=webp&s=813c78c8264fc5feade53080a050faec6e5711e8\nhttps://preview.redd.it/z0xnajju8kwd1.png?width=3004&format=png&auto=webp&s=954a4ce9ab8462253b17bb78d170bb9bf47f3d75\nhttps://preview.redd.it/0us62qku8kwd1.png?width=3240&format=png&auto=webp&s=9de7e47388fa3f9c98d02400a34abde70f44a640\nhttps://preview.redd.it/v8cykzcz8kwd1.png?width=3252&format=png&auto=webp&s=a9f9a8d5e4ad1d4fb45273aae4569e71d3424afe\nhttps://preview.redd.it/pgjq6qku8kwd1.png?width=3304&format=png&auto=webp&s=7ee20f4b2b2bd90dafd80e98f54affdd34a008f7\nhttps://preview.redd.it/q8dyioku8kwd1.png?width=3460&format=png&auto=webp&s=652c2b9f05cdaba1d81ab9f025721a6874b03683\nReally worth-looking stuff, please share more if you found something interesting to take a look at.\nJust imagine what do they have under 'Immaculate Constellation' program. That's why we need transparency and that's why UAPDA must pass.", "media": null, "score": 3090, "upvote_ratio": 0.98, "comment_count": 426, "over_18": false}, "60": {"id": "1g846uo", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "littlespacemochi", "link_flair_text": "Video", "time": 1729911564.350392, "created_utc": 1729445732.0, "url": "https://v.redd.it/t2arzjx26yvd1", "title": "UFO seen in Italy, October 15, 2024", "permalink": "/r/aliens/comments/1g846uo/ufo_seen_in_italy_october_15_2024/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/t2arzjx26yvd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 520, "width": 480, "scrubber_media_url": "https://v.redd.it/t2arzjx26yvd1/DASH_96.mp4", "dash_url": "https://v.redd.it/t2arzjx26yvd1/DASHPlaylist.mpd?a=1732503562%2CZGVhNmY2OTY2ZWM0MmUzMjJmYmI0NWQ4YTRjZWRhNWJlYzE5ODlhZDhhYmRjYjdhOWE5NGI5YjhhZTFhN2MwMQ%3D%3D&v=1&f=sd", "duration": 52, "hls_url": "https://v.redd.it/t2arzjx26yvd1/HLSPlaylist.m3u8?a=1732503562%2CYmU3YThiMjU1NTg5MTc5OWU3MzU1YjdkMDZhMjJjMGM2YjMzY2M0YTI2MzRlZWRjOThjNDcyNjUxMWUwZmQyOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1789, "upvote_ratio": 0.98, "comment_count": 118, "over_18": false}, "61": {"id": "1gb6svj", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Physical_Fall5129", "link_flair_text": null, "time": 1729911564.8356276, "created_utc": 1729787327.0, "url": "https://www.reddit.com/r/UAP/comments/1gb6svj/unusual_search_activity_in_ohio_and_alabama_for/", "title": "Unusual Search Activity in Ohio and Alabama for \"Immaculate Constellation.\"", "permalink": "/r/UAP/comments/1gb6svj/unusual_search_activity_in_ohio_and_alabama_for/", "selftext": "I found a spike in Ohio in 2009 and Alabama in 2012. Huntsville, Alabama has multiple organizations / agencies that could be connected to UAP research and I believe there is a lot of history of antigravity work, there. Let's not forget that Alabama is extremely poor, and like everywhere else in the country, you would never expect anyone to be searching the exact term, \"Immaculate Constellation,\" and this is what you find on Trends, nobody searching this term except a few in specific places.See below.\nIn Alabama, a few organizations and facilities could be linked to Unidentified Aerial Phenomena (UAP) research or investigations, either through aerospace, defense, or research capabilities. Alabama has a notable history of involvement in advanced aerospace research, including work related to anti-gravity and propulsion technologies:\n\nRedstone Arsenal (Huntsville, AL): This is a key U.S. Army installation that supports research and development, particularly in missile defense and aerospace. Its connections to defense technologies make it a potential facility of interest in UAP-related research, particularly concerning airspace defense and anomalous phenomena.\nMarshall Space Flight Center (MSFC) (Huntsville, AL): As part of NASA, the Marshall Space Flight Center is heavily involved in rocket propulsion, spacecraft technology, and space exploration. Given NASA’s renewed interest in studying UAPs, MSFC may play a role in data analysis or research related to space or atmospheric anomalies.\nAviation and Missile Research, Development, and Engineering Center (AMRDEC): Also located at Redstone Arsenal, AMRDEC conducts research on advanced aviation and missile systems. Their involvement in advanced aerospace technology positions them as a possible contributor to UAP investigations.\nU.S. Space & Rocket Center (Huntsville, AL): Though primarily an educational and tourist facility, the Space & Rocket Center is connected to Huntsville’s aerospace and defense industries, fostering public interest and education in space phenomena.\n\nThese facilities, especially in the Huntsville area, are known for their involvement in aerospace, defense, and technological research, all areas relevant to potential UAP studies.\nAdding to the post based on questions, hope this helps, if this doesn't work, I have the screenshots or I can show you how to pull up the data (make sure to choose the state and choose 2004 - Present:\nScreenshots here because people are saying the links do not show the data any longer, or perhaps there's a problem with how its linked (make sure to choose the state and choose 2004 - Present:\nhttps://imgur.com/a/9bkuBMw\nHopefully this works. Here is Alabama 2012:\nhttps://trends.google.com/trends/explore?date=all&geo=US-AL&q=%22immaculate%20constellation%22&hl=en\nHere is Ohio 2009:\nhttps://trends.google.com/trends/explore?date=all&geo=US-OH&q=%22immaculate%20constellation%22&hl=en\nI only searched California, Ohio, New Mexico and Alabama knowing that these were places where we might see activity. I have a lot of Anti-Gravity research being connected to Alabama.\nAnd then there was the Chinese Anti Gravity researcher who supposedly had made progress in her research, published a paper and then I believe, tested her theories and got positive results in that she might have achieved a result where she was able to make an object weigh less by manipulating gravity.  But I don't have this documentation in front of me, this is something that I had dug up online so I don't know what is true from memory. She was also connected to Huntsville, Alabama. And then disappeared. There were many conspiracy theories but it seems she was swept up by the Pentagon where she continued her work and obviously had to keep everything confidential. See below from GPT:\nThe Chinese-American physicist Ning Li is a key figure associated with anti-gravity research, and she has connections to Alabama. Ning Li worked at the University of Alabama in Huntsville (UAH) in the 1990s, where she conducted research at the Center for Space Plasma and Aeronomic Research (CSPAR). Her work focused on the theoretical foundations of gravitational field manipulation, and she became known for controversial claims about the possibility of creating anti-gravity devices.\nIn 1999, she left UAH to establish her own company, AC Gravity, LLC, to further explore practical applications of her theories. Reports claim that she received funding from the U.S. Department of Defense for her research. After this period, she largely disappeared from public view, which fueled speculation and rumors about her work and whereabouts​\nHowever, there is no direct evidence connecting her disappearance to any specific event or organization, though her Alabama connection and pioneering work on anti-gravity technology remain well-documented.", "media": null, "score": 62, "upvote_ratio": 0.91, "comment_count": 49, "over_18": false}, "62": {"id": "1g74q6b", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "gl0rydaze", "link_flair_text": null, "time": 1729911566.0695276, "created_utc": 1729327867.0, "url": "https://www.reddit.com/r/conspiracy/comments/1g74q6b/man_should_not_be_able_to_see_his_own_face/", "title": "“Man should not be able to see his own face”", "permalink": "/r/conspiracy/comments/1g74q6b/man_should_not_be_able_to_see_his_own_face/", "selftext": "“Man should not be able to see his own face -- there’s nothing more sinister. Nature gave him the gift of not being able to see it, and of not being able to stare into his own eyes. Only in the water of rivers and ponds could he look at his face. And the very posture he had to assume was symbolic. He had to bend over, stoop down, to commit the ignominy of beholding himself. The inventor of the mirror poisoned the human heart.”  \n— Fernando Pessoa\nI know you guys prefer news on this sub(ha ha), but I just wanted to share this quote which I found very interesting...", "media": null, "score": 2329, "upvote_ratio": 0.93, "comment_count": 264, "over_18": false}, "63": {"id": "1gc0fey", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "BigDaddyFlynn", "link_flair_text": null, "time": 1729911567.0148692, "created_utc": 1729879006.0, "url": "https://i.redd.it/iy69zsjfyxwd1.jpeg", "title": "Thought this was funny! ", "permalink": "/r/bigfoot/comments/1gc0fey/thought_this_was_funny/", "selftext": "", "media": null, "score": 530, "upvote_ratio": 0.98, "comment_count": 7, "over_18": false}, "64": {"id": "1g92c2k", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Asbestos_Nibbler", "link_flair_text": "Meme", "time": 1729911567.7214708, "created_utc": 1729548589.0, "url": "https://i.redd.it/ikrdn7qwn6wd1.png", "title": "Literally 1984", "permalink": "/r/Cryptozoology/comments/1g92c2k/literally_1984/", "selftext": "", "media": null, "score": 484, "upvote_ratio": 0.97, "comment_count": 56, "over_18": false}, "65": {"id": "1g7m0h3", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "weizenbrot_", "link_flair_text": null, "time": 1729911568.7114778, "created_utc": 1729381777.0, "url": "https://i.redd.it/ojitff1xvsvd1.jpeg", "title": "How do you think of my cryptic drawings ", "permalink": "/r/cryptids/comments/1g7m0h3/how_do_you_think_of_my_cryptic_drawings/", "selftext": "", "media": null, "score": 145, "upvote_ratio": 0.92, "comment_count": 31, "over_18": false}, "66": {"id": "1gbat5a", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "KdotJdot", "link_flair_text": null, "time": 1729911570.4956524, "created_utc": 1729797358.0, "url": "https://v.redd.it/far1nmnt6rwd1", "title": "I invited passing strangers to sit down and explain why the did or did not believe in Ghosts: this guy was the only skeptic I interviewed who made some good counter-points, but curious to hear what you all think?", "permalink": "/r/Ghosts/comments/1gbat5a/i_invited_passing_strangers_to_sit_down_and/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/far1nmnt6rwd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/far1nmnt6rwd1/DASH_96.mp4", "dash_url": "https://v.redd.it/far1nmnt6rwd1/DASHPlaylist.mpd?a=1732503569%2CNThlYWY4ZGUxMTZhN2M1ZjdkNDdiZjRlNGJiM2RlOGFiOWQzNTI4YjdjNWZkZmJjNWE1MjMwZjZjZWFkYjQwZQ%3D%3D&v=1&f=sd", "duration": 67, "hls_url": "https://v.redd.it/far1nmnt6rwd1/HLSPlaylist.m3u8?a=1732503569%2CZDE5MDg4MTA0NzYzMTg4NDIyOWYzNjI0ZGU5Y2ZiYTlhNzk5NzkwMzlkMjM3ODljNDI5MDgyYWM5MDc0ZmE2Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 172, "upvote_ratio": 0.9, "comment_count": 80, "over_18": false}, "67": {"id": "1g7wpls", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "SpiritLongjumping931", "link_flair_text": "Glitch Vid", "time": 1729911570.8252542, "created_utc": 1729424231.0, "url": "https://v.redd.it/pk05erskaqvd1", "title": "Baby do be glitching", "permalink": "/r/GlitchInTheMatrix/comments/1g7wpls/baby_do_be_glitching/", "selftext": "", "media": null, "score": 225, "upvote_ratio": 0.96, "comment_count": 0, "over_18": false}}}