{"_default": {"1": {"id": "1gv23xr", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "IAMONEIAMALL", "link_flair_text": "Discussion", "time": 1732331109.884584, "created_utc": 1732035913.0, "url": "https://www.reddit.com/gallery/1gv23xr", "title": "A Collection of UFO Photos 🛸 ", "permalink": "/r/ufo/comments/1gv23xr/a_collection_of_ufo_photos/", "selftext": "A collection of some lesser known photos from various dates. ", "media": null, "score": 1565, "upvote_ratio": 0.95, "comment_count": 158, "over_18": false}, "2": {"id": "1gsdwl6", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "None", "link_flair_text": "Classic Case", "time": 1732331111.7228842, "created_utc": 1731726019.0, "url": "https://v.redd.it/nvbm3kv8i61e1", "title": "Full 10 minute video showing glowing multi-colored UAP orbs outside a military base in Afghanistan. The orbs are then shot with a missile and are completely unaffected", "permalink": "/r/UFOs/comments/1gsdwl6/full_10_minute_video_showing_glowing_multicolored/", "selftext": "The video is somewhat infamous but I’ve only seen a 60-second or so version posted here before. There are usually comments along the lines of “these are training targets”; however, in this full 10-minute version you can see that the camera switches from FLIR to normal vision, revealing that these are multi-colored glowing orbs that move in a rigid spatial relationship with each other! ", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/nvbm3kv8i61e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/nvbm3kv8i61e1/DASH_96.mp4", "dash_url": "https://v.redd.it/nvbm3kv8i61e1/DASHPlaylist.mpd?a=1734923110%2CMDUzOWNkNTZhYTY5MDRkNzE5ZDA1NWUxNTY5YjQ2YjEzMTRmZmI5NGI4NTc0M2JjMDUzZWY5NjdjNDBhYmEwNg%3D%3D&v=1&f=sd", "duration": 513, "hls_url": "https://v.redd.it/nvbm3kv8i61e1/HLSPlaylist.m3u8?a=1734923110%2CZDA2OWJhNWVjZmUyZTJkMjUxN2NjYjVmMjZkZTI2MTUzZmFjMDliYWJlNjk0MGMyNGQ1Y2UwNjczNDIxNjk5NA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 10733, "upvote_ratio": 0.89, "comment_count": 1730, "over_18": false}, "3": {"id": "1gt1n02", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "None", "link_flair_text": "Video", "time": 1732331113.4736445, "created_utc": 1731804545.0, "url": "https://v.redd.it/tljjppzpzc1e1", "title": "Video showing an extremely close up view of a disc/saucer UAP; the surface of the craft perfectly matches the description in the Immaculate Constellation document: “dynamic, roiling like the surface of the sun” with “intense luminosity”", "permalink": "/r/aliens/comments/1gt1n02/video_showing_an_extremely_close_up_view_of_a/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/tljjppzpzc1e1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/tljjppzpzc1e1/DASH_96.mp4", "dash_url": "https://v.redd.it/tljjppzpzc1e1/DASHPlaylist.mpd?a=1734923112%2COWFhMDg4MzE5MzRjZjQzNGNiMjA0NDBmYTU2Yzc0OWM0NzZhOTQ2MGIyZmQwNjFmZDY4YjIxZjdjMDllNjg0Nw%3D%3D&v=1&f=sd", "duration": 62, "hls_url": "https://v.redd.it/tljjppzpzc1e1/HLSPlaylist.m3u8?a=1734923112%2CMjVmMTYwNjNmMzVjNTU2MzI5M2I2Njk0ODRmMmEzNTYwN2ZiYzQ0NDU1Y2NjODU2NWJiNjQ0NTY0NjQwZGRhNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 5495, "upvote_ratio": 0.87, "comment_count": 758, "over_18": false}, "4": {"id": "1gtuuyc", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "summervogel", "link_flair_text": "Discussion", "time": 1732331114.093734, "created_utc": 1731898191.0, "url": "https://www.reddit.com/r/UAP/comments/1gtuuyc/with_the_recent_congressional_hearing_we_are/", "title": "With the recent congressional hearing, we are witnessing soft disclosure that nonhuman intelligence (I.e., alien life) has been confirmed. We are not alone.", "permalink": "/r/UAP/comments/1gtuuyc/with_the_recent_congressional_hearing_we_are/", "selftext": "While I don’t believe the species who have created these offworld vehicles are here with us, their tech (without a doubt) is here with us on earth. (Someone or something had to make them!) The evidence seems to point to these being either autonomous “unmanned” alien drones or something similar. I wonder what information about us, our world, our culture, is being sent back to whoever made them, wherever they might be? It’s fascinating and exciting. We are aware of 4,000* exoplanets. Are they from one of those? \nI wonder if there’s a way for us to intercept any signals these things are sending back to their home world to find out who sent them here? Who knows. Maybe the military already knows this, and much more. \nI’ve honestly hoped my whole life that we’d get confirmation that we’re not alone during my lifetime. I expected it to happen years from now, if not decades from now. \nBut no. It’s happening now. And basically has been unfolding slowly for a few years now. \nWe aren’t alone, y’all! We basically have confirmation. But it feels cheapened and lost in the media cycle because of everything else going on. \nEven my one friend who I can speak about this topic in a serious way can’t even engage with this news without discrediting it and claiming that he doesn’t care because he can’t think about anything except the US election results. So many of us are so * distracted to see the big picture. \nBe not afraid. And be not distracted. ", "media": null, "score": 287, "upvote_ratio": 0.86, "comment_count": 104, "over_18": false}, "5": {"id": "1gsqszq", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "pystar", "link_flair_text": null, "time": 1732331115.3993695, "created_utc": 1731774146.0, "url": "https://i.redd.it/w072qkenha1e1.jpeg", "title": "How true is this?", "permalink": "/r/conspiracy/comments/1gsqszq/how_true_is_this/", "selftext": "", "media": null, "score": 4878, "upvote_ratio": 0.92, "comment_count": 486, "over_18": false}, "6": {"id": "1gvribp", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "OPiiiiiii", "link_flair_text": null, "time": 1732331115.6149156, "created_utc": 1732115045.0, "url": "https://www.youtube.com/watch?v=D6wOSJNuW1w", "title": "2017 Court Docs: Palantir Owns U.S. Government's Analyzed Data - \"Intellectual Property\"", "permalink": "/r/conspiracyfact/comments/1gvribp/2017_court_docs_palantir_owns_us_governments/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "What Is The Government Doing With Your Data?", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/D6wOSJNuW1w?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"What Is The Government Doing With Your Data?\"></iframe>", "author_name": "OP", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/D6wOSJNuW1w/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@SpotTheOp"}}, "score": 7, "upvote_ratio": 0.99, "comment_count": 0, "over_18": false}, "7": {"id": "1gwonfb", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "treynew5", "link_flair_text": null, "time": 1732331116.166045, "created_utc": 1732219050.0, "url": "https://i.redd.it/48ugzs2l8b2e1.jpeg", "title": "Government placed Bigfoot sign….", "permalink": "/r/bigfoot/comments/1gwonfb/government_placed_bigfoot_sign/", "selftext": "Sign posted on the road to Pikes peak. ", "media": null, "score": 479, "upvote_ratio": 0.98, "comment_count": 62, "over_18": false}, "8": {"id": "1gu8sy4", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "tinoturner6969", "link_flair_text": null, "time": 1732331116.742452, "created_utc": 1731947507.0, "url": "https://i.redd.it/60jcpad5to1e1.jpeg", "title": "Cryptids of Maryland ", "permalink": "/r/Cryptozoology/comments/1gu8sy4/cryptids_of_maryland/", "selftext": "I had fun coming up with ideas for this print. Available as a tshirt. ", "media": null, "score": 498, "upvote_ratio": 0.97, "comment_count": 84, "over_18": false}, "9": {"id": "1gt32do", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "theMothman1966", "link_flair_text": "Mothman", "time": 1732331116.9646702, "created_utc": 1731808972.0, "url": "https://i.redd.it/le6kubl7dd1e1.jpeg", "title": "Today is the 58 anniversary of the Marcella Bennett encounter with the mothman", "permalink": "/r/Humanoidencounters/comments/1gt32do/today_is_the_58_anniversary_of_the_marcella/", "selftext": "Illustrated by Gary Bibeaut", "media": null, "score": 160, "upvote_ratio": 0.98, "comment_count": 13, "over_18": false}, "10": {"id": "1gufswg", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Past-Mycologist3843", "link_flair_text": null, "time": 1732331117.5336177, "created_utc": 1731964599.0, "url": "https://i.redd.it/drk8n6zy7q1e1.jpeg", "title": "Moth man making me feel some typa way… 😩", "permalink": "/r/cryptids/comments/1gufswg/moth_man_making_me_feel_some_typa_way/", "selftext": "", "media": null, "score": 1117, "upvote_ratio": 0.97, "comment_count": 66, "over_18": false}, "11": {"id": "1gvvzit", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "LemonsXBombs", "link_flair_text": "Disemb. Voice", "time": 1732331117.9204116, "created_utc": 1732126265.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gvvzit/something_knocking_at_our_bedroom_door_all_night/", "title": "Something knocking at our bedroom door all night, waking us up with a \"hey\" in the morning.", "permalink": "/r/Thetruthishere/comments/1gvvzit/something_knocking_at_our_bedroom_door_all_night/", "selftext": "This happened just a few nights ago. I waited a few more nights before I decided to post to see if this was some reoccurring, explainable thing. It hasn't happened since so I feel it's appropriate to post.\nMy fiancé and I were going to bed around 10 or 11PM. Our bedroom is in the basement and our room mate lives upstairs. His schedule is the opposite of ours, so we have become accustomed to him knocking on our door later in the night if he needs anything.\nFiancé and I were having our final conversation before drifting off and we hear a familiar knock at the door. \"Come in,\" I say because we're all pretty close and he knows he's welcome. No one steps through the door and I say again, \"come in!\" Still nothing so we call his name and, when he doesn't come in the door, I get up and open it. There was no one there.\n\"Huh,\" I sat and we joke briefly about how it's \"the ghost\" (long story short, we've had some other weird experiences, as people often do with an old house, but nothing as weird as what happened this night) and go to bed.\nFiancé falls asleep and I start to drift off. As I'm falling asleep, another knock. This doesn't wake fiance up so I don't say anything and instead get up and decide to investigate the basement a little. Maybe the cat is being a brat, or something is settling. I note that the knocking sounded similar in tempo to the first time it happened so I wondered if it was some pipes in the walls adjusting to the winter temperatures. I figure, yeah it must be that, but I couldn't help the feeling that the noise was very obviously knocking against our door. We are very used to the sound as our our roommate very often approaches us that way. I also know what creaking pipes sound like and this was not that, nor had the pipes ever adjusted that way in previous winters.\nWell, whatever. It's annoying but no big deal. I go back to bed and actually fall asleep this time. About 30 minutes later, the knocking starts again. *Knock-knock-knock,* it could be something settling in the house but it so obviously sounds like knuckles on the wood of our door. The pattern, the tempo, and the hollow sound of our door. And it IS happening at our door. It's not in the walls or the ceiling. We have our laundry room a room away from our bedroom but our door is so thick that we NEVER hear anything happening out there. It is decidedly weird but I'm tired and have to work in the morning so I try my best to ignore it.\nEVERY 30 minutes to an hour, the knocking comes back and with each occurrence, the knock pattern changes. Deliberate *knock-knocks,* fast *knockknockknockknockknocks,\" there was even a *shave-and-a-haircut.* Each time I'm trying to ignore it and fall back asleep, only to be jostled awake again.\nI had lost track time but I assume it was early morning when I was SHOT awake by a knock followed by a male voice saying, \"Hey!\"\nOkay, so this HAD to have been our roommate. I got up and once again opened to door to find no one. Well, maybe he was messing with us. He has a weird sense of humor. I begrudgingly put on some clothes to go walk around upstairs and find him. Turns out, he's still at work. The house is pitch black and I'm starting to freak out. I go to the front door and see if someone was knocking there and there's no one. Of course if there was someone trying to get in all night, the dog would have been freaking the fuck out, but I really had no other explanation.\nSo, I make myself go back to bed. Maybe the pipes are not only shifting to sound like knocking on wood, but also creaking to sound like a man calling out. The night goes on and, though the knocking continues, I finally get used to it and actually get a few hours sleep...\nUntil around 7AM when my fiancé and I LEAP out of bed to another obvious \"Hey!\" From outside the room. One last time, I open the door to find no one. I confirm with her that yes, she woke up because of the \"hey\" and I explain to her that I've been dealing with the knocking all night.\nRoommate doesn't come home until later in the day and I ask him if he tried to talk to us the previous night. He confirms that never came home and stayed at a friend's house. I tell him what happened and he's as stumped as we are.\nLike I said at the top, we waited the following nights to see if there would be any more weird house sounds and, even as things have warmed up and cooled down again, there have been no more weird noises to suggest pipes or other old house sounds.\nIn general, we're fans of paranormal activity stuff but I always err on skepticism. This was probably the weirdest things to happen to us at this house and I still don't know what it could have been if not some genuine high strangeness.", "media": null, "score": 97, "upvote_ratio": 0.95, "comment_count": 33, "over_18": false}, "12": {"id": "1gtypjj", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "harlequinns", "link_flair_text": null, "time": 1732331118.062233, "created_utc": 1731911705.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1gtypjj/my_new_friend_turned_out_to_be_a_cult_leader/", "title": "my \"new friend\" turned out to be a cult leader", "permalink": "/r/LetsNotMeet/comments/1gtypjj/my_new_friend_turned_out_to_be_a_cult_leader/", "selftext": "PSA: Oh my god there have been TWO new incidents since my original post. I've had to edit this bitch twice. Receipts at the end.\n_\ntdlr; I thought I was meeting a group of likeminded women and instead, I just watched a cult take advantage of vulnerable people\nSo, this started on one of those \"meet new friends\" apps.\nI'm not just a huge loser, I swear. I moved to my current city during the pandemic and have a work from home position, so it just hasn't been the prime circumstances for a social life.\nI matched with this random girl, we'll call her Annie. I can't remember if I saw her first or vice versa. Honestly, I was paying more attention to the profiles than the pictures, and she seemed okay. Spirituality came up somehow. I can't remember how this happened either, and to be fair, it could have been either of us. I've recently been more seriously following norse paganism, but it wasn't something I was seeking to explore with other people. It's mostly a private thing, not to mention my own beliefs are more metaphorical.\nBut that doesn't mean I'm closed to the experience entirely. So when she mentioned having a \"LGBTQ neurodivergent pagan femme\" coven, I was like... okay wow, that's either very specific or very broad. But hey, why not? Maybe it'll be fun. So we agreed to meet first before I went to the event.\nONE weird thing that stuck out in our text conversation was that her partner was in some \"bizarre Scientology rehab\". At first, I assumed this was a place where one recovers from Scientology lmfAO. But I DID ask her if her partner was a Scientologist. I didn't get an answer.\nWe only met for an hour to have coffee. I think more red flags would have popped up if we'd had more time, because the little things that went off on my radar were things that weren't... THAT weird. Like there were explanations, or I decided to give her the benefit of the doubt, and my dumbass didn't ask again about the Scientology thing. I kept MEANING to google Scientology rehab, but kept... forgetting to do it. I've since googled it and can't find anything about a rehabilitation for ex-Scientologists soooooo I wish I'd done that sooner.\nThere were, however, OTHER things that stuck out. They're relatively benign out of context, but putting everything together in retrospect made me feel dumb:\n- She wouldn't answer any direct questions about herself. And not for lack of asking. I'm the kind of person who is conscious of when the attention is ALL on me, so it made me uncomfortable, and I didn't... learn anything about her, really. Most of what she said had to do with her spiritual \"awakening.\"\n- Her spiritual awakening itself sounded weird asf. She said she had a realization that she was like a lighthouse that was drawing people toward their personal enlightenment. And okay, I DID think this was weird, but like? She's from California, idk. Maybe that's normal. I just chalked it up to her personal beliefs being whatever they were.\n- Reincarnation came up. Reincarnation is a big part of paganism, although Asatru additionally focuses on your ancestors. She told me she didn't think she had any past lives and is a \"new\" soul, which doesn't make a lot of sense, but okay. Whatever. Not my circus, not my monkeys. The vaguely supernatural element she placed on herself was strange, but I know a lot of people want to feel special. That didn't mean I had to believe it.\n- At one point, I told her about this random woman I met at the pagan festival who tried to con me. She wanted to charge me so I could be \"under her wing\" or whatever, lmfao. I don't need someone to protect or guide me, so I declined. As I was telling this story, I could tell Annie was conflicted. Like she wanted to agree, but didn't. Finally she said something blasé, like how it was only inappropriate because the student should CHOOSE the teacher. So I clarified that I did not want a teacher.\n- Her responses were very mirroring. And I'm not a moron. I was getting a weird sense that she wasn't being honest with me, that she was telling me things that I wanted to hear, and told myself she was probably just nervous. I have a strong personality. I'm very independent, so I can understand if someone wouldn't want to go up against the things I said at our very first meeting.\nI know I'm just dumb at this point, but I didn't want to be paranoid. I don't trust people easily and I KNOW that, so I was trying to loosen up and be more chill.\nYeah, big mistake.\nSo, I go to this thing.\nIMMEDIATELY it's weird, ya'll. IMMEDIATELY. The second I step foot in that house, I'm uncomfortable. It's filled with people and completely silent. Everyone is looking at me. I'm laughing and saying hi, and no one is like... really responding, lmfao, and here I am awkwardly dropping my keys AND phone while everyone is just watching me.\nEventually I take a seat on this short couch, because there's no room in the large circle. It's a very small living room and there are like 20 people circled up. There's a cushion on the couch, so I sit on that. The \"leader\" starts talking, and as she's going on, I'm looking around at the people there. I was curious. Out of the corner of my eye, I see the leader TRYING to look at me. The girl sitting in front of me is partially blocking our view of each other, so the leader is like... leaning over to try and meet my gaze. Finally I felt awkward enough to like, shift over, so that I was leaning against the arm of the couch.\nStaying perched on a fuckin cushion was UNCOMFORTABLE by that point, so I shifted off and spread out a bit to be more comfortable. The leader ended the speech with, \"so spread out, I GUESS,\" which was clearly directed at me. It was said with some humor though, so I... wasn't sure what to make of it.\nEveryone introduces themselves and is their own unique brand of neurodivergent. I'm ADHD, but I guess I don't subscribe to labels beyond the requirement to stay medicated. I've been medicated since 2015, so this isn't a new diagnosis for me. That was the ONLY question we got asked about ourselves, beyond our name.\nThe leader guides us through this meditation, and people are making these weird breathing sounds and hums. I get it. It's spiritual, right? UNFORTUNATELY, my ADHD ass can't focus to save my life, and it's impossible for me to follow the guided meditation. I do not understand. HOW can anyone with actual attention issues listen past trills and deep nose breathing?\nSo I'm sitting there with my eyes closed and BARELY paying attention. Because I can't. But I DO hear the leader say that we should think of anything we'd want to ask her, or need from her, and THAT got my attention. Wtf did I need to ask her? Other than where the snacks were. Because I paid 8$ and don't see a single snack.\nOnce the meditation ended, Annie and the leader walked around to give us material for an activity. Annie gave me two long pieces of twine and the leader gave me two sticks. As the leader was handing me the sticks, I asked her where the snacks were.\nShe was like \"in the kitchen. On the table. Where snacks tend to be.\"\nI'm a dry, sarcastic person, so I thought it was her brand of humor. I laughed and played along all, \"oh right, I think I'll find them!\"\nLiterally she was deadpan, unsmiling. \"Mm-hm.\" And then walked away.\nSo stupid me thought she might just be like that, but then I saw her laughing with the other girls, and realized something was off. As the activity commenced, she went back over to Amy and started stroking her back, kissing her hair, and giving me this creepy smile. YEAH. IT WAS WEIRD. I was so uncomfortable, I wanted to get up and go. But I couldn't.\nWhy? Because of this damn activity.\nThe activity was the last straw. They wanted us to think of something we wanted to discard that brought us pain. Then they wanted us to FEEL how bad that thing made us feel, as we slowly twisted the piece of twine around the stick. That's shit I would only ever do with my therapist. Obviously, people were emotionally melting down before long.\nI wasn't comfortable doing the activity for obvious reasons. So I sat there awkwardly with the sticks and the string in my lap. I was the only one NOT doing it, and it was obvious. But because I wasn't doing it, I had the opportunity to watch Annie and the leader, and it was chilling.\nAnnie was doing some weird pyramid thing above her head with her arms. There were a lot of references to her as being a lighthouse, or some sort of guiding figure throughout the meeting. She was the ONLY one who wasn't doing the ritual, other than the other leader. They were both running it. Suddenly, it occurred to me (as it probably did to ya'll already) that Annie had been using this app JUST to bring people into their group. She was the only person who seemed to know EVERYONE, yet no one there knew each other. Even the name of the group now made sense - they weren't being *specific*, they were casting a wide net. And I had this big realization in a handful of seconds. It made my stomach turn.\nSo yeah. I was done. But I couldn't get up, because people were sharing their experiences and shit, pouring their hearts out. This was the most fucked up part of it, imo. There's no reason to do a releasing ceremony that forces people to feel their trauma. Especially at the VERY FIRST MEETING. It's also inherently manipulative, because it requires people to let their guard down. Then they can \"save the day\" by showing people how to release the very same pain THEY just inflicted.\nBut that isn't the fault of the people there, so I didn't want to disrespect them. Like, people were sobbing on top of my shoes I left by the door. I had to wait for the best time to ask someone to pass them to me. Finally I got up and told everyone I had to go to the car, then took off.\nI texted Annie and told her I wouldn't be back and that I hoped she found \"her people\", lmfao. Just make sure you're not her people. Be REALLY careful of any spiritual ceremony or practice that demands vulnerability from you, especially directed by people who don't know you beyond a name.\nAnnie, let's not, under any circumstances, ever EVER meet. Again.\nAnd if ya'll ever hear the term \"neurodivinity\", run. If ADHD made me divine then I'd be on my 94th incarnation by now.\n_\nEDIT: Ya’ll there’s been an update. The girl who ran it texted me and I have the receipts. Don't worry, she's got ThEm CeRtiFiCaTiOns!!! It's also EXTRA hilarious that she accuses me of projecting my trauma and insists that's why I took issue with her method. THEN she had the audacity to APOLOGIZE for the imaginary trauma she assumes I have. ALso... I don't know why she thinks I actually did the exercise, because I left behind the twine and sticks untouched. I did not participate or even try to think of a trauma to release.\nBecause to be honest, although there's some trauma in my past, I'm not haunted by it, and have worked through a lot of it with a licensed therapist. The ad hominem attacks were just silly to me.\n_\nEDIT EDIT: oh my GOd I am shaking this time. Ya'll. I went back on the app bc I had new matches and messages. One of them seemed normal at first, we were talking about video games, and she asked me about zelda. Zelda is my name on a lot of social media. People typically assume it's about the video game, but I'm actually weirdly obsessed with Zelda Fitzgerald lmfao I'm a lit nerd ok. Anyway, she said \"I would love to get together and hear more about what Zelda means to you.\"\nOkay seriously, who talks like that? I'll give you two guesses, but you're only going to need one. So I looked at her profile. 0 mention of spirituality. Finally I ask, dreading the answer, and she is part of Annie's group.\nWhat's particularly hilarious was how vehemently the leader denied getting her members from that app, and yet, the VERY NEXT PERSON I ENCOUNTER ON THE APP is in her group.\nI swear, ya'll. I swear. I am getting off this fucking app. I am deleting it off my phone. I'm getting an entirely new phone. I'm changing my number. I'm going to space.\nFuck new friends.", "media": null, "score": 467, "upvote_ratio": 0.99, "comment_count": 57, "over_18": true}, "13": {"id": "1gwimgy", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "HamletX95", "link_flair_text": null, "time": 1732331118.1856143, "created_utc": 1732204826.0, "url": "https://i.redd.it/y6al8y362a2e1.jpeg", "title": "In 2006, a 70-year-old fire lookout disappeared from her isolated post near Hinton, Alberta, leaving behind only a smear of blood on the porch of her cabin. No trace has been found in the 16 years since. ", "permalink": "/r/truecreepy/comments/1gwimgy/in_2006_a_70yearold_fire_lookout_disappeared_from/", "selftext": "", "media": null, "score": 209, "upvote_ratio": 0.99, "comment_count": 8, "over_18": false}, "14": {"id": "1gug72m", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "matchacry", "link_flair_text": null, "time": 1732331118.324345, "created_utc": 1731965571.0, "url": "https://www.reddit.com/r/threekings/comments/1gug72m/the_mouth_of_god/", "title": "The Mouth of God", "permalink": "/r/threekings/comments/1gug72m/the_mouth_of_god/", "selftext": "Forewarning:  This is not merely a guide to the occult, but a harbinger of curse. For those who dare invoke its rites, prepare to be bound in perpetuity to the inky blackness that precedes the dawn of time, doomed to a tormented existence besieged by nightmares and visions potent enough to fracture the strongest of wills.\nOrigins: In the dim recesses of time, when Earth lay unformed and the heavens but a canvas devoid of stars, there thrived beings of immense power and malevolence, beings that even the gods hesitated to name. Foremost among these was a presence known simply as \"The Mouth.\" Legends whisper that The Mouth was the nascent echo of creation, a voice rising from the void to speak of all that was and all that could never be. This entity, older than the cosmos itself, holds knowledge so profound and so harrowing that it taints all who dare to perceive it.\nIt is told that King Solomon, in his insatiable thirst for wisdom, once summoned The Mouth. From their encounter, he penned a chapter of the Goetia so accursed that all copies were believed destroyed. Yet, whispers persist of a sole surviving manuscript, the Liber Obscurum, which is rumored to contain the true rite of The Mouth along with other dark arts.\nPreparations:\n\nEncase the room with heavy, black drapes to banish all light, mimicking the eternal abyss.\nA Candle of Midnight Black: To be lit only briefly, serving as a beacon to the shadows.\n\nA Boundary of Salt and Charred Bone Dust: Blend these to create a barrier between the realms of mortals and the abyss.\n\n\nAn Heirloom Mirror: A relic, preferably, that has borne witness to the visages of the departed.\n\nA Silver Blade: To draw blood, a sacrifice essential to capture the attention of The Mouth.\nA Veil of Black Velvet: To shroud the mirror after the ritual, entrapping the essence of the entity.\nA Cup of Wormwood Tea: Brewed to be consumed post-ritual, emblematic of the bitter knowledge to be gained.\n\nThe Ritual:\nThe Summoning:\n\nInitiate at the stroke of midnight, the witching hour when the veil between realms is thinnest.\nIgnite the candle and position it before the mirror. Encircle yourself with the salt and bone dust.\nWith the silver blade, incise your palm, letting your blood seep onto the surface of the mirror while chanting:\n\"From the void, I summon thee, The Mouth that speaks from beyond the sea of stars. Speak, and let your words unfold the cosmos before me.\"\n\n\n\nThe Revelation:\n\nExtinguish the candle, plunging the room back into darkness. Gaze into the mirror, allowing your eyes to adapt until shadows begin to dance within the glass.\nA voice will emerge, not through your ears but within your mind, speaking in the primordial tongue of creation. Its message, though arcane, will imbue you with a terror and understanding beyond words.\n\nThe Binding:\n\nDrape the mirror with the black velvet, sealing The Mouth's presence within. Recite the binding oath:\n\"By blood and bone, I bind thee to this silent throne. Speak no more but through the dreams of lore.\" \n\n\n\nThe Closing:\n\nCast the remaining salt and bone dust over the cloth-covered mirror, ensuring it is thoroughly concealed.\nConsume the wormwood tea, embracing the bitter truth you now possess.\n\nAftermath:\n\nYou shall be afflicted by relentless nightmares, each a vision of potential realities and cosmic truths too formidable for mortal comprehension.\nShadows will cling more closely to you, and whispers will tease the fringes of your awareness—The Mouth still imparting its accursed wisdom.\nMirrors will spontaneously fog, a sign that The Mouth continues to observe.\n\nCautions:\n\nNever perform this ritual more than once, for each summons deepens the entwining curse.\nThe insights gained will forever set you apart from your fellow man, isolating you within your cursed existence.\nGuard against sharing this knowledge; to do so is to propagate the curse, dooming others to the fate you now endure.\n\nIn your quest for the forbidden, you have tethered yourself to an eternal darkness, one that will forever overshadow the light of your days.", "media": null, "score": 11, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "15": {"id": "1gx260e", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Lowyy_hatake_99", "link_flair_text": null, "time": 1732331118.7735758, "created_utc": 1732259380.0, "url": "https://www.reddit.com/gallery/1gx260e", "title": "photo of a real ghost (Little Girl in a church)", "permalink": "/r/Ghosts/comments/1gx260e/photo_of_a_real_ghost_little_girl_in_a_church/", "selftext": "Hello everyone, I wanted to leave you with one of the clearest ghost photographs ever taken. I'm going to give you context, the following photograph was taken in 2017, in a school in the city of Rosario, Argentina. That was a day of activities, where we played various games and had snacks with classmates and teachers. That afternoon, some classmates and I went to the church located at the back of the school, we entered, climbing a staircase that connects with a storehouse of religious figures.  At that moment, a colleague took a photograph, in it you can see a little girl in a white dress, who I assure you was NOT there, nor did we see her at any time. When we got home, they sent the photo to the course group and our blood ran cold... What do you think?", "media": null, "score": 1984, "upvote_ratio": 0.88, "comment_count": 292, "over_18": false}, "16": {"id": "1gxh1s4", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "LunarLinguist42401", "link_flair_text": "Glitch Pic", "time": 1732331118.930445, "created_utc": 1732306106.0, "url": "https://i.redd.it/pbj9fgskfv1e1.jpeg", "title": "How this frozen Diet Pepsi exploded", "permalink": "/r/GlitchInTheMatrix/comments/1gxh1s4/how_this_frozen_diet_pepsi_exploded/", "selftext": "", "media": null, "score": 93, "upvote_ratio": 0.95, "comment_count": 10, "over_18": false}, "17": {"id": "1gsyv0a", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "ornulf1", "link_flair_text": null, "time": 1732331120.4025047, "created_utc": 1731796408.0, "url": "https://i.redd.it/gxz561mubc1e1.jpeg", "title": "October 2024 this was taken by an elderly lady in Kvalsund in Norway.", "permalink": "/r/ufo/comments/1gsyv0a/october_2024_this_was_taken_by_an_elderly_lady_in/", "selftext": "", "media": null, "score": 786, "upvote_ratio": 0.91, "comment_count": 82, "over_18": false}, "18": {"id": "1gt48h4", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "None", "link_flair_text": "Video", "time": 1732331121.5328772, "created_utc": 1731812818.0, "url": "https://v.redd.it/86jsrv2mod1e1", "title": "Video showing an extremely close up view of a disc/saucer UAP; the surface of the craft perfectly matches the description in the Immaculate Constellation document: “dynamic, roiling like the surface of the sun” with “intense luminosity”", "permalink": "/r/UFOs/comments/1gt48h4/video_showing_an_extremely_close_up_view_of_a/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/86jsrv2mod1e1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/86jsrv2mod1e1/DASH_96.mp4", "dash_url": "https://v.redd.it/86jsrv2mod1e1/DASHPlaylist.mpd?a=1734923120%2CZTg0OWM0ZDAzNjE2YmFhNmE1ZTkxNTAwZWMyNmNjZTY0N2Y1OWJkODkzOWI1NzZmMmU4YWVhMmFiNzBmNTNhZQ%3D%3D&v=1&f=sd", "duration": 62, "hls_url": "https://v.redd.it/86jsrv2mod1e1/HLSPlaylist.m3u8?a=1734923120%2CODYwOGZiZmZiNTNlNzljZWRjYTE4OWZkNTMzNTFkYzExOTYyMTM5YzZiMmU1ODk2N2Q1NTEzNzljYWY5ZGY5ZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4439, "upvote_ratio": 0.86, "comment_count": 654, "over_18": false}, "19": {"id": "1gtijwl", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "None", "link_flair_text": "Video", "time": 1732331123.4540262, "created_utc": 1731864110.0, "url": "https://v.redd.it/gi2w5rm5xh1e1", "title": "Video showing a cluster of 14 luminous orbs hovering in the sky over the middle of the ocean", "permalink": "/r/aliens/comments/1gtijwl/video_showing_a_cluster_of_14_luminous_orbs/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/gi2w5rm5xh1e1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 852, "width": 480, "scrubber_media_url": "https://v.redd.it/gi2w5rm5xh1e1/DASH_96.mp4", "dash_url": "https://v.redd.it/gi2w5rm5xh1e1/DASHPlaylist.mpd?a=1734923121%2CYzY3MTAxZmFiMzUwOTgwOThlYWZkMzhmMjkzYWU2MmFjODAxMjE2YWM0ODgyZjg0MWE3YTk5YzVjYTE2Y2ViOA%3D%3D&v=1&f=sd", "duration": 30, "hls_url": "https://v.redd.it/gi2w5rm5xh1e1/HLSPlaylist.m3u8?a=1734923121%2CYjlhM2EwMzkxN2FhZTkzNTdmMTBkMWIyYWU0NTg0MTg2NjkzNGRjMDBjMjJhODAxMzJlMTNiMGFjMGEzYjYyZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2534, "upvote_ratio": 0.96, "comment_count": 327, "over_18": false}, "20": {"id": "1gsihgj", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Irish_Goodbye4", "link_flair_text": "Documentary", "time": 1732331124.13423, "created_utc": 1731743431.0, "url": "https://www.reddit.com/r/UAP/comments/1gsihgj/george_knapps_investigation_alien_on_netflix_is/", "title": "George Knapp’s “Investigation Alien” on Netflix is Terrific", "permalink": "/r/UAP/comments/1gsihgj/george_knapps_investigation_alien_on_netflix_is/", "selftext": "I think it’s #3 on Netflix’s top shows this week.  George Knapp calls out and exposes AARO for being a fake-news obstructionist organization.   He does a good job weaving in different key UAP disclosure faces (Vallet, Nolan, Grusch, Fravor, Graves, Mellon, etc etc).\nThis is an excellent show to get the masses more informed about this important topic.\n.", "media": null, "score": 204, "upvote_ratio": 0.88, "comment_count": 68, "over_18": false}, "21": {"id": "1gtsi8d", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Ahsaasinator", "link_flair_text": null, "time": 1732331125.2228267, "created_utc": 1731890960.0, "url": "https://i.redd.it/p3nb4s305k1e1.jpeg", "title": "I can. One word. Israel.", "permalink": "/r/conspiracy/comments/1gtsi8d/i_can_one_word_israel/", "selftext": "", "media": null, "score": 3927, "upvote_ratio": 0.92, "comment_count": 316, "over_18": false}, "22": {"id": "1gw4qvk", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "mralstoner", "link_flair_text": null, "time": 1732331125.4407814, "created_utc": 1732153720.0, "url": "https://www.youtube.com/watch?v=oM7I7wAVfxc", "title": "As I read the biography of Mohammed, it was very disturbing ", "permalink": "/r/conspiracyfact/comments/1gw4qvk/as_i_read_the_biography_of_mohammed_it_was_very/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "British Evangelist Slashed, Imprisoned, Threatened with Death, Keeps Going", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/oM7I7wAVfxc?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"British Evangelist Slashed, Imprisoned, Threatened with Death, Keeps Going\"></iframe>", "author_name": "CBN News", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/oM7I7wAVfxc/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@CBNnewsonline"}}, "score": 3, "upvote_ratio": 0.71, "comment_count": 0, "over_18": false}, "23": {"id": "1gui9a7", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "FarEntrepreneur3781", "link_flair_text": "evidence", "time": 1732331125.9621363, "created_utc": 1731970769.0, "url": "https://i.redd.it/mzlpd1hbqq1e1.jpeg", "title": "Had some weird activities at my camp during the night. Found hair the next morning. ", "permalink": "/r/bigfoot/comments/1gui9a7/had_some_weird_activities_at_my_camp_during_the/", "selftext": "I am a believer andy property has has a lot of odd stuff and I have some hair I simply can't explain ", "media": null, "score": 363, "upvote_ratio": 0.88, "comment_count": 187, "over_18": false}, "24": {"id": "1gtng9y", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "ANSISP", "link_flair_text": "Art", "time": 1732331126.4758053, "created_utc": 1731877009.0, "url": "https://i.redd.it/avkw5c6gzi1e1.jpeg", "title": "Images of the Bunyip", "permalink": "/r/Cryptozoology/comments/1gtng9y/images_of_the_bunyip/", "selftext": "", "media": null, "score": 228, "upvote_ratio": 0.92, "comment_count": 41, "over_18": false}, "25": {"id": "1gsr4eg", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "MinusGoji", "link_flair_text": "Unsolved", "time": 1732331126.6966984, "created_utc": 1731775013.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1gsr4eg/my_final_update_this_is_what_i_saw_in_a_field_in/", "title": "My Final Update: This is what I saw in a field in 2018; I talked to the owners ", "permalink": "/r/Humanoidencounters/comments/1gsr4eg/my_final_update_this_is_what_i_saw_in_a_field_in/", "selftext": "First post: https://www.reddit.com/r/Humanoidencounters/comments/1gild7s/this_is_what_i_saw_in_a_field_in_2018/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button\nSecond post: https://www.reddit.com/r/Humanoidencounters/comments/1gjdgz9/update_this_is_what_i_saw_in_a_field_in_2018_i/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button\nThese last couple of days have been really unsettling for me. On one hand it‘s been nice to read all the comments and input on what I could do to further investigate. On the other hand it has been terrifying to revisit this encounter in such detail and to carve away at the mystery of what I‘ve seen for the first time basically ever. My excitement quickly turned to fear of what I might find and talking to the owners only deepened my worry.\nI had pretty much dismissed the idea of talking to the owners of the field in my head. I had convinced myself that I didn‘t want to come off as weird by asking them six years after the fact and I also convinced myself that nothing would come off it anyway. I think I was honestly just afraid that they might not be able to give me what I wanted to hear which is that what I‘d seen was nothing more than a scarecrow of sorts. Holding back on asking them is what kind of kept that possibility a reality in my mind and gave me some comfort in knowing it could‘ve been a scarecrow, so I didn‘t want to rob myself of that comfort by talking to them to potentially find out it wasn’t. Well it wasn’t.\nI took these last week to really think about how I want to continue with this and I thought about what they told me 24/7. I‘ve been as afraid and as paranoid as I‘ve ever been since my encounter and I‘m not sure if I want to continue looking into this. I tried to stop thinking about it and distracting myself but what they’ve told me is keeping me awake and keeping me from functioning normally these last days. I even have doubts about sharing what they told me and I have not idea if I‘m just reading way too much into this. But I took a chance on asking them so now I‘m gonna take a chance on telling you guys what they said.\nI told them what I saw and tried to leave out as much of the weird details as possible so as to not come off as crazy. I basically asked them if they ever had a weird looking silver Scarecrow or machine in one of their fields. They were very VERY interested to find out more about what I‘d seen. Apparently around the time right after my encounter, so April of 2018, they had to stop using the field for their horses because the horses repeatedly got sick from grazing there and were acting weird and unusual in general. They said they had the field looked at by a an environment examiner. They didn’t hear back for a while until they were informed that the land had been contaminated but didn‘t receive a detailed explanation of what happened. They told me it was very hard to get a concrete answer on what happened to their field and that they received an offer to buy their field by some sort of environmental protection organization a couple of months after the official examination. They told them that the field would most likely never be safe for usage again and that they wanted to make further examinations of the ground. Apparently it was a very good offer which made it possible for the owners to move on from all the losses they endured due to the sick horses and new space they had to rent for them to graze, so they took it.\nThey told me that they’ve never heard back about the field and that they could never get any information when they tried to talk to someone. They have also never seen anyone other than that first examiner look at the field. I showed them the pictures I took (see my second post) and they said that they know nothing of fires or anything similar which could‘ve caused the ground to look like it looks and they were very surprised because they thought no one was active at the field but from my pictures it looks like there is. That would also explain the weird smells but I’ve also never seen anyone in that area other than farmers and other dog walkers or people going for walks. The stress of the whole situation made them to just want to be done with it but they were still very interested in what I‘d seen and the pictures I took and they pretty much asked me more question than I asked them.\nWhen they told me their horses got sick I got extremely worried about my dogs since they were biting at some of the surrounding grass but both are fine at this time and I‘ve never seen any sort of signs that warned people of contaminated grass or something. So either the area is not contaminated anymore, it never was contaminated or me and my dogs got very lucky.\nStill, I‘m extremely paranoid that I did something very stupid. I wish I never talked to them and I just hope I didn‘t give them any ideas. I‘m scared that they tell the people who bought the field about what I‘ve seen (if they don‘t already know). I don‘t want them to get in trouble and I‘m scared for my safety. I‘m very paranoid. Looking back now the way I acted was so stupid and naive. I’ve already compromised way too much about myself and I think it would be downright dangerous to continue.\nThank you everyone.", "media": null, "score": 133, "upvote_ratio": 0.95, "comment_count": 15, "over_18": false}, "26": {"id": "1gsywit", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "No-Meaning-860", "link_flair_text": null, "time": 1732331127.3033543, "created_utc": 1731796533.0, "url": "https://v.redd.it/17yp3dsdkb1e1", "title": "A snake covered in algae", "permalink": "/r/cryptids/comments/1gsywit/a_snake_covered_in_algae/", "selftext": "", "media": null, "score": 578, "upvote_ratio": 0.99, "comment_count": 39, "over_18": false}, "27": {"id": "1gvkql0", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "FederalSherbert2625", "link_flair_text": null, "time": 1732331127.6125968, "created_utc": 1732090261.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gvkql0/i_saw_a_fairy/", "title": "I saw a fairy ", "permalink": "/r/Thetruthishere/comments/1gvkql0/i_saw_a_fairy/", "selftext": "I ain't crazy I ain't trippin I know what I seen I ain't had any good luck or any bad but I seen one magical or just weird shit who knows but they are definitely real ", "media": null, "score": 43, "upvote_ratio": 0.79, "comment_count": 32, "over_18": false}, "28": {"id": "1gshbpe", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "MrSatanSuperSaiyan", "link_flair_text": null, "time": 1732331127.7762337, "created_utc": 1731738600.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1gshbpe/the_time_a_stranger_followed_me_for_hours_and/", "title": "The time a stranger followed me for hours and wouldn’t let me escape", "permalink": "/r/LetsNotMeet/comments/1gshbpe/the_time_a_stranger_followed_me_for_hours_and/", "selftext": "A few years ago, I (35M) had a terrifying experience that still haunts me today. I was living in a busy city at the time, and I had just finished a late shift at work. It was around 10 PM, and I was walking home through the quieter side streets of my neighborhood. I’m someone who’s always been somewhat cautious, so I was alert, keeping an eye out for any unusual activity.\nAs I walked down the street, I noticed a guy about 20 feet behind me. At first, I didn’t think much of it—he seemed like just another person walking the same route—but something about his movements caught my attention. He wasn’t walking in a normal manner. He was clearly trying to keep his distance, but his pace matched mine, no matter how fast or slow I went.\nAfter a few blocks, I decided to take a detour. I turned onto a side street that was a little less populated, hoping he wouldn’t follow. I checked over my shoulder, and sure enough, he was still there. It’s hard to describe, but I felt the hair on the back of my neck stand up. My instincts told me something wasn’t right.\nI crossed the street, hoping that would throw him off. But he crossed too, without hesitation. I thought, “Okay, this is weird now.” I had to make a decision. I wasn’t that far from home, but something about this guy’s persistence made me uncomfortable. I decided to stop at a nearby 24/7 convenience store to try to lose him.\nThe store was empty, save for the cashier, who barely looked up from their phone. I quickly grabbed a drink and stood by the door, hoping to see if the guy would pass by. He didn’t. He stopped right outside the store. At this point, I could see his face clearly through the glass. He was staring directly at me.\nI panicked and ran back into the aisles, trying to calm down. I could hear his footsteps growing louder as he approached the door. I couldn’t stay here any longer. I tried to pay, but I was so rattled I couldn’t focus on anything. The cashier just stared at me, probably wondering why I looked so frantic. I threw the drink on the counter, paid quickly, and bolted out the door.\nI ran down another street, not wanting to look back but knowing I had to. I didn’t see him for a while, and my heart slowly started to calm down. But as I turned the corner to my street, I saw him again, standing at the far end of the block. It was like he had been waiting there the whole time.\nI wasn’t sure what to do next. I considered calling the police, but he hadn’t really done anything illegal, just followed me for a while. I didn’t want to overreact. But I also couldn’t shake the feeling that this wasn’t a coincidence. He was still standing there, watching me, and now he was closer. I took a deep breath, checked both ways, and made a beeline for my apartment building, not daring to look back until I was inside.\nWhen I got to my apartment, I locked the door and stayed there, staring out the window for what felt like hours. I didn’t see him again after that night, but the whole experience left me unsettled for weeks. I never felt comfortable walking home alone late at night after that, even though I’ve lived in the city my entire life.\nI still wonder if I was just being paranoid, but there was something off about the way he followed me. It felt intentional, and it left me with a gut feeling I couldn’t shake.\nIf you're reading this, the guy who followed me for hours that night—let’s not meet again.", "media": null, "score": 201, "upvote_ratio": 0.97, "comment_count": 14, "over_18": true}, "29": {"id": "1gt5bed", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "FranceCance", "link_flair_text": null, "time": 1732331128.0370245, "created_utc": 1731816556.0, "url": "https://www.reddit.com/r/threekings/comments/1gt5bed/have_you_ever_had_anything_happen_by_reading_the/", "title": "Have you ever had anything happen by reading the rituals?", "permalink": "/r/threekings/comments/1gt5bed/have_you_ever_had_anything_happen_by_reading_the/", "selftext": "Hello, FranceCance here. I know everyone says just reading the rituals won't cause anything horrible to happen, but I do believe it can have some lesser after effects. \nI know some paranoid people are reading this, I'll tell you first and foremost. You're going to be OK. I'm alive, it's just frightening having some of these things happen. If you're scared, I suggest saying a prayer.\nI've seen some cursed pictures, and some cursed stories that say you'll be cursed after reading them, and nothing happened. (Yay! It was a relief.) It seems people have worse luck with rituals from Asia, could it be because they're older? I've heard stories of people having problems after reading the ritual, but not performing it. On the brightside, effects seem to be muted compared to those who do the ritual.\nHave you ever had any creepy things happen to you or others after reading rituals?", "media": null, "score": 6, "upvote_ratio": 0.88, "comment_count": 1, "over_18": false}, "30": {"id": "1gtuzb2", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "stellanuova", "link_flair_text": null, "time": 1732331128.5067728, "created_utc": 1731898587.0, "url": "https://www.reddit.com/gallery/1gtuzb2", "title": "Possible UK Cotswolds Phantom Caught on a Hike", "permalink": "/r/Ghosts/comments/1gtuzb2/possible_uk_cotswolds_phantom_caught_on_a_hike/", "selftext": "Today my boyfriend and I were looking back at old pics he took while hiking the Thames River path in the UK in 2013. He has this beautiful shot of the trail (which he was alone on). The picture looks like the trail heads toward a clearing in the trees. For some reason, I decided to zoom in today and realized that it isn’t a clearing at all. It genuinely looks like a white glowing shape and changes a bit from the first to the second pic. Any thoughts on what this could be would be awesome. It gave me chills when I saw it. All these years later to find this….We always just thought it was “light at the end of a tree tunnel.” The second pic was zoomed in. ", "media": null, "score": 1243, "upvote_ratio": 0.91, "comment_count": 214, "over_18": false}, "31": {"id": "1gvr2m6", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Jaded-Wafer-6499", "link_flair_text": "Glitch Vid", "time": 1732331128.6846042, "created_utc": 1732113889.0, "url": "https://v.redd.it/i1w15swzi22e1", "title": "The Miracle of the Sun at Medjugorje (Bosnia and Herzegovina) - Photosensitive Seizure Warning!", "permalink": "/r/GlitchInTheMatrix/comments/1gvr2m6/the_miracle_of_the_sun_at_medjugorje_bosnia_and/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/i1w15swzi22e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/i1w15swzi22e1/DASH_96.mp4", "dash_url": "https://v.redd.it/i1w15swzi22e1/DASHPlaylist.mpd?a=1734923128%2CNGRlODAyZjIwMzk5OGQ5ZDk1YjdjMDM2Zjk5ZjdlMjRhNDI4MjI2MDg4MmJkZDRkNTAyOTc5NWQzYzAwYTI1MQ%3D%3D&v=1&f=sd", "duration": 289, "hls_url": "https://v.redd.it/i1w15swzi22e1/HLSPlaylist.m3u8?a=1734923128%2CYjhmNjJmODE2OGRjNWQ4ZTBkYTdmYWE3OGMyMTlmZjJmYmRkNTEzNzgxOTRhMzU1YjBjM2Q1OWU0NTRjZWM1Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 48, "upvote_ratio": 0.75, "comment_count": 28, "over_18": false}, "32": {"id": "1guf4o7", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "None", "link_flair_text": "Discussion", "time": 1732331130.553873, "created_utc": 1731962919.0, "url": "https://www.reddit.com/r/ufo/comments/1guf4o7/the_eisenhower_briefing_document_that_was_leaked/", "title": "The \"Eisenhower Briefing Document\" that was leaked in 1984 is public-domain evidence that non-human bodies were recovered at the Roswell crash", "permalink": "/r/ufo/comments/1guf4o7/the_eisenhower_briefing_document_that_was_leaked/", "selftext": "EDIT: Added more information regarding the validation of the \"Majestic Documents\"\nThis 8 page briefing document was created for President Eisenhower after the formation of the original 12 Majestic member group. The original document is dated 11/18/1952, but it was leaked to researcher Jamie Shandera in 1984. The document details how the Kenneth Arnold sighting had caused near hysteria in the public, and describes a secret operation that recovered the wreckage as well as the bodies of four small human-like beings. \nhttps://preview.redd.it/92onkcqn2q1e1.png?width=1748&format=png&auto=webp&s=eb062a4441fb321f5f6852ffb1449a51e87ccab2\nThe document goes on to state that after biological analysis of the recovered bodies, they found that they are definitely not human, although outwardly appear human-like. \nhttps://preview.redd.it/factyilp2q1e1.png?width=1748&format=png&auto=webp&s=1db8e8746c14112842d2863f01e5c9c9e26d0b2e\nRegarding the fact that this document is part of the “Majestic Documents” leak, please note this review paper that serves as a follow up to the decade-long effort to analyze every aspect of these documents to determine their validity, including forensic analysis, cross referencing names/dates with official US gov. documents, and time-period accuracy. They found “very strong points of authentication imbedded in almost every document” - you can see their summarized conclusions for yourself here or the full 30 page research paper here.\nThere is an FBI archive link that is often cited as a way to discredit the Majestic Documents - after the leak in 80s, these documents were sent to the FBI - and to date we don’t have any indication that they did any sort of analysis on these documents. In fact, it’s possible they saw the word “extraterrestrial” and immediately assumed it was “bogus”, as the stigma prevails even at the highest level of government :)", "media": {"type": "imgur.com", "oembed": {"provider_url": "http://imgur.com", "description": "Discover the magic of the internet at Imgur, a community powered entertainment destination. Lift your spirits with funny jokes, trending memes, entertaining gifs, inspiring stories, viral videos, and so much more from users.", "title": "Imgur", "url": "https://imgur.com/a/97Zgm2n", "type": "rich", "thumbnail_width": 790, "height": 955, "width": 600, "html": "<iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fimgur.com%2Fa%2F97Zgm2n%2Fembed%3Fpub%3Dtrue%26ref%3Dhttps%253A%252F%252Fembed.ly%26w%3D790&display_name=Imgur&url=https%3A%2F%2Fimgur.com%2Fa%2F97Zgm2n&image=https%3A%2F%2Fi.imgur.com%2FKYMlzWc.jpg%3Ffb&type=text%2Fhtml&schema=imgur\" width=\"600\" height=\"955\" scrolling=\"no\" title=\"Imgur embed\" frameborder=\"0\" allow=\"autoplay; fullscreen; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe>", "version": "1.0", "provider_name": "Imgur", "thumbnail_url": "https://i.imgur.com/KYMlzWc.jpg?fb", "thumbnail_height": 1197}}, "score": 665, "upvote_ratio": 0.95, "comment_count": 148, "over_18": false}, "33": {"id": "1gwi38t", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "thegman1966", "link_flair_text": "Discussion", "time": 1732331131.946357, "created_utc": 1732200805.0, "url": "https://i.redd.it/0j4hanvbq92e1.jpeg", "title": "Met Lue Elizondo last night. He told me something encouraging.", "permalink": "/r/UFOs/comments/1gwi38t/met_lue_elizondo_last_night_he_told_me_something/", "selftext": "I went to Lue’s speaking engagement last night at the Texas Theatre in Dallas, TX. Good presentation, btw.\nAfterwards, I got to meet Lue and get my pic taken with him. I asked him one simple yes or no question.\nI started by saying “I’m 58.” That’s all Lue needed to hear. He knew exactly what I was about to ask. He replied “You’ll live to see Disclosure.”\nIn fact, he strongly implied that if I just live two more years to be 60, I’ll see Disclosure.\nLue couldn’t say much more than this, but he also strongly implied that a major event was gonna occur in 2027.\nI know Lue is a controversial character around here, but I trust the guy. He comes across as being intelligent, sincere, and trustworthy. And he’s a helluva nice guy in person.\nHere’s the thing. I believe you just gotta believe in something. Is Lue perfect? No, of course not. But I do believe that he knows what he’s talking about.\nSo anyway…get ready. The Disclosure train ain’t stopping now. They’re coming.", "media": null, "score": 3798, "upvote_ratio": 0.81, "comment_count": 1378, "over_18": false}, "34": {"id": "1gt6542", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Masteruserfuser", "link_flair_text": "Video", "time": 1732331133.234667, "created_utc": 1731819527.0, "url": "https://v.redd.it/5vqfng8k8e1e1", "title": "Stabilised version of the sun ufo", "permalink": "/r/aliens/comments/1gt6542/stabilised_version_of_the_sun_ufo/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/5vqfng8k8e1e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/5vqfng8k8e1e1/DASH_96.mp4", "dash_url": "https://v.redd.it/5vqfng8k8e1e1/DASHPlaylist.mpd?a=1734923132%2CYjI2NjlhZDhiZWY4NDBkMmNhOGE4MjdmMTIwMGQwOWZiOGQ0NWM4MGI3ZGUyMDFjM2M3MmY4MmExNTk5M2Q3NQ%3D%3D&v=1&f=sd", "duration": 21, "hls_url": "https://v.redd.it/5vqfng8k8e1e1/HLSPlaylist.m3u8?a=1734923132%2CMTNiNDdjYzM2MzMzYjgzNWY2YjUyYzhkODUwMThiZTVkODY0Y2RmZDc1MTUyYmJmMTU3ZDhiMDQ4OWFkNjIwMw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1844, "upvote_ratio": 0.95, "comment_count": 399, "over_18": false}, "35": {"id": "1gvx9d4", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": null, "time": 1732331133.8693306, "created_utc": 1732129359.0, "url": "https://x.com/KOSHERRRRR/status/1859147574587867447", "title": "Ryan Graves responds to AARO: \"If the AARO office actually spoke with the pilots that were involved in that incident, they would know the objects were part of a larger formation of objects.\" ", "permalink": "/r/UAP/comments/1gvx9d4/ryan_graves_responds_to_aaro_if_the_aaro_office/", "selftext": "", "media": null, "score": 196, "upvote_ratio": 0.98, "comment_count": 59, "over_18": false}, "36": {"id": "1gsp4xd", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "ComfortableYak2071", "link_flair_text": null, "time": 1732331134.9041767, "created_utc": 1731769464.0, "url": "https://i.redd.it/7lwi8viq3a1e1.jpeg", "title": "If this is true, you know why they want him dead so badly ", "permalink": "/r/conspiracy/comments/1gsp4xd/if_this_is_true_you_know_why_they_want_him_dead/", "selftext": "", "media": null, "score": 3693, "upvote_ratio": 0.92, "comment_count": 354, "over_18": false}, "37": {"id": "1gxonsl", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "OPiiiiiii", "link_flair_text": null, "time": 1732331135.1328151, "created_utc": 1732327057.0, "url": "https://www.youtube.com/watch?v=_5B6PM_5_Wk", "title": "NATO: Directed Energy Weapons (DEW), Havana Syndrome, Cognitive Warfare, & 'Hacking the OODA Loop'", "permalink": "/r/conspiracyfact/comments/1gxonsl/nato_directed_energy_weapons_dew_havana_syndrome/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "NATO: Directed Energy Weapons (DEW), Havana Syndrome, Cognitive Warfare, & 'Hacking the OODA Loop'", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/_5B6PM_5_Wk?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"NATO: Directed Energy Weapons (DEW), Havana Syndrome, Cognitive Warfare, &amp; &#39;Hacking the OODA Loop&#39;\"></iframe>", "author_name": "OP", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/_5B6PM_5_Wk/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@SpotTheOp"}}, "score": 2, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "38": {"id": "1gwlgzn", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Wellifitisntjoe", "link_flair_text": null, "time": 1732331135.7687755, "created_utc": 1732211484.0, "url": "https://i.redd.it/7cx8k683ma2e1.jpeg", "title": "i think if we ever capture a live bigfoot we should drop it off at north sentinel island and see what happens ", "permalink": "/r/bigfoot/comments/1gwlgzn/i_think_if_we_ever_capture_a_live_bigfoot_we/", "selftext": "", "media": null, "score": 284, "upvote_ratio": 0.85, "comment_count": 108, "over_18": false}, "39": {"id": "1gtojtq", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "ApprehensiveRead2408", "link_flair_text": "Discussion ", "time": 1732331136.2892697, "created_utc": 1731879881.0, "url": "https://i.redd.it/gz1ycf7m7j1e1.jpeg", "title": "What do you think about ennedi tiger,a african cryptid that are theorized to be living sabretooth cat? Could ennedi tiger really exist?", "permalink": "/r/Cryptozoology/comments/1gtojtq/what_do_you_think_about_ennedi_tigera_african/", "selftext": "", "media": null, "score": 207, "upvote_ratio": 0.99, "comment_count": 14, "over_18": false}, "40": {"id": "1gu265u", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Vivid_Plastic_741", "link_flair_text": "Alien", "time": 1732331136.5014176, "created_utc": 1731927436.0, "url": "https://i.redd.it/9av9agsg5n1e1.png", "title": "Strange Humanoid Encounter in Abruzzo, Italy, 1978.", "permalink": "/r/Humanoidencounters/comments/1gu265u/strange_humanoid_encounter_in_abruzzo_italy_1978/", "selftext": "Location: San Vito Chietino, Abruzzo, Italy.\nDate: December 23, 1978.\nTime: 20:30.P.M.\nThe Bucco family was returning from visiting relatives when a dazzling light began following their vehicle. The light overtook the vehicle and the vehicle suddenly stopped without the driver applying the brakes. Then at the same time a strange little man crossed road in front of the vehicle in strange bounding jumps. Mr. Bucco thought he had struck the figure with the car. The figure then quickly bounded away and disappeared into a nearby pine grove. Francesco and Fiorentina Bucco reported seeing one humanoid, but the other two passengers in the vehicle reported seeing two. The figure or figures wore brown “astronaut” like suits, large helmets with black square visors, and 5-digit white gloves. The beings were about 1 meter in height and moved over the road in a strange unison-robot like manner, floating 20-35 cm above the road as if bouncing on an invisible cushion. Mr. Bucco noticed a green flashlight like object wrapped over the humanoid’s shoulder.\nSource: Archivio S.U.F. & Moreno Tambellini, “Alieni in Italia: 1945-1995: 50 anni di Incontri Ravvicinati.”", "media": null, "score": 120, "upvote_ratio": 0.98, "comment_count": 11, "over_18": false}, "41": {"id": "1gtiqf4", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "phonester", "link_flair_text": null, "time": 1732331137.004601, "created_utc": 1731864579.0, "url": "https://i.redd.it/vdi7w7xjyh1e1.jpeg", "title": "Cryptids...", "permalink": "/r/cryptids/comments/1gtiqf4/cryptids/", "selftext": "", "media": null, "score": 324, "upvote_ratio": 0.99, "comment_count": 3, "over_18": false}, "42": {"id": "1gwlc8d", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Voyagar", "link_flair_text": null, "time": 1732331137.30063, "created_utc": 1732211188.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gwlc8d/creepy_glimpse_out_the_window_in_my_student_days/", "title": "Creepy glimpse out the window in my student days", "permalink": "/r/Thetruthishere/comments/1gwlc8d/creepy_glimpse_out_the_window_in_my_student_days/", "selftext": "One of the weirder experiences I have had happened  many years ago, while I was a student at the university in Oslo, the capital of Norway. Most probably it happened n 2008 or 2009. I was friends with a fellow student at the time, we used to meet frequently, both at the university and back at the dormitories were we lived. We also went to the same fencing club together. One summer we used to meet a lot at the top of the tall dormitory building where he lived, which was located in Sogn student town. The building had a lot of floors, I seem to remember it had 10, so it was taller than most of the other dormitory houses sprawled around it. My friend lived in the top floor. There was a quite small balcony at one end of the top floor, where it was possible to get some fresh air. The floor itself was quite deserted the times I were there, I rarely saw anyone else, and we had the balcony for ourselves. We used to grill out there, drink wine and smoke a hookah he had, and in general had a great time together. \nOne late evening I remember we got back into the shared student kitchen after having been sitting out on the balcony for quite some time. It was pitch black outside. At one end of the kitchen, there was a row of large windows, looking out in the dark night. I believe we may have been talking about mysterious topics, but I am not sure. We sat at a kitchen table by the row of windows, all alone, facing each other across the table. Outside the window, and fastened above it, there was hanging a power cable to the ground far below. Suddenly, I noticed in the corner of my eye that there was a dark figure hanging below the cable, crawling up it. My friend noticed it too, staring in fear and being so frightened that he fell of his chair. I instinctively pushed away from the window myself in the same instant. The ‘vision’ lasted only a second or two. We both talked about it, and found out that we had seen the same figure crawling up the cable. If anyone of you have seen the movie «Aliens», the sequel to the horror classic «Alien», you might remember a scene where the characters are hiding in a kind of control room at the space colony. They are very anxious, as the electronic detectors indicate many aliens are closing in on them, but they cannot understand how. Then one of them opens one of the ceiling plates above them and takes a look inside. He sees the aliens hanging upside down and crawling forward inside this narrow space. The crawling movement of the figure I saw, was exactly the same. At the time, I dismissed it as a shared illusion or hallucination. We were surely scared, but I left the place soon afterwards. I do remember me and my friend talking about the experience later, several times, but I did not attach any importance to it. It was merely a curiosity. \nHowever, many years later (in 2021 or 2022), I shared the experience with another friend. And he immediately said: «Check if somebody has fell from the building». The thought had never entered my mind, but I promptly searched in Google for this. And, lo and behold, it came up right away. Several news articles came up, describing how one student had fell out of a building at Sogn student town and died. It happened during a party. The police had researched it, but found no evidence of anything criminal. This occurred in 2006, a few years prior. I immediately contacted the old student friend whom I had seen the figure with, sharing the news articles, and asking about his opinion. And he said he knew of the case. It was a foreign exchange student from Russia who had fallen out of the same building he had lived in. My friend said he had fallen out from the floor below where we sat, if he remembered correctly. There had actually been rumours for a long time afterwards about sightings of his ghost in the area.\nSo what I originally had regarded as just a trick of the mind, became all these years later something much more eerie. Was it really a ghost? I don't know, and I never will. I certainly had never heard about the death of the student at the time the experience occurred, so it cannot just be my mind imagining things based on my expectations of something paranormal occurring. If anyone has experienced something similar, please share. This experience has at least led me to consider other peoples weird experiences with an open mind.  ", "media": null, "score": 33, "upvote_ratio": 0.97, "comment_count": 5, "over_18": false}, "43": {"id": "1guq7l4", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "whisperwhite222", "link_flair_text": null, "time": 1732331137.4473815, "created_utc": 1731994808.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1guq7l4/creepy_fedex_driver/", "title": "Creepy FedEx Driver", "permalink": "/r/LetsNotMeet/comments/1guq7l4/creepy_fedex_driver/", "selftext": "This is a long story, so stick with me. \nI, (23F) am a bartender. I have some crazy stories where I have been genuinely scared for my life, but this has got to be the worst. \nI’m working a double at the restaurant. Around 11 am a delivery man comes in with a package that I had to sign for. He comes, I sign for the package, and tell him to have a good day with a smile. I continue my shift per usual. This was a Friday or Saturday, I can’t remember specifically, but later on we got BUSY. The restaurant and parking lot full. I see a lot of different people daily, plus seeing someone (for the 2nd time ever) out of their uniform, you may not recognize them. FedEx driver comes and sits at the bar. I don’t (obviously) remember him from the 25 second interaction we had that morning. I start talking to him as I do all my customers. I get him a drink, appetizer, another drink, entree, etc. Our conversation started…\nHim: “how long have you worked here?” \nMe: “a few years, I’ve worked my way up” \nHim: “how do you like it here?”\nJust regular conversation with a bar guest. It slowly became…. Not so regular. He asked me if I had a boyfriend, I said yes. He would change the subject and then go back. Complimenting me saying how beautiful I was ever few minutes. \n“Can I have you number?” \n“No, I don’t think my boyfriend would appreciate that.” \n“Okay What’s your last name, we could just be Facebook friends?” All annoying, but normal interactions I have had with men in this industry. \nHe started to become really pushy over time. Pressing for my phone number or social media. I continued to politely decline and laugh it off. \nHe then tells me… “I actually came this morning to drop off a package with fedex. You signed for it??? I came back just for you..”\nI smile, and continue with my stupid customer service “oh yeah, I remember you!” Smile and laugh it off. \nI even stepped in the back to vent to my manager at this point, about how he was being extra pushy and uncomfortable. \nFlash forward about an hour, he pays his tab and leaves. I’m just glad he’s gone at this point. \nWe’ll say as a guess, it’s about 7 pm when he leaves. We are still busy, and we close at 10. \nWe finish dinner service, customers slowly start to leave, and the restaurant is finally empty. Ive been cleaning for a while, and am finally finishing up. It’s about 10:30 at this point. I’m cleaning the bar, I look up, (the whole front of the restaurant that im facing consists of large windows that face the parking lot) and I see one (1) car in the parking lot, I notice that the delivery driver/ guest from earlier, is standing outside of the car, walking around it and seeming like he is cleaning the backseat out. Doors open, and he is leaning in and out with a bag. As soon as I realized it was him, who had “left” almost 4 hours ago, my heart sank. Why was he still here?? Why was he cleaning the back seat out?? I freak. My manager and I are the only people left in the restaurant at this point. It’s almost 11. I run to her and tell her everything. About how he came back “just for me” and about how he had seemingly left 4 HOURS ago, and I made her come from the back of the restaurant to behind the bar up front so she could see him in the parking lot… idk, WAITING for me???? \nShe says she’s gonna call the police. At this point my boyfriend and I had an apartment literally 5 minutes away from the restaurant. I told her not to worry about it, I’ll just call my boyfriend to come get me. \nI did just that, but my bf could immediately tell something was wrong, and when I’m scared/ anxious, I ramble…. So I gave him a quick debriefing of what was going on. He said he would be there soon and I hung up. My manager made me sit in the office until he got there, so I didn’t see this go down. \nAll I remember is my boyfriend coming into the restaurant to get me, walking me to the car through the back door, and me getting home. \nMy boyfriend, who is very confrontational and protective, later tells me, that he pulled in the parking lot to see fedex driver sitting in the drivers seat of his car. My bf walked up to his car and knocked on the window for him to roll it down. He does, and my boyfriend tells him something along the lines of “ you need to get out of here” this is where the scariest thing happens.. the dude responded to him in a different language, mumbling and acting like he didn’t speak English!! My boyfriend said something like “I know you speak English, you’ve been talking to my girlfriend all night, and you need to get out of here” dude continued to ramble in a different language, until my boyfriend raised his voice and basically said, you have 15 seconds before I pull you out of this car and you never leave this parking lot, for the guy to finally, put the car in drive and speed off. \nI was on edge for weeks after this interaction and even considered switching jobs. \nWhy was he still in the parking lot that long after close and hours after cashing out his tab, and WHY was he cleaning his back seat???? \nTo the creepy bar guest/delivery driver, let’s never meet again. ", "media": null, "score": 141, "upvote_ratio": 1.0, "comment_count": 9, "over_18": true}, "44": {"id": "1gsysxh", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Sazzify", "link_flair_text": null, "time": 1732331137.7151577, "created_utc": 1731796239.0, "url": "https://www.reddit.com/r/threekings/comments/1gsysxh/tominos_hell/", "title": "Tominos Hell ", "permalink": "/r/threekings/comments/1gsysxh/tominos_hell/", "selftext": "I recently read the Japanese poem “Tominos Hell” In STRICTLY The Japanese Version Assuming The English Version wouldn’t harm me . I would usually Just Assume its fake like i do to most chainmails or creepy pastas But after learning the poem was created in 1919 I was more Frightened Because this was Before people online liked to scared people .\nWill i be okay?", "media": null, "score": 6, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "45": {"id": "1gutn0e", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Gloomy-Molasses6108", "link_flair_text": null, "time": 1732331138.018063, "created_utc": 1732009903.0, "url": "https://www.reddit.com/gallery/1gutn0e", "title": "Look at what I found on my deer cam, and temp changes 10 degrees between photos and hour apart ", "permalink": "/r/Ghosts/comments/1gutn0e/look_at_what_i_found_on_my_deer_cam_and_temp/", "selftext": "Here are two pictures from my trailcam, and the photos are taken a hour apart. Can anyone tell me what they think it is?", "media": null, "score": 578, "upvote_ratio": 0.94, "comment_count": 44, "over_18": false}, "46": {"id": "1gty32k", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Stephen_P_Smith", "link_flair_text": null, "time": 1732331139.6842153, "created_utc": 1731909322.0, "url": "https://www.dailymail.co.uk/sciencetech/article-14084477/Pentagon-UFO-crash-commercial-airliner-New-York-bombshell-report-released.html", "title": "Pentagon says UFO nearly crashed into commercial airliner above New York - as bombshell report is released", "permalink": "/r/ufo/comments/1gty32k/pentagon_says_ufo_nearly_crashed_into_commercial/", "selftext": "", "media": null, "score": 392, "upvote_ratio": 0.91, "comment_count": 76, "over_18": false}, "47": {"id": "1gtgtye", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "whatsthis1005", "link_flair_text": "Likely Identified", "time": 1732331141.0187323, "created_utc": 1731859692.0, "url": "https://www.reddit.com/gallery/1gtgtye", "title": "Strange lights in the South Pacific Ocean around 1:49 am. Does anyone know what this could be?? ", "permalink": "/r/UFOs/comments/1gtgtye/strange_lights_in_the_south_pacific_ocean_around/", "selftext": "", "media": null, "score": 2757, "upvote_ratio": 0.94, "comment_count": 413, "over_18": false}, "48": {"id": "1gukmvi", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "None", "link_flair_text": "Video", "time": 1732331143.3082268, "created_utc": 1731977203.0, "url": "https://v.redd.it/8slmby439r1e1", "title": "Video of a man coming face-to-face with an “irregular-type” UAP; the man appears to be locked “in a trance” until it leaves. His reaction matches the descriptions presented at the recent congressional hearing, where Navy personnel were locked “in a trance” for the duration of a UAP encounter at sea", "permalink": "/r/aliens/comments/1gukmvi/video_of_a_man_coming_facetoface_with_an/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/8slmby439r1e1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/8slmby439r1e1/DASH_96.mp4", "dash_url": "https://v.redd.it/8slmby439r1e1/DASHPlaylist.mpd?a=1734923141%2CNzI3YzY4ODc2ZjYzODc4ZjlkNDUzMzI4N2ZhMjdlN2ZlZWE2NWY0YmYwNWFiMWM1YjM0NzZmMTMyNDUwOTVlMQ%3D%3D&v=1&f=sd", "duration": 264, "hls_url": "https://v.redd.it/8slmby439r1e1/HLSPlaylist.m3u8?a=1734923141%2CNDVlZDM5ZTFjOTNmMzRmZGEwNjNlOGQ3MDY3OGIwYTgwOWI4YjMzMTRlODc5NWQyZGFkY2FjZDNlM2MyODZkMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1712, "upvote_ratio": 0.89, "comment_count": 525, "over_18": false}, "49": {"id": "1gsy5pd", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "YuSikFuk", "link_flair_text": "Discussion", "time": 1732331144.0586038, "created_utc": 1731794410.0, "url": "https://www.reddit.com/gallery/1gsy5pd", "title": "I searched for \"Immaculate Constellation\" online and found a weird novel on a writing platform that oddly resembles the Kuwait UAP incident mentioned in the congressional hearing.", "permalink": "/r/UAP/comments/1gsy5pd/i_searched_for_immaculate_constellation_online/", "selftext": "", "media": null, "score": 150, "upvote_ratio": 0.92, "comment_count": 45, "over_18": false}, "50": {"id": "1gv0xz3", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "crazyass13", "link_flair_text": null, "time": 1732331145.1939728, "created_utc": 1732033078.0, "url": "https://i.redd.it/6cjih24vuv1e1.jpeg", "title": "Marjorie Taylor Greene threatens Republican colleagues in House and Senate with the release of the Epstein tapes", "permalink": "/r/conspiracy/comments/1gv0xz3/marjorie_taylor_greene_threatens_republican/", "selftext": "", "media": null, "score": 3538, "upvote_ratio": 0.96, "comment_count": 614, "over_18": false}, "51": {"id": "1gtgrvf", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Vib_ration", "link_flair_text": null, "time": 1732331145.424687, "created_utc": 1731859529.0, "url": "/r/Spiritualchills/comments/1gs4mvi/kundalini_the_term_for_a_spiritual_energy_or/", "title": "Kundalini, the term for ''a spiritual energy'' or ''vital energy'' said to be located at the base of the spine, is propaganda.", "permalink": "/r/conspiracyfact/comments/1gtgrvf/kundalini_the_term_for_a_spiritual_energy_or/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.58, "comment_count": 0, "over_18": false}, "52": {"id": "1gss8kr", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Space_CheetoZ", "link_flair_text": "eyewitness encounter", "time": 1732331145.9224696, "created_utc": 1731778071.0, "url": "https://www.reddit.com/r/bigfoot/comments/1gss8kr/i_swear_on_everything/", "title": "I swear on everything ", "permalink": "/r/bigfoot/comments/1gss8kr/i_swear_on_everything/", "selftext": "[EDIT]\nSorry everyone been kinda busy with more hunting \nWe went out on the plains in the canyon was a bunch of doe's all looking at something me my freind and my dad all commented on this. My dad asked my freind do you want to shoot a doe. He said probably not. I get in the bed of our truck (we were stopped) the deer we shot this morning was bloating dad told me to stab it under the ribs to let air out it did. My freind says \"what the hell is that\" i grabbed my binoculars and my dad grabs the 25-6 for the scope my friend has the other gun. We see this thing running away this is 400 yards away. This thing looked like a fuxking gorilla it was a brownish red color, very sturdy and Its head was up. This was a closed ground. It was running faster then the deer it ran into a feald and we lost it. This is what happend I swear on evething.\nUPDATE: NEIGHBORS IN A CANON A FEW MILES FROM US SAW THE SAME THING THEY CANT EXPLAINE IT EATHER THEY HAVE NEVER SEEN ANYTHING LIKE IT THEY HAVE LIVED ON THIS LAND FOR 80+ YEARS ", "media": null, "score": 158, "upvote_ratio": 0.88, "comment_count": 112, "over_18": false}, "53": {"id": "1gsfxl3", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "DeathSongGamer", "link_flair_text": "Question", "time": 1732331146.5659068, "created_utc": 1731733166.0, "url": "https://i.redd.it/8pwhsrss371e1.jpeg", "title": "I’m sorry if this is a stupid question, but what the hell is this and where did it come from?", "permalink": "/r/Cryptozoology/comments/1gsfxl3/im_sorry_if_this_is_a_stupid_question_but_what/", "selftext": "", "media": null, "score": 190, "upvote_ratio": 0.85, "comment_count": 38, "over_18": false}, "54": {"id": "1gw85ot", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "alien_anthropology", "link_flair_text": "Bedroom", "time": 1732331146.8039384, "created_utc": 1732164145.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1gw85ot/my_childhood_encounter_with_a_gray/", "title": "My childhood encounter with a gray ", "permalink": "/r/Humanoidencounters/comments/1gw85ot/my_childhood_encounter_with_a_gray/", "selftext": "Let me preface this by saying, yes, this happened when I was 7 years old. I know that memory can be tricky, but I have also thought about this experience every day since it happened. It’s less important to me if this experience was real or not, and more important to me that whatever it was - it had a significant, long-lasting impact on my life. \nAnd the crazy thing is, it lasted just a few seconds. \nIt was the night before or early morning of January 25th, 1999. Central California. And I only know the exact date because it was the only time it snowed here (in a really long time anyway) so you can still Google the newspaper articles about it. \nAnyway - basically, I woke up, like sat up straight in bed…and crouching on the bed (one knee bent on the bed, one leg off the bed) was a typical gray alien. Large head, big black eyes. To me the skin looked greenish-gray and had an almost rubbery or just very smooth texture. No nose, slit for a mouth, no visible ears. Remember it not wearing any clothing. \nIt just stared at me and I just remember feeling shocked…like not enough time to even feel terrified (that came the days, weeks, months after). For whatever reason I just laid backed down, turned on my side, put the covers over my head, and I guess I fell asleep. \nThe whole next day I was thankfully partially distracted by a rare snow day, but I also was very aware that I would not be able to go to sleep without feeling petrified for a long time. I thought about telling my parents, but I didn’t have a word for what I had seen. No reference for it. Didn’t know it was an “alien” or a “gray.” For lack of a better word, it was totally alien and unknown to me. \nIt wasn’t until I was at a friends house whose dad was watching a sci fi movie that had typical grays in it, that I learned to associate what I had seen with the word alien, and that they were at least “real” enough to be depicted on tv. And then of course, I noticed them everywhere - in shows, movies, art, etc. \nI accept that this could have been a hallucination or very vivid nightmare or whatever…maybe I had seen them depicted on tv before and my subconscious picked up on it…but it is the single event that led to a lifelong obsession with aliens and unexplained phenomena. Sometimes I wonder if that was the whole point of that experience in the first place or if that’s a part of the reason why they appear to people - just so stories about them will continue to influence our culture, mythos, spirituality, etc. \nAnyway, thanks for reading! ", "media": null, "score": 84, "upvote_ratio": 0.94, "comment_count": 16, "over_18": false}, "55": {"id": "1gw50yl", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "SubstantialPressure3", "link_flair_text": null, "time": 1732331147.3628936, "created_utc": 1732154511.0, "url": "https://i.redd.it/7y4xsq9ow52e1.jpeg", "title": "Look what I found! ", "permalink": "/r/cryptids/comments/1gw50yl/look_what_i_found/", "selftext": "I can only show one side of this multi tool for 5 bucks, idk whether I should show the pretty side of the useful side. \nMaybe the useful side. \nAlso, this sub needs more options for flair. ", "media": null, "score": 192, "upvote_ratio": 0.98, "comment_count": 12, "over_18": false}, "56": {"id": "1gx8gds", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "pixelburst404", "link_flair_text": "Dead Relative(s)", "time": 1732331147.6584573, "created_utc": 1732283955.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gx8gds/siblings_die_on_the_same_day_around_same_time_7/", "title": "Siblings die on the same day, around same time, 7 years apart ", "permalink": "/r/Thetruthishere/comments/1gx8gds/siblings_die_on_the_same_day_around_same_time_7/", "selftext": "My grandma and my great uncle (grandma's brother) were each other's only siblings. They were 3 years apart in age and very close all their life. \nMy grandma died on Nov 21st back in 2017. Soon after, my uncle began showing signs of dementia and has been declining ever since. He passed 7 years to the day, almost to the hour, as my grandma. \nThis could just be me wishing for meaning in my grief, but I think it's more than a coincidence. I felt like my grandma was \"around\" during my last visit with my great uncle.", "media": null, "score": 29, "upvote_ratio": 0.91, "comment_count": 5, "over_18": false}, "57": {"id": "1gsu3kv", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "NoseLaSecuela", "link_flair_text": null, "time": 1732331148.053721, "created_utc": 1731783111.0, "url": "https://www.reddit.com/r/threekings/comments/1gsu3kv/red_door_yellow_door_question/", "title": "Red Door Yellow Door question", "permalink": "/r/threekings/comments/1gsu3kv/red_door_yellow_door_question/", "selftext": "I'm trying to play the Red Door Yellow Door game with my friends and we have a question\nShould the phrase \"Red Door, Yellow Door, Any other color door\" Should it be said in English or can it be said in another language?\nIdk if this is the best place to ask but I don't know where else to ask :(((", "media": null, "score": 4, "upvote_ratio": 1.0, "comment_count": 3, "over_18": false}, "58": {"id": "1gxe2dx", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Used-Fig-5905", "link_flair_text": null, "time": 1732331148.4615505, "created_utc": 1732298544.0, "url": "https://i.redd.it/mqj7ovpysh2e1.jpeg", "title": "I didn't know it was there until my team member showed me the picture she took. Zoom in and look to the right. We were on an investigation in the basement of the building.", "permalink": "/r/Ghosts/comments/1gxe2dx/i_didnt_know_it_was_there_until_my_team_member/", "selftext": "", "media": null, "score": 161, "upvote_ratio": 0.73, "comment_count": 95, "over_18": false}, "59": {"id": "1gv2h5y", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Ad1714", "link_flair_text": null, "time": 1732331149.899831, "created_utc": 1732036807.0, "url": "https://www.usatoday.com/story/opinion/columnists/2024/11/19/are-ufos-real-aliens-spacecraft-cosmos/76410791007/", "title": "We are not alone in the cosmos. Why isn't UFO hearing tearing up Google trends? | Opinion", "permalink": "/r/ufo/comments/1gv2h5y/we_are_not_alone_in_the_cosmos_why_isnt_ufo/", "selftext": "", "media": null, "score": 255, "upvote_ratio": 0.92, "comment_count": 139, "over_18": false}, "60": {"id": "1gv6scq", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "showmeufos", "link_flair_text": "Documentary", "time": 1732331151.4398496, "created_utc": 1732047416.0, "url": "https://x.com/jamescfox/status/1858962257369002430", "title": "James Fox: \"It comes with great pleasure to finally announce the release date of The Program: December 16. What a ride it’s been — thanks for all your help and continued support. Please help spread this far & wide. Let’s GO!\"", "permalink": "/r/UFOs/comments/1gv6scq/james_fox_it_comes_with_great_pleasure_to_finally/", "selftext": "", "media": null, "score": 2657, "upvote_ratio": 0.93, "comment_count": 182, "over_18": false}, "61": {"id": "1gtt4ki", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "None", "link_flair_text": "Video", "time": 1732331152.9122033, "created_utc": 1731892799.0, "url": "https://v.redd.it/9wwp67zgak1e1", "title": "Video of a luminous UAP taken from a private plane. Near the end of the video, the UAP approaches the plane head on at incredible speeds and nearly collides with the plane", "permalink": "/r/aliens/comments/1gtt4ki/video_of_a_luminous_uap_taken_from_a_private/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 450, "fallback_url": "https://v.redd.it/9wwp67zgak1e1/DASH_270.mp4?source=fallback", "has_audio": true, "height": 224, "width": 400, "scrubber_media_url": "https://v.redd.it/9wwp67zgak1e1/DASH_96.mp4", "dash_url": "https://v.redd.it/9wwp67zgak1e1/DASHPlaylist.mpd?a=1734923151%2CMzVjNDI3MjVmOTMyM2Q2ODJhNzg4MDg0YTk2NjFkZGM0MDg5ODllMGFjZDUxZGI3NDk5N2EwZGRkYjk4YzZmZA%3D%3D&v=1&f=sd", "duration": 46, "hls_url": "https://v.redd.it/9wwp67zgak1e1/HLSPlaylist.m3u8?a=1734923151%2CNTAxYzcwNTJkY2U0MzgwZmZmMzgzNzhiNGM1ODExMzcwN2QxODUyYzIyZWUyYjc5MDY5NzJiMGI0ODg1ZTE5MQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1492, "upvote_ratio": 0.95, "comment_count": 137, "over_18": false}, "62": {"id": "1gvfaea", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "princessaurora912", "link_flair_text": null, "time": 1732331153.5868802, "created_utc": 1732070336.0, "url": "https://i.redd.it/k1ayb1udyy1e1.jpeg", "title": "I was surprised to see the Middle East as hotspots for UAP activity from the AARO hearing today. Why are they there?", "permalink": "/r/UAP/comments/1gvfaea/i_was_surprised_to_see_the_middle_east_as/", "selftext": "Not Russia? China? But the Middle East? lol ", "media": null, "score": 119, "upvote_ratio": 0.86, "comment_count": 111, "over_18": false}, "63": {"id": "1gwqt2c", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "dillontooth2", "link_flair_text": null, "time": 1732331154.5675364, "created_utc": 1732224406.0, "url": "https://i.redd.it/n234fz9iob2e1.jpeg", "title": "Probably just a coincidence ", "permalink": "/r/conspiracy/comments/1gwqt2c/probably_just_a_coincidence/", "selftext": "", "media": null, "score": 3492, "upvote_ratio": 0.94, "comment_count": 156, "over_18": false}, "64": {"id": "1gtqnwb", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "BreadAccomplished469", "link_flair_text": null, "time": 1732331154.7911766, "created_utc": 1731885639.0, "url": "/r/Free_Speech_News/comments/1gt8o1z/nigel_farage_has_confirmed_he_has_been_silenced/", "title": "🚨Nigel Farage has confirmed he has been silenced by parliament on the Southport attacks. He says this is the “BIGGEST COVER UP in our life time”.Social media is erupting right now as Starmer and Labour are being exposed at biblical levels.", "permalink": "/r/conspiracyfact/comments/1gtqnwb/nigel_farage_has_confirmed_he_has_been_silenced/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 0.53, "comment_count": 2, "over_18": false}, "65": {"id": "1gxgc6b", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "sasquatchodyssey", "link_flair_text": null, "time": 1732331155.2910388, "created_utc": 1732304282.0, "url": "https://i.redd.it/xyqxbjw0ai2e1.jpeg", "title": "Les Stroud The Question Of Bigfoot ", "permalink": "/r/bigfoot/comments/1gxgc6b/les_stroud_the_question_of_bigfoot/", "selftext": "I am having Les back on the Sasquatch Odyssey podcast on Monday to discuss his new documentary film project. What would you like to see me ask him during the interview? It can be related to his new documentary or anything about Bigfoot? ", "media": null, "score": 116, "upvote_ratio": 0.98, "comment_count": 62, "over_18": false}, "66": {"id": "1gvj53p", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1732331155.8167198, "created_utc": 1732083332.0, "url": "https://i.redd.it/2rwo1sf0102e1.png", "title": "Saber toothed tiger cryptids are found in almost every continent. From sightings near the US/Mexico border, to the cattle-mauling warrigal of Australia, the water dwelling tigre dantero of South America, the fanged mountain tigers of Africa, and the fierce guoshanhuang of China", "permalink": "/r/Cryptozoology/comments/1gvj53p/saber_toothed_tiger_cryptids_are_found_in_almost/", "selftext": "", "media": null, "score": 150, "upvote_ratio": 0.97, "comment_count": 20, "over_18": false}, "67": {"id": "1guf3a0", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "KOPHER_", "link_flair_text": "U.F.O. Humanoid", "time": 1732331156.0402193, "created_utc": 1731962820.0, "url": "https://www.reddit.com/gallery/1guf3a0", "title": "Suited human-like beings from Jupiter in Luanda, Angola without exact month in 1970.", "permalink": "/r/Humanoidencounters/comments/1guf3a0/suited_humanlike_beings_from_jupiter_in_luanda/", "selftext": "The witness referred as Mr. X, a Portuguese national, lived in Angola at the time and ran a company there for 30 years. One evening he went hunting alone in the bush. In an isolated area he suddenly felt something coming from behind him. He turned around and saw something in the sky, which at first he thought was a helicopter. He assumed it was performing an emergency landing and ran towards the scene to possibly render assistance to the pilots. As he approached the location he realized that the object was so bright that he had to shield his eyes from the glare. When he got even closer he saw something that shocked him. The object was not a helicopter, but clearly a UFO which in the distance seemed to have a diameter of fiver meters but which in reality was much larger, possibly 50 meters. Its shape as described by Mr. X was round and on one side of the device black smoke and fire spewed out. When it landed a tripod like landing gear came out.\nConfused, he still wanted to offer his help. Meanwhile a metal ladder dropped down from the top of the object and five men got out. They wore some kind of blue diving suit that shone so brightly that it stung the witness’ eyes. The men wore helmets made of a glass like material that had some kind of shiny metal cover on top, from which a tube came out and connected to the mouth and forehead. Two other hoses ran behind and were connected by two metallic devices on the back of the entities. The men also seemed to have several rope like devices hanging on their backs.\nWhen the entities got down from the ship, X walked up to them. He added that one of them was carrying a strange instrument in his hand. He then made a sign to the, the peace sign used by Natives. This made theme recoil, apparently startled. The leader then spoke to the others in a quick foreign and high-pitched sounding language. According to X. outwardly the entities resembled humans. The one that seemed to be the leader turned to X and spoke to him in a melodious Spanish and told him that they were from the planet called ‘TIOS’, which us earth people knew as Jupiter. Then he scratched the witness’s back, and this gesture was repeated by the other four. At this point, the witness felt sedated, his head was spinning and he was unable to speak. At the same time the leader kept speaking to the witness and wondered how they could have come across a man similar to themselves. He claimed that they were here to help earthlings, and to obtain substances that were indispensable to them. The leader then invited X to inspect their craft. He then allowed himself to be lifted on board. At this moment he was seized with panic, and felt like an ‘ant’ in their presence. The craft was brightly lit inside by an unknown light source. Inside, X saw hundreds of appliances and indecipherable feeder boards, monitors, etc. The leader told him that the craft was powered by some form of electricity. He was taken to a room which resembled a laboratory which contained large maps on a wall. There he saw about 15 other men who were apparently ‘scientists.’ He was then taken to the ‘engineering hall’ and there he saw what appeared to be large ‘smoking’ turbines that were linked by cables. There was also equipment similar to transformers. The witness was soon escorted off the ship and the entities and ship left, but not before promising a return visit.\nHe was taken to a room which resembled a laboratory which contained large maps on a wall. There he saw about 15 other men who were apparently ‘scientists.’ He was then taken to the ‘engineering hall’ and there he saw what appeared to be large ‘smoking’ turbines that were linked by cables. There was also equipment similar to transformers. The witness was soon escorted off the ship and the entities and ship left, but not before promising a return visit.\nAccording to information provided by the witness’s nephew, X apparently experienced another contact which he refused to talk about it. He became very ill after this encounter and finally had to admit himself in a hospital in Lisbon. The doctors could not come up with a satisfactory diagnosis as to what was causing X’s illness. He died in 1973, and according to his nephew during the autopsy it was discovered that his organs had turned green. X never discussed the incident with anyone, except for his family.\nSource: UFO Information 1981 # 1 citing Jose Garrido in ‘UFO Nachrichten’ nr. 245, June 1977.", "media": null, "score": 74, "upvote_ratio": 0.96, "comment_count": 12, "over_18": false}, "68": {"id": "1gxcvpa", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "CryptidKing04", "link_flair_text": null, "time": 1732331156.628163, "created_utc": 1732295613.0, "url": "https://i.redd.it/r6yorix8kh2e1.jpeg", "title": "Never forget that Teddy Roosevelt was going to hunt the Snallygaster ", "permalink": "/r/cryptids/comments/1gxcvpa/never_forget_that_teddy_roosevelt_was_going_to/", "selftext": "", "media": null, "score": 169, "upvote_ratio": 0.98, "comment_count": 10, "over_18": false}, "69": {"id": "1gu96ii", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Bulky_Western357", "link_flair_text": "Unidentified?", "time": 1732331156.9405432, "created_utc": 1731948442.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gu96ii/weird_yellow_cream_ish_colored_humanoid_in_forest/", "title": "Weird yellow cream ish colored humanoid in forest ", "permalink": "/r/Thetruthishere/comments/1gu96ii/weird_yellow_cream_ish_colored_humanoid_in_forest/", "selftext": "A few years ago, I saw something weird in Cumming Ga, in someone’s backyard by a small creek. It was around 4–5 PM during the fall, and everything was calm and quiet, with some birds in the background. I was with a few friends and my brother at the time.\nWe noticed this figure, and it stood out because of how strange it looked. It was cream-colored or off-white and didn’t have any facial features at all. The head looked football-shaped, not exactly a football, more like an elongated oval, and the rest of the figure seemed pretty human-like in shape mixed with alien. It was around the same height or maybe a little taller than a normal person, and it had a slim build — not fat, but not muscular either.\nAt first, it was just standing there, staring at some sticks it had in its hand. After a while, it looked up and stared at us. It didn’t move or make any sound, just stood there watching us. We ended up running away after that. I wasn’t really scared at the time cuz I was like 7 or 8. The area around us was completely still, with no breeze or movement in the trees. It felt too quiet. The stillness added to the weirdness of the whole experience.\nAbout a year or two later, I went back to that area with just a friend and my brother, and I saw it again, only this time it was closer, maybe about 150 feet away. It was still staring at us, just standing there and not doing anything else. It didn’t approach us fast but it slowly slowly hovered towards us, i definitely knew it was aware of us. After that, I never saw it again.\nI was wondering if anyone has seen anything like this before, or if you might know what it could be. A off white or cream colored humanoid with a football-shaped head and no facial features around average height maybe a bit taller.", "media": null, "score": 22, "upvote_ratio": 0.88, "comment_count": 7, "over_18": false}, "70": {"id": "1guk1w4", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Yellow-beef", "link_flair_text": "Captured Apparition ", "time": 1732331158.1000903, "created_utc": 1731975568.0, "url": "https://i.redd.it/ptm8oso7yq1e1.jpeg", "title": "The Mormon Tabernacle in Temple Square. The photo was taken in the early 1940s.  ", "permalink": "/r/Ghosts/comments/1guk1w4/the_mormon_tabernacle_in_temple_square_the_photo/", "selftext": "", "media": null, "score": 128, "upvote_ratio": 0.91, "comment_count": 18, "over_18": false}}}