{"_default": {"1": {"id": "1h24her", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Training_Parsley1519", "link_flair_text": null, "time": 1732936041.6885655, "created_utc": 1732824262.0, "url": "https://www.reddit.com/gallery/1h24her", "title": "Incredible photos of UFOs taken in Brazil, 2011.", "permalink": "/r/ufo/comments/1h24her/incredible_photos_of_ufos_taken_in_brazil_2011/", "selftext": "I'm Brazilian and I recently started looking for content about UFOs. The region where I was born is well known for UFO sightings and abduction cases and, in one of my research I came across these photographs and the report of this man called Edie Meireles. For more information about his story you can access this link here, but it is in Portuguese.\nhttps://ovniologia.com.br/2024/07/sonda-extraterrestre-na-chapada-diamantina-as-fotografias-de-edie-meireles.html#as-fotografias\n.\nAuthor: Edie Meireles\nPark name: Chapada Diamantina National Park\nDate: 2011/02/10\n\"I was going to Serra de Igatú when I saw a spaceship passing over a wall, I got out of the car and took a photo, it was wonderful, an indescribable emotion to have photographed a UFO so clearly visible, about 40 minutes later, still on the road, my car turned off, I braked, I tried to turn on the key and nothing, absolutely nothing, I saw a light on the hood and I looked up and there was a UFO standing over my car, I opened the door and ran, I even stopped to take a Selfie with them. My car was towed by tractor the next day, all electrical parts burned out.\"", "media": null, "score": 3430, "upvote_ratio": 0.88, "comment_count": 468, "over_18": false}, "2": {"id": "1gz43fm", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "sentimental_cactus", "link_flair_text": "Discussion", "time": 1732936043.1659095, "created_utc": 1732489075.0, "url": "https://www.reddit.com/gallery/1gz43fm", "title": "Interesting pics from the supposed leak, what do u guys think?", "permalink": "/r/UFOs/comments/1gz43fm/interesting_pics_from_the_supposed_leak_what_do_u/", "selftext": "", "media": null, "score": 8243, "upvote_ratio": 0.85, "comment_count": 1776, "over_18": false}, "3": {"id": "1h1d9q5", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Botsworth1985", "link_flair_text": "Image 📷", "time": 1732936045.140608, "created_utc": 1732737254.0, "url": "https://i.redd.it/60vo3mg71i3e1.png", "title": "Manchester Airport UAP/Drone floating inches above Tarmac. Taken from inside the cockpit. Zoomed/Enhanced. Link in Comments.", "permalink": "/r/aliens/comments/1h1d9q5/manchester_airport_uapdrone_floating_inches_above/", "selftext": "", "media": null, "score": 14129, "upvote_ratio": 0.83, "comment_count": 2262, "over_18": false}, "4": {"id": "1h286en", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Exact_Band_5259", "link_flair_text": null, "time": 1732936045.664809, "created_utc": 1732835407.0, "url": "https://www.reddit.com/r/UAP/comments/1h286en/ufo_flap_in_the_uk_is_being_caused_by_a_major/", "title": "UFO flap in the UK is being caused by a major transfer of Nuclear material", "permalink": "/r/UAP/comments/1h286en/ufo_flap_in_the_uk_is_being_caused_by_a_major/", "selftext": "Since Nov 14 of this year the US and UK changed their Bilateral Nuclear Defense Treaty that hasn't changed since 1958 and there has been zero news about it, even the press release I found is very limited and clearly very major. The US was capped at a certain amount of Nuclear Weapons they could have in the UK. That cap was lifted 13 days ago or something similar. I think what we are seeing is one of the largest transfers of Nuclear weapons in history. \nI have no idea the timeline as to when they started to alter the treaty but something tells me the Biden Administration wants to disperse their Nuclear weapons to trusted allies before the Trump Admin comes into power and other reasons. Most, if not almost all drones are probably US/UK stuff that's not to say that E.T's are not watching this very closely if not interfering or making themselves known in some manner as UFO's and Nukes go hand in hand and its also possible that some of the activity is Russian and Chinese actors using their own drones to try and surveil this massive movement of Nuclear weapons. That is why the U.S military spokesman said \"We don't know where or who they are, We know they are no harm\" he will obfuscate the truth completely in the first part of the sentence but will tell the truth in the last part and it explains why the US and the UK are not reacting to the apparent threat because its their own gear.\nRussia and the U.S mutually do not want this transfer and policy change to be broadcast openly. Putin would be forced to escalate to not appear weak infront of his country and he has limited options at this point. The U.S doesn't need to broadcast this either as it would be seen as saber rattling and the effect is to strengthen the UK, Russia will know about the transfer and the U.S wants russia to know that going forward even if the U.S were to completely capitulate to Russia the UK will have enough weapons for Mutually Assured Destruction. This is a insurance policy for the US/UK and the free world if the US democracy doesn't survive trump and the U.S leadership becomes vassals to russian leadership and we can no longer rely on the United States to counter Russia(which news flash happened for 4 years under trump's last presidency but now we are in a literal world war).\nIt takes 10-15 days for a military cargo ship to sail from the US to the UK. They probably had the Nukes ready to ship but couldn't go underway until the treaty was alterations were ratified officially which fits into the timeline with all the activity going on 14 days after the treaty changes.\nThis is from the House of Commons in the UK, look at how the start off by saying \" Many of the proposed changes are minor technical amendments relating to outdated language, definitions and terminology\"\nlike its not a major policy change, then the below points are essentially saying \"we cannot rely on the US anymore you are too politically unstable so the Nukes you keep here are actually our nukes now and even if you want them back tough luck\". \nhttps://commonslibrary.parliament.uk/research-briefings/cbp-10086/\nhttps://www.state.gov/united-states-and-united-kingdom-bring-amendment-to-mutual-defense-agreement-into-force/\n(This was all copy and pasted from a email I sent last sorry for any errors or formatting issues", "media": null, "score": 768, "upvote_ratio": 0.9, "comment_count": 220, "over_18": false}, "5": {"id": "1h0ldfa", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Swatieson", "link_flair_text": null, "time": 1732936046.9890506, "created_utc": 1732651601.0, "url": "https://i.redd.it/bgc772pqya3e1.png", "title": "This qualifies as a major conspiracy theory", "permalink": "/r/conspiracy/comments/1h0ldfa/this_qualifies_as_a_major_conspiracy_theory/", "selftext": "", "media": null, "score": 5769, "upvote_ratio": 0.87, "comment_count": 855, "over_18": false}, "6": {"id": "1h1au1u", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Disastrous_Monk_4079", "link_flair_text": null, "time": 1732936047.3085837, "created_utc": 1732731218.0, "url": "https://v.redd.it/779o6cq12c3e1", "title": "Elvis was a Peado... ", "permalink": "/r/conspiracyfact/comments/1h1au1u/elvis_was_a_peado/", "selftext": "", "media": null, "score": 4, "upvote_ratio": 0.63, "comment_count": 1, "over_18": false}, "7": {"id": "1gzr75q", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "1KN0W38", "link_flair_text": "question", "time": 1732936047.8626297, "created_utc": 1732562311.0, "url": "https://i.redd.it/h39mvnz9l33e1.jpeg", "title": "What would you do?", "permalink": "/r/bigfoot/comments/1gzr75q/what_would_you_do/", "selftext": "Take the shot or let him grow a couple more years. ", "media": null, "score": 689, "upvote_ratio": 0.9, "comment_count": 1026, "over_18": false}, "8": {"id": "1h02c9r", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "DragonflyStandard499", "link_flair_text": "Discussion ", "time": 1732936048.4381218, "created_utc": 1732591714.0, "url": "https://www.reddit.com/gallery/1h02c9r", "title": "Just a guess ", "permalink": "/r/Cryptozoology/comments/1h02c9r/just_a_guess/", "selftext": "I was thinking about aliens today so I went on Google images to look at the flatwoods monster because he looks so ridiculous I call him a little goober. Anyway then something jumped into my mind. You know what he looks like? An owls. Let me explain.\nWhen some species of owl get scared or startled the puff up their feathers to appear larger. And some owls eyes also glow if you point a light or film it on camera. So imagine this. You're walking at night in the woods and hear something so you look and it's a creature that appears to have a huge head and glowing eyes. You'd think it's an monster or an alien. Could it be?", "media": null, "score": 760, "upvote_ratio": 0.96, "comment_count": 66, "over_18": false}, "9": {"id": "1h0zrw9", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "yourhoobastanks", "link_flair_text": "Unidentified", "time": 1732936048.6627364, "created_utc": 1732696313.0, "url": "https://i.redd.it/18lw3tgqne3e1.jpeg", "title": "I know I'm not crazy lol", "permalink": "/r/Humanoidencounters/comments/1h0zrw9/i_know_im_not_crazy_lol/", "selftext": "I had a really terrible day today. Not to get into it but I went to my BF's house once he got off work for some comfort and not be alone lol. I was meaning to leave his house around midnight but I ended up taking a little nap and waking up at 2:00 a.m. I have things to do tomorrow so this was not in the plan and I walked home which was about 3/4 of a mile from his house. I don't want to give away the exact location but this was not far from University of Cincinnati, and I've seen a lot of strange things walking home late at night but never felt in danger usually. I was about halfway home and noticed this person (? Lol) walking in front of me pretty erratically. You can kind of see in this picture the feet and they were definitely what I would call shuffling, not walking. Most of the buildings in this area are cookie cutter so I tried to keep about 1 to 2 buildings distance between us because for some reason in the back of my head my subconscious told me not to pass this person. They were going slower than me so I had to slow down. A guy walking his dog was between us at one point and looked at whatever this was and then looked at me, who was low-key watching YouTube videos while walking home and his reaction made me kind of pay attention for real as to what this person was lol. He was looking at me like WTF basically 🤣😭 That was about five buildings away from mine. I kept my distance but once I got to my building something told me to take a picture. This is lit entirely by the street lights and when I opened my camera 1x made it look way farther away so I zoomed in. Upon zooming in is when I noticed the head shape, And I got a deep overwhelming feeling of dread as I snapped this 😭 any ideas? I ran into my building's side door bc it literally felt surreal lol and I can't stop thinking about it. A friend told me to post here so I am on a throwaway", "media": null, "score": 618, "upvote_ratio": 0.82, "comment_count": 151, "over_18": false}, "10": {"id": "1gyvjq0", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "breck69", "link_flair_text": null, "time": 1732936049.0659018, "created_utc": 1732467354.0, "url": "https://i.redd.it/8t088a5xqv2e1.jpeg", "title": "Mothman tattoo", "permalink": "/r/cryptids/comments/1gyvjq0/mothman_tattoo/", "selftext": "Thought this would be appreciated here. 2 days back to back, one more session to go to finish it off ", "media": null, "score": 4144, "upvote_ratio": 0.99, "comment_count": 67, "over_18": false}, "11": {"id": "1gzduha", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "TurbulentDot5660", "link_flair_text": null, "time": 1732936049.3148277, "created_utc": 1732521476.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gzduha/unnatural_figure_on_road/", "title": "Unnatural figure on road", "permalink": "/r/Thetruthishere/comments/1gzduha/unnatural_figure_on_road/", "selftext": "Hello, I am using a translator because my English is not very good so I apologize for any bad English. The other night I was driving through Culiacán around 9 and saw a disturbing figure crawling along the road. It looked like a woman with long straight hair but it didn't look human. It had no legs and had large hands that looked like they had claws and had a very thin neck. I couldn't see much of her face because it was dark but she seemed pale. I don't know if this was real or if it was just my imagination playing tricks on me, but it was still very creepy.", "media": null, "score": 37, "upvote_ratio": 1.0, "comment_count": 9, "over_18": false}, "12": {"id": "1h0nqkr", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "MUKworld", "link_flair_text": null, "time": 1732936049.5045705, "created_utc": 1732657488.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1h0nqkr/the_man_in_the_crawlspace/", "title": "The Man in the Crawlspace", "permalink": "/r/LetsNotMeet/comments/1h0nqkr/the_man_in_the_crawlspace/", "selftext": "This happened to me about five years ago, and even now, I get chills just thinking about it.\nI was renting a small house in a quiet neighbourhood at the time. It wasn’t anything fancy, but it was cosy, affordable, and had a lot of character. The only thing I didn’t love was the crawlspace under the house. The access door to it was in the laundry room, a square wooden hatch flush with the floor. It was locked from the outside, and I never had any reason to open it. I figured it was just pipes, cobwebs, and the usual creepy crawlspace stuff.\nOne evening, I came home late from work. It had been a stressful day, and all I wanted was to shower and collapse into bed. As I stepped inside, I noticed something strange: my laundry room light was on. I was sure I had turned it off that morning. But I chalked it up to being absentminded in my rush and turned it off again.\nThat night, I woke up around 2 a.m. to a faint noise. At first, I thought it was just the wind, but as I lay there, I realized it was coming from the laundry room—a soft, rhythmic thumping sound. My heart started to race. I debated whether to get up and check or just stay in bed and hope it stopped. Curiosity got the better of me, so I grabbed my phone for light and tiptoed to the laundry room.\nWhen I opened the door, everything was quiet. But then I saw it: the hatch to the crawlspace was slightly ajar. My stomach dropped. I distinctly remembered it being locked, and there was no way I could’ve accidentally opened it. Trying to stay calm, I convinced myself it might be an animal that had somehow gotten in. I shut the hatch tightly and placed a heavy box of detergent on top of it before going back to bed.\nThe next day, I called the landlord to ask if there were any pest issues I should know about. He seemed surprised and said no one had reported anything like that before. Still, he promised to send someone over to check it out.\nThat night, I double-checked the hatch and even put a chair on top of it for good measure. I didn’t hear any noises, and I started to feel a little silly for being so freaked out. But around 3 a.m., I woke up to the sound of my bedroom door creaking open.\nI froze. My bedroom door doesn’t creak unless you push it slowly, and I knew I had closed it before bed. I stayed as still as I could, barely breathing, as I heard soft footsteps shuffle into the room. My phone was on the nightstand, just out of reach. The footsteps stopped right next to my bed. I could feel someone’s presence, their quiet breathing in the dark.\nSummoning every ounce of courage I had, I grabbed my phone, turned on the flashlight, and swung it toward the intruder.\nThere was a man, crouched on the floor, his face pale and gaunt, his eyes wide and unblinking. He looked just as startled as I was. I screamed and bolted out of the room, running outside to the neighbour’s house. I banged on their door until they let me in, and they called the police.\nWhen the officers arrived, they found the man still in my house, hiding in the crawlspace. He had a small mattress, some food wrappers, and a collection of random items he must have taken from my house. The lock on the hatch had been tampered with, and from the looks of it, he had been living under my house for at least a few days—maybe longer.\nThe scariest part? The police said they found a notebook with detailed notes about me. He had written down my daily routine, when I left for work, when I came home, even what I wore. There was also a list of \"plans,\" though they wouldn’t tell me what was on it.\nI moved out the next week and stayed with friends until I found a new place. To this day, I have no idea how he got in or how long he had been watching me before I noticed something was wrong.\nTo the man in the crawlspace: let’s not meet. Ever.", "media": null, "score": 196, "upvote_ratio": 0.97, "comment_count": 24, "over_18": true}, "13": {"id": "1h1aqg3", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "AtmanDharma", "link_flair_text": null, "time": 1732936049.6910129, "created_utc": 1732730977.0, "url": "https://i.redd.it/qgjsku3sih3e1.jpeg", "title": "The last person to die of smallpox was Janet Parker in Birmingham, UK in 1978. Although her office was one floor above a smallpox laboratory, investigators could not determine how she was infected. When the Professor in charge of the lab found out about her illness, he committed suicide.", "permalink": "/r/truecreepy/comments/1h1aqg3/the_last_person_to_die_of_smallpox_was_janet/", "selftext": "", "media": null, "score": 97, "upvote_ratio": 0.98, "comment_count": 3, "over_18": false}, "14": {"id": "1h1vyzh", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Unable-Glass2441", "link_flair_text": null, "time": 1732936049.883804, "created_utc": 1732800591.0, "url": "https://www.reddit.com/r/threekings/comments/1h1vyzh/ghosts_on_the_tracks_the_tragic_tale_of_tunnel_no/", "title": "Ghosts on the Tracks: The Tragic Tale of Tunnel No. 33", "permalink": "/r/threekings/comments/1h1vyzh/ghosts_on_the_tracks_the_tragic_tale_of_tunnel_no/", "selftext": "Tunnel No. 33: A Tale of Tragedy, Hauntings, and Mystery\nIndia is a land of stories—some rooted in history, others in legend, and a few that blur the lines between the two. One such tale is that of Tunnel No. 33, also known as Barog Tunnel, nestled along the famous Kalka-Shimla Railway in Himachal Pradesh. This seemingly ordinary tunnel has captured the imagination of many due to its tragic past and eerie reputation. Known as one of India’s most haunted locations, Tunnel No. 33 tells a story that intertwines engineering ambition, human tragedy, and paranormal intrigue.\nThe Kalka-Shimla Railway: An Engineering Marvel\nThe Kalka-Shimla Railway, completed in 1903, was a monumental project undertaken during British rule to connect Shimla, the summer capital of British India, to the plains. Winding through the rugged terrain of the Shivalik Hills, the railway is an engineering marvel with over 100 tunnels and countless bridges. These tunnels were not just feats of construction but also testaments to the challenges faced by engineers of the time.\nAmong these, Tunnel No. 33 stood out—not for its length or complexity, but for the haunting tale associated with its creation.\nThe Tragic Story of Colonel Barog\nColonel Barog, a British engineer, was tasked with constructing Tunnel No. 33. Given the steep deadlines and difficult terrain, he devised a plan to dig the tunnel from both ends simultaneously, aiming for the two ends to meet in the middle. While this approach was innovative, it required precise calculations to ensure alignment.\nTragically, a critical miscalculation led to the two ends of the tunnel failing to meet. This mistake was not just a technical failure but a significant financial loss for the British authorities. Colonel Barog faced severe backlash and was fined for his error, a punishment that humiliated him both professionally and personally.\nConsumed by shame and despair, Colonel Barog took his own life near the incomplete tunnel. According to local accounts, he shot himself in the nearby woods, leaving behind a legacy of sorrow. He was reportedly buried not far from the site, and the area has since carried his name.\nCompletion of the Tunnel\nAfter Colonel Barog’s tragic demise, the construction of Tunnel No. 33 was handed over to another engineer, H.S. Harrington. Learning from the previous mistakes, Harrington enlisted the help of a local sage, whose advice proved instrumental in successfully aligning and completing the tunnel. Today, this 1,143-meter-long tunnel is the longest on the Kalka-Shimla Railway and remains operational, serving as a vital link in this historic route.\nThe Haunted Reputation of Tunnel No. 33\nWhat sets Tunnel No. 33 apart from the other tunnels on the Kalka-Shimla Railway is the eerie aura that surrounds it. Over the years, numerous stories of paranormal activity have emerged, making it a popular destination for ghost hunters and thrill-seekers.\nHere are some of the reported phenomena that have contributed to its haunted reputation:\n1. The Ghost of Colonel Barog\nThe spirit of Colonel Barog is said to linger near the tunnel. Unlike the malevolent ghosts of popular lore, his apparition is often described as calm and even friendly. Locals claim he doesn’t harm anyone, though his presence is palpable.\n2. Unexplained Noises\nVisitors have reported hearing strange sounds inside the tunnel, including whispers, footsteps, and even chilling screams. These noises are most commonly heard late at night or during quiet hours when the tunnel is devoid of trains.\n3. Mysterious Lights and Shadows\nStrange lights have been seen flickering within the tunnel, and shadowy figures are said to move through the darkness, vanishing when approached. These sightings have fueled the tunnel’s reputation as a hotspot for paranormal activity.\n4. Physical Sensations\nSome visitors have described the sensation of being touched or pushed by an unseen force. While these experiences are rare, they have left a lasting impression on those who have felt them.\n,\n5. An Overwhelming Sense of Unease\nMany travelers recount feeling an inexplicable sense of dread or unease when passing through Tunnel No. 33. Even those who do not believe in ghosts have acknowledged the strange atmosphere surrounding this place.\nExploring the Mystery: Folklore vs. Reality\nThe story of Tunnel No. 33 and its haunted reputation is a fascinating mix of history, legend, and human imagination. While the tragic death of Colonel Barog is documented, the tales of paranormal activity remain anecdotal. Skeptics argue that the eerie experiences could be attributed to the tunnel’s isolated location, the play of light and shadows, or even the psychological impact of its grim history.\nHowever, for those who have experienced the unexplained, these stories are more than mere folklore. The ghost of Colonel Barog, they say, is a reminder of the emotional toll borne by those who undertook ambitious projects under immense pressure.\nTunnel No. 33 Today\nToday, Tunnel No. 33 is a popular spot for tourists and paranormal enthusiasts alike. It offers a unique blend of natural beauty, historical significance, and an air of mystery that is hard to resist. While most visitors come to marvel at the engineering feats of the Kalka-Shimla Railway, many also hope to catch a glimpse of the supernatural.\nFor thrill-seekers, the tunnel is best visited during the evening or at night, when the atmosphere becomes particularly eerie. However, it’s important to remember that the tunnel is still operational, and safety should always be a priority.\nLessons from the Legend\nThe tale of Tunnel No. 33 is more than just a ghost story. It’s a poignant reminder of the human cost of progress, the fragility of mental health, and the enduring power of storytelling. Colonel Barog’s life and death highlight the immense pressures faced by those tasked with seemingly impossible feats. His ghost, whether real or imagined, continues to evoke empathy and curiosity in equal measure.\nFor some, the tunnel represents an engineering marvel and a testament to perseverance. For others, it’s a place where the past lingers in a tangible, almost supernatural way. Either way, Tunnel No. 33 remains a symbol of the mysteries that make life—and history—so compelling.\nConclusion\nWhether you’re a history buff, a fan of the paranormal, or simply someone looking for an offbeat travel destination, Tunnel No. 33 is worth a visit. Its story is a fascinating blend of fact and folklore, offering a unique glimpse into a bygone era. As you walk along the tracks or explore the nearby areas, you may find yourself wondering about the man whose name the tunnel bears—a man whose story continues to captivate and haunt us to this day.", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "15": {"id": "1gyfiml", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Free_Watatsumi", "link_flair_text": "Captured Apparition ", "time": 1732936050.3546243, "created_utc": 1732411929.0, "url": "https://v.redd.it/z0840mt36r2e1", "title": "Security systems at work went off last night, multiple videos caught at the same time as this video. Manager checked outside cameras, no person outside.", "permalink": "/r/Ghosts/comments/1gyfiml/security_systems_at_work_went_off_last_night/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/z0840mt36r2e1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 480, "scrubber_media_url": "https://v.redd.it/z0840mt36r2e1/DASH_96.mp4", "dash_url": "https://v.redd.it/z0840mt36r2e1/DASHPlaylist.mpd?a=1735528050%2CN2IxYmUzZTFhOTFmNTk3MjYxNDkzOWFjNDQ2NjgzYjkzYzU5MWQ4NGIzYjQ5N2Y5NWU2ZmYyMzA2NmVjZDllOA%3D%3D&v=1&f=sd", "duration": 17, "hls_url": "https://v.redd.it/z0840mt36r2e1/HLSPlaylist.m3u8?a=1735528050%2CM2I1MjJlNjA1OTY5M2VhMjNhNWJmNDkxNzA2YzFhYTU2YzFiZTdiNWRjYWQ4MGMzZWZjMmQ0YTZkYTE2NDI1Ng%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 356, "upvote_ratio": 0.92, "comment_count": 55, "over_18": false}, "16": {"id": "1h205m7", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "TruxtonCP", "link_flair_text": "Glitch Pic", "time": 1732936050.6367555, "created_utc": 1732812495.0, "url": "https://www.reddit.com/gallery/1h205m7", "title": "Glitch in the matrix or Louisiana DOT shenanigans? ", "permalink": "/r/GlitchInTheMatrix/comments/1h205m7/glitch_in_the_matrix_or_louisiana_dot_shenanigans/", "selftext": "", "media": null, "score": 159, "upvote_ratio": 0.95, "comment_count": 11, "over_18": false}, "17": {"id": "1h1jdex", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": null, "time": 1732936051.8246257, "created_utc": 1732753684.0, "url": "https://ovniologia.com.br/2024/11/drone-esferico-ou-ufo-o-que-pousou-no-aeroporto-de-manchester.html", "title": "A blue spherical object was spotted and filmed at Manchester Airport today. The object took off when an airport security car approached.", "permalink": "/r/ufo/comments/1h1jdex/a_blue_spherical_object_was_spotted_and_filmed_at/", "selftext": "", "media": null, "score": 987, "upvote_ratio": 0.92, "comment_count": 130, "over_18": false}, "18": {"id": "1h12adr", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Hirakous", "link_flair_text": "Video", "time": 1732936053.1819882, "created_utc": 1732707302.0, "url": "https://v.redd.it/8boy58ldkf3e1", "title": "UFO formation over power plant in NC.", "permalink": "/r/UFOs/comments/1h12adr/ufo_formation_over_power_plant_in_nc/", "selftext": "Credit to @iwanttobelieve715 on tiktok.", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/8boy58ldkf3e1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 480, "scrubber_media_url": "https://v.redd.it/8boy58ldkf3e1/DASH_96.mp4", "dash_url": "https://v.redd.it/8boy58ldkf3e1/DASHPlaylist.mpd?a=1735528052%2CZmY5ZTBkNTE1Y2JlMzE0ZTUwYzgzZTc3MDhhMTcyOTRmMmUyYWNhMmJhNzYxYTcyNDc5YWIyNTQ5YzZhNTI2MA%3D%3D&v=1&f=sd", "duration": 169, "hls_url": "https://v.redd.it/8boy58ldkf3e1/HLSPlaylist.m3u8?a=1735528052%2CZmFiMDI3YTE0MDA5NTEzNDI2YzZmNTNmZjkwNjg3MTZkZGNlODBlYjUzNjEzNTljMmYxNDQ5ODE1NTM0MDJlNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 6270, "upvote_ratio": 0.88, "comment_count": 1114, "over_18": false}, "19": {"id": "1gzczt7", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "d-slam", "link_flair_text": "Discussion :table:", "time": 1732936055.2445035, "created_utc": 1732517771.0, "url": "https://i.redd.it/9tsw4s3uwz2e1.jpeg", "title": "No one is ready for this conversation ", "permalink": "/r/aliens/comments/1gzczt7/no_one_is_ready_for_this_conversation/", "selftext": "I always had my suspicions but after seeing that spike UAP image a few days ago, it clicked for me. ", "media": null, "score": 4051, "upvote_ratio": 0.84, "comment_count": 1294, "over_18": false}, "20": {"id": "1h1gip4", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Astral-projekt", "link_flair_text": null, "time": 1732936055.9031093, "created_utc": 1732745704.0, "url": "https://www.reddit.com/gallery/1h1gip4", "title": "LOL don’t look up guys, censorship is REAL. Save the data- offline, disconnected from your internet ", "permalink": "/r/UAP/comments/1h1gip4/lol_dont_look_up_guys_censorship_is_real_save_the/", "selftext": "Save the data, offline folks \nAccounts are getting wiped, even on 4chan. My post was gone almost immediately. Stay on top of this! CaptainBiggalow deleted, https://www.reddit.com/r/UFOs/s/MiUXxqQK4i liberty wing deleted. Don’t ever wonder how they can cover up “real” evidence. Our gov does it all the time. ", "media": null, "score": 472, "upvote_ratio": 0.9, "comment_count": 112, "over_18": false}, "21": {"id": "1h0bx7y", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "ClockworkSkyy", "link_flair_text": null, "time": 1732936057.1304955, "created_utc": 1732627883.0, "url": "https://i.redd.it/g7n7gp69093e1.jpeg", "title": "Who remembers the time when they pulled stunts like this?", "permalink": "/r/conspiracy/comments/1h0bx7y/who_remembers_the_time_when_they_pulled_stunts/", "selftext": "It's crazy to think that many have forgotten the past and the circus that they were put through, that or they're battling trauma every day. I'd be embarrassed too if that was me. ", "media": null, "score": 3882, "upvote_ratio": 0.81, "comment_count": 625, "over_18": false}, "22": {"id": "1gzairz", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "mralstoner", "link_flair_text": null, "time": 1732936057.4043837, "created_utc": 1732508530.0, "url": "https://www.youtube.com/watch?v=6Qg7G3uTawg", "title": "Mayorkas: Something’s Not Right ", "permalink": "/r/conspiracyfact/comments/1gzairz/mayorkas_somethings_not_right/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "🚨⚠️ Why did Mayorkas & Wray REFUSE to Testify at THIS Key Hearing?!", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/6Qg7G3uTawg?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"🚨⚠️ Why did Mayorkas &amp; Wray REFUSE to Testify at THIS Key Hearing?!\"></iframe>", "author_name": "BlazeTV", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/6Qg7G3uTawg/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@BlazeTV"}}, "score": 3, "upvote_ratio": 0.71, "comment_count": 3, "over_18": false}, "23": {"id": "1gzn31r", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Live_Meeting8379", "link_flair_text": "humor", "time": 1732936058.0737712, "created_utc": 1732552617.0, "url": "https://i.redd.it/9dnzarafs23e1.jpeg", "title": "I felt this belongs here.", "permalink": "/r/bigfoot/comments/1gzn31r/i_felt_this_belongs_here/", "selftext": "", "media": null, "score": 664, "upvote_ratio": 0.95, "comment_count": 76, "over_18": false}, "24": {"id": "1gyfuce", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "ApprehensiveRead2408", "link_flair_text": "Discussion ", "time": 1732936058.64903, "created_utc": 1732412922.0, "url": "https://i.redd.it/e83s6urq8r2e1.jpeg", "title": "Yamapikarya is a large cat cryptid reported from Iriomote island,Japan. It was theorized to be a subspecies of clouded leopard", "permalink": "/r/Cryptozoology/comments/1gyfuce/yamapikarya_is_a_large_cat_cryptid_reported_from/", "selftext": "", "media": null, "score": 296, "upvote_ratio": 0.99, "comment_count": 27, "over_18": false}, "25": {"id": "1gzyedj", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Rich-Veterinarian-19", "link_flair_text": "Werewolf", "time": 1732936058.90283, "created_utc": 1732580172.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1gzyedj/i_think_i_saw_a_dogman/", "title": "I think i saw a dogman", "permalink": "/r/Humanoidencounters/comments/1gzyedj/i_think_i_saw_a_dogman/", "selftext": "This happened in Connecticut United states in the year 2008 i think. \nI actually saw this thing twice. The first time i saw it it was at night. For context when i was little i used to always stare out the window at night that faced a wooded grove that was about 100 yards or so away from the house and fall asleep staring out the window due to how peaceful the night was in the woods. \nSo one night when i was about 8-9 years old im staring out the window when suddenly i notice two yellow lights in the woods. At first i was confused thinking that a car was somehow in a tree in. But as i stared more the yellow lights dissapeared and then reappeared in the same spot almost like blinking eyes. As my groggy brain took a closer look at the lights i started noticing other  odd things like how the tree these lights were showing up in was a little thicker than i remembered and how there was a giant wolf head in the tree and that the yellow lights alligned with the head to be its eyes. \nThis is when i was getting nervous and i bumped my head on the window accidentaly as i was backing away. \nWell, as soon as my head hit the window. The wolf head turned suddenly towards my window and the rest of the creatures body started emerging from behind the tree. The body was hard to see at first because it was jet black and perfectly blended into the shadows. But now it was stepping out into the moonlight and i was freaking out because this wolf was on two legs. And the top of this wolfs head was a good 10 feet off the ground. The wolf stayed in the treeline but was still very much visable from my window and i could tell that it knew exactly where i was even though there were no lights on outside for it to see me with. By this point i had seen it more than enough so i quickly slammed the curtins shut and hid under my covers that whole night waiting to hear it clawing at the window to get me (fortunately this didnt happen) and i stayed burried under the covers until my alarm clock went off the next morning. I never told anyone about it because although i saw it myself i still couldnt beleve that it had happened. \nThe second encounter happened 12 years later durring a 4th of july celebration. Me and my dad were setting off fireworks in the back yard to celebrate and when we were done with the firework show as my dad and i were packing up for the night i saw the same pitch black wolf head peaking out from behind the shed with the same glowing yellow eyes. The head was absolutely massive. It was every bit the size of the 3 foot wide window on that side of the house. When it saw me staring at it it quickly ducked its head back behind the shed. I told my dad that there was a big dog back there and he chalked it up to coyotes. Well if it was a coyote then how did it manage to stand on two feet and how did its face take up the entirety of a 3 foot window? I dont know for sure what i saw but it matches descriptions that have been given for dogmen by other supposed witnesses so until i see otherwise im gonna say that what i saw was a dogman. It was terrifying to see both times and i never again want to see it or anything like it. \nEdit: forgot to put the date and location sorry", "media": null, "score": 57, "upvote_ratio": 0.88, "comment_count": 38, "over_18": false}, "26": {"id": "1h0m6mk", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "houselegs", "link_flair_text": null, "time": 1732936059.3625906, "created_utc": 1732653608.0, "url": "https://v.redd.it/o84re4gl4b3e1", "title": "another little watercolor of mine", "permalink": "/r/cryptids/comments/1h0m6mk/another_little_watercolor_of_mine/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/o84re4gl4b3e1/DASH_720.mp4?source=fallback", "has_audio": false, "height": 870, "width": 720, "scrubber_media_url": "https://v.redd.it/o84re4gl4b3e1/DASH_96.mp4", "dash_url": "https://v.redd.it/o84re4gl4b3e1/DASHPlaylist.mpd?a=1735528059%2CNTViMzVmZTRlNDg4N2RhYTZkOTRiNzZjMjYzYWNkYTViZTc2OTM2YWI4NzIxOGU1ZjQ3OGZjOGE3ZDgwMmU5Ng%3D%3D&v=1&f=sd", "duration": 28, "hls_url": "https://v.redd.it/o84re4gl4b3e1/HLSPlaylist.m3u8?a=1735528059%2CM2NkYTdiYmNjN2FmZTFhYWE5ZDE0ZTc1YjMzMmYwNDY3Yjg1YjQ2NzM5OWU1NWEwYmUzOTdhODc4NTM4ZTg4ZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 634, "upvote_ratio": 0.99, "comment_count": 20, "over_18": false}, "27": {"id": "1h09k4c", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "unsettlingmemorial", "link_flair_text": "Picture/Evidence", "time": 1732936059.6360521, "created_utc": 1732620017.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1h09k4c/unsettling_memorial_found_while_urbexing/", "title": "Unsettling memorial found while urbexing.", "permalink": "/r/Thetruthishere/comments/1h09k4c/unsettling_memorial_found_while_urbexing/", "selftext": "Hey all, tonight a buddy and I went exploring a place we've previously been. But upon arrival, both my friend and I felt a looking sense that was not previously present. We felt instinctively more on edge and aware of our surroundings. Upon making it to the factory, we pulled out our radio to keep an eye on security and listened. Upon listening we heard what sounded to be an alarm system, to be sure we ventured down near towards the sound, upon making it to the front entry, we found what looked to be a mangled raggedy Anne doll. Unsettling? Yes. Frightening? Not quite. \nUpon feeling relatively secure, we then ventured into a building, once we entered we felt a sense of heaviness and dread. Upon walking further we found used needles that looked as if they had been used very recently. When venturing further, I led down a staircase - once at the base I was suddenly startled by what sounded to be a charging sound towards me. Worried for my friend I called to him to see there was no one but him around me. Once we were both at the bottom, I noticed to my left what appeared to be a memorial (picture attached in comments), the note made mention of someone, a kid not too much younger than us that had been dismembered and whose entire body had yet to be found. A scary five weeks prior to our visit tonight. With that being said, the note looks, off? Strangely composed, a trap maybe. The more I look at the picture trying to figure it out, the more dreadful and near tears I feel. At a loss, we're looking for any additional possible explanations.\nTLDR; went urbexing, upon entry looking for alarm systems, we found an old raggedy Anne doll held by its neck. Moving in the the building, we saw needles, I heard a charging sound that seemed to come from no where and we found a memorial for someone who was seemingly killed and disfigured. But the memorial seems, odd?memorial picture w/o phone number", "media": null, "score": 35, "upvote_ratio": 0.77, "comment_count": 34, "over_18": false}, "28": {"id": "1h05aql", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Graf_Koks", "link_flair_text": null, "time": 1732936059.8087862, "created_utc": 1732601799.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1h05aql/i_was_almost_getting_robbedkilled_trying_to_buy/", "title": "I was almost getting robbed/killed trying to buy snacks because of my stupidity", "permalink": "/r/LetsNotMeet/comments/1h05aql/i_was_almost_getting_robbedkilled_trying_to_buy/", "selftext": "This happened shortly before weed was legalized in Germany. In Berlin, regulation was already quite loose; as long as you didn’t explicitly bother anyone, you usually wouldn’t get arrested for smoking in public.\nI’ve been smoking daily for years (I know, it’s not great, but that’s beside the point), so I can function pretty well while stoned. However, I almost never smoke in public—partly to avoid trouble, but mostly because I enjoy the comfort of my own home.\nOne late night, around 3 a.m., I was chilling online with friends, ready to call it a day. I wanted to relax with a joint and one of my favorite shows, but unfortunately, I had no snacks left. Determined to end the night with a proper munchie session, I decided to hit up a nearby Späti—a small convenience store similar to a 7/11. At that hour, only the sketchiest ones are still open, often operating illegally.\nI grabbed my coat and keys but stopped short before leaving. “Why not add a little joy to this cold walk?” I thought, rolling a small joint. I lit it as I stepped outside, braving the freezing breeze.\nThe area I live in is pretty rough—mostly foreign residents, many from Arabic countries. Poor integration has led to crime and violence being all too common. Even so, I was in good spirits as I strolled toward the flickering neon sign of the Späti. Just one more intersection to go.\nA group of men stood at the corner. They looked Middle Eastern, a bit older than me, and watched me as I walked by. It felt normal—nothing to worry about, I thought, already a little high. I crossed the street without giving them much thought.\nThen, I heard a voice call out, “Routine ID check—please show me your identification.”\nMy heart sank. “Of course, this has to happen the one time I smoke in public,” I thought, turning to face the \"police.\"\nOnly, they weren’t police. It was the group from the intersection, now slowly approaching me. “Routine ID check—please show me your ID. We’re undercover cops,” one of them said with a smug grin.\nI froze. The fact that they weren’t cops became clear when, despite their demand, none of them reached for any identification. “You know smoking weed is illegal, don’t you?” the man continued. His pupils were enormous, like saucers. It was obvious these guys had no authority whatsoever.\nThey began circling me. “Show us what’s in your pockets,” the leader demanded.\nSo, it’s a robbery, I thought. As long as I don’t resist, maybe I’ll only lose my phone and the few bills I brought for snacks. Then, a wave of dread hit me: my weekly tips—about €300 in cash—were also in my pocket. I had forgotten to deposit it earlier. Losing that money would crush my tight budget for the month. What now?\nAs I slowly reached into my pocket, the leader pressed me. “What’s taking so long?” I pulled out an old pack of gum and some broken headphones, hoping to satisfy them. “Where’s your wallet? I need your ID,” he insisted.\nStill fumbling, too stubborn (and stupid) to hand over my tips, I inadvertently revealed something that shocked even me: the glint of a Glock tucked into his belt.\nKnives and metal rods are typical weapons here, but a gun? That was insane, even by local standards. German gun laws are incredibly strict. My adrenaline spiked. Slowly, I pulled out the €5 bill I’d planned to use for snacks, trying to keep my expression neutral.\n“You’ve got no wallet?” he growled, his face darkening. My brain screamed at me to do something—anything—before this escalated further.\nThen, a desperate thought flashed through my mind. The Arabs in this area had a well-known fear of Russians, with frequent clashes between the two groups. Maybe… just maybe, I could use this.\nIn a heavy Russian accent, I stammered, “My friends have my wallet. They’re coming soon—we meet here.”\nTo my surprise, their poor English comprehension worked in my favor. They exchanged glances, muttering in German, and decided to wait. I forced myself to look confused, maintaining the bluff.\nIt worked. Their effort to translate or figure me out must have seemed too much trouble. The leader finally pointed at my €5 bill. “Alright then, you get us something to drink.”\nReluctantly, I followed them into the Späti. They grabbed a six-pack of Coke, and I paid, heart pounding. I was certain this wasn’t over—that they’d either search me themselves or retaliate when my nonexistent “friends” didn’t show up.\nBut then, just like that, they left.\nNo violence, no further questions—nothing. I stood there in shock, unable to process what had just happened.\nLooking back, I can’t believe I bluffed in such a dangerous situation. It could have been my last day on Earth, all over €300. I’ve learned my lesson. These days, I avoid walking around late at night when the streets are empty.\nAnd to those guys from that night—let’s not meet again. Ever.", "media": null, "score": 150, "upvote_ratio": 0.92, "comment_count": 11, "over_18": true}, "29": {"id": "1gy1yec", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "dangerdangerman", "link_flair_text": null, "time": 1732936059.9928007, "created_utc": 1732375241.0, "url": "https://i.redd.it/0xn4zgs05o2e1.jpeg", "title": "In 1988 the FBI National Center for the Analysis of Violent Crime (NCAVC) did a psychological profile of Jack the Ripper in time for the 100 years anniversary of the White Chapel murders. The FBI profiled Jack as male, 28-36 years old, most likely a butcher, mortician, or medical orderly.", "permalink": "/r/truecreepy/comments/1gy1yec/in_1988_the_fbi_national_center_for_the_analysis/", "selftext": "", "media": null, "score": 71, "upvote_ratio": 0.95, "comment_count": 4, "over_18": false}, "30": {"id": "1h0a16u", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Unable-Glass2441", "link_flair_text": null, "time": 1732936060.19679, "created_utc": 1732621820.0, "url": "https://www.reddit.com/r/threekings/comments/1h0a16u/kotas_dark_chapter_myths_murders_and_mr_burton/", "title": "Kota’s Dark Chapter: Myths, Murders, and Mr. Burton", "permalink": "/r/threekings/comments/1h0a16u/kotas_dark_chapter_myths_murders_and_mr_burton/", "selftext": "Introduction\nKota, a bustling city in Rajasthan, India, is often associated with its coaching institutes and scenic landscapes along the Chambal River. Yet, beneath its vibrant surface lies a history steeped in mystery and enigma. Among the tales of Kota's past, one stands out—the story of Mr. Burton, a British colonial officer whose life and legacy are shrouded in darkness. From whispers of occult practices to unsolved murders, Mr. Burton’s presence in Kota has left an indelible mark on the city's history.  \nIn this blog, we will explore the life of Mr. Burton, the shadowy events that unfolded during his tenure, and the haunting impact they continue to have on Kota's identity.  \nThe Mysterious Mr. Burton  \nMr. Burton, an officer in the British colonial administration, was stationed in Kota during the early 20th century. The British Raj was at its peak, and Kota, with its strategic location and historical significance, was an important administrative center. Records indicate that Mr. Burton was a disciplined officer, entrusted with maintaining order in the region.  \nHowever, his official duties were overshadowed by rumors and allegations that hinted at a darker side to his personality. Locals describe him as a recluse, often seen wandering the city's outskirts late at night. He had few interactions with the native population, and those who did meet him spoke of his piercing gaze and unsettling demeanor.  \nWho was Mr. Burton? Was he merely a misunderstood man living in a foreign land, or was there truth to the rumors that painted him as a sinister figure?  \nKota’s Historical Backdrop\nTo understand Mr. Burton’s story, we must first delve into the historical context of Kota. The city, founded in the 17th century, had long been a battleground for power struggles. During the British era, Kota was a princely state under the suzerainty of the Raj. The city bore witness to social and political upheavals, as traditional structures clashed with colonial governance.  \nThe early 20th century was a time of great turmoil for Kota. The economy was strained by British taxation policies, and tensions simmered between the ruling elites and the common people. Against this backdrop of unrest, Mr. Burton’s arrival marked the beginning of a series of events that would plunge the city into a period of fear and uncertainty.  \nThe Occult Connection\nPerhaps the most controversial aspect of Mr. Burton’s legacy is his alleged involvement in the occult. Local legends suggest that he was a member of a secret society that practiced dark rituals, including black magic and human sacrifice. These rituals were said to take place in hidden chambers beneath his residence, away from prying eyes.  \nOne particularly persistent rumor describes how strange symbols were often seen painted near his home. These symbols, which locals claim were linked to ancient occult practices, were said to invoke fear and unease among the city's residents.  \nWhile no concrete evidence of such activities exists, the stories have endured for generations. Historians believe that these tales may have been exaggerated over time, blending colonial distrust with native folklore. Yet, the very mention of Mr. Burton’s name continues to send shivers down the spines of those familiar with his story.  \nThe Murders That Shook Kota\nDuring Mr. Burton’s tenure, a series of brutal murders rocked Kota. The victims, mostly local villagers, were found with strange symbols carved into their bodies, eerily similar to those associated with occult practices. The killings were gruesome, with evidence suggesting they were carried out with precision and purpose.  \nThe murders sparked widespread panic, and many began to point fingers at Mr. Burton. His reclusive nature and the eerie stories surrounding him made him an easy target for suspicion. Yet, the British administration dismissed these claims, citing a lack of evidence.  \nThe truth behind these murders remains a mystery. Were they the work of a deranged killer, or did they have deeper, more sinister connections to the occult practices rumored to involve Mr. Burton?  \nEyewitness Accounts and Folklore\nOver the years, numerous eyewitness accounts have emerged, adding layers of intrigue to the story of Mr. Burton. An elderly resident of Kota once claimed to have seen strange lights emanating from Mr. Burton’s residence late at night. Another described hearing unearthly chants that seemed to echo through the stillness of the city.  \nFolklore has also played a significant role in shaping Mr. Burton’s legacy. Stories of his ghost haunting the old colonial bungalow where he once lived are common. Some claim to have seen his spectral figure, dressed in a colonial uniform, wandering the streets of Kota under the cover of darkness.  \nThe Legacy of Mr. Burton\nToday, Mr. Burton’s story is both a source of fascination and a cautionary tale. While some dismiss the rumors as mere folklore, others view them as a reflection of the deep-seated anxieties and fears of the colonial era. His name has become synonymous with Kota’s dark history, a reminder of the shadows that once loomed over the city.  \nKota has come a long way since the days of Mr. Burton. It is now a thriving urban center, known for its educational institutions and cultural heritage. Yet, the stories of its past continue to intrigue residents and visitors alike.  \nA Reflection on Myth and History\nThe tale of Mr. Burton highlights the fine line between history and myth. While the lack of concrete evidence leaves much of his story open to interpretation, it also underscores the power of storytelling in shaping collective memory.  \nKota’s dark past serves as a reminder of the human tendency to create narratives that explain the inexplicable. Whether Mr. Burton was a villain, a victim of circumstance, or merely a figment of exaggerated imagination, his story remains an integral part of Kota’s cultural identity.  \nConclusion\nMr. Burton’s story is a haunting chapter in Kota’s history, a blend of fact, folklore, and fear that continues to capture the imagination. As we uncover the secrets of his life, we must also remember the broader historical and cultural context that gave rise to such tales.  \nKota, like many cities with a rich and complex past, carries the weight of its history. By reflecting on stories like that of Mr. Burton, we honor the memories of those who lived through those times and ensure that the lessons of history are never forgotten.  ", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "31": {"id": "1h1dseu", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Quirky_Scar7857", "link_flair_text": null, "time": 1732936061.0450954, "created_utc": 1732738545.0, "url": "https://www.reddit.com/r/Ghosts/comments/1h1dseu/saw_the_ghost_of_my_wifes_dog_last_night_it/", "title": "Saw the ghost of my wife's dog last night. it brought me comfort but I wish my wife had seen it too. ", "permalink": "/r/Ghosts/comments/1h1dseu/saw_the_ghost_of_my_wifes_dog_last_night_it/", "selftext": "Alfie our Maltesed, passed October 2023. last night I was sitting down, and out of the corner of my eye I saw a white translucent \"thing\" moving down the hallway in the same shuffle manor that I used to see him. basically the outline of a back and tail because the head part was already out of sight. \nwas weird and comforting at the same time", "media": null, "score": 133, "upvote_ratio": 0.94, "comment_count": 20, "over_18": false}, "32": {"id": "1gytrac", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Thatoneboi27", "link_flair_text": "Glitch Vid", "time": 1732936061.3402874, "created_utc": 1732462798.0, "url": "https://v.redd.it/5zxkzhh7dv2e1", "title": "Water coming out of seemingly nowhere", "permalink": "/r/GlitchInTheMatrix/comments/1gytrac/water_coming_out_of_seemingly_nowhere/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/5zxkzhh7dv2e1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/5zxkzhh7dv2e1/DASH_96.mp4", "dash_url": "https://v.redd.it/5zxkzhh7dv2e1/DASHPlaylist.mpd?a=1735528061%2CZGI2MzdkNzJkZjcxMWI1YWY2MDI1YmU1NDRiMzVmMGU4YjAxOGE3N2NiOTE4ODgyOTQxOTBjOTUzZjViZTZiNA%3D%3D&v=1&f=sd", "duration": 9, "hls_url": "https://v.redd.it/5zxkzhh7dv2e1/HLSPlaylist.m3u8?a=1735528061%2CYjg5OTZlZTQ4MjAyOWM4ZDA1NjkyZDYzM2FjN2M5MGFlODA1ZWRiOWQyZDM5Mzc5ZjdjOWZjYWM2ZWUwYjc3MA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 100, "upvote_ratio": 0.68, "comment_count": 38, "over_18": false}, "33": {"id": "1h2eem9", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Guilty-Top-7", "link_flair_text": null, "time": 1732936062.6549845, "created_utc": 1732857230.0, "url": "https://i.redd.it/5fb7k428yr3e1.jpeg", "title": "I have a better photo of the pixilated photo of the UFO at Manchester airport.", "permalink": "/r/ufo/comments/1h2eem9/i_have_a_better_photo_of_the_pixilated_photo_of/", "selftext": "It’s less pixilated and shows a clearer image.", "media": null, "score": 677, "upvote_ratio": 0.83, "comment_count": 148, "over_18": false}, "34": {"id": "1h00fq7", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Novel_Cow8226", "link_flair_text": "Cross-post", "time": 1732936064.347364, "created_utc": 1732585987.0, "url": "https://v.redd.it/rx7o0vemj53e1", "title": "Spotted over Colorado military base ", "permalink": "/r/UFOs/comments/1h00fq7/spotted_over_colorado_military_base/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/rx7o0vemj53e1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 480, "scrubber_media_url": "https://v.redd.it/rx7o0vemj53e1/DASH_96.mp4", "dash_url": "https://v.redd.it/rx7o0vemj53e1/DASHPlaylist.mpd?a=1735528063%2CYzA2OWYwZjVkZGEyY2VmZTkzMzlmMmZjY2IwZDE2ZWU2Yjc0ZTE5NTljZDNjZTdkN2VjNDdkOGQ1ZjI3YzdkYw%3D%3D&v=1&f=sd", "duration": 37, "hls_url": "https://v.redd.it/rx7o0vemj53e1/HLSPlaylist.m3u8?a=1735528063%2CNWFlYzI1ZGUxMDY3ZDA3OTU5MjIzMjY0YmZlODU3ZDQ1MGQ0MWViMTYwNTNhMmVhOWM5ZDhmNGQ2NjYwODIxMA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 6150, "upvote_ratio": 0.89, "comment_count": 1051, "over_18": false}, "35": {"id": "1h1fwrl", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "SirLadthe1st", "link_flair_text": "Discussion :table:", "time": 1732936066.6538746, "created_utc": 1732744104.0, "url": "https://i.redd.it/18er790pli3e1.png", "title": "The account of Captain Biggalow who shared the Manchester Drone / UAP pics is gone from Twitter", "permalink": "/r/aliens/comments/1h1fwrl/the_account_of_captain_biggalow_who_shared_the/", "selftext": "", "media": null, "score": 3061, "upvote_ratio": 0.96, "comment_count": 525, "over_18": false}, "36": {"id": "1h1s5h2", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "ProfessionalSky8494", "link_flair_text": null, "time": 1732936067.3168814, "created_utc": 1732785510.0, "url": "https://www.reddit.com/r/UAP/comments/1h1s5h2/uap_incursions_on_uk_bases/", "title": "UAP incursions on UK bases.", "permalink": "/r/UAP/comments/1h1s5h2/uap_incursions_on_uk_bases/", "selftext": "I just want to add something to the current talk about drones/uaps over the RAF bases etc in the UK currently.\nI know everyone is quick to suggest these aren't drones and something more other worldy, and I was skeptical of that at first,however my mind has changed.\nI have a relative that works on one of these bases currently and from what we've spoken on the vibe is very much that something is going on and everything is not under control.\nAir traffic routes have been thinned and the plan seems to be \"let's see what happens\" which is baffling to me.\nTL:DR my relative says they're quick worried about what this is and don't seem to be able to do much about it.\nIf you have any questions I might be able to pass them on and get some answers.\nUPDATE: After speaking with my relative briefly, they have told me that one of the bases are half joking that these are UFOS's flying over the bases.\nI asked if they actually think that, and the answer was alluding to the fact that they all think these craft are drones its just technology they aren't familiar with. The feeling is that they'll find out soon, but my relative isn't directly 'in the know' so for what it's worth that's all I've got.\nTL:DR UPDATE: boots on the ground think it's next level drone tech, don't know where its from yet.", "media": null, "score": 188, "upvote_ratio": 0.92, "comment_count": 153, "over_18": false}, "37": {"id": "1gz8m60", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "TorrAsh", "link_flair_text": "Rule 6 Reminder", "time": 1732936068.5641685, "created_utc": 1732502239.0, "url": "https://i.redd.it/4v4666hnmy2e1.jpeg", "title": "Just sayin …..", "permalink": "/r/conspiracy/comments/1gz8m60/just_sayin/", "selftext": "", "media": null, "score": 3619, "upvote_ratio": 0.88, "comment_count": 650, "over_18": false}, "38": {"id": "1h28j5p", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "mralstoner", "link_flair_text": null, "time": 1732936068.8255355, "created_utc": 1732836573.0, "url": "https://www.youtube.com/watch?v=QgNtsn88ZVc", "title": "Wuhan looks suspiciously modern and competent ", "permalink": "/r/conspiracyfact/comments/1h28j5p/wuhan_looks_suspiciously_modern_and_competent/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Wuhan, City In 🇨🇳 China 4k Video |", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/QgNtsn88ZVc?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Wuhan, City In 🇨🇳 China 4k Video |\"></iframe>", "author_name": "4k Explore World ", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/QgNtsn88ZVc/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@4kExploreWorld"}}, "score": 2, "upvote_ratio": 0.56, "comment_count": 5, "over_18": false}, "39": {"id": "1h1srym", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Celestial_MoonDragon", "link_flair_text": "holiday cheer", "time": 1732936069.3661826, "created_utc": 1732788293.0, "url": "https://i.redd.it/80pgt4n89m3e1.jpeg", "title": "Happy Thanksgiving!", "permalink": "/r/bigfoot/comments/1h1srym/happy_thanksgiving/", "selftext": "", "media": null, "score": 591, "upvote_ratio": 0.99, "comment_count": 11, "over_18": false}, "40": {"id": "1gz11q3", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Sure_Background_2748", "link_flair_text": "Question", "time": 1732936070.0170074, "created_utc": 1732481095.0, "url": "https://i.redd.it/ehobi3crvw2e1.png", "title": "What are your explanations to what the Ningen is? (other than an iceberg)", "permalink": "/r/Cryptozoology/comments/1gz11q3/what_are_your_explanations_to_what_the_ningen_is/", "selftext": "", "media": null, "score": 252, "upvote_ratio": 0.78, "comment_count": 95, "over_18": false}, "41": {"id": "1h2l7me", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "VihaanLoskaa", "link_flair_text": "Unidentified", "time": 1732936070.2958255, "created_utc": 1732885006.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1h2l7me/my_encounter_at_night_in_remote_finnish/", "title": "My encounter at night in remote Finnish countryside", "permalink": "/r/Humanoidencounters/comments/1h2l7me/my_encounter_at_night_in_remote_finnish/", "selftext": "This happened three years ago. It was December 26th and me and my sister had just visited our grandparents who live at a farm in remote Finnish countryside. It was not particularly late, perhaps around seven in the evening, but this being the north, the road was pitch black and there were no streetlights. \nMy sister was focused on driving carefully, as you never knew when a deer might jump out on the road, but I was looking around at the side of the road which was only lit by the headlights of the car. Suddenly, I saw a shape of a slightly unnaturally tall man standing perfectly still at the side of the road, simply staring blankly ahead while remaining still. The humanoid figure seemed to pay no attention to us or the car.\nThe very moment I saw the humanoid figure, my lizard brain sensed danger, I almost jumped on my seat, and my heart started beating extremely rapidly. I had never experienced that sort of sudden visceral fear before and my sudden reaction freaked out my sister who was driving. I quickly looked back and the figure was still there, but very quickly it became too dark to see. \nThis was a very remote road with multiple kilometres to the nearest farms and there were no street lights. In theory it is not impossible for a tall person to have been walking in the area and stopping to let the car pass, but this was but there were no houses anywhere close, it was a pitch dark road, and the temperatures were freezing. The way the humanoid was just blankly staring ahead was also very unnatural. \nI don't know what I saw, but it reminded me of Finnish and Scandinavian folk lore and a creature called \"nuuttipukki\" or \"kekripukki\", which resembles a northern Scandinavian version of Krampus. The season would match. However, while I didn't see the humanoid for very long, it did not seem very goat-like, although it did seem to be around two metres tall. I haven't heard of stories about Skinwalkers in this part of the world, but I can't rule that out either.", "media": null, "score": 45, "upvote_ratio": 0.94, "comment_count": 5, "over_18": false}, "42": {"id": "1gz2gqc", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Tha_Maestro", "link_flair_text": null, "time": 1732936070.7360764, "created_utc": 1732484766.0, "url": "https://v.redd.it/s1ipbauo6x2e1", "title": "Strange looking deer ", "permalink": "/r/cryptids/comments/1gz2gqc/strange_looking_deer/", "selftext": "I’m not really sure if this is a cryptid but it’s something that I’ve never seen in my entire life. Spotted in a family members yard in Eastern Pennsylvania. Looks like a cross between a goat and a deer to me. Sorry if this doesn’t belong here. Just curious as to what this could be. ", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/s1ipbauo6x2e1/DASH_720.mp4?source=fallback", "has_audio": false, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/s1ipbauo6x2e1/DASH_96.mp4", "dash_url": "https://v.redd.it/s1ipbauo6x2e1/DASHPlaylist.mpd?a=1735528070%2CZjUyYjhkODI1YWFiYmI2MTMzNjE5M2JjMGI1YmFkYjRiZjFiYTc1YTA1ZTJmYTA4MjMzMGMzMTMxNDUwNTZjYQ%3D%3D&v=1&f=sd", "duration": 21, "hls_url": "https://v.redd.it/s1ipbauo6x2e1/HLSPlaylist.m3u8?a=1735528070%2COGRlNGJhNzM1MWE3YWZiNTIzODI4NzY2NDBiY2NlNzNkNjBlZTQ5MDQ3MGE1MThlMTI2YzhlMzQxNTJlODhhZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 594, "upvote_ratio": 0.93, "comment_count": 87, "over_18": false}, "43": {"id": "1gykq70", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Bisexual2077", "link_flair_text": "Discussion/Advice", "time": 1732936070.986464, "created_utc": 1732430087.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gykq70/strange_experiences_with_a_mysterious_force/", "title": "Strange experiences with a mysterious \"force\" controlling my life; I need to get this off my chest", "permalink": "/r/Thetruthishere/comments/1gykq70/strange_experiences_with_a_mysterious_force/", "selftext": "\nI don't know who to talk to or where to ask for help, so I'm sharing my strange personal experience here, translated by AI.\n\nI'm sharing this knowing it might not be \"permitted\" by what I call \"the thing\" or the \"mysterious force.\" I've experienced consequences when going against its will. If this post disappears, you'll know why.\nSince elementary school, I've noticed patterns in my luck. I could predict when I'd get good grades(during the \"designated good grades\"semesters, minimal effort would yield high scores. But in semesters marked for poor performance, no amount of effort would improve my grades) or when my dad would lose his temper. Back then, I used to picturing someone sitting at a control panel, flipping a \"luck switch\" repeatedly that affected my childhood life.\nI often find myself shouting into thin air furiously, demanding answers: \"What do you want? I'm not your puppet! When will you leave me alone?\" It feels like my entire life is a script written by this force, and I'm just an actor with no real control. When I do things it \"permits,\" everything goes smoothly. But when I go against its will, I face obstacles and prepare to face punishment to prevent me from doing it again.\nHere's a recent example: Last year, I had a severe cold and went to the clinic. Everything was fine until exactly my turn to see the doctor - suddenly, the computers lost power despite that level still having electricity. So I had to wait a bit longer. This wasn't an isolated incident; similar \"technical issues\" have happened multiple times when I've tried to see doctors.I can see that it doesn’t like me seeing doctors. Another time was the print machine broke down. Once is bad luck, but a series of coincidences? That’s possibility multiplying, That's deliberate.\nThe hospital incidents are just one small part of this. If I were to create a Venn diagram of all the strange \"coincidences\" and manipulations I've experienced, it would be incredibly complex.\nI guess The hospital incident is a still-going thread, there are so much to share.\nAs a child in elementary and junior high school, I simply observed and followed these patterns. Later, I tried to actively manipulate them to achieve desired outcomes, though it remained challenging.\n(Not sure if anyone will believe this, but I needed to share.)\nEdit: Might have to delete this if \"it\" doesn't approve. We'll see.", "media": null, "score": 27, "upvote_ratio": 0.77, "comment_count": 53, "over_18": false}, "44": {"id": "1gyyxoi", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "East_Impact4101", "link_flair_text": null, "time": 1732936071.151495, "created_utc": 1732475798.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1gyyxoi/kidnapper_who_decided_to_hmu_again/", "title": "Kidnapper who decided to hmu again…", "permalink": "/r/LetsNotMeet/comments/1gyyxoi/kidnapper_who_decided_to_hmu_again/", "selftext": "Ive held off from telling this story besides close friends as it wasnt big in the news but it was fucked and reading other stories has given me the umpf to share.\nWhen i was 14 (im 23 now) i was naive and dumb and my need for attention all converged. I was abused, alone and hardly had friends because i wasnt allowed to hangout with my friends except in school. I discovered Omegle as most teens did in the mid 2010s. I met a guy from MO and he claimed to be 20, his name is Noble. We talk and my birth giver found out and kept making steps to keep me from talking to him but i was stubborn and thought he loved me. So our relationship goes on as im taken from my home and put in a Safe house to protect me from being exploited. The thing is i still had access to a cell phone, wifi and anything on the internet. So Noble and i keep talking and i find out he is not in fact 20 but he is 31. I was delusional and was like “oh thats fine” because again, i believed he loved me and only he loved me. Lots of in and out of youth homeless shelters and programs and I was then placed back with my birth giver for a short amount of time but was taken again and given to my bio father. Who then also proceeds to find out about this man and try and prevent me from talking to him. It worked for a while as i was in therapy and on meds. After we moved i was taken off my meds and out of therapy and i started acting up and reaching out to him again. Well i was removed from my bio fathers home due to his and my behaviors and i was placed in a group home. Im now 15, My third week there i ranaway and told Noble to come pick me up. He drove 16 hours as i stayed hidden in some random ladies house i met at a gas station. He arrives and we start heading back to MO. While we are in PA (driving from southern tier NY) im playing on his phone and i see he got repeated messages from a few girls accounts on snapchat. I ask about it and he comes clean that he had been doing the same thing with other girls that he does with me (nudes, calls, etc). i start crying and telling him to either bring me back or drop me off on the side of the road and ill find my way back. He tells me no and proceeds to pull over and choke me until im unconscious (im 5’6 111 lbs and anorexic at the time and hes 200 something lbs and 5’10ish) idk how long i was out but it was long enough for him to find a hotel, check us in and get me in the room without someone noticing. I woke up to him on top of me raping me. The rest of the trip was kind of a blur but we end up finally reaching his apartment and i asked to see his phone so i could play a game, his dumbass gave me the phone and i texted my grandma and my birth giver on messenger saying i loved them and if they didnt hear from me i was in MO. \nAfter multiple times of being graped, forced to take pictures for other disgusting individuals and forced to act like i was happy so i could live, like the meme minus the yelling FBI, the FBI and MO state police bust down the door and handcuff him, take me to a car and take him to another one. They took all his computers, harddrives etc and i was brought to the juvie, then transferred to the mental ward for weeks then back to juvie (ward of the state and i said i wanted to die bc of all of this happening). instead of being treated like a kid who was groomed and raped and kidnapped i was treated like a criminal. I was in MO for a month before i was put on a plane and sent back to NY where i was quickly put into residential. He was sentenced to 30 years for what he did to me and other girls my age. \nI tell this story now because he randomly found my instagram and started trying to reach out to me again from prison. I told him he was disgusting, i wasnt a naive kid anymore and that he needs to leave me alone. He got the memo the first time thank fuck but he shouldve NEVER been able to reach out. I keep my eye on where he goes but it seems hes either working his years off or hes been getting less time somehow because his years dropped from 30 to 26 that he needs to serve. \nSo Noble if youre on your little prison tablet and somehow on this subreddit, i hope we never meet again.\nEdit: spelling and wording ", "media": null, "score": 145, "upvote_ratio": 0.93, "comment_count": 34, "over_18": true}, "45": {"id": "1gzl7sm", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "happypants69", "link_flair_text": null, "time": 1732936071.3397555, "created_utc": 1732547996.0, "url": "https://i.redd.it/67yj65xke23e1.jpeg", "title": "60-Year-Old Wells Fargo Worker Died At Her Desk And Was Found Four Days Later By Colleagues Due To Foul Odor", "permalink": "/r/truecreepy/comments/1gzl7sm/60yearold_wells_fargo_worker_died_at_her_desk_and/", "selftext": "", "media": null, "score": 28, "upvote_ratio": 0.85, "comment_count": 2, "over_18": false}, "46": {"id": "1h1sfsy", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Significant_Yak5400", "link_flair_text": null, "time": 1732936071.5203743, "created_utc": 1732786828.0, "url": "https://www.reddit.com/r/threekings/comments/1h1sfsy/kashima_reiko_is_it_real/", "title": "Kashima Reiko, is it real?!", "permalink": "/r/threekings/comments/1h1sfsy/kashima_reiko_is_it_real/", "selftext": "Kashima Reiko was a woman who was viciously attacked by a group of men in a public restroom and left to die. Although she had fatal injuries, she did not die immediately, she was crying out for help (which didn't arrive on time unfortunately) she died due to blood loss on the meishin express railway track. She didn't revive until the train reversed, severing her body at the waist, killing her. Following her death, she became an Onryō, a vengeful spirit.\nP,S: IF YOU READ THROUGH THE WHOLE STORY, IT IS SAID THAT SHE'LL VISIT YOU WITHIN A MONTH\nTO ESCAPE:\n\nyou can either answer her questions\nShare this story\n\nTO ANSWER HER QUESTIONS,\n1.She'll ask \"Where are my legs?\" correct answer: \"on the Meishin expressway\",\n2.she will then ask, \"Who told you that?\" The correct answer to this is \"Kashima Reiko told me that\"\n\nShe then will ask \"Do you know my name?\" the correct response is \"Mask Death demon\"\n\nDO NOT UNDER ANY CIRCUMSTANCES ANSWER \"KASHIMA\" TO THE LAST QUESTION", "media": null, "score": 0, "upvote_ratio": 0.44, "comment_count": 0, "over_18": false}, "47": {"id": "1h2l4gn", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "mykeuk", "link_flair_text": null, "time": 1732936071.953085, "created_utc": 1732884687.0, "url": "https://i.redd.it/7t0duf7v7u3e1.jpeg", "title": "DAE Remember an old ghost cam website that had the following view as one of its feeds? ", "permalink": "/r/Ghosts/comments/1h2l4gn/dae_remember_an_old_ghost_cam_website_that_had/", "selftext": "I'd love to find this site again, but can't for the life of me remember what it was called. Anyone else recognise this? ", "media": null, "score": 48, "upvote_ratio": 0.84, "comment_count": 13, "over_18": false}, "48": {"id": "1h0v7b4", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Relevant_Fondant1525", "link_flair_text": "Glitch Vid", "time": 1732936072.236612, "created_utc": 1732678966.0, "url": "https://v.redd.it/b5z00r29k93e1", "title": "Cloud glitch", "permalink": "/r/GlitchInTheMatrix/comments/1h0v7b4/cloud_glitch/", "selftext": "", "media": null, "score": 95, "upvote_ratio": 0.89, "comment_count": 23, "over_18": false}, "49": {"id": "1h284ow", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Exact_Band_5259", "link_flair_text": null, "time": 1732936073.5680768, "created_utc": 1732835253.0, "url": "https://www.reddit.com/r/ufo/comments/1h284ow/major_transfer_of_nukes_from_the_us_to_the_uk_is/", "title": "Major transfer of Nukes from the US to the UK is creating this UFO Flap", "permalink": "/r/ufo/comments/1h284ow/major_transfer_of_nukes_from_the_us_to_the_uk_is/", "selftext": "Since Nov 14 of this year the US and UK changed their Bilateral Nuclear Defense Treaty that hasn't changed since 1958 and there has been zero news about it, even the press release I found is very limited and clearly very major. The US was capped at a certain amount of Nuclear Weapons they could have in the UK. That cap was lifted 13 days ago or something similar. I think what we are seeing is one of the largest transfers of Nuclear weapons in history. \nI have no idea the timeline as to when they started to alter the treaty but something tells me the Biden Administration wants to disperse their Nuclear weapons to trusted allies before the Trump Admin comes into power and other reasons. Most, if not almost all drones are probably US/UK stuff that's not to say that E.T's are not watching this very closely if not interfering or making themselves known in some manner as UFO's and Nukes go hand in hand and its also possible that some of the activity is Russian and Chinese actors using their own drones to try and surveil this massive movement of Nuclear weapons. That is why the U.S military spokesman said \"We don't know where or who they are, We know they are no harm\" he will obfuscate the truth completely in the first part of the sentence but will tell the truth in the last part and it explains why the US and the UK are not reacting to the apparent threat because its their own gear.\nRussia and the U.S mutually do not want this transfer and policy change to be broadcast openly. Putin would be forced to escalate to not appear weak infront of his country and he has limited options at this point. The U.S doesn't need to broadcast this either as it would be seen as saber rattling and the effect is to strengthen the UK, Russia will know about the transfer and the U.S wants russia to know that going forward even if the U.S were to completely capitulate to Russia the UK will have enough weapons for Mutually Assured Destruction. This is a insurance policy for the US/UK and the free world if the US democracy doesn't survive trump and the U.S leadership becomes vassals to russian leadership and we can no longer rely on the United States to counter Russia(which news flash happened for 4 years under trump's last presidency but now we are in a literal world war).\nIt takes 10-15 days for a military cargo ship to sail from the US to the UK. They probably had the Nukes ready to ship but couldn't go underway until the treaty was alterations were ratified officially which fits into the timeline with all the activity going on 14 days after the treaty changes.\nThis is from the House of Commons in the UK, look at how the start off by saying \" Many of the proposed changes are minor technical amendments relating to outdated language, definitions and terminology\"\nlike its not a major policy change, then the below points are essentially saying \"we cannot rely on the US anymore you are too politically unstable so the Nukes you keep here are actually our nukes now and even if you want them back tough luck\". \nhttps://commonslibrary.parliament.uk/research-briefings/cbp-10086/\nhttps://www.state.gov/united-states-and-united-kingdom-bring-amendment-to-mutual-defense-agreement-into-force/\n(This was all copy and pasted from a email I sent last sorry for any errors or formatting issues", "media": null, "score": 603, "upvote_ratio": 0.89, "comment_count": 107, "over_18": false}, "50": {"id": "1h1df1c", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "sdubs76", "link_flair_text": "News", "time": 1732936074.8889325, "created_utc": 1732737621.0, "url": "https://v.redd.it/zz2y2m2d2i3e1", "title": "At RAF Lakenheath NOW", "permalink": "/r/UFOs/comments/1h1df1c/at_raf_lakenheath_now/", "selftext": "Curiosity got the better of me and drove about 45 mins from home. Seen a couple of ‘drones’ in the sky. At one point there were three. I was informed that ‘one with the green and red lights’ was an RAF drone. 🤔\nOne of them did a really weird thing which I can only describe as a light show with a series of 4-5 white lights blinking in sequence from front to back. \nWho knows what they are or why they are here but I’m here in hope I seen something life changing! ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/zz2y2m2d2i3e1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/zz2y2m2d2i3e1/DASH_96.mp4", "dash_url": "https://v.redd.it/zz2y2m2d2i3e1/DASHPlaylist.mpd?a=1735528073%2CY2ZhNjhiNGJjODU1ODlhOGRjYTYyODUzZmU1MmM4MWMyYmFlNDkzY2ZmZjM3MWEyZTY3ZTc2NWRmZjU2YzdkMQ%3D%3D&v=1&f=sd", "duration": 108, "hls_url": "https://v.redd.it/zz2y2m2d2i3e1/HLSPlaylist.m3u8?a=1735528073%2CZTFiZmE0YWMyOTA2ZmY1ZDVlNmRhZjAxMTA1ZTMwMjliOTk1ZjE5ZDAxYTZjZGM4MjQ4ZTc2YjBiNzY4ODJmNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 5541, "upvote_ratio": 0.87, "comment_count": 1096, "over_18": false}, "51": {"id": "1h19ylp", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "East-Direction6473", "link_flair_text": "Evidence :upvote:", "time": 1732936076.7245524, "created_utc": 1732729067.0, "url": "https://x.com/captainbiggalow/status/1861103995772645582", "title": "Drone at manchester airport captured upclose ", "permalink": "/r/aliens/comments/1h19ylp/drone_at_manchester_airport_captured_upclose/", "selftext": "", "media": null, "score": 2081, "upvote_ratio": 0.97, "comment_count": 607, "over_18": false}, "52": {"id": "1h2new6", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "tonymontanaOSU", "link_flair_text": null, "time": 1732936077.2945392, "created_utc": 1732891801.0, "url": "https://www.reddit.com/r/UAP/comments/1h2new6/wouldnt_a_hobbyist_drone_get_immediately_shot/", "title": "Wouldn’t a hobbyist drone get immediately shot down if it flew over a military base?", "permalink": "/r/UAP/comments/1h2new6/wouldnt_a_hobbyist_drone_get_immediately_shot/", "selftext": "What am I missing here. If the drones are being allowed to fly over bases for days, isn’t this confirming that they can’t shoot them down?", "media": null, "score": 180, "upvote_ratio": 0.96, "comment_count": 156, "over_18": false}, "53": {"id": "1gyt868", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "No-Match6172", "link_flair_text": null, "time": 1732936078.5768788, "created_utc": 1732461393.0, "url": "https://i.redd.it/bl4oomu49v2e1.jpeg", "title": "The Establishment has trained us well", "permalink": "/r/conspiracy/comments/1gyt868/the_establishment_has_trained_us_well/", "selftext": "", "media": null, "score": 2767, "upvote_ratio": 0.87, "comment_count": 418, "over_18": false}, "54": {"id": "1h23xh4", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Vib_ration", "link_flair_text": null, "time": 1732936078.8381162, "created_utc": 1732822667.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1h23xh4/you_can_tap_into_your_endorphins_to_go_beyond/", "title": "You can tap into your endorphins, to go beyond physical pain, whenever you want with this special skill.", "permalink": "/r/conspiracyfact/comments/1h23xh4/you_can_tap_into_your_endorphins_to_go_beyond/", "selftext": "Introduction to Runner’s High\nThis post will focus on explaining how the term Runner’s High that is experienced by people who run/jog is another way you can experience your vital energy, the energy from your Spirit (soul/astral body/etheric body/energetic body/emotional body/true self). This is to help spread this information and help everyone learn about the different spiritual/biological discoveries, usages and benefits that were documented on the activation of this type of energy.\nThis presents to you an opportunity to empower yourself with your knowledge of the Runner’s High by gaining the ability to really tap into all the reported, documented and written spiritual/ biological usages that are said to be achievable with your conscious cultivation of your Vital Energy.\nWhat does Runner’s high mean/Represents:\n• Runner’s High is a deeply euphoric state that is experienced during or following any intense exercise where you push yourself past your limit.\n• It is commonly known to be experienced by people who run or jog daily as they push themselves beyond their limit. This makes their body release hormones called endorphins that help relieve pain, reduce stress and improve their sense of well-being, helping them go on for hours, almost effortlessly.\n• This state is also reported to have its users experience physical goosebumps mixed with the emotion of Euphoria that is the same one present when anyone experiences Frisson from a song they really like/moves them.\n• That same energy can be and is activated/drawn from your body when you get chills/goosebumps from an positive external or internal stimuli.\n• Your vital energy activates goosebumps/chills not the other way around. You can learn how to separate that extremely pleasant energy from the physical reaction of goosebumps and eventually learn how to activate only that Euphoric energy part whenever you please, feel it wherever or everywhere on yourself and for the duration you choose.\n• Experiencing the Runner’s High state is equivalent to experiencing what can be considered your \"Spiritual Energy\" because your spirit (soul/astral body/etheric body/ energetic body/emotional body/true self) is made of that same energy in motion that activates when you experience it.\n• In its neutral state, you unconsciously draw that energy with your breath, the foods/liquids you consume and especially the thoughts you think, the actions you do and the visual content that you watch either emits or draws in to amplify your base of this BioElectric Energy.\nHere's a simple way that's explains how you can become aware of your Spiritual Energy, it is that extremely comfortable Euphoric wave that can most easily be recognized as present while you experience goosebumps/chills from a positive external or internal situations/ stimuli like listening to a song you really like, thinking about a lover, watching a moving movie scene, striving, feeling thankful, praising God, praying, etc.\n• That Euphoric wave is the animating energy behind life itself, Other cultures that have experienced in other ways with this energy found their own usages for it and then documented their results as they coined different terms for it.\n• It was discovered that this energy can be used in many beneficial ways.\nSome which are more biological like Unblocking your lymphatic system/Meridians, Feel euphoric/ecstatic on your whole body, Guide your Spiritual chills anywhere in your body, Control your temperature, Give yourself goosebumps, Dilate your pupils, Regulate your heartbeat, Counteract stress/anxiety in your body with this energy, Internally Heal yourself, access your Hypothalamus on demand,\nand I discovered other usages which are more spiritual like Accurately use your Psychic senses (clairvoyance, clairaudience, spirit projection, higher-self guidance, vision from your third eye)with this energy, Managing your Auric field, Manifestation, Energy absorption from any source and even more to come.\nIf you're interested in learning how to use this subtle energy activation for these ways, here are three written tutorials going more in-depth and explicitly revealing how you can do just that.", "media": null, "score": 1, "upvote_ratio": 0.54, "comment_count": 0, "over_18": false}, "55": {"id": "1h1ypdx", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "SquidTeats", "link_flair_text": "holiday cheer", "time": 1732936079.344059, "created_utc": 1732808590.0, "url": "https://i.redd.it/nl5f8mnhxn3e1.jpeg", "title": "Happy Thanksgiving!!", "permalink": "/r/bigfoot/comments/1h1ypdx/happy_thanksgiving/", "selftext": "", "media": null, "score": 439, "upvote_ratio": 0.95, "comment_count": 12, "over_18": false}, "56": {"id": "1h0jzjw", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Intelligent_Oil4005", "link_flair_text": "Discussion ", "time": 1732936079.9667258, "created_utc": 1732648274.0, "url": "https://i.redd.it/dnktmuwvoa3e1.jpeg", "title": "A painting of the mysterious Washington Sea Eagle by John James Audobon, who claimed to see the bird fly across the Mississipi River. While some believe he mistook a younger Bald Eagle for a new genus, some believe it was one, but it extinct sometime after John's sighting.", "permalink": "/r/Cryptozoology/comments/1h0jzjw/a_painting_of_the_mysterious_washington_sea_eagle/", "selftext": "", "media": null, "score": 218, "upvote_ratio": 0.97, "comment_count": 22, "over_18": false}, "57": {"id": "1gywe2x", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Mysterious-Oil-8358", "link_flair_text": "U.F.O. Humanoid", "time": 1732936080.1962488, "created_utc": 1732469380.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1gywe2x/voronezh_ufo_incident/", "title": "Voronezh UFO Incident", "permalink": "/r/Humanoidencounters/comments/1gywe2x/voronezh_ufo_incident/", "selftext": "https://preview.redd.it/bl9fhphtwv2e1.jpg?width=250&format=pjpg&auto=webp&s=c7475ba1b31b1918e910c4a35ecee96e4f43a9db\nIn what may be the most bizarre extraterrestrial encounter ever reported, dozens of eyewitnesses claimed that in the autumn of 1989, a trio of three-eyed aliens — along with their mechanical companion — landed and attacked a pair of teens in a Russian park. The Russian city of Voronezh is an industrial hub located about 300 miles from Moscow. The city has a population of nearly one million and hardly seems like the kind of isolated region that is ordinarily associated with strange alien encounters, yet on the evening of September 27, 1989, at about 6:30 pm., it became the host of what strikes many as being one of the most unusual, not to mention horrifying, encounters with creatures ever recorded. Eyewitnesses reported that on the evening in question a glowing, deep red, ovoid object — which they estimated to be approximately 45-feet wide and 18-feet high — circled above an area known as Levoberezhniy’s park. Witnesses swore that the “vehicle” hovered less than 40-feet above ground, close enough to disturb the grass below. Then, just as suddenly as it had arrived, the UFO soared away, leaving the eyewitnesses perplexed and no doubt more than a little relieved.\nhttps://preview.redd.it/e2jq2o9wwv2e1.jpg?width=220&format=pjpg&auto=webp&s=d040f69aee1d7f272c9e54b21dfeec2bbda15493\nThat was until the strange craft returned just minutes later. It hovered near a group of grade-school children; including Vasya Surin, Julia Sholokhova, Lena Sarokina, Alyosha Nikonov and Vova Startsev – who were engaged in a soccer match. But it wasn’t only children who saw the UFO. It was also spotted by 35 to 40 adults who were waiting at a nearby bus stop on Poutiline St. Both the kids and adults were awed by the spectacle before them and utterly unprepared for what they were about to see next.\nAccording to eyewitness accounts, a hatch on the underside of the still hovering craft opened to reveal an odd, long-armed, neck-less, thick-set, 9-foot tall entity with a small, knob-like head. The creature was clad in a silver jumpsuit with bronze boots and was so large it appeared to fill the hatch opening. As if the creature’s immensity wasn’t disturbing enough, eyewitnesses claimed that there were three luminous eyes wedged into its tiny, dome-like head. The being’s two outer eyes were whitish and the center eye — which was set slightly above the other two — was bright red and “swiveling around like a radar.” They also claimed that the alien had a disk-like object attached to its chest. This bizarre being seemed to methodically scan the terrain below, then sealed the hatch. Then the UFO made its descent. Eyewitnesses stated that the object’s weight was so substantial that it permanently bent to the side a standing poplar tree that was near the craft.\nThe object then hovered about 5-feet off the ground and extended four leg-like supports and landed softly on the grass. At this point, the alien that was seen through the open hatch now emerged from the ship followed by two equally colossal creatures that shared the same three-eyed visages. These extraordinary entities walked with a “heavy gait” and were followed by what witnesses described as a box-like robot, with push buttons on its front side. An alien adjusted one of the controls on the robot’s chest, enabling it to walk about in a “mechanical” fashion. The entities then began to examine the ground near where their craft had landed and proceeded to take some soil samples. One of the creatures made indecipherable sounds, which some eyewitnesses perceived to be orders. Then a beam of light emerged from the “chief” alien’s chest. The beam delineated a number of luminous triangles and rectangles — about 1-foot by half a foot wide — as if indicating something to its comrades. This frightened one young man so much he apparently cried out in alarm. At the sound the lead alien apparently fixed its gaze on the youngster, freezing him unnaturally in his tracks. This sent panic rippling through the rest of the terrified crowd and — as if this tale could get any weirder — witnesses claim that the aliens and the UFO all simultaneously disappeared. Nevertheless, this encounter was far from over.\nApproximately five minutes later, the remaining witnesses, still stunned by what they had witnessed, were once again thrust back into the looking glass as the UFO and its occupants instantaneously reappeared at the same coordinates. One of the creatures was now carrying a “tube” that was about a foot in length. It aimed the tube toward a 16-year-old boy who was nearby and a beam shot out, causing the teen to disappear without a trace. Before a terror filled riot could ensue, the creatures re-entered the UFO. It retracted its landing gear and began its ascent, slowly increasing its speed. Just as the vehicle was disappearing from sight, the vaporized teen miraculously reappeared. Of course, it wasn't long before the press got wind of this harrowing and utterly bizarre tale of UFOs, robots, vanishing “guns” and gargantuan alien invaders. Genrikh Silanov, head of the Voronezh Geophysical Laboratory, first reported the case and — in a reflection of the new era of glasnost — the Soviet news agency TASS published a report about the event. Soon the story spread across the globe like wildfire.\nIn no time, scores of scientists, Soviet Government agencies and reporters descended upon the city of Voronezh. Those interviewed claimed they had observed this UFO, not just during the incident in question, but also many times between the dates of September 21 and October 2, 1989. An investigation at the scene of the landing indicated that there were depressions in the ground in the shape of a large rhombus that must have been caused by something weighing several tons, but there were conflicting reports as to their cause. Scientists also allegedly found anomalies in the local magnetic field and background radiation, though these findings have also been disputed. Silanov further claimed that unearthly substances were found at the scene: At first glance, they looked like sandstone of a deep-red color. However, mineralogical analysis has shown that the substance cannot be found on Earth. However, additional tests are needed to reach a more definite conclusion.”\nOther reputable witnesses included Lieutenant Sergei A. Matveyev who confessed that while he had not actually seen the aliens, he had seen the spaceship, which he described as “a body flying in the sky,” moving silently at a very high speed and very low altitude. Lieutenant Matveyev claimed that even he was a little skeptical when he first saw the object: ”I thought I must be really tired, ‘but I rubbed my eyes and it didn't go away. Then I figured, in this day and age, anything is possible.” Vladimir A. Moiseyev, director of the regional health department, claimed that his primary concern was that of the health of the children who may have been exposed to unknown pathogens or radiation due to their contact with the aliens and their technology.\nJournalist E. Efremov, of the Sovietskaya Kultura, spoke of the veracity of the eyewitness accounts: ”Children and eyewitnesses of the abnormal phenomenon have been questioned by police workers and journalists… there are no discrepancies in the description of the sphere itself or the actions of the ‘aliens.’ Moreover, all the children who became witnesses to this event are still afraid, even now.” Following the event, the children — including 6th grader Roma Torshin and Genya Bilinov — were encouraged to draw the beings they had seen, with results that even skeptics had to admit were surprisingly consistent with what had been reported by the children and adults alike. Even today debates rage in ufological circles concerning this odd incident.\nWhile many seem convinced that this account is an obvious hoax, there are others who feel that this may be Russia’s equivalent of the now notorious Roswell UFO Incident. Perhaps the truth lies somewhere in between, but it would seem that even in 1989 — during a relatively open juncture in the exceedingly clandestine history of the USSR — Soviet secrets were still kept close to the vest. In the years following this largely forgotten incident, there has grown an almost cult affection for the odd creatures that allegedly visited Levoberezhniy’s park that chilly autumn evening, even spawning a line of Japanese toys. Whatever these entities were they’ve never returned, leaving the rest of the world to speculate as to whether or not these creatures were a hoax, explorers from another world, interdimensional travelers or advanced scouts for an alien invasion… perhaps we’ll be luckier if we never know.", "media": null, "score": 46, "upvote_ratio": 0.95, "comment_count": 5, "over_18": false}, "58": {"id": "1h1srpl", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "mistahfunniman", "link_flair_text": null, "time": 1732936080.558541, "created_utc": 1732788265.0, "url": "https://i.redd.it/p9485m5y8m3e1.png", "title": "I feel bad for Ningen because in most pictures hes just wandering around cluelessly with no goal, can somebody please get this guy home?", "permalink": "/r/cryptids/comments/1h1srpl/i_feel_bad_for_ningen_because_in_most_pictures/", "selftext": "", "media": null, "score": 567, "upvote_ratio": 0.98, "comment_count": 32, "over_18": false}, "59": {"id": "1gxt8tv", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Magellan_8888", "link_flair_text": "Discussion/Advice", "time": 1732936080.818625, "created_utc": 1732342917.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gxt8tv/had_a_very_serious_out_of_the_blue_period_of/", "title": "Had a very serious, out of the blue period of grief 2 days before the passing of a local student I knew", "permalink": "/r/Thetruthishere/comments/1gxt8tv/had_a_very_serious_out_of_the_blue_period_of/", "selftext": "*Warning* this post mentions death and self harm. please read at your own discretion.\nI'm 22m and have experienced a variety of \"crazy coincidences\" throughout my life, but this has got to be the weirdest.\nOn Tuesday, I was doing homework and happened upon the song \"mercy street\" by peter gabriel. the song is quite melancholy, and it made me unusually sad. Particularly, how it was based on the poems of Anne Sexton, an american mental patient who wrote as a form of therapy. She had repeatedly tried to end her own life, until she eventually succeeded, which is quite grim. I listen to a variety of music, and usually I don't get very emotional over it. However, when I went to bed, the sadness had compounded, to the point where I was crying uncontrollably and could not stop. This went on constantly for about 1 hour. At the time, I was just thinking about my family and how much our lives had changed for worse, especially during COVID. Eventually I fell asleep, and the next morning, awoke feeling on the right side of bed as though nothing had happened.\nFast forward to Thursday, news got around that a student at my school had been killed in a car accident. He was simply biking down the street, when a reckless driver lost control of his car. He crashed the car, and ended up running into the student. This student ended up being the younger brother of a girl I had dated two years ago. I also happened to have seen him the day before he was killed. \nI cant help but feel irked. I never feel grief like that, let alone out of the blue. And for it to be two days before someone I knew getting so horribly killed.", "media": null, "score": 21, "upvote_ratio": 0.93, "comment_count": 3, "over_18": false}, "60": {"id": "1h261bl", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Glitter_Heels21", "link_flair_text": null, "time": 1732936081.0199358, "created_utc": 1732828845.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1h261bl/in_senior_year_i_got_really_bizarre_notes_from_a/", "title": "In senior year, I got really bizarre notes from a secret admirer.", "permalink": "/r/LetsNotMeet/comments/1h261bl/in_senior_year_i_got_really_bizarre_notes_from_a/", "selftext": "When I was a freshman in high school, Alyssa was my role model.\nAlyssa was a senior. She was so gorgeous, confident, smart, effortlessly stylish, and always owning the room. Back then, I was too shy to talk to her. Seniors are already pretty intimidating to freshmen, but Alyssa was next-level intimidating because she was such a queen!\nI didn’t expect anyone to see me the way I saw Alyssa, but I was pleasantly surprised in my senior year.\nIn my senior year, I started finding cute little notes in my locker. I wasn’t expecting that at all, but I was really flattered. The first one said:\n\n“You were beautiful in that dress on Friday ♡”\n\nThe handwriting was neat and simple with a cute little heart at the end.\nMore notes kept coming, always in fourth period. I got a note every week or two. I know they came during fourth period because I checked my locker before and after every class. They were all really sweet. They said things like this:\n\n“Your smile lights up the hallway!”\n“You shine brighter than any star!\"\n\"Your homecoming photos are straight out of a magazine cover! So stunning!\"\n\nThere were more notes that I don’t remember. They weren’t romantic or flirty. They looked like things I might have said to Alyssa if we'd ever spoken. I thought maybe they were from a shy underclassman girl. I had my suspicions.\nI didn’t tell anyone about the notes. I really didn’t want my friends turning this into an investigation and embarrassing whoever was leaving them. Whoever was leaving these messages, I thought they meant well.\nThen in the second semester, my schedule changed. My last class of the day was upstairs near my friend’s locker. My friend’s last class was near my locker. We swapped lockers.\nI forgot all about the notes until my 18th birthday. That morning, my friend handed me a note she found in her (my old) locker. It said “Happy birthday, princess.”\nAt first, she thought the notes were meant for her since any of those compliments could fit her too. But when she realized the birthday didn’t match up, she put two and two together.\nCome to think of it, I don’t think any of the notes ever said my name.\nI admitted that the notes had been happening all year and explained that I didn’t want to make a big deal about it.\nThen my friends launched their investigation that I had been worried about! All the girls in our friend group became detectives trying to solve this mystery. One friend, who didn’t have a fourth-period class, stationed herself by the lockers to surveil that area. That worked.\nThe notes weren’t from a shy freshman or even from a boy. They were from a janitor, an older woman none of us knew. We all recognized her, but I don't think any of us had ever talked to her. She’d been leaving these notes for several months, watching me closely enough to comment on my outfits, field hockey games, and even what I posted on Facebook!\nI saw her at the last field hockey game of the season. She sat quietly in the stands. That was the only time I noticed her watching me, but I have no idea how places I didn't notice her watching me.\nNone of us brought this up to her. She hadn’t done anything \"wrong,\" but it felt unsettling in a way that’s hard to explain.", "media": null, "score": 97, "upvote_ratio": 0.97, "comment_count": 9, "over_18": true}, "61": {"id": "1gy2f1a", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Expert_Wall5587", "link_flair_text": null, "time": 1732936081.2205522, "created_utc": 1732376465.0, "url": "https://www.reddit.com/r/truecreepy/comments/1gy2f1a/the_hinterkaifeck_murders_true_story/", "title": "The Hinterkaifeck murders. (True story) ", "permalink": "/r/truecreepy/comments/1gy2f1a/the_hinterkaifeck_murders_true_story/", "selftext": "In 1922 a German farmer by the name Andreas Gruber woke up and found footprints in the snow leading from the forest right up to his back door. Whoever had come to his house hadn't left as there were no other footprints leaving the house, other then the ones leading up to the door. He went to make sure it wasn't just his family. It wasn't. he then searched everywhere on his property in his house everywhere. Nothing, he could not determine who made the footprints or where they went. Weeks leading up to this incident,  Kreszenz Rieger, the family maid abruptly quit. It was later found out she claimed hearing stranger noises coming from the attic. She believed the house to be haunted. \nOn the afternoon of Friday March 31, 1922, a new maid arrived at the Hinterkaifeck farm. Maria Baumgartner had been escorted to Hinterkaifeck by her sister, who left the farm after a brief stay. It was likely that Baumgartner’s sister was the last person to see the Gruber family and her sister alive. A few days go by and No one hears from the Gruber family. Saturday and Monday, little Cecilia was supposed to attend her school, but she didn't show up to. and on Sundays, none of her family members went to church. On Tuesday April 4th, a mechanic visited the farm and spent a few hours fixing farm equipment, but none of the family came out. When the repairman thought it was strange and told the villagers of Kaypek, the villagers also wondered, The family of Hinterkaifek Farm are nowhere to be seen.\nAt some point during the night of March 31st. Andreas and his wife Cäzilia, along with their daughter Viktoria and granddaughter Cäzilia, were lured away from the house one at a time to the barn, where they were attacked and murdered. The killer had used a hatchet that belonged to the family farm, inflicting blows to the head. The killer then went into the family's house, and using the same  weapon, killed the youngest son Josef, while he slept as well as Baumgartner, who was found in her bedroom. The bodies of the family and their maid would remain undiscovered over the next four days. The day after the murders, April 1st at around 3:30pm, Lorenz Schlittenbauer sent his sixteen-year-old son Johann to the Hinterkaifeck farm to see if they could find the whereabouts of the Gruber family. He eventually returned home and reported he hadn't seen anyone at the Hinterkaifeck farm. Schlittenbauer headed to the farm the same day in the company of Michael Plöckl and Jakob Sigl. The three men entered the barn and there found the  bodies of Andreas Gruber, his wife Cäzilia Gruber, his daughter Viktoria Gabriel, and his granddaughter Cäzilia. Schlittenbauer stacked on top of each other, he then went into the house alone shortly afterwards, and there found the maid, Maria Baumgartner, and the youngest family member, Josef, murdered inside the house. The victims in the barn suffered horrendous injuries. Cäcilia Gruber was found to have eight holes in the right side of her skull, while her daughter Viktoria’s skull was found to have nine holes after being hit repeatedly on the right side of her head.\nBoth of the murder weapons  belonged to Andreas Gruber, who suffered significantly different injuries to the other members of his family. He was found to have died from a fall onto the tip of the heavy pickaxe, which was found in the animal feeding trough. This wound tore open his carotid artery, causing him to bleed to death within a very short time. The flesh was torn open on the right side of his cheek and the cheekbone protruded. He only had this one injury. Detectives believe the killer had remained in the house for three days with bodies of the victims, and despite a thorough investigation, this gruesome crime remains unsolved to this day.\nThe police set about questioning eye-witnesses who came forward with information. One such person questioned was artisan Michael Plöckl. In an interview with Michael, he States he would walk past the Hinterkaifecker's property every morning and evening as he went to and from work. According to Michael, On Friday night March 31st around 9:00 o'clock, as he was returning from work, he was illuminated with a lantern by a man who was coming towards him from a field near Hinterkaifeck. This man, whom he did not know very well, then jumped back into the field without saying anything. As Plöckl told me, the figure of the man matched that of Lorenz  Schlittenbauer.\nAs he continued walking, Plöckl noticed that there must have been a fire in the Hinterkaifecker's oven because he saw smoke rising. This smoke had a disgusting smell, as if old rags were being burned. Plöckl also told me that that evening, or rather, on that night, the inhabitants of the Kaifeck were killed, at least that night was described by the homicide squad as the night of murder. Plöckl said  \"I am convinced that Schlittenbauer burned his blood-stained clothes in the oven that evening\". For many years people speculated that Schlittenbauer murdered the family after Viktoria demanded financial support for young Josef. Before his death in 1941, Schlittenbauer initiated and won several civil claims for slander against those people who described him as the “murderer of Hinterkaifeck”. If Schlittenbauer had knowledge of who committed the Hinterkaifeck murders, he took the secret with him to the grave.   \n( Thank you guys for reading I hope you enjoyed it, I spent a whole day reading and watching documentaries and what not on this story. I know I didn't get all the details but I tried to cover most of it lmk what you think! )", "media": null, "score": 17, "upvote_ratio": 0.87, "comment_count": 4, "over_18": true}, "62": {"id": "1gz5g6m", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "perdurabo9", "link_flair_text": "ISO (In Search Of)", "time": 1732936081.8483827, "created_utc": 1732492841.0, "url": "https://www.reddit.com/gallery/1gz5g6m", "title": "Question about footage - Pink Lady GreenCastle Indiana", "permalink": "/r/Ghosts/comments/1gz5g6m/question_about_footage_pink_lady_greencastle/", "selftext": "Hi guys in the video Guy says some writing appeared on the walls after he walked into the house. Does anyone know if the writing has ever been deciphered? Any help is appreciated ", "media": null, "score": 42, "upvote_ratio": 0.85, "comment_count": 11, "over_18": false}, "63": {"id": "1h2ryh4", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "FaeTheWolf", "link_flair_text": "Glitch Vid", "time": 1732936082.0991995, "created_utc": 1732904002.0, "url": "https://v.redd.it/9ludw6ut4u3e1", "title": "Cat changes the laws of physics mid jump", "permalink": "/r/GlitchInTheMatrix/comments/1h2ryh4/cat_changes_the_laws_of_physics_mid_jump/", "selftext": "", "media": null, "score": 44, "upvote_ratio": 0.89, "comment_count": 5, "over_18": false}, "64": {"id": "1gzpace", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "PodwithPat", "link_flair_text": null, "time": 1732936083.56846, "created_utc": 1732557721.0, "url": "https://youtube.com/watch?v=4wSt1xLoeMc&si=zSXH4qBU_GkmKVjH", "title": "Jesse Michel's David Grusch Documentary TAKEN DOWN On Youtube", "permalink": "/r/ufo/comments/1gzpace/jesse_michels_david_grusch_documentary_taken_down/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Jesse Michel's David Grusch Documentary TAKEN DOWN On Youtube", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/4wSt1xLoeMc?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Jesse Michel&#39;s David Grusch Documentary TAKEN DOWN On Youtube\"></iframe>", "author_name": "VETTED", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/4wSt1xLoeMc/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@VETTEDPODCAST"}}, "score": 336, "upvote_ratio": 0.87, "comment_count": 64, "over_18": false}, "65": {"id": "1h2a0zm", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Pulsear", "link_flair_text": "Sighting", "time": 1732936084.9951317, "created_utc": 1732841634.0, "url": "https://v.redd.it/dr7eesmzmq3e1", "title": "I assumed this was a spotlight but it’s moved about 5 miles east! (UK)", "permalink": "/r/UFOs/comments/1h2a0zm/i_assumed_this_was_a_spotlight_but_its_moved/", "selftext": "Location: Hertfordshire, UK\nDate: 28/11/24\nTime: 10pm\nDuration: Lasted about 30 minutes\nNumber of witnesses: 1\nDescription of sighting: Strange lights in the sky which I’m unable to explain!", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/dr7eesmzmq3e1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/dr7eesmzmq3e1/DASH_96.mp4", "dash_url": "https://v.redd.it/dr7eesmzmq3e1/DASHPlaylist.mpd?a=1735528083%2CYTc1ZjhlMzlkMmE3ZTQxZjg0YjljM2JkOThkNDk2YzBjZTk2MzE4MTJmMWVjMDdiNmY2OGEyNWNjNmM2MzBkOA%3D%3D&v=1&f=sd", "duration": 211, "hls_url": "https://v.redd.it/dr7eesmzmq3e1/HLSPlaylist.m3u8?a=1735528083%2CZDM0YmE2NjhmYTMxMTM5NTJjNGEwZmMwZjNmNWZjNzQzMzdlZmJhODg4OTg2YTQwYWU3NmEwODcxZDcyOWNlOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 5272, "upvote_ratio": 0.81, "comment_count": 902, "over_18": false}, "66": {"id": "1gzz7x1", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "littlespacemochi", "link_flair_text": "Video", "time": 1732936086.6048973, "created_utc": 1732582492.0, "url": "https://v.redd.it/m37rjg3a953e1", "title": "Cube UFO Seen in Colorado Springs, November 23, 2024", "permalink": "/r/aliens/comments/1gzz7x1/cube_ufo_seen_in_colorado_springs_november_23_2024/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/m37rjg3a953e1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 480, "scrubber_media_url": "https://v.redd.it/m37rjg3a953e1/DASH_96.mp4", "dash_url": "https://v.redd.it/m37rjg3a953e1/DASHPlaylist.mpd?a=1735528085%2CNDVkNjA4OWMxNDE3NzRmNjhmNzY0ZWJhM2ZkNzc5NDUwOTQ5NjQ4MDRjMTU4YjA4M2U4N2M0ZTM4OGZhZWU1MA%3D%3D&v=1&f=sd", "duration": 49, "hls_url": "https://v.redd.it/m37rjg3a953e1/HLSPlaylist.m3u8?a=1735528085%2CMGU2MzQ4OGQ2MTNiMGIwYjA0NjI3MzFjZWZiNWY1NmVhMzE4ZjVmZWI3NzE0YTcyMjAyZmZmYzViZTZlODhlYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2013, "upvote_ratio": 0.86, "comment_count": 405, "over_18": false}, "67": {"id": "1h11z6a", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": null, "time": 1732936087.1798346, "created_utc": 1732706067.0, "url": "https://ovniologia.com.br/2024/11/drones-desafiam-novamente-bases-dos-eua-no-reino-unido.html", "title": "\"Drones\" challenge U.S. bases in the UK once again. The incursions of the alleged drones have been happening quietly at several bases, raising serious suspicions about their true nature and origin.", "permalink": "/r/UAP/comments/1h11z6a/drones_challenge_us_bases_in_the_uk_once_again/", "selftext": "", "media": null, "score": 133, "upvote_ratio": 0.99, "comment_count": 10, "over_18": false}, "68": {"id": "1gzxenn", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "topcat5", "link_flair_text": "Rule 10 Reminder ", "time": 1732936088.5797188, "created_utc": 1732577500.0, "url": "https://i.redd.it/xih3inm3u43e1.jpeg", "title": "Biden's DOJ drops all Jan 6 charges against Trump. The cases are falling like flies.", "permalink": "/r/conspiracy/comments/1gzxenn/bidens_doj_drops_all_jan_6_charges_against_trump/", "selftext": "", "media": null, "score": 2594, "upvote_ratio": 0.77, "comment_count": 849, "over_18": false}, "69": {"id": "1gxx7uq", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "cheriaspen", "link_flair_text": null, "time": 1732936088.8289256, "created_utc": 1732359770.0, "url": "https://www.reddit.com/gallery/1gxx3ew", "title": "REINER - WORLDWIDE EFFORTS. ED WACKERMAN - ONE POSSIBLY BRILLIANT STRATEGY, FROM CLIF HIGH.", "permalink": "/r/conspiracyfact/comments/1gxx7uq/reiner_worldwide_efforts_ed_wackerman_one/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.45, "comment_count": 4, "over_18": false}, "70": {"id": "1h1xhfy", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "RansomDCoslett", "link_flair_text": "holiday cheer", "time": 1732936089.3925102, "created_utc": 1732805168.0, "url": "https://i.redd.it/hcho06zenn3e1.jpeg", "title": "Happy Thanksgiving ", "permalink": "/r/bigfoot/comments/1h1xhfy/happy_thanksgiving/", "selftext": "", "media": null, "score": 402, "upvote_ratio": 0.97, "comment_count": 17, "over_18": false}, "71": {"id": "1h0tf1j", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Mamboo07", "link_flair_text": "Art", "time": 1732936090.0408401, "created_utc": 1732673326.0, "url": "https://www.reddit.com/gallery/1h0tf1j", "title": "Cryptids! (Art by Eduardo Valdés-Hevia)", "permalink": "/r/Cryptozoology/comments/1h0tf1j/cryptids_art_by_eduardo_valdéshevia/", "selftext": "", "media": null, "score": 197, "upvote_ratio": 0.9, "comment_count": 46, "over_18": false}, "72": {"id": "1h0cpq9", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Mysterious-Oil-8358", "link_flair_text": "U.F.O. Humanoid", "time": 1732936090.3639205, "created_utc": 1732630129.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1h0cpq9/kofu_fanged_humanoids/", "title": "Kofu Fanged Humanoids", "permalink": "/r/Humanoidencounters/comments/1h0cpq9/kofu_fanged_humanoids/", "selftext": "https://preview.redd.it/c35evffo693e1.jpg?width=180&format=pjpg&auto=webp&s=d7f58f821afd665bcfcedc07d2c18646b70c16b5\nSometime before 7 PM, on the evening of February 23, 1975, two grade-school boys, Masato Kawano and Katsuhiro Yamahata, were roller skating near the Hinode Housing Estate in Kamimachi, Kōfu, Yamanashi, Japan, when they noticed a pair of “glittering,” orange UFOs frolicking in the sky above. The enthralled boys stared in awe as the larger of the two objects broke off and flew toward Mt. Atago, while the smaller one slowly descended to the ground, landing amongst the crops of a vineyard behind the estate. The boys later stated that the strange aerial objects emitted an odd crackling or “ticking” sound, not unlike that of a Geiger counter.\nIt goes without saying that the curious youngsters wasted no time in removing their skates and charging into the vineyard in order to get a better look at this now earthbound object. As the two 2nd Graders approached the formerly orange “space craft\" they saw that it was actually a domed, silverish disc, which stood approximately 7-feet high and was almost 15-feet in diameter. This classically shaped flying saucer was perched on “three ball-shaped legs” and had what the children described as “strange characters” embossed on the metallic surface of its hull. While inspecting the craft, both Kawano and Yamahata were astounded — and no doubt a bit frightened — to see a hatch open on the side of the craft and a ladder automatically extending down to the ground below. The boys watched in stunned silence as a bizarre humanoid creature disembarked from the ship. It was at that moment that the boys noticed another — smaller, though similar looking — humanoid that remained inside the control room. Kawano and Yamahata reported that the first creature was long-armed, almost 4-feet tall and was clad in a “glowing” or reflective silver uniform.\nhttps://preview.redd.it/gend2i9r693e1.jpg?width=180&format=pjpg&auto=webp&s=2d12cf709c5c3f795cd39f99a16f45ab1967bc6e\nUnlike the Kinnula Humanoid — which was clad head to foot in a deep sea diver-like, green suit — the Kofu entity’s skin was described as being dark brown and covered in wrinkles so dense that they obscured any noticeable features; save three, two-inch long, metal “fangs.” While the silvery fangs are a new twist, the wrinkly skin might ring a bell for those who have heard of the Pascagoula Elephant Men. This strange alien sightseer apparently began to explore the terrain, seemingly oblivious to the enthralled duo staring at it. That was until it abruptly turned and placed one of its “hands” on Yamahata’s shoulder, patting him twice and uttering a series of sounds that sounded to the boys: “like a tape recorder running backwards.” At this point Yamahata collapsed to the ground, paralyzed.\nAlthough his friend believed that this was caused by fear, anyone familiar with so-called close encounters of the 3rd kind can attest that human beings are often placed in a state of almost suspended animation by extra-terrestrial visitors in, what one must assume, is an effort to prevent them from hurting themselves or anyone else. As soon as Yamahata dropped, Kawano — exhibiting a commendable bout of courage for one so young — rapidly pulled his friend up onto his shoulders and lugged him away from these vampiric alien assailants as swiftly as possible. Upon returning home, the now almost hysterical boys immediately informed their mothers about this bizarre close encounter. Their curious — yet almost certainly incredulous — mothers followed their clearly perturbed sons to the back of the Hinode Housing Estate, where, much to their shock, they confirmed seeing an orange light pulsating in the vineyard. This odd light show continued for five minutes. Before the boys could convince their mothers to investigate the strange craft at a closer range, the UFO launched with a burst of light so brilliant the eyewitnesses were compelled to avert their eyes.\nIt should be noted that while Yamahata and Kawano were the only ones to have actually seen the aliens, their classmate — 8-year-old, Ichiro Minegishi — also reported that he saw a shining object flying toward the Hinode Housing Estate while he was riding in a car with his parents near the Kōfu Bypass, approximately one half-hour before the boys claimed to have discovered the UFO. The following day, Kawano and Yamahata had a captivated audience of students and teachers at the Yamashiro Elementary School, as they drew pictures and retold the harrowing tale of their alien encounter. It wasn’t long before the buzz enveloped the entire school and the educational authorities — with what, at least in the 21st Century, seems to be uncharacteristic open-mindedness — decided that they would inspect the area for themselves.\nThe school officials arrived armed with whatever gear they could get hold of and immediately noticed that two solid concrete posts had been “pushed over” at the landing site. It was determined that the boys would have been unable to accomplish this task of ostensibly intergalactic vandalism on their own. This investigative team also found what they referred to as “landing traces” as well as a ring pattern in the soil near the broken concrete posts where the UFO landed. One schoolteacher even claimed to have discovered radioactivity within the circular patch. Following the event, both boys were questioned in depth by their parents, their schoolmaster, Nobuyoshi Kaneko, and noted UFO investigator Masaru Mori — their stories remained alarmingly consistent.\nUnsurprisingly, the authorities of the Civil Aviation Bureau of the Transportation Ministry claimed that the UFO was nothing more than the lights of a YS-11 propeller plane, which often flew at an altitude of a thousand meters and was visible to the naked eye. They apparently reserved comment as to whether or not this aircraft could also assume the form of small, pointy eared, fanged humanoids.\n----------------\nLink: https://cryptidz.fandom.com/wiki/Kofu_Fanged_Humanoids", "media": null, "score": 12, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "73": {"id": "1gyh9ku", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Dangerous_Word_3769", "link_flair_text": null, "time": 1732936090.7572443, "created_utc": 1732417517.0, "url": "https://i.redd.it/wou4obbqmr2e1.jpeg", "title": "Looking for the artist behind this", "permalink": "/r/cryptids/comments/1gyh9ku/looking_for_the_artist_behind_this/", "selftext": "Been looking for the artist behind this or at least where it originated, it's tossed on pretty much anything spooky but especially mothman", "media": null, "score": 175, "upvote_ratio": 0.99, "comment_count": 9, "over_18": false}, "74": {"id": "1h0fttk", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "unsettlingmemorial", "link_flair_text": "Picture/Evidence", "time": 1732936091.0542088, "created_utc": 1732638263.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1h0fttk/unsettling_memorial_found_while_urbexing_phone/", "title": "Unsettling memorial found while urbexing (phone number removed)", "permalink": "/r/Thetruthishere/comments/1h0fttk/unsettling_memorial_found_while_urbexing_phone/", "selftext": "Hey all, tonight a buddy and I went exploring a place we've previously been. But upon arrival, both my friend and I felt a looking sense that was not previously present. We felt instinctively more on edge and aware of our surroundings.\nUpon making it to the factory, we pulled out our radio to keep an eye on security and listened. Upon listening we heard what sounded to be an alarm system, to be sure we ventured down near towards the sound, upon making it to the front entry, we found what looked to be a mangled raggedy Anne doll. Unsettling? Yes. Frightening? Not quite.\nUpon feeling relatively secure, we then ventured into a building, once we entered we felt a sense of heaviness and dread. Upon walking further we found used needles that looked as if they had been used very recently. When venturing further, lled down a staircase - once at the base I was suddenly startled by what sounded to be a charging sound towards me. Worried for my friend I called to him to see there was no one but him around me. Once we were both at the bottom, I noticed to my left what appeared to be a memorial (picture attached in comments), the note made mention of someone, a kid not too much younger than us that had been dismembered and whose entire body had yet to be found. A scary five weeks prior to our visit tonight. With that being said, the note looks, off? Strangely composed, a trap maybe. The more I look at the picture trying to figure it out, the more dreadful and near tears I feel. At a loss, we're looking for any additional possible explanations. memorial that was found\nTLDR; went urbexing, upon entry looking for alarm systems, we found an old raggedy Anne doll held by its neck. Moving in the the building, we saw needles, I heard a charging sound that seemed to come from no where and we found a memorial for someone who was seemingly killed and disfigured. But the memorial seems, odd?\nFactory location", "media": null, "score": 5, "upvote_ratio": 0.63, "comment_count": 3, "over_18": false}, "75": {"id": "1gyygzg", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "pugster123456", "link_flair_text": null, "time": 1732936091.2516098, "created_utc": 1732474655.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1gyygzg/guy_staring_through_my_window/", "title": "Guy staring through my window", "permalink": "/r/LetsNotMeet/comments/1gyygzg/guy_staring_through_my_window/", "selftext": "I'm not a very good writer or anything even close but ill try, i also doubt this is a very exciting or concerning to anything else on this sub, but still. \nthis happened when i was 11-12 (cant remember exactly), i had a bedtime of around 8pm but it never stuck since i'd be busy before then, so i usually got to bed at around 9pm. \ni went down to my room after dinner with my parents, it was univentful as always but it felt different that night, i dont know how to explain it but it just felt more important. \nwhen i laid down in bed i felt my cat jump up onto the bed, i looked around slightly for some reason, checking the windows, door and turning on the fan. \ni fall asleep a few minutes after getting into bed, i wake up suddenly, turning my head to check the clock, i will never forget this time. 4:27am. \ni looked down and saw the cat, happily sleeping against my leg, fan still on so i think to get a drink and try to go back to sleep but before i do that, i check the door and then, the window. \nthe second i look at that window i see a man, i had no idea who it was (i live in a small town/city so its rare to find someone unkown), he had to be atleast 40, unshaved, grey facial hair, balding, porch light off, the moonlight shining off his face. \nhe's staring me dead in the eye, my heart was racing unlike anything i had ever felt before, this was another form of terror, given my age, i didn't move as much as a centimetre, i was too scared. \nthis went by for probably around 30 seconds but it felt like hours, i managed to gather courage to do something, or it could have been adrenaline, reguardless i got up from my bed quickly, falling over immedietly and standing back up, running at the same time. \ni scrambled to the door, opening it and running directly to my mothers room on the end of the hall, i bash my fists against her door, yelling for her to get up, my voice waveing, a shrouded cry for help. \neventually she opens the door, half asleep, i, still scared shitless, lead her to my room, ghasping for air, she looks around and timmidly tells me theres nothing there. \ni look around, now seeing nothing at the window, she calms me back down slowly and puts me back to bed, i fall sleep, waking hours lately as the warm sunlight shines through the windows. \ni went to school, came home and then back to my room, the entire day was a blur, i felt like nothing else mattered that day, only that i had to see if that guy was still at the window, i checked when i looked out the window, there was nobody there, i took it as that, i was safe. \ncreepy guy staring at me through my window, lets not meet again.", "media": null, "score": 54, "upvote_ratio": 0.94, "comment_count": 7, "over_18": true}, "76": {"id": "1h15ykj", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Maya3701", "link_flair_text": "Personal Encounter ", "time": 1732936092.1832385, "created_utc": 1732718833.0, "url": "https://www.reddit.com/r/Ghosts/comments/1h15ykj/ghost_is_messing_with_us_and_im_not_quite_sure/", "title": "Ghost is messing with us and I’m not quite sure what to do ", "permalink": "/r/Ghosts/comments/1h15ykj/ghost_is_messing_with_us_and_im_not_quite_sure/", "selftext": "We have our bedroom lights hooked up to Alexa so we can tell it to turn the lights off and on. \nWe moved into our apartment 6 years ago and the previous tenant committed suicide in it. \nShe is still here. She lets us know by doing little things like breaking glasses or pushing things off the shelves. She stayed mostly in our guest room. For the last few months the light in that room has been going off and on randomly. I got tired of it so a few weeks ago I turned the switch off manually so Alexa can’t turn on the light. \nThis morning I came down the hall and noticed a glowing coming from under the door in that room. I go into the room and it’s freezing cold and the tv in that room is on. \nIt’s not a smart tv and you have to use the remote to turn it on. We haven’t been in that room in weeks. \nMy husband opened the door and yelled for her to turn the tv off. \nWe will see if she does. \nI think we need to sage our apartment ", "media": null, "score": 36, "upvote_ratio": 0.75, "comment_count": 40, "over_18": true}, "77": {"id": "1h2wq9t", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ScientificlyCorrect", "link_flair_text": "Glitch Pic", "time": 1732936092.4695723, "created_utc": 1732916788.0, "url": "https://i.redd.it/g2rcrpibvw3e1.jpeg", "title": "Mircosoft flight simulator lookin ahh plane", "permalink": "/r/GlitchInTheMatrix/comments/1h2wq9t/mircosoft_flight_simulator_lookin_ahh_plane/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.25, "comment_count": 2, "over_18": false}}}