{"_default": {"1": {"id": "1ei0lsw", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Difficult-Sail9873", "link_flair_text": null, "time": 1722653071.2630584, "created_utc": 1722571207.0, "url": "https://i.redd.it/jbjlbvelc6gd1.jpeg", "title": "Found a ufo in google maps that was taken 9 years ago.", "permalink": "/r/ufo/comments/1ei0lsw/found_a_ufo_in_google_maps_that_was_taken_9_years/", "selftext": "It also kinda looks like it’s breaking the sound barrier to the right of it if you zoom in ", "media": null, "score": 615, "upvote_ratio": 0.92, "comment_count": 186, "over_18": false}, "2": {"id": "1egpgfd", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Time-Development1510", "link_flair_text": "Likely Identified", "time": 1722653072.6643538, "created_utc": 1722438269.0, "url": "https://i.redd.it/tpb59ytadvfd1.jpeg", "title": "this huge white cube was rotating in the skies for about 5 min. then disappeared. in a moment.", "permalink": "/r/UFOs/comments/1egpgfd/this_huge_white_cube_was_rotating_in_the_skies/", "selftext": "Prague, 10:11.\nIt appeared first, i started to record with older iphone, then it disappeared. then it appeared again and ill try to post video in comments with newer iphone.", "media": null, "score": 3898, "upvote_ratio": 0.77, "comment_count": 1328, "over_18": false}, "3": {"id": "1egu645", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "gringoswag20", "link_flair_text": "Video", "time": 1722653074.1834965, "created_utc": 1722449644.0, "url": "https://v.redd.it/tzh27m73bwfd1", "title": "I Think About This Video Everyday", "permalink": "/r/aliens/comments/1egu645/i_think_about_this_video_everyday/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/tzh27m73bwfd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 592, "scrubber_media_url": "https://v.redd.it/tzh27m73bwfd1/DASH_96.mp4", "dash_url": "https://v.redd.it/tzh27m73bwfd1/DASHPlaylist.mpd?a=1725245073%2CODEyNjU1Mzc5ODc4N2FjMGNhODNmNGQyYzQxOWQzNTYyOTEzYTAyYzhlNjNiZDc3YjQ5MzJlY2Y2YTY2ODYwMw%3D%3D&v=1&f=sd", "duration": 18, "hls_url": "https://v.redd.it/tzh27m73bwfd1/HLSPlaylist.m3u8?a=1725245073%2CZTA4MDE3YmYwNjllNzg3MGFkZTllOGY2ZDQxYTM4OGZiNDhjMjUwZTRhMzVmZjVjMDlkYjJkYWM4OTNlMjU1MQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 6447, "upvote_ratio": 0.85, "comment_count": 1315, "over_18": false}, "4": {"id": "1egh055", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "herpderpedian", "link_flair_text": "Discussion", "time": 1722653074.4077754, "created_utc": 1722410379.0, "url": "https://www.reddit.com/r/UAP/comments/1egh055/steven_greer_just_posted_an_easily_debunked_hoax/", "title": "Steven Greer just posted an easily debunked hoax image & lost any credibility for me", "permalink": "/r/UAP/comments/1egh055/steven_greer_just_posted_an_easily_debunked_hoax/", "selftext": "He posted on Twitter about \"Universal Peace\" and CE5 with a photo of \"spaceships\" that is easily and obviously debunked as pelicans. Someone who calls himself a \"Foremost authority on UFOs & ET intelligence and technologies\" should be able to verify that a photo is pelicans.\nhttps://x.com/ufoofinterest/status/1818384046684090644\nI don't know who takes him seriously any more, but this really seals it for me.\nEdit: People looking for the debunk: click the link! It's a Twitter post with a video of pelicans that look exactly like Greer's photo", "media": null, "score": 138, "upvote_ratio": 0.77, "comment_count": 112, "over_18": false}, "5": {"id": "1edxiho", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "External-Noise-4832", "link_flair_text": null, "time": 1722653075.3274183, "created_utc": 1722135024.0, "url": "https://i.redd.it/o4bpg5klb6fd1.jpeg", "title": "Olympics removes its own opening ceremony video that features drag queens from YouTube.", "permalink": "/r/conspiracy/comments/1edxiho/olympics_removes_its_own_opening_ceremony_video/", "selftext": "", "media": null, "score": 3329, "upvote_ratio": 0.87, "comment_count": 724, "over_18": false}, "6": {"id": "1ef6yhu", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1722653075.6438196, "created_utc": 1722277816.0, "url": "https://youtube.com/shorts/L6lOtAQsHYE?feature=share", "title": "Ozzy Osbourne is enjoying the AI rendition of himself singing a Shania Twain song", "permalink": "/r/conspiracyfact/comments/1ef6yhu/ozzy_osbourne_is_enjoying_the_ai_rendition_of/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.63, "comment_count": 0, "over_18": false}, "7": {"id": "1eiaji8", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "YouTube", "time": 1722653076.3405404, "created_utc": 1722606575.0, "url": "https://v.redd.it/i30eru2r99gd1", "title": "This is one of my favorite bigfoot videos. It's known as the \"Beast of Gum Hill\" and according to the witness (dude on the ATV) it's about 7 feet or 2.13m tall.", "permalink": "/r/bigfoot/comments/1eiaji8/this_is_one_of_my_favorite_bigfoot_videos_its/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/i30eru2r99gd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 640, "scrubber_media_url": "https://v.redd.it/i30eru2r99gd1/DASH_96.mp4", "dash_url": "https://v.redd.it/i30eru2r99gd1/DASHPlaylist.mpd?a=1725245075%2CZmZiMTBhM2MxNWQ3ZDc2NTUyZGZlN2EwMzZlY2NkZWMzNmRkYmNhYTRlYjRjN2MzYTAzYzhkY2U0MTU4ZjE2Zg%3D%3D&v=1&f=sd", "duration": 25, "hls_url": "https://v.redd.it/i30eru2r99gd1/HLSPlaylist.m3u8?a=1725245075%2CNjIyMGJmNzc1ODdjOWUyMjMyYjVlOGZlYjBiOGNhYmE2ZmIzYjIxMjBiMTg3YzI4MzNjNzYwNzFlNzcwYmQwMA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4669, "upvote_ratio": 0.86, "comment_count": 646, "over_18": false}, "8": {"id": "1eghqwx", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Stopnswop2", "link_flair_text": null, "time": 1722653076.8188293, "created_utc": 1722413484.0, "url": "https://i.redd.it/ebm5billbtfd1.jpeg", "title": "Is this bat responsible for the Jeersey Devil sightings?", "permalink": "/r/Cryptozoology/comments/1eghqwx/is_this_bat_responsible_for_the_jeersey_devil/", "selftext": "Hammerhead Bat", "media": null, "score": 1882, "upvote_ratio": 0.98, "comment_count": 129, "over_18": false}, "9": {"id": "1eicy3e", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Lusicane", "link_flair_text": "Just plain weird", "time": 1722653077.004118, "created_utc": 1722612447.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1eicy3e/1883_maryland_news_article_child_encounters_a/", "title": "1883 Maryland News Article, child encounters a \"queer old bugaboo\"", "permalink": "/r/Humanoidencounters/comments/1eicy3e/1883_maryland_news_article_child_encounters_a/", "selftext": "From the Maryland Standard, Nov 1st, 1883\nA QUEER OLD BUGABOO\nWhat a little miss saw as she skipped along to the spring\nA remarkable incident happened to a little daughter of Captain William L. Pratt, of King George County, last Monday evening. At three o'clock she started to the spring, about two hundred yards from the house, for a bucket of water. When about half way, in passing a peach tree near the path, an indescribable sensation came over her. Her hair felt as though it was standing on end and a heavy pressure on the shoulders almost crashed her to the earth. With difficulty she walked to the spring, got her water and started back.\nArriving at the same tree something came out of the weeds in front of her, crossed the path and disappeared. The object appeared to be moving just above the ground, but not touching it. It was covered with something like an old coat, with the sleeves hanging down, one on each side. Its head was covered with short, kinky hair and it seemed to have no face, eyes or feet. Its disappearing in an open space seems to be the mystery, and the further fact that the weakness and pressure left the little girl as soon as it disappeared.\nThe little girl was very much alarmed at the time and says while this object was passing she could not have moved out of her tracks or spoken if her life depended upon it. The mother reports that she was as pale as a corpse when she reached the house. \nHer father, Captain Pratt, was in town, and she feared it was a token of some accident that had or would happen to him. She watched steadily for him until he got in sight of the house on his return, when she clapped her hands for joy and shouted: \"Papa is coming.\" Captain Pratt says he is not a believer in ghosts or supernatural things, but this is a mystery which he can not explain and which is giving him much concern. The little girl is about eleven years old.", "media": null, "score": 66, "upvote_ratio": 0.97, "comment_count": 4, "over_18": false}, "10": {"id": "1ee10x4", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "an_ol_chunk_of_coal", "link_flair_text": null, "time": 1722653077.4502566, "created_utc": 1722147940.0, "url": "https://www.reddit.com/r/cryptids/comments/1ee10x4/dear_smoky_mountain_bigfoot_conference_shame_on/", "title": "Dear smoky mountain Bigfoot conference : Shame on You", "permalink": "/r/cryptids/comments/1ee10x4/dear_smoky_mountain_bigfoot_conference_shame_on/", "selftext": "Mods. I understand if this post needs to be removed, but i ask out of the kindness of your hearts  to leave it up as an open letter to convey a much needed message,as it is important to our cryptozoology community\nMy family and I spent  a good deal of money to attend the smoky mountain bigfoot conference (in Gatlinburg)  ,even paying for gold seating and i was disgusted to find a vendor in the conference vendor area selling cheap Maga movement shirts and other crap with trumps face on it (along with vulgarities). \nI ask you why is this at a bigfoot conference? Politics have no place at a bigfoot conference, t shirts with obscene words have no place at an event that was advertised as kid/family friendly. \nThis ignorant Maga hate enticing nonsense has no place at an event that was advertised as a bigfoot conference, a place to come and learn. Not spread hate ,ignorance and violence. \nI have no doubt that a good number of attendees and vendors are most likely for trump, but they at least were not pushing or selling hateful messages on merchandise. \nTo whoever was in charge of vendors,or allowed a vendor to sell hate agenda merchandise, this is an open letter to you.  Is this what you want your bigfoot event to be known for? I would imagine you would like the subject of bigfoot and cryptozoology to be taken seriously, but instead you only drive home the stereotype of inbred racist hillbillies in the woods. You should be ashamed of yourself. ", "media": null, "score": 1051, "upvote_ratio": 0.82, "comment_count": 285, "over_18": false}, "11": {"id": "1eekamf", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "myriad0fthoughts", "link_flair_text": "Discussion/Advice", "time": 1722653077.5742593, "created_utc": 1722207591.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1eekamf/i_went_to_the_grand_canyon_for_the_first_time_and/", "title": "I went to the Grand Canyon for the first time and it felt really weird. ", "permalink": "/r/Thetruthishere/comments/1eekamf/i_went_to_the_grand_canyon_for_the_first_time_and/", "selftext": "My boyfriend(31)and I(24) moved to CA at the beginning of the year. Last week we rented a car and drove back with the last of his furniture and clothing we couldn't fit during our initial move. We decided to stop by the GC and see what all the hype is about since It was on our way. \nSide note: skip this paragraph if you've already been but if you have not been to the Grand Canyon you seriously need to. We both went in thinking it was a canyon slightly larger than the average with great photo opportunities but it blew our minds. It is truly a surreal experience with a LOT of interesting history. I swear no photo will ever do that place justice you really have to see it for yourself. If you plan to go camping and hike the trails PLEASE DO YOUR RESEARCH!!! reddit has a lot of stories from people who have hiked and had really bad experiences or even died from underestimating the weather and conditions. \nThe Grand Canyon is the most dangerous national park and hundreds of people die or go missing from being dumb and/or unprepared. If you've been and plan on going back to camp or hike or whatever, be smart and be prepared. Do NOT be that guy who thinks they're built different and can do it regardless of preparedness. DO YOUR RESEARCH!\nWhile In line to get our park passes  I started doing some research and found a lot of unsettling truths about the place. Even though we were just planning on stopping by for a hour, I wanted to get some perspective on the hiking and camping thats done there. Ive never been to a national park before so I was even more intrigued when we pulled in to see that it was practically a small town.  \nOnce we parked we headed into the area thats just before the canyon where the visitor center is and its like the moment you leave the parking lot and enter that area, the energy completely shifted for me. I am in no way someone who can talk to the dead or anything like that but one thing I can definitely gauge is the energy in the room or from a person. For example if I meet someone I wont even have to talk to them and I can immediately feel the energy they carry and from that I know whether or not I should to be around them. \nThe grand canyon has a really odd almost bad vibe to it. Ive never felt anything like that before, I told my boyfriend when we walked in that something feels really off and he agreed with me. I know a lot of people have died there but the energy of that place is so dense it was honestly unsettling to be around. Researching the place wasn't what scared me, being there was. \nPersonally I would never camp or hike there. After seeing how big it in person I get why so many people go missing, a lot of people talk about how easy it is to accidentally fall off trail and get lost or just suffer from intense dehydration.\nWe got home at 9 PM last night and I was up until about 4 this morning reading stories on reddit about it. I went down this huge rabbit hole of whats hiding there, hiker experiences, paranormal experiences etc. I love reading into conspiracies and all but nothing has ever stuck with me the way this has. Might have been because I went and saw it for myself but I'm so intrigued to hear what others have to say about it. \nAnyways the GC has been on my mind and has been sitting weird with me ever since we left and I wanted to see if anyone else had the same feeling while camping there or if anyone saw anything strange or if you know someone who went and had a weird/scary experience or maybe something from people who worked at the GC or any other national park.  We were there for an hour and I am so interested in finding out what it was like overnight. \nIve read hundreds of stories about the hike itself and how brutal it is and I've come across some other reddit posts of people talking about some weird moments during their trip. Im not sure exactly what it is I'm looking for I just know I haven't found it yet. Most of the posts I've read about strange happenings were posted over 9 years ago and are pretty surface level. I need to find out if anyones experienced anything similar recently and can go into detail on it. If you have a story and have some time PLEASE share everything about it. I know I'm not the only one who may have felt this way but  I have yet to find someone who thinks about it the same way. ", "media": null, "score": 118, "upvote_ratio": 0.88, "comment_count": 47, "over_18": false}, "12": {"id": "1efnmx7", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "califoruication", "link_flair_text": null, "time": 1722653077.714775, "created_utc": 1722325931.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1efnmx7/my_ex_hired_people_to_come_in_my_house_and_hurt/", "title": "My ex hired people to come in my house and hurt me after i got him arrested for DV. ", "permalink": "/r/LetsNotMeet/comments/1efnmx7/my_ex_hired_people_to_come_in_my_house_and_hurt/", "selftext": "I dated this man for about 2.5 years and he nearly killed me. Very physically abusive, emotionally, sexually, all of it. \nThe last time he hurt me was because i told him i was moving and i was gonna have a roommate. He didn't like that. He strangled me twice and punched me in the face. I escaped and called the cops, he got arrested a few days later. Until then, though, he was coaching me on how i needed to go back to law enforcement and state i hit myself and he didn't really strangle me - that i stopped taking my psychiatric medication and was having a psychotic break that night. \nAt the first hearing, i recanted and told the judge all the lies my ex told me to. The judge believed me, and he was set to get released from jail but he was still under state county hold or something like that. Before he was supposed to get released, i went back to law enforcement after gaining some clarity and told them the truth again, in which another hearing was scheduled. \nUndoubtedly, my ex was notified the reason WHY another hearing was being scheduled. He was a gang member. Obviously, i will not be saying which one. And as previously mentioned, by now i had moved into my new house with my roommate. But before he got arrested, he asked me where i was moving and i told him which street corner the house was on, very stupidly. \nWell, my roommate's boyfriend at the time was affiliated as well (we were with some real winners, huh?) and he was apparently notified that my house had been \"marked\" by the gang my ex belonged to. And that showed true. \nOne morning around 6am, my roommate and her bf were sitting in the driveway in her car with the lights off. I was inside the house asleep. A car then pulled up in front of my house, blocking the driveway, preventing my roommate from pulling her car out. We are still unsure whether or not these people initially knew there were people sitting in my roommate's car. The mystery car sat blocking the driveway for a few minutes before a man got out of the passengers seat and began walking directly up the driveway to my porch. Luckily, my roommate's boyfriend had a gun on him and once he saw the man walking towards the front door, he got out of my roommate's car and flashed his gun at the man. The man saw it and ran back to the car, which then sped off. \nMaybe a few weeks later, i had driven to the gas station a few streets over after the sun had gone down. I was getting a vape or something. When i was walking back to my car out of the gas station, i man in the same car that was in front of my house pulled up next to me and started yelling something. I couldn't tell what he was saying before i just yelled back \"shut the fuck up and leave me alone\" (thinking i was just being randomly cat called). I got in my car and went to pull out of the gas station, noticing his car was sitting in front of the exit i was going to take and not moving. So i went out a different exit and turned back onto the street my house was on. I looked behind me and saw him following me. He waited for me to leave before he pulled out behind me and followed me. I started going down different streets and he kept tailing. So eventually i freaked out and sped up real fast and made a quick impulsive turn that threw him off my track. I didn't go home. \nAnother day i came home from work and saw that the window in our dining room that looks out to the backyard (the only window on the first story that doesn't have iron bars guarding it from the inside) had been tampered with from the outside. It had a screen secured to it so that the window may be opened, and the screen had been ripped off. We reattached it and tried to rip it off ourselves, and it was HARD. My roommate's boyfriend was able to but we weren't strong enough. It would've taken a lot of effort to get that screen off. \nLast instance, my roommate's boyfriend and his friend had left our house to go on a walk. When they came back, as they were walking back up to my house they saw two men peaking through the other dining room window trying to see inside. They noticed my roommate's boyfriend as he started yelling at them asking wtf they were doing and they scurried away. \nMe and my ex's final hearing happened a few months ago and i have gotten him locked up until 2036. I think maybe his fellow gangbangers have realized that a man locked up for the next 12 years is not worth risking their freedom over anymore, and i have since been left alone. ", "media": null, "score": 758, "upvote_ratio": 0.96, "comment_count": 51, "over_18": true}, "13": {"id": "1ef64bg", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "happypants69", "link_flair_text": null, "time": 1722653077.830265, "created_utc": 1722275820.0, "url": "https://i.redd.it/mhzg2e88yhfd1.jpeg", "title": "Torture mask from 1800's Germany", "permalink": "/r/truecreepy/comments/1ef64bg/torture_mask_from_1800s_germany/", "selftext": "", "media": null, "score": 117, "upvote_ratio": 0.93, "comment_count": 11, "over_18": false}, "14": {"id": "1eg9fid", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "InformalWay7224", "link_flair_text": null, "time": 1722653077.944903, "created_utc": 1722385548.0, "url": "https://www.reddit.com/r/threekings/comments/1eg9fid/the_stairs_ritual/", "title": "The Stairs Ritual", "permalink": "/r/threekings/comments/1eg9fid/the_stairs_ritual/", "selftext": "There is a ritual known as The Stairs Ritual. This ritual involves a lot of books. You need to place a book on each step of the stairs. You must go down sideways and pick up a book at each step. It will take a few hours to get this right, but every single book, on the first try, must be turned to page 12. If you fail to turn it to page 12, you must start over. It'll take hours before you get it right.\nIf you successfully go down the stairs sideways while picking up every book and turning it to page 12, and if you're home alone (this is crucial—you must be home alone), you will successfully enter another realm. It will look like you're downstairs in whatever building you're in, but you are actually in a different dimension. Now, you've brought ghosts into the world—presences.\nYou will start to feel like you're tired or sick, and you will want to lay down. Do not, under any circumstances, lay down. Just push on. Ignore any head pain you have, and ignore any voices, no matter how human they sound. Continue. If you hear a little song, like a music box playing, don't let it get stuck in your head. Proceed as fast as you can to the nearest mirror in the area.\nOnce you reach a mirror, you need to look at yourself in it for approximately one minute. If you do this successfully, you must then run to the stairs. There are two methods of getting back up:\n\nUse a lighter or some other method to completely destroy the first book on the step. This will instantly transport you back to your dimension, and all the ghosts will disappear.\nAttempt to walk back up sideways, turning every book to page 12 again. But this will take time, and at this point, your head will really be hurting, making it difficult.\n\nOnce you are back in your dimension, you're safe, and you will have good luck for a year or so. Really good luck. Good things will start happening.\nNow, if you fail this challenge—by running back up without burning a book or turning them all to page 12, not making it to the mirror, or laying down before you get there—you will be brought back to your dimension, but the ghostly presences will not have left. They will ensure you have bad luck until you successfully perform the ritual again. This bad luck can range from simple accidents to serious mishaps, even death. Be warned.", "media": null, "score": 16, "upvote_ratio": 1.0, "comment_count": 13, "over_18": false}, "15": {"id": "1ehwhja", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "somethingdeido", "link_flair_text": null, "time": 1722653078.2488246, "created_utc": 1722558656.0, "url": "https://v.redd.it/dp7n72m9b5gd1", "title": "A guy suddenly disappeared in the middle of the road", "permalink": "/r/Ghosts/comments/1ehwhja/a_guy_suddenly_disappeared_in_the_middle_of_the/", "selftext": "This was taken from the Philippines. ", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/dp7n72m9b5gd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/dp7n72m9b5gd1/DASH_96.mp4", "dash_url": "https://v.redd.it/dp7n72m9b5gd1/DASHPlaylist.mpd?a=1725245078%2CNDNiZjMzYmIyOWI2ZjA5OGMzOTY3NzM5YWI2YWRjNTFkM2M3NWE4NzU5YzNhNzQwZjUyMmY4ZjFhZmIyMjc4OA%3D%3D&v=1&f=sd", "duration": 30, "hls_url": "https://v.redd.it/dp7n72m9b5gd1/HLSPlaylist.m3u8?a=1725245078%2CZWEwN2YwMjAyYTY5MDE1YTAzM2FiZmY0MjQ0YTFiNjRlYmUwMmFlZmJkMGJhNDMzNDJjNmI5OTljZmRhOWUwYQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2151, "upvote_ratio": 0.87, "comment_count": 215, "over_18": false}, "16": {"id": "1edenrm", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Glittering-Treat-824", "link_flair_text": "Glitch Pic", "time": 1722653078.506303, "created_utc": 1722081377.0, "url": "https://www.reddit.com/gallery/1edenrm", "title": "I found this on my floor in my room when I was going to the toilet and I don't know where it came from, or what it is. Can someone tell me if it is a shark tooth or something else. Thanks", "permalink": "/r/GlitchInTheMatrix/comments/1edenrm/i_found_this_on_my_floor_in_my_room_when_i_was/", "selftext": "", "media": null, "score": 966, "upvote_ratio": 0.97, "comment_count": 262, "over_18": false}, "17": {"id": "1ef6kaj", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "1_Brilliant_Pickle", "link_flair_text": "Discussion", "time": 1722653079.4712214, "created_utc": 1722276861.0, "url": "https://i.redd.it/zyzgh1oc1ifd1.jpeg", "title": "What was the outcome to the David Grusch hearing after all was said and done? Anyone got an update? ", "permalink": "/r/ufo/comments/1ef6kaj/what_was_the_outcome_to_the_david_grusch_hearing/", "selftext": "I wasn't able to find anymore information on this case. Yes I've heard David Grusch had some mental health issues but that doesn't explain the others claims... What's going on? Swept under the rug? ", "media": null, "score": 557, "upvote_ratio": 0.93, "comment_count": 320, "over_18": false}, "18": {"id": "1ee86id", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "NHI", "time": 1722653081.0729804, "created_utc": 1722175495.0, "url": "https://v.redd.it/8zytew01n9fd1", "title": "Upcoming fall House UFO hearing will be led by Rep. Nancy Mace, who led the most important line of questioning at the David Grusch hearing, which resulted in the Major testifying under oath to the American public that the US military is in possession of Non-Human/Alien tech and biologics.", "permalink": "/r/UFOs/comments/1ee86id/upcoming_fall_house_ufo_hearing_will_be_led_by/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/8zytew01n9fd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/8zytew01n9fd1/DASH_96.mp4", "dash_url": "https://v.redd.it/8zytew01n9fd1/DASHPlaylist.mpd?a=1725245079%2CYTUwODg2NDYzOWIzZDJlZTExOTkwZTc3YWQ2ZWM5MDcxMWRkZDQxYWJiNzE4MDk5OTFhMjFhMWY5YzA3N2RmMg%3D%3D&v=1&f=sd", "duration": 61, "hls_url": "https://v.redd.it/8zytew01n9fd1/HLSPlaylist.m3u8?a=1725245079%2CNTE3NWUxZWI0YjY5ZjVmOGJkMWM5ZDZmYWJkZDczNTNlMzhiYmFjNDBlYzAyODZhMjdkODVmMjczODZiYTBiZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2146, "upvote_ratio": 0.91, "comment_count": 284, "over_18": false}, "19": {"id": "1eecn8n", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "DragonfruitOdd1989", "link_flair_text": "Evidence :upvote:", "time": 1722653082.3467379, "created_utc": 1722187421.0, "url": "https://v.redd.it/1g6u0macnafd1", "title": "American Forensic Team release video of the 3 new non-humans discovered near the Nazca Lines. ", "permalink": "/r/aliens/comments/1eecn8n/american_forensic_team_release_video_of_the_3_new/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 450, "fallback_url": "https://v.redd.it/1g6u0macnafd1/DASH_270.mp4?source=fallback", "has_audio": true, "height": 472, "width": 270, "scrubber_media_url": "https://v.redd.it/1g6u0macnafd1/DASH_96.mp4", "dash_url": "https://v.redd.it/1g6u0macnafd1/DASHPlaylist.mpd?a=1725245081%2CZTg1NjU3NjUxOTRiNTliZDYzNWU5OTU2MDA4ZDRjNzZjMmM5Zjg3YWZlOGFmZWEwYWE0YWQyN2YzNTM1NWJkZA%3D%3D&v=1&f=sd", "duration": 36, "hls_url": "https://v.redd.it/1g6u0macnafd1/HLSPlaylist.m3u8?a=1725245081%2COTQxZGIzMTA0YjAxZGMyMTZlNDk5NmQ1N2U2YzdkZDI5ODFhY2JmNWQyOTI0YWNjNTY0NGIwMzhhZTdhNDQ1OQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2349, "upvote_ratio": 0.7, "comment_count": 1343, "over_18": false}, "20": {"id": "1egpzir", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "Video", "time": 1722653082.5817966, "created_utc": 1722439574.0, "url": "https://v.redd.it/6uj10qu2gvfd1", "title": "Yesterday — Tuesday, July 30 — was National Whistleblower Day.", "permalink": "/r/UAP/comments/1egpzir/yesterday_tuesday_july_30_was_national/", "selftext": "", "media": null, "score": 63, "upvote_ratio": 0.92, "comment_count": 1, "over_18": false}, "21": {"id": "1efv0xr", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "DJRedd352", "link_flair_text": null, "time": 1722653084.0648322, "created_utc": 1722350297.0, "url": "https://i.redd.it/tppg8zup3ofd1.jpeg", "title": "WELL WELL WELL … would ya look at that! 😂 ", "permalink": "/r/conspiracy/comments/1efv0xr/well_well_well_would_ya_look_at_that/", "selftext": "", "media": null, "score": 2602, "upvote_ratio": 0.75, "comment_count": 622, "over_18": false}, "22": {"id": "1ei9ive", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1722653084.3287587, "created_utc": 1722603802.0, "url": "/r/wallstreetSHITS/comments/1ei9gyl/trolls_making_fun_of_mtg_losing_30_on_crwd_her/", "title": "Trolls making fun of MTG losing 30% on CRWD. Her mistake was listening to +50 analysts strong buy recommendations for CrowdStrike. PE still 480 even after recent drop. Gross negligence untested update worst malware in history. Delta suing for $500 million in damages. Do analysts know anything?", "permalink": "/r/conspiracyfact/comments/1ei9ive/trolls_making_fun_of_mtg_losing_30_on_crwd_her/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 0.67, "comment_count": 0, "over_18": false}, "23": {"id": "1eg3pwz", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Binh3", "link_flair_text": "what is it?", "time": 1722653085.3032181, "created_utc": 1722371127.0, "url": "https://i.redd.it/7xlarjhmtpfd1.jpeg", "title": "Caught on a trail cam in Nc ", "permalink": "/r/bigfoot/comments/1eg3pwz/caught_on_a_trail_cam_in_nc/", "selftext": "Could be bear but arms look too long.", "media": null, "score": 4067, "upvote_ratio": 0.83, "comment_count": 1496, "over_18": false}, "24": {"id": "1eiajcv", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Evidence", "time": 1722653085.8588216, "created_utc": 1722606564.0, "url": "https://v.redd.it/hm40xktp99gd1", "title": "This is one of my favorite bigfoot videos. It's known as the \"Beast of Gum Hill\" and according to the witness (dude on the ATV) it's about 7 feet or 2.13m tall.", "permalink": "/r/Cryptozoology/comments/1eiajcv/this_is_one_of_my_favorite_bigfoot_videos_its/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/hm40xktp99gd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 640, "scrubber_media_url": "https://v.redd.it/hm40xktp99gd1/DASH_96.mp4", "dash_url": "https://v.redd.it/hm40xktp99gd1/DASHPlaylist.mpd?a=1725245085%2CMmE3OTQ5Zjc3N2Y5NmJhYzgxNWM2MzMwZjM3ZDljMDRhMzgwMGRlMThjZjMxODU3OWU0M2UwNDFhMjA2ZTAyMg%3D%3D&v=1&f=sd", "duration": 25, "hls_url": "https://v.redd.it/hm40xktp99gd1/HLSPlaylist.m3u8?a=1725245085%2CYWQ0MzVkMmY0NGNmZTcyZTNmMmEyMGI5MGQ3ODI2NTkyYzgyMzgzYzE1ZTQ1MGEwM2FhY2UwMDdjZGMxMmQyYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 871, "upvote_ratio": 0.91, "comment_count": 90, "over_18": false}, "25": {"id": "1ei5cv7", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Curiousmynature1010", "link_flair_text": "Skinwalker", "time": 1722653086.0398932, "created_utc": 1722589380.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1ei5cv7/i_encountered_a_real_skin_walker_i_do_not_like/", "title": "I encountered a real skin walker. I do not like saying them name ", "permalink": "/r/Humanoidencounters/comments/1ei5cv7/i_encountered_a_real_skin_walker_i_do_not_like/", "selftext": "Hi all , Long story short this is an Arizona in about 2008. We were out by the old jail on 29th St. before there was like development of homes. There was some but not how it is now. Anyways, we were out there doing stuff just hanging out. in a cul-de-sac and then there was nothing but desert behind us anyway I was inside of a truck jumped out of it. Look to the right of me because my spiritual guides told me too and of course there was a being that was anywhere from 8 to 10 feet tall the horns went forward on top of the head.    \nYou could not see its face or stomach however, you could see its legs that look like horse legs and then its feet had hoof feet and was hovering towards me. The person in the truck was yelling for me to get back in so I did. I was so frozen. I couldn’t even like drive so that person put their hands on the steering wheel and I put my feet on the gas after that person started the truck and we were out of there man! A medicine man cleaned my body years later and he validated when I felt leaving my body. Also the night b4 the medicine man cleaned my body which was also in AZ I saw a coyote and I have took journeys with the native stick and a Havelina and a coyote in my dreams recently so interesting. \nI think it’s still with me in some type of way guiding me through life and who knows maybe it’s from the old ancestors and that’s why it was warning me. I am writing this text from my phone so sorry if it doesn’t make sense hopefully it does point being wanted to do something to me and it didn’t so I felt like it was a warning to get away from that person that I was with, and which I did, but stuff had happened after that and I think that If I would realize that was a warning, but that doesn’t mean that this is the case for everyone when you encounter these beings so please don’t go looking for them. Ashe ", "media": null, "score": 57, "upvote_ratio": 0.65, "comment_count": 43, "over_18": false}, "26": {"id": "1eghrog", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Stopnswop2", "link_flair_text": null, "time": 1722653086.4364448, "created_utc": 1722413578.0, "url": "https://i.redd.it/p2z0oqovbtfd1.jpeg", "title": "Is the Hammerhead Bat what Kersey Devil witnesses are seeing?", "permalink": "/r/cryptids/comments/1eghrog/is_the_hammerhead_bat_what_kersey_devil_witnesses/", "selftext": "", "media": null, "score": 307, "upvote_ratio": 0.97, "comment_count": 34, "over_18": false}, "27": {"id": "1efunr9", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Oviluz", "link_flair_text": "Discussion/Advice", "time": 1722653086.5832746, "created_utc": 1722349412.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1efunr9/i_think_i_might_believe_in_god_now/", "title": "I think I might believe in god now. ", "permalink": "/r/Thetruthishere/comments/1efunr9/i_think_i_might_believe_in_god_now/", "selftext": "I’ll start this by saying I was not raised in a very religious home. When I was very young my parents did take my sister and I to church but I barely remember it and we stopped going after a bit. For a very long time I have been atheist. Maybe for some periods, I was agnostic; I’ve never truly and honestly believed in god. Ashamed to say, there’s been a lot of times I’ve talked down on religion, and openly have talked about how “dumb” I found it. \nI was at work earlier this month and had my AirPods in listening to podcasts (music just isn’t stimulating enough anymore). I was listening to a man interview a real life exorcist. Let me tell you, even as someone who is a non-believer, this interview was absolutely fascinating and intriguing. They talked all about god, angels, demons, sin, scripture, and hell. But there was a part that actually did end up striking me. \nI’m sure many of you have heard stories about people asking god to “reveal” himself with an open heart and then x,y,z…. something surreal happens. \nThis kind of thing was brought up in the interview and I thought to myself, man, that is pretty weird how many people have a story like that. \nThe truck I had driven to work was my dad’s, and he had always had this cross necklace hanging on the rear view mirror. I had been driving his truck for a while now as mine was broken and I didn’t have enough money to throw at it. \nThe same day I listened to this podcast, I was driving home from work and randomly… the necklace came undone and fell off the mirror. \nSomehow, I reacted without even thinking, and my hand shot out and caught the cross. I CAUGHT the cross. \nThat necklace has never once fallen off the mirror in the time I’ve been driving the truck. How could it be coincidence the ONE DAY I start contemplating if god could really reveal himself to someone, that necklace comes off and I catch it without even thinking. \nWas this a sign from god? What do you think? ", "media": null, "score": 113, "upvote_ratio": 0.77, "comment_count": 83, "over_18": false}, "28": {"id": "1ega3rm", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "OddAssociation666", "link_flair_text": null, "time": 1722653086.7164602, "created_utc": 1722387426.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ega3rm/a_guy_i_used_to_work_with_really_wanted_to_take/", "title": "A guy i used to work with really wanted to take me hunting.", "permalink": "/r/LetsNotMeet/comments/1ega3rm/a_guy_i_used_to_work_with_really_wanted_to_take/", "selftext": "I work at a big retail store as a self checkout host. Most of my days are spent walking laps and listening to customers saying things like \"i don't work here\" or \"why aren't you on the register\". I understood their frustrations. Usually there would be 2 or 3 of us at the self check and maybe 2 manned registers open. We got a new guy in, we'll call him Terry. Terry always wore a mask as it was 2021 and covid was still coviding. I was training him, telling him to stock candy and bags. He would ask questions anyone would ask. If i'm in school, if i have a grlfriend. I lived in a small city/big town that had a good college. Students from all over the country would come and usually wound up with the prisons or retail. I usually ask the same questions. I told him no on both accounts. He then asked if i ever went hunting.  We had a lot of woods and a big forrest around the town. \"No, I don't like guns.\" He said he'd have to take me one day. A few days go by and he's over on my side again. He ask if i have family in town, and if they didn't, do they live close. I lived 3 doors down from my mom. He starts talking about hunting again. How he was out with his buddies and started using \"pack tactics\", where they would box in the prey and finish off. Weird for deer seeing as they flee at the first thought of a noise. He's off for a few days because new hires have problems getting hours for the first 3 weeks. I talk to one of my coworkers, and they tell me he asks a lot about me. The next time i see him, his questions are very telling. \"How tall would you say youbare? How much do you weigh? How well do you know the woods past so and so street?\" I'm a big guy at 6ft and 300 pounds, and when he brought up hunting again, a creepy thought would send a chill down my spine. \"Come on, man. You'd like. Just some good ol' boys, shooting the shit, late at night, in the middle of the woods. Then the real fun starts right before dawn. They won't know what hit them.\" The mask hid most of his face, but I could see it rise when he smiled. I don't know why he thought that would be a great way to convince someone. Other than feeling like they were about to hunt me, it sounded like i would've been bored af before. I must have made a face or something because he turned and walked away quick. I told a couple of coworkers about it, but that was his last day. I never saw him again, and i hope thatvwe never meet again.", "media": null, "score": 443, "upvote_ratio": 0.97, "comment_count": 35, "over_18": true}, "29": {"id": "1ehi4l1", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "sasbergers", "link_flair_text": null, "time": 1722653086.8207657, "created_utc": 1722522632.0, "url": "https://i.redd.it/cu1n6cy4c2gd1.jpeg", "title": "Real skeletons were used in the 1982 film Poltergeist. The reason is because it was actually cheaper and more cost-effective than creating and using plastic fake ones.", "permalink": "/r/truecreepy/comments/1ehi4l1/real_skeletons_were_used_in_the_1982_film/", "selftext": "", "media": null, "score": 72, "upvote_ratio": 0.94, "comment_count": 9, "over_18": false}, "30": {"id": "1egppn2", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "yesfiraswa", "link_flair_text": null, "time": 1722653086.959185, "created_utc": 1722438898.0, "url": "https://www.reddit.com/r/threekings/comments/1egppn2/i_swear_i_cant_do_anything_this_night_because/", "title": "I swear I can't do anything this night because today is the last day of the month", "permalink": "/r/threekings/comments/1egppn2/i_swear_i_cant_do_anything_this_night_because/", "selftext": "My bedroom has 2 windows, one with curtain and one without it. Although I already have the twin loft bed, I am still afraid that I will accidentally trigger The Windows Game ritual because I am alone in my own room right now. Problem is that I have an incomplete homework and I have to get up for school because if you want to survive a creature knocking your windows 24/7 the ritual wants you to get in your bedroom until 6 am. Although I have survived the ritual, it's still an insult to injury for me. I missed the Subuh prayer (because I'm a muslim and 6 am is the deadline of it due to sunrise) and I will be late to school\nDon't expect me having a cozy yet comfortable bedroom in the basement. I live in Indonesia where most houses doesn't have it, unlike in United States", "media": null, "score": 8, "upvote_ratio": 0.78, "comment_count": 3, "over_18": false}, "31": {"id": "1ehg3zu", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "J10138", "link_flair_text": null, "time": 1722653087.2490015, "created_utc": 1722517318.0, "url": "https://i.redd.it/vsnha6vcw1gd1.jpeg", "title": "Is this a ghost or headlights? You tell me.", "permalink": "/r/Ghosts/comments/1ehg3zu/is_this_a_ghost_or_headlights_you_tell_me/", "selftext": "", "media": null, "score": 1705, "upvote_ratio": 0.84, "comment_count": 694, "over_18": false}, "32": {"id": "1effbvf", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Majestically12", "link_flair_text": "Glitch Pic", "time": 1722653087.478075, "created_utc": 1722298403.0, "url": "https://www.reddit.com/gallery/1effbvf", "title": "Two suns", "permalink": "/r/GlitchInTheMatrix/comments/1effbvf/two_suns/", "selftext": "", "media": null, "score": 88, "upvote_ratio": 0.91, "comment_count": 13, "over_18": false}, "33": {"id": "1ed7e7j", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Dark5140", "link_flair_text": null, "time": 1722653088.5544972, "created_utc": 1722052826.0, "url": "https://i.redd.it/4plc05i6jzed1.jpeg", "title": "Dead body in ufo doc?", "permalink": "/r/ufo/comments/1ed7e7j/dead_body_in_ufo_doc/", "selftext": "I’m watching Unearthing Nazca: The Complete Story and 42-43 minutes in, this guy is crawling around in a cave right next to what looks like a dead guy??? No one mentions it at all and I can’t find info on Google. Wtf is going on here?? ", "media": null, "score": 196, "upvote_ratio": 0.89, "comment_count": 80, "over_18": false}, "34": {"id": "1efse8f", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "Video", "time": 1722653090.2624295, "created_utc": 1722343496.0, "url": "https://v.redd.it/jpcm2mg4jnfd1", "title": "Former Director of National Intelligence James Clapper asked about UFOs on CNN in 2021 - \"I don't know why we haven't been more transparent about it in the past and I'm part of that crime, I guess\". \"I didn't insist on more transparency with respect to this issue\".", "permalink": "/r/UFOs/comments/1efse8f/former_director_of_national_intelligence_james/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/jpcm2mg4jnfd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/jpcm2mg4jnfd1/DASH_96.mp4", "dash_url": "https://v.redd.it/jpcm2mg4jnfd1/DASHPlaylist.mpd?a=1725245088%2CODEwMjAwMTFmNWNmM2Y3ZjE0MDQxZDY1M2JlOGZlZGE3MDE5Nzg2OTYyNDViZDA4ZTM3Yzk2NjcyZDAxNDZlOA%3D%3D&v=1&f=sd", "duration": 50, "hls_url": "https://v.redd.it/jpcm2mg4jnfd1/HLSPlaylist.m3u8?a=1725245088%2CYTJjYjg4NzRlZWFiZmY1ZGU3OTliN2I3YjkwYTliNTg0NjQ1ZDExZjc3YmExOWNjMTRkNWNlNTRiNzhmNzgyZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1407, "upvote_ratio": 0.94, "comment_count": 155, "over_18": false}, "35": {"id": "1egrqmp", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "littlespacemochi", "link_flair_text": "Video", "time": 1722653091.3566437, "created_utc": 1722443821.0, "url": "https://v.redd.it/u0kwg59rtvfd1", "title": "Large Cigar craft seen over neighborhood, July 30th 2024", "permalink": "/r/aliens/comments/1egrqmp/large_cigar_craft_seen_over_neighborhood_july/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/u0kwg59rtvfd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/u0kwg59rtvfd1/DASH_96.mp4", "dash_url": "https://v.redd.it/u0kwg59rtvfd1/DASHPlaylist.mpd?a=1725245090%2COTgyZTIwMTMwZTgyNWMzNDJjNWQ5MWE3Yzg0ZWExNmM0YzdkZjdhZTQ2NDIxM2U2MTBiNjQwZGQ1MjVmYzMxOA%3D%3D&v=1&f=sd", "duration": 126, "hls_url": "https://v.redd.it/u0kwg59rtvfd1/HLSPlaylist.m3u8?a=1725245090%2CNDVjMDc1Zjc5ZjU2ODJjZjZlMmYyZGM2YTg1ZDdkZjVmZGExMTFmYmJiMmEzMTc4NjFjNmM0YTA3ODkwMGY4Mw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1351, "upvote_ratio": 0.9, "comment_count": 267, "over_18": false}, "36": {"id": "1ef9frj", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Video", "time": 1722653091.5698495, "created_utc": 1722283760.0, "url": "https://v.redd.it/k7q82bgllifd1", "title": "Matthew Pines: \"[The Senate doesn't trust AARO/Pentagon on UAP] and they are doubling down on that, saying [the UAPDA] is necessary because credible evidence indicates UAP records exist that haven't been subject to [declassification] due to an overbroad interpretation of the Atomic Energy Act 1954.\"", "permalink": "/r/UAP/comments/1ef9frj/matthew_pines_the_senate_doesnt_trust/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/k7q82bgllifd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/k7q82bgllifd1/DASH_96.mp4", "dash_url": "https://v.redd.it/k7q82bgllifd1/DASHPlaylist.mpd?a=1725245091%2CMTBiM2ZkYjViMTI0ZDA5MmQxOTFkZjNkYTUyMzAzMTQxZmNmMTMzZWRmYTMyODI4MTk5YWFhM2Q1YTcyZjc4OA%3D%3D&v=1&f=sd", "duration": 395, "hls_url": "https://v.redd.it/k7q82bgllifd1/HLSPlaylist.m3u8?a=1725245091%2CMjg1OWJhMTA1ZTMyYzM0MzliOTdiODNjYjA1NGVhNWZhNDg2OTAxZTI2Nzg3N2VjMjE1NzRkNzc1YzY1OWU5MA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 61, "upvote_ratio": 0.97, "comment_count": 1, "over_18": false}, "37": {"id": "1ehm6bc", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Mighty_L_LORT", "link_flair_text": null, "time": 1722653093.0329776, "created_utc": 1722532550.0, "url": "https://i.redd.it/l2dcbn3k53gd1.jpeg", "title": "Health insurance is a scam", "permalink": "/r/conspiracy/comments/1ehm6bc/health_insurance_is_a_scam/", "selftext": "", "media": null, "score": 2481, "upvote_ratio": 0.94, "comment_count": 448, "over_18": false}, "38": {"id": "1egbf47", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1722653093.2568505, "created_utc": 1722391191.0, "url": "https://www.youtube.com/watch?v=zj-02XBTZEo", "title": "Exciting video footage of military aircraft chasing three UFOs in the Nevada desert.", "permalink": "/r/conspiracyfact/comments/1egbf47/exciting_video_footage_of_military_aircraft/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Exciting video footage of military aircraft chasing three UFOs in the Nevada desert.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/zj-02XBTZEo?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Exciting video footage of military aircraft chasing three UFOs in the Nevada desert.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/zj-02XBTZEo/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 1, "upvote_ratio": 0.57, "comment_count": 1, "over_18": false}, "39": {"id": "1ehe28a", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "video", "time": 1722653093.851279, "created_utc": 1722510883.0, "url": "https://v.redd.it/fpw614r7d1gd1", "title": "This video taken in 2008 appears to show a large bigfoot-like figure stand up and walk away on the left side of the video. It was taken on the Upper McKenzie river in Oregon, an area that's supposedly a bigfoot hotspot.", "permalink": "/r/bigfoot/comments/1ehe28a/this_video_taken_in_2008_appears_to_show_a_large/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/fpw614r7d1gd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 640, "scrubber_media_url": "https://v.redd.it/fpw614r7d1gd1/DASH_96.mp4", "dash_url": "https://v.redd.it/fpw614r7d1gd1/DASHPlaylist.mpd?a=1725245093%2CNTliY2ZjZmJmOWQwMzNlZWQ2YTBjNGRmN2VhM2NmODNiNGU5ZWQ4Yzc2ZWM2YjE0ZTA3MTZmZWI4ZmMwMGM2NQ%3D%3D&v=1&f=sd", "duration": 7, "hls_url": "https://v.redd.it/fpw614r7d1gd1/HLSPlaylist.m3u8?a=1725245093%2CMzE5MGQxOGM5MzYzZmJhYjAxNTY0NGY5NDJmNDIxODQ5ZDNkMzg4MDdlY2E1OWI0ZTE0N2I1NjcxMjdjZjczNA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 669, "upvote_ratio": 0.87, "comment_count": 123, "over_18": false}, "40": {"id": "1ed5lep", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "OvergrownGhost", "link_flair_text": "Meme", "time": 1722653094.2738302, "created_utc": 1722046856.0, "url": "https://i.redd.it/zg1l6hje1zed1.jpeg", "title": "POV: You made a post about bigfoot on r/Cryptozoology", "permalink": "/r/Cryptozoology/comments/1ed5lep/pov_you_made_a_post_about_bigfoot_on/", "selftext": "", "media": null, "score": 672, "upvote_ratio": 0.95, "comment_count": 86, "over_18": false}, "41": {"id": "1ee7evf", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "TheUmbraProject", "link_flair_text": "Alien", "time": 1722653094.449168, "created_utc": 1722173238.0, "url": "https://youtu.be/Qtx1ocWoxk8", "title": "The Varginha, Brazil 1996 Alien Encounter - Full Documentary ", "permalink": "/r/Humanoidencounters/comments/1ee7evf/the_varginha_brazil_1996_alien_encounter_full/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Varginha Alien Encounter | Brazil's Most Chilling Incident", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/Qtx1ocWoxk8?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"The Varginha Alien Encounter | Brazil&#39;s Most Chilling Incident\"></iframe>", "author_name": "The Umbra Project", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/Qtx1ocWoxk8/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@TheUmbraProject"}}, "score": 35, "upvote_ratio": 0.79, "comment_count": 11, "over_18": false}, "42": {"id": "1edcak4", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "xXxWhizZLexXx", "link_flair_text": null, "time": 1722653094.893676, "created_utc": 1722072178.0, "url": "https://i.redd.it/aao9pm3q41fd1.jpeg", "title": "Used-Sentence-448's Dogman in a Tree but a clear Picture", "permalink": "/r/cryptids/comments/1edcak4/usedsentence448s_dogman_in_a_tree_but_a_clear/", "selftext": "", "media": null, "score": 163, "upvote_ratio": 0.97, "comment_count": 21, "over_18": false}, "43": {"id": "1egsa3h", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Metaphobos", "link_flair_text": "Cryptid", "time": 1722653095.039976, "created_utc": 1722445120.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1egsa3h/any_insight_on_or_sightings_of_the_dark_watchers/", "title": "Any insight on (or sightings of) The Dark Watchers between Big Sur and Santa Lucia Range in California? ", "permalink": "/r/Thetruthishere/comments/1egsa3h/any_insight_on_or_sightings_of_the_dark_watchers/", "selftext": "Title. I'm doing a writing project on The Dark Watchers between Big Sur and Santa Lucia Range in California. I wanted to come to Reddit to see if anyone has had any sightings or has any information. Cheers!", "media": null, "score": 20, "upvote_ratio": 1.0, "comment_count": 5, "over_18": false}, "44": {"id": "1egj4tp", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Smooth-Marsupial-212", "link_flair_text": null, "time": 1722653095.1842053, "created_utc": 1722419348.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1egj4tp/a_man_approached_me_at_the_bus_station_when_i_was/", "title": "A man approached me at the bus station when I was 15. He then tried to kidnap me and stalked me.", "permalink": "/r/LetsNotMeet/comments/1egj4tp/a_man_approached_me_at_the_bus_station_when_i_was/", "selftext": "This happened in 1996, in my hometown of about 100.000 people. I was 15 years old, from the suburbs and went to a highschool in the city. English is not my first language, so I apologize for any grammatical mistakes.\nI finished with class and for some reason, I decided to walk to the main bus station instead of just waiting at the nearest bus stop. I stood at the gate that my bus line (number 15) starts from. Another bus line (number 17) also starts from the same gate.\nAfter waiting for around 10 minutes, a man asks me if bus number 17 had taken off yet. I say yes, I'm sorry, you've just missed it. The man, who looked to be around 30 or 40, then introduces himself to me as Mark. He streches out his hand for me to shake it. I don't want to be impolite, so I do. I introduce myself as Maya.\nMy name is not Maya. It was bizzare to me that a grown man is introducing himself to me at a bus station. I may have been 15, but I knew better. \nHe asks if I just finished school. I say yes. He asks me what school I go to. I lie. He asks if I'm going home. I say no, even though I am. He asks where I'm going. I say \"to a friend's house\".\nMy bus pulls up and I get on it. Strangely, this man, Mark, gets on as well. I know for a fact he'd asked me if number 17 had taken off yet. If he was originally planning on going on number 17, there is absolutely no reason to get on my bus, number 15. They don't have a single stop in common.\nI sit down and he sits himself next to me. He asks me which year of highschool I'm in. I lie and say I'm a junior. I was actually a freshman at the time. He says I look too young to be a junior. I say I hear that all the time. He asks me if I have a boyfriend. I say no, he says that I should. \nI then ask him where he is going. He says he's going home. I ask if he wasn't planning on taking number 17. He says no and tells me he lives at the very end of the bus line 15. That was odd, I've never seen him on the bus before. He asks me if I'm on my way home as well. I say no, I'm visiting a friend. \nLooking back, he knew I was lying. I was sure he believed me and I really thought I had the situation under control. I should've walked up to the bus driver and told him what's going on. I didn't, because I just wasn't scared enough and I didn't want to make a scene out of nothing. There were plenty of people around and while he was strange, I really thought he's just a harmless lonely weirdo.\nWe get to my stop, I purposefully miss it and get off at the next one, thinking I'll fool him and then just walk home a bit longer. To my surprise, he gets off as well. I ask him where he's going and he says he wants to walk me home.\nAgain, I tell him that I'm not going home. I'm visiting a friend. He says that's fine, he'll walk me. I say he really doesn't need to and in a stern, irritated tone, he tells me to \"shut up and walk\".\nThere is no one on the street, we're the only ones who got off the bus here. I'm alone with this weird man who followed me from the bus station. I can't go home, because I don't want him knowing where I live. I start panicking, I don't know what do to, so I just freeze and stand there, silent. In an instant, he went from weird but chatty and smiley to telling me to shut up. And I went from feeling in control to knowing I really, really fucked up.\nHe puts his hand on my shoulder and tells me that he doesn't have much time, so we should get going. I want to tell him that he clearly does, but I don't want to anger him. So I just nod. He tells me that if I'm good, I don't have to be scared of him. I lie and say I'm not. He asks me if that means I plan on being good. I say yes. He forced me to repeat it in a whole sentence (\"yes, i will be good\"). \nI begin walking. I don't know where I was going, I just walked. He walked with me, with his hand still on my shoulder. I was never religious, but I remember praying that I don't pass out. My heart was beating so fast and breathing was so difficult, I was sure I'm about to collapse and die.\nThen, I spotted an older man tending his garden in front of a house. That's the last thing I clearly remember. I have a vague memory of running. I was later told that I was screaming for help while running towards the older man, while \"Mark\" ran off. The older man called the police and they contacted my parents.\nThe police couldn't do anything but take my statement. Since my parents both worked and couldn't take me to and from school, they bought me a phone the very same day - this was in the 90s, when mobile phones were a luxury.\nI wish the story ended here.\nAfter the event, I only ever got on the bus at the stop right in front of my school. A few weeks passed and I did so like I did any other day. We locked eyes as soon as I stepped on. He was on the bus, with the biggest grin on his face, like he couldn't be more excited to see me. I was so creeped out, I immediately got off and ran into the school. I called my mom in tears and she had me find a teacher to walk me to her car when she came to get me. The school was then notified of the situation.\nAfter that, he was spotted walking around the school several times, sometimes a few days in a row, but sometimes he wasn't seen for weeks. The police was of no help - they couldn't do anything until he actually hurt me or showed up on the school property or at my home.\nI spent the rest of the year waiting in the school until late afternoon, so my mom could pick me up after work. We always took a very long route home. I now know she was making sure we weren't getting followed. My parents then had me switch schools.\nThankfully, he was never spotted in my neighbourhood and I'm very sure he never found out my name or got my adress.\nI only ever saw him one more time. I was 21, in my hometown, on summer break from university. I saw him in a grocery store in a whole different part of town. He didn't recognize me, didn't even look at me, but I immediately recognized him.\nWhere I live, there is no \"convincted criminal\" list like in the US, such cases are not reported and I never found out the man's full name. I have no idea who he is or what he has done in the past. I don't know what he would have done to me. My belief is that he was mentally challenged, saw me, liked me and followed me. My mother believes that it had been much more complex, that he was planning something and that he knew exactly where we're going. My dad still doesn't talk about it.\nI'm just happy he's out of my life.", "media": null, "score": 273, "upvote_ratio": 0.99, "comment_count": 24, "over_18": true}, "45": {"id": "1ehkidv", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "bpcrepere15", "link_flair_text": null, "time": 1722653095.6804492, "created_utc": 1722528519.0, "url": "https://i.redd.it/jtcvi9snt2gd1.jpeg", "title": "Zoom in on the Passenger Seat of the Vehicle", "permalink": "/r/Ghosts/comments/1ehkidv/zoom_in_on_the_passenger_seat_of_the_vehicle/", "selftext": "One of our warehouse workers sent this after his gf made him send a picture to confirm he was actually at work. He was the only one there that day. ", "media": null, "score": 1108, "upvote_ratio": 0.82, "comment_count": 407, "over_18": false}, "46": {"id": "1edllby", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ojfs", "link_flair_text": "Glitch Pic", "time": 1722653095.8942544, "created_utc": 1722101026.0, "url": "https://i.redd.it/b4j8sl7ii3fd1.jpeg", "title": "Pigeon algorithm glitch in Chicago", "permalink": "/r/GlitchInTheMatrix/comments/1edllby/pigeon_algorithm_glitch_in_chicago/", "selftext": "", "media": null, "score": 67, "upvote_ratio": 0.98, "comment_count": 7, "over_18": false}, "47": {"id": "1efa5dy", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "MadOblivion", "link_flair_text": "Post Disclosure World", "time": 1722653096.8148298, "created_utc": 1722285414.0, "url": "https://www.reddit.com/gallery/1efa5dy", "title": "Google Moon Anomalies of Interest. ", "permalink": "/r/ufo/comments/1efa5dy/google_moon_anomalies_of_interest/", "selftext": "", "media": null, "score": 155, "upvote_ratio": 0.89, "comment_count": 90, "over_18": false}, "48": {"id": "1ef15u9", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "News", "time": 1722653098.021788, "created_utc": 1722263874.0, "url": "https://v.redd.it/661oc7ahygfd1", "title": "UFOs/UAP May Be Future Humans - Morning in America on News Nation ", "permalink": "/r/UFOs/comments/1ef15u9/ufosuap_may_be_future_humans_morning_in_america/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/661oc7ahygfd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/661oc7ahygfd1/DASH_96.mp4", "dash_url": "https://v.redd.it/661oc7ahygfd1/DASHPlaylist.mpd?a=1725245097%2CZDk0OWZkZDUyMWQ2MGZlMTlhNTZiOWVhZmI5ZTYwNzc5ZGViMzRmMDUzNDc0ZjIzYzIyMzU0ZDU4YWExYjVhNQ%3D%3D&v=1&f=sd", "duration": 222, "hls_url": "https://v.redd.it/661oc7ahygfd1/HLSPlaylist.m3u8?a=1725245097%2CODYxZmNmMTgzYjdhYzViYjI1YTU3NjU3OTk1ZGQxNTVkNWQ3NzQ2OTVjYTcyM2RiOGU1ODMxMGNiZjAyZmNjNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1113, "upvote_ratio": 0.86, "comment_count": 350, "over_18": false}, "49": {"id": "1edhtk3", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "DragonfruitOdd1989", "link_flair_text": "Evidence :upvote:", "time": 1722653099.304906, "created_utc": 1722090991.0, "url": "https://www.reddit.com/gallery/1edhtk3", "title": "Dr. Piotti comparing his hand to the giant hand he’s studying in Mexico. ", "permalink": "/r/aliens/comments/1edhtk3/dr_piotti_comparing_his_hand_to_the_giant_hand/", "selftext": "", "media": null, "score": 1070, "upvote_ratio": 0.83, "comment_count": 549, "over_18": false}, "50": {"id": "1eh3dlw", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "strangelightstudios", "link_flair_text": "Video", "time": 1722653099.543481, "created_utc": 1722472942.0, "url": "https://youtu.be/NKs84jk7qlE?si=Kz11SS66pRG-9rIe", "title": "Wilson-Davis Memo inspired short film.", "permalink": "/r/UAP/comments/1eh3dlw/wilsondavis_memo_inspired_short_film/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "THE MEMO", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/NKs84jk7qlE?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"THE MEMO\"></iframe>", "author_name": "Strange Light Studios", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/NKs84jk7qlE/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@strangelightstudios"}}, "score": 55, "upvote_ratio": 0.91, "comment_count": 13, "over_18": false}, "51": {"id": "1ef06nd", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "DictatorBiden", "link_flair_text": null, "time": 1722653100.418263, "created_utc": 1722261445.0, "url": "https://i.redd.it/96uzipbirgfd1.jpeg", "title": "Why are the elites so afraid of Donald Trump? ", "permalink": "/r/conspiracy/comments/1ef06nd/why_are_the_elites_so_afraid_of_donald_trump/", "selftext": "", "media": null, "score": 2178, "upvote_ratio": 0.67, "comment_count": 1340, "over_18": false}, "52": {"id": "1ei2rn3", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "FinTerran", "link_flair_text": null, "time": 1722653100.6603978, "created_utc": 1722578804.0, "url": "https://www.nasa.gov/news-release/nasa-partners-conduct-fifth-asteroid-impact-exercise-release-summary", "title": "The Asteroid of 2038 not real - A NASA Drill ", "permalink": "/r/conspiracyfact/comments/1ei2rn3/the_asteroid_of_2038_not_real_a_nasa_drill/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 0, "over_18": false}, "53": {"id": "1ehq90o", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "photo", "time": 1722653101.3648694, "created_utc": 1722542522.0, "url": "https://i.redd.it/inx3mg3yw3gd1.jpeg", "title": "The 2000 Arapaho Tribal Reservation photos taken by Russell Lumpmouth. Others there that day also saw the creatures", "permalink": "/r/bigfoot/comments/1ehq90o/the_2000_arapaho_tribal_reservation_photos_taken/", "selftext": "", "media": null, "score": 637, "upvote_ratio": 0.93, "comment_count": 84, "over_18": false}, "54": {"id": "1eftwyj", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1722653101.9640818, "created_utc": 1722347595.0, "url": "https://i.redd.it/erz3urcovnfd1.png", "title": "The Mysterious Case of Marvin ", "permalink": "/r/Cryptozoology/comments/1eftwyj/the_mysterious_case_of_marvin/", "selftext": "", "media": null, "score": 317, "upvote_ratio": 0.97, "comment_count": 26, "over_18": false}, "55": {"id": "1eiazjc", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Some-Cake-426", "link_flair_text": "Ghost or apparition", "time": 1722653102.1639407, "created_utc": 1722607714.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1eiazjc/do_you_know_this_creature/", "title": "Do you know this creature ? ", "permalink": "/r/Humanoidencounters/comments/1eiazjc/do_you_know_this_creature/", "selftext": "I don't know if I'm in the right forum but I read an old thread on Reddit and someone pointed this one out , so I will try. See if someone can help me. \nWhen I was child I used to see a big totally black creature , no eyes or facial features, very tall, standing in the doorway in my room, like blocking it. I could just see it had a head. But no ears, eyes. This happend to me so many nights I can't remember how many. I was terrified and with time I found a way to sooth myself , I went under blanket, held my ears tight and sang in my mind a song, always the same song, then I passed somehow out. Sometimes scary sounds followed this creature usually before it appeared. One time I had a nightmare and I was going to run into my parents bedroom, but when I was almost there, this creature just stood there blocking the entrance of my parents bedroom. This creature was so terrifying and so big I just started shaking , my teeth were shattering a lot and I was too afraid to move because I knew this thing would get me , so I just kneeled down on the floor in front of it and just cried and shaked feeling this horror and shives going through my spine and body. I woke up, my mom was waking me up like \"why are you here sleeping on the floor,  you should be in your bed\". Then I don't remember anything more from this night. \nIt was a traumatizing experience, all these years of this terror and as a child I was feeling scared about going to sleep. I didn't tell my parents about this, I thought they wouldn't believe me. But I told my younger brother only to find out that he also saw a creature but totally black with eyes. Mine didn't have any eyes. So we started sleeping in each other room, holding each other, for safety. This went on and on through all my childhood. My mom came one day and said we couldn't sleep in each others room, we were big enough to sleep in our own, so piece was over and this nightmare continued. \nToday as an adults, we have for many years joked about what happened, that this house we grew up in was haunted. But deep down we both know the truth, it was not funny at all what happend and it had really serious consequences for us both. We are still traumatized after these encounters with these creatures. I still get nightmares and trauma related experiences when it's bed time. I sometimes wake up in the middle of the night , often many times and start shaking and feeling like someone is at the door. And I'm over 40 years old. And I have tried everything. I'm even taking medications for this. Some years ago I came down with some kind of an answer to all of this. I found out that me and my brother , because of some things that happened in our past, another childhood trauma, we started to see things and experience things due to fear and unsolved traumas. We were just really scared children with no support. It was pschycological. I went to pschycologist for many years, worked on my traumas, did EMDR and a lot of inner work.  And I stopped thinking about these creatures as they were real. I thought I had this solved. I thought I got my answer, they didn't exist and it was my mind playing tricks on me.\nBut then one day, couple of years ago, me, my ex husband and our three sons were moving into a new home. We were not moved in yet. I was sitting in one room, on the floor, with our middle son. My ex was in living room with our oldest and our youngest. All of a sudden I look up, somebody was at the doorway to the room we were sitting in, and it was this big black creature from my childhood, but now it could walk, it was no longer just standing there, and it walked from the door and went to the hall and then to the living room. I was shocked, didn't say anything yet, but then my middle sonsaid \"mom, what was that walking there !\" And then shortly after my ex and my oldest start calling and then we ran into living room and everyone was terrified and shocked. My ex, my oldest and my middle son all saw the same thing ! This black , tall creature. The creature went from standing in the doorway of the room me and my middle son were  in, looking at us, then it walked through the hall, then living room and out to the balcony and then it disappeared. We were so shocked. Everyone saw it with their eyes open.\nAfter this I started opening up about this creature. I told my parents and they just shook their heads. I told my biological mom, and she told me many stories of things she saw and experienced through her life , things that were not from this world. She referred to them as evil. Called them demonic spirits. She also one time saw this big , black, tall creature. So I started talking to my blood family more and more and found out that a lot of them had seen or experienced strange outer worldly things. I started thinking it was running in my family, some heritage? But why and how, I don't know.\nSo my childhood memories are true. And it really happened. \nI have been trying to find out what this is. And I have read a lot but nothing is matching entirely my experience. Do you know what this is and why it comes and why it's trying to terrify me and my family ? I still have trouble sleeping and I'm so tired of this.\nEdit - it my acounter with this black creature happened first in the year 1984 in small village in  Iceland.  The acounter lasted from around 1984-1992. And then again in 2011 in another town in Iceland. ", "media": null, "score": 6, "upvote_ratio": 0.75, "comment_count": 6, "over_18": false}, "56": {"id": "1eejwih", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "CatrinaBallerina", "link_flair_text": null, "time": 1722653102.5692945, "created_utc": 1722206544.0, "url": "https://i.redd.it/1itj1m198cfd1.jpeg", "title": "For the Bigfoot Lovers", "permalink": "/r/cryptids/comments/1eejwih/for_the_bigfoot_lovers/", "selftext": "Found at Walmart and had to share 🙏🏾", "media": null, "score": 107, "upvote_ratio": 0.99, "comment_count": 3, "over_18": false}, "57": {"id": "1efq6x5", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "blablathon", "link_flair_text": null, "time": 1722653102.696339, "created_utc": 1722336334.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1efq6x5/a_possible_matrix_glitch_or_parallel_universe/", "title": "A Possible Matrix Glitch or Parallel Universe?", "permalink": "/r/Thetruthishere/comments/1efq6x5/a_possible_matrix_glitch_or_parallel_universe/", "selftext": "About a year ago, my mother and I experienced something truly bizarre, and I'm wondering if anyone here has a plausible explanation or similar story.\nWe had a successful business deal, so we decided to go out and buy some jewelry. My mom likes to invest in valuable jewelry instead of leaving money in the bank. We parked in a secured parking lot (with cameras and security), left a bag of cash in the glove compartment of our car, and locked the car. Both of us distinctly remember putting the bag there and even discussed hiding it under the glove compartment for extra security.(We always do that so we don't have to visit a shop than another with bunch of money with us )\nWe went shopping, picked out the jewelry, and returned to the car to retrieve the money. To our shock, the bag was gone! We searched the car thoroughly, argued with security, called the police, and filed a report. The whole ordeal took all day. The police said they would check the cameras and investigate.\nCompletely frustrated, we went back home, only to find the missing bag of cash lying intact on my mom's bed. Everything was there, untouched. We were both completely stunned. The last time we saw the bag was in the car's glove compartment at the parking lot.\nMy blood ran cold, and my legs felt weak. My mom thought it might be some supernatural phenomenon, and we decided to donate all the money, thinking that's what the spirits wanted.\nBut now, after reading about matrix glitches and parallel universe theories, I'm wondering if we experienced something like that. Has anyone else experienced anything similar or have any idea what could have happened? \nPlease share your thoughts!", "media": null, "score": 13, "upvote_ratio": 0.76, "comment_count": 4, "over_18": false}, "58": {"id": "1eel7p7", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Count_Curlyfluffs", "link_flair_text": null, "time": 1722653102.8701532, "created_utc": 1722210089.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1eel7p7/joe_the_contractor/", "title": "Joe the Contractor", "permalink": "/r/LetsNotMeet/comments/1eel7p7/joe_the_contractor/", "selftext": "This just happened yesterday. \nI will preface this with the fact that we are entering into building phase on our house right now, so I am meeting a lot of contractors and new peoople. We have been having trouble finding someone to do our foundation. Over the last month I have called tons of people who said they can’t do the job but “know someone who can” and then give me their name and number. I call, get the same answer, rinse and repeat. After a lot of this I finally land on the number of a guy named Joe. \nJoe sounded excited to do the job and was the most responsive and also nicest person I’ve run into so far contractor-wise. We set up a meet time and he came out to my place to see the site. He seemed confident that he could do the job. He then asked to take the plans home with him so he could go over them and said he would get back to me with a quote soon. I agreed, gave him the plans but told him I would need them back soon, and that was that. \nNot too long after, we met with a second contractor who we ultimately ended up hiring for the job. On Friday I realized Joe still had the plans and it’s coming time now that the first steps are about to happen and we needed the plans back. So I texted him (R is me, J is Joe):\nR: Hey Joe, would I be able to come get those architectural plans from you?\nJ: Yes, I can stop by tomorrow\nR: I can meet you in (Town) if that is easier. I need to go to the store anyways.\nJ: Ok, what time?\nR: Noon, at the (Grocery) parking lot\nJ: Sounds good\nAround noon yesterday I arrived at the grocery store parking lot. I text Joe right away saying I’ve arrived and he shows up soon after. He pulled up next to my car and got out, I get out as well and notice that he is empty handed. \nConfuse, I asked where plans are and if he brought them. “Oh….no, they are back at my house, do you need them?”\nI’m slightly annoyed at this point, so I just said yes, the guy who is prepping the site needs them. Joe responds “oh...well you can follow me back to my house and I will give them to you.” I started to feel alert at this point, nobody but my husband knows I’m meeting this guy and I really do not know him very well. So I asked him how far his house was. Joe said “(Neighboring town), 5 minutes, 4 miles”\nThe weird vibes are growing the more I think about it, clearly nothing to write home about, but I ready to get out of there at the drop of a hat if necessary.  I said to Joe “Let me call my husband, I might not have time, because we need to be somewhere,\" giving myself an easy out.  \nI walk away, out of earshot, so I could think straight and call my husband. He thankfully answered and I told him everything that happened so far. He agreed that it sounded a little shady and told me to be straight up with Joe and tell him I wasn’t comfortable going to his house. \nI hung up and walked back to where Joe was waiting and I said “Soooo, I do have time, but I’m not going to your house because I don’t know you well enough, but I will wait in the (Community Development Building) parking lot, across from the fish factory. A very loud, stink place that you couldn't miss. \nJoe seemed confused and didn’t know where I was talking about. So after a bit of back and forth and trying to explain where I was going to wait, I offered to drive first and he could follow me, that way he could see where I pulled into. Then he could continue to his house grab the plans and meet me back there.\nAlso I will mention that I was proud of myself because I tend to be a bit timid and too polite, to my own detriment sometimes. This time I did NOT beat around the bush and was clear and concise with everything I said. Like I had adopted lazer focus on my delivery for once.\nI then got in my car and drove first, Joe followed me and I pulled into the (Community Development) parking lot. I look to make sure Joe saw me, and I noticed he had stopped in the middle of the empty street  and he is signaling for me to turn my car around. Since I am a good distance away, I get out of my car so I can hear what he is saying and he is yelling for me to turn around and follow him because his “house is right there.” \nI again said no, I wasn’t going to his house, I’d wait right there for him to come back. A flash of annoyance went through him, but then he nods and continues down the street. Leaving me there to wait for him to return. \nLess than 1 single minute later he arrives back with the plans, hands them off to me. I quickly took them, said a quick goodbye and booked it out of there. \nAfter I got out the situation I was finally able to think and reflect. It took him less than one minute to get the plans from his house. So its one of two things. If he lived so close, why didn’t he know what the community development building and the fish factory were? He could probably see them from his house he’d be so close….\nOr, he had the plans with him the whole time. \nAlso, I think it is good to note that my husband and I tried looking him up after this, there is nothing about Joe on the internet, he does not have an email, business name, or registered phone number. I don’t even remember who gave me his number. I now realize that aside from my husband, no one knows I have been talking to or meeting with him. He simply doesn’t exist as a contractor online and since we never decided to use him as a contractor, I never officially looked him up until now. ", "media": null, "score": 149, "upvote_ratio": 0.97, "comment_count": 18, "over_18": true}, "59": {"id": "1efx808", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "ty609", "link_flair_text": "Personal Encounter ", "time": 1722653103.4156086, "created_utc": 1722355549.0, "url": "https://www.reddit.com/r/Ghosts/comments/1efx808/my_oujia_board_experience_that_haunted_me_forever/", "title": "My Oujia Board experience that haunted me forever.", "permalink": "/r/Ghosts/comments/1efx808/my_oujia_board_experience_that_haunted_me_forever/", "selftext": "One night at my friends dad we decided to play the oujia board being that the previous 2 times we played nothing serious happened. \nSo the 3 of us started playing and asking questions and having fun getting our questions answered. \nI’m literally getting chills typing/thinking about this\nSo we keep asking questions for about 5-10 minutes.. it stops answering us and just starts making the figure 8 over and over on the board (at this time we were 12-13) so we had no knowledge what so ever on what was going on\nAfter it stopped making the figure 8 it started going to “Z” then “O” fast! Back and forth! (Again if we had the knowledge we have now we would have said goodbye)\nBeing so we didn’t know what it meant we kept out hands on…\nAfter getting a very weird feeling the lights started flickering on and off fast and the garage started opening and closing fast (friends dad had went out for night we were there alone and played in garage) without saying goodbye we all ran into the house and huddled in the basement until his dad got back home\nAfter that day we each never touched a board again.. and it definitely made us believe in that stuff. Def not something to play around with. \nSometimes I wonder if that’s the reason a lot of bad/weird things happen in my life. I know we all go through some weird and bad times but it’s a lot for me makes me think it’s something from that experience ", "media": null, "score": 245, "upvote_ratio": 0.88, "comment_count": 163, "over_18": false}, "60": {"id": "1eip6wd", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "youraveragesprite", "link_flair_text": "Glitch Pic", "time": 1722653103.6186523, "created_utc": 1722643165.0, "url": "https://i.redd.it/622izj5kacgd1.jpeg", "title": "My husband lost his $70 knife a few months ago. He looked everywhere and just assumed someone had stolen it. He bought another just like the old one after a couple of months. He wakes up today and finds original sitting in the middle of his cushion on the couch. As if it never left!", "permalink": "/r/GlitchInTheMatrix/comments/1eip6wd/my_husband_lost_his_70_knife_a_few_months_ago_he/", "selftext": "", "media": null, "score": 44, "upvote_ratio": 0.94, "comment_count": 16, "over_18": false}, "61": {"id": "1egnrmd", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "slv2xhrist", "link_flair_text": null, "time": 1722653104.8170242, "created_utc": 1722434035.0, "url": "https://www.reddit.com/r/ufo/comments/1egnrmd/matthew_pines_said_nhi_not_from_outer_space_but/", "title": "Matthew Pines said NHI “Not from outer space but here and made by something else”…Thoughts? ", "permalink": "/r/ufo/comments/1egnrmd/matthew_pines_said_nhi_not_from_outer_space_but/", "selftext": "Makes this statement on Bitcoin Wars podcast:\nhttps://youtu.be/mdvupw79Q2U?si=OzW7p6a07qOG9Esk\n@1:51:00\nJust want to know what you think he means by this…", "media": null, "score": 123, "upvote_ratio": 0.82, "comment_count": 138, "over_18": false}, "62": {"id": "1ef8l11", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Clipping", "time": 1722653106.0728426, "created_utc": 1722281732.0, "url": "https://v.redd.it/5ngb64t7cifd1", "title": "Matthew Pines: \"[The Senate doesn't trust AARO/Pentagon on UAP] and they are doubling down on that, saying [the UAPDA] is necessary because credible evidence indicates UAP records exist that haven't been subject to [declassification] due to an overbroad interpretation of the Atomic Energy Act 1954.\"", "permalink": "/r/UFOs/comments/1ef8l11/matthew_pines_the_senate_doesnt_trust/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/5ngb64t7cifd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/5ngb64t7cifd1/DASH_96.mp4", "dash_url": "https://v.redd.it/5ngb64t7cifd1/DASHPlaylist.mpd?a=1725245105%2CZThhNDA2ZmExODA5NGNmNGE0NTMwM2UwNDExOTQ1ZTVkN2Y5MjZlMjQwMTQ5ZWFkNDYzODQ2M2MzMjRjZjRmYw%3D%3D&v=1&f=sd", "duration": 395, "hls_url": "https://v.redd.it/5ngb64t7cifd1/HLSPlaylist.m3u8?a=1725245105%2CMTgwZTUwYTdlYjZlZTE1N2Y1Mzc5ZGI0MTA4ZmFiODJhMjY2MWE1ZDE0NTdlMGQ1OWE3YTAzMjI4ZDMwMWY3Zg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 974, "upvote_ratio": 0.97, "comment_count": 186, "over_18": false}, "63": {"id": "1efautg", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "engion3", "link_flair_text": "Evidence :upvote:", "time": 1722653107.249826, "created_utc": 1722287055.0, "url": "https://www.cnn.com/2024/07/29/science/venus-gases-phosphine-ammonia/index.html", "title": "The discovery of a possible sign of life in Venus’ clouds sparked controversy. Now, scientists say they have more proof", "permalink": "/r/aliens/comments/1efautg/the_discovery_of_a_possible_sign_of_life_in_venus/", "selftext": "", "media": null, "score": 966, "upvote_ratio": 0.97, "comment_count": 149, "over_18": false}, "64": {"id": "1ehmlz6", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Astro_ImproVe", "link_flair_text": "Discussion", "time": 1722653107.4546854, "created_utc": 1722533598.0, "url": "https://www.reddit.com/r/UAP/comments/1ehmlz6/foia_navy_high_frequency_wave_generator_invented/", "title": "FOIA Navy High Frequency Wave Generator \"invented\" in 2016", "permalink": "/r/UAP/comments/1ehmlz6/foia_navy_high_frequency_wave_generator_invented/", "selftext": "Apparently this was \"invented\" in 2016. Has anyone else come across this? Very interesting...\nhttps://www.navair.navy.mil/foia/documents \nhttps://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2020-010057%20FINAL%20VERSION%20Disclosure_0.pdf", "media": null, "score": 51, "upvote_ratio": 0.92, "comment_count": 21, "over_18": false}, "65": {"id": "1ehw49m", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "External-Noise-4832", "link_flair_text": null, "time": 1722653108.408133, "created_utc": 1722557603.0, "url": "https://i.redd.it/hmdkjm3585gd1.jpeg", "title": "This gotta be the most insane olympics of all time!", "permalink": "/r/conspiracy/comments/1ehw49m/this_gotta_be_the_most_insane_olympics_of_all_time/", "selftext": "", "media": null, "score": 2093, "upvote_ratio": 0.83, "comment_count": 313, "over_18": false}, "66": {"id": "1ei26us", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "FlutedBezzy", "link_flair_text": null, "time": 1722653108.6943316, "created_utc": 1722576589.0, "url": "https://youtu.be/dC3A15yk3Wg?si=m1hzL9ZLxN0HmhvH", "title": "Deep State Conspiracy:Iran and the deep state motives", "permalink": "/r/conspiracyfact/comments/1ei26us/deep_state_conspiracyiran_and_the_deep_state/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Deep State Conspiracy:Iran and the deep state motives", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/dC3A15yk3Wg?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Deep State Conspiracy:Iran and the deep state motives\"></iframe>", "author_name": "Think Tank Network", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/dC3A15yk3Wg/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@ThinkTankNetworkNot4Sale"}}, "score": 0, "upvote_ratio": 0.5, "comment_count": 0, "over_18": false}, "67": {"id": "1eeiy1n", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Infamous-Garbage-420", "link_flair_text": "announcement 📣", "time": 1722653109.8839056, "created_utc": 1722203984.0, "url": "https://www.reddit.com/r/bigfoot/comments/1eeiy1n/this_is_a_bigfoot_site_please_take_your_political/", "title": "This is a bigfoot site, please take your political beliefs to the political sites on reddit. ", "permalink": "/r/bigfoot/comments/1eeiy1n/this_is_a_bigfoot_site_please_take_your_political/", "selftext": "", "media": null, "score": 516, "upvote_ratio": 0.87, "comment_count": 148, "over_18": false}, "68": {"id": "1ee5rid", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Question", "time": 1722653110.4981518, "created_utc": 1722167754.0, "url": "https://i.redd.it/cgjsdo5v09fd1.jpeg", "title": "Anyone else feel a bit suspicious of the Alvin sea serpent? ", "permalink": "/r/Cryptozoology/comments/1ee5rid/anyone_else_feel_a_bit_suspicious_of_the_alvin/", "selftext": "", "media": null, "score": 317, "upvote_ratio": 0.97, "comment_count": 57, "over_18": false}, "69": {"id": "1eiljhz", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "TheUmbraProject", "link_flair_text": "Alien", "time": 1722653110.670918, "created_utc": 1722633456.0, "url": "https://v.redd.it/uqj2ypxc0ced1", "title": "The Kelly-Hopkinsville Encounter - In 1955, the Sutton family of Kelly, Kentucky, experienced a night of terror they would never forget.", "permalink": "/r/Humanoidencounters/comments/1eiljhz/the_kellyhopkinsville_encounter_in_1955_the/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "70": {"id": "1eiicym", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "FadedFigure1160", "link_flair_text": null, "time": 1722653111.056475, "created_utc": 1722625610.0, "url": "https://i.redd.it/oh4sp5tcuagd1.jpeg", "title": "This image was taken about 30 feet away from the figure, the figure looked to be around 7 feet tall, photo was taken from my car as I was stopped to look out the window, there was nothing else in the clearing other than the figure. what do you think it is?", "permalink": "/r/cryptids/comments/1eiicym/this_image_was_taken_about_30_feet_away_from_the/", "selftext": "", "media": null, "score": 109, "upvote_ratio": 0.72, "comment_count": 85, "over_18": false}, "71": {"id": "1egaadv", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Xxjustnoxx", "link_flair_text": "Discussion/Advice", "time": 1722653111.2049868, "created_utc": 1722387913.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1egaadv/random_voices_playing_xbox/", "title": "Random voices playing Xbox ", "permalink": "/r/Thetruthishere/comments/1egaadv/random_voices_playing_xbox/", "selftext": "I’m gonna start by saying I’m sure there’s a practical explanation but I just can’t  find one lol. Lately when I play Xbox I will randomly hear short bursts of someone talking . Diffrent people every time . I’ve heard lots of ppl say they hear voices randomly but I’ve always heard people say they sound robotic or ominous . This is just random. Like I just heard someone again tonight and it sounded like any teenage / 20’s guy you’d meet in a lobby only I wasn’t in a party or any game lobby so no one could have been talking . And another time it sounded like a very little kid. I don’t think I’m hallucinating , bc it only happens when I’m on my Xbox ", "media": null, "score": 9, "upvote_ratio": 0.8, "comment_count": 5, "over_18": false}, "72": {"id": "1egen9y", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "cribibi", "link_flair_text": null, "time": 1722653111.432076, "created_utc": 1722401326.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1egen9y/a_creepy_customer_pulled_a_knife_on_me_at_walmart/", "title": "A creepy customer pulled a knife on me at walmart", "permalink": "/r/LetsNotMeet/comments/1egen9y/a_creepy_customer_pulled_a_knife_on_me_at_walmart/", "selftext": "So I recently got a job at Walmart in online grocery, and while I don't talk to customers nearly as much as cashiers or customer service, I do have to answer a lot of questions and direct people to items they can't find. There are plenty of stupid people who don't look before asking me where something is, and people who are just plain rude, but besides this one encounter I haven't really had a problem with creepy men. At my past jobs I was used to men making horrible comments about my body and body mods, but I guess at Walmart there's always someone weirder walking around, so I don't get as many.\nIt started at around noon when I went out on my first pick run of the day.  I was in the soda aisle struggling to fit a box pack of beer into my cart when this guy came up and helped me. He was probably in his early to mid-20s (This kind of adds to the creep factor because I only recently turned 18 and haven't switched out my yellow nametag yet), a bigger guy, a bit shorter than me, wearing a Korn shirt. I thanked him for helping me, and said I liked his shirt, he said it was no problem and complimented my hair. No big deal, right? I pick up my handheld and get back to bagging soda and praying that I don't get sent on exceptions that night.  \nAround 15 minutes later I'm in the soup aisle crouched on the floor bagging 20 cans of Dinty Moore. Not my finest moment. Someone walks up behind me and says \"Excuse me?\" I'm already excited to talk to them. Nobody, and I mean nobody says excuse me when they want my attention. I stand up and turn around to see the same guy. He says he's been looking everywhere and he can't find the baking soda, and that he knows he probably passed it but he wants to make sure he's looking in the right area. The baking aisle is just a few over and what a coincidence, the next thing I need for my run is bread flour. I tell him I'm heading over to the aisle the baking soda is in right now and I'll show him where it is. He says thank you, I finish scanning in the Dinty Moore, and we head over. It was a Tuesday and completely dead. Like, I was seeing my coworkers more often than customers.\nWe get to the baking aisle and I show him the baking soda before getting to picking out the bread flour. I had a LOT to pick from in that aisle so I was there for a good 10 minutes picking different items, and I couldn't help but notice that he put a tiny box of Arm and Hammer into his cart and was just standing there on his phone, occasionally looking at me. A little strange, but maybe he's texting someone and is feeling a bit awkward that neither of us has left the aisle. Who knows. I finish my pick run, stage the totes onto the cart, and bring it to the back. I go on two more runs before my first 15-minute break, and I catch a glimpse of Korn guy every so often. I figure he's just having a hard time finding stuff because the Walmart I work at is massive, and continue on with my day. I go into the break room to eat the salad I had in the fridge and drink a cherry Pepsi while getting that good gossip from one of the guys from customer service, and life is good. For a second I thought I saw Korn guy walk past the door, but I figured it was just an employee wearing the same shirt and didn't think of it again until later.\nMy manager tells me to do three more pick runs before I go to the back to start dispensing orders, and I head out on a produce run. Easily one of the worst types, as the produce section is super confusing and always crazy busy. I get to the produce section and start doing my thing when I see Korn guy standing next to the corn stand. I laugh to myself for a second before realizing that it's 1:30 at this point, and this guy has been at Walmart for at least an hour and a half. There are only three things in his cart. I try not to look in his direction so he doesn't try to talk to me and get back to bagging onions and weighing apples. At this point, I'm getting some serious weirdo vibes from this guy.\nHe walks up to me and says hi. I say hi back, and ask him if he needs anything. He proceeds to go on the creepiest tirade I've ever heard. I remember almost exactly what he said because I was standing there in absolute horror the entire time while holding a bag of apples. He said;\n\"I just wanted you to know that you don't need to eat salad if you don't want to, you don't need to lose weight. If you're trying to impress that guy you were talking to, you should go for someone who would love you for who you are, not someone who would want to change you like that. You are so beautiful.\"\nI stare at this man in SHOCK. For one, I eat salads for lunch because I like fucking salad. It sure ain't a healthy salad either, those things are loaded with caesar dressing and bacon bits. Second of all, I have a boyfriend already, it's not Gavin from customer service, and he's also fat and could not care less what I eat. Third of all, I take offense that some random creep thinks that I, a grown-ass woman, have been waiting all my life to be validated by him, a man who spends all day at Walmart without even being paid for it. Needless to say, I am horrified, embarrassed because he just said this in front of multiple other customers who are giving us weird looks, and pissed off by the audacity of this fucking weirdo. I can't tell him any of this. I stick with telling him that I think that's inappropriate for him to say, he needs to stay out of employee-only areas like the break room, and if he needs anything else he can go ahead and talk to customer service. He looks shocked as if this wasn't the nicest way I could have ended the conversation, and I end my pick run early to go talk to a manager. \nIn the back I tell my manager about Korn guy, how he's been following me, and how I'm not going back out to pick tonight unless we know for sure that he's gone. She's understanding and lets me start dispensing early, and sends one of the guys in the back to pick in my place. The rest of the day goes okay, except when my coworker and I go out together to take a huge order to one of the spots in the main parking lot and Korn guy is sitting on the bench out front. I prayed that he was just waiting for someone to pick him up and refuse to take out any more orders to the main lot. \nI manage to put away returns without seeing him and with minimal trouble, and at 8 I go back to OGP, turn in my handheld and keycard, and say goodbye to everyone left. I always park in the main lot right in front of the grocery section and as I'm walking it's just starting to get a bit dark. It had been raining on and off the whole day and it was the perfect balance of summer warmth and cold rain outside. As I'm unlocking my shitty old CRV I see the Korn guy approaching me. I'm scared of what the fuck he wants from me, but at this point I have my keys out and the pepper spray on the chain is clearly visible so I'm hoping he isn't stupid enough to try something. He walks up to me and starts trying to talk. I shut him down, tell him that he has been following me all day (reminder that he has been at Walmart for a full 8 hours at this point) and I am uncomfortable talking to him. I am off the clock and if he needs something regarding Walmart he can go talk to customer service, and if he wants to talk to me personally I'm not interested and he needs to leave me the fuck alone. \nHe has the nerve to look OFFENDED and then says something that tops his salad rant in terms of stupid shit to say to a random woman. \n\"Okay, since you're gonna be like that I won't ask you out. Ungrateful bitch. I thought you were cool and could maybe understand me, but you're just like every other girl.\"\nI'm too morbidly curious. I ask him what the fuck that means.\n\"I mean you seem cool. I don't see anyone around here with ears stretched that big or who can appreciate Korn's artistry. I thought maybe you were on my level, but you're just like every other stupid midwesterner in this shitty town.\"\nAt the end of this little rant, he digs in the pocket of his sweatpants and produces the shittiest little switchblade I've seen in my life. This pitiful little thing couldn't skin a hamster.\nI'm somehow even more offended. First, I've been stalked all day because I have stretched ears and complimented a guy's band shirt. Second, he thinks Korn is some deep-cut metal band that nobody else has ever heard of. Third of all, we do live in Iowa, but we live in one of the LARGEST CITIES IN IOWA AND THIS WALMART IS RIGHT IN THE MIDDLE OF IT, and fourth, he's not only threatening me with a knife for not living up to his manic pixie dream girl fantasy but thinks I'm gonna be scared of that pathetic excuse of a knife?  At this point, I'm so sick of this asshole I get in my car, tell him to go fuck himself, slam the door and get out of there.\nI haven't seen him since, but I work pretty much every day, so it's only a matter of time. \nSo basically, to the creepy guy in a Korn shirt who pulled a knife on me in the Walmart parking lot, I hope we never meet again. ", "media": null, "score": 118, "upvote_ratio": 0.97, "comment_count": 9, "over_18": true}, "73": {"id": "1egg9h6", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "serialkiller24", "link_flair_text": null, "time": 1722653112.1290977, "created_utc": 1722407396.0, "url": "https://www.reddit.com/r/Ghosts/comments/1egg9h6/what_are_some_ghostparanormal_podcasts_you_enjoy/", "title": "What are some ghost/paranormal podcasts you enjoy listening to? ", "permalink": "/r/Ghosts/comments/1egg9h6/what_are_some_ghostparanormal_podcasts_you_enjoy/", "selftext": "", "media": null, "score": 183, "upvote_ratio": 0.97, "comment_count": 192, "over_18": false}, "74": {"id": "1eg7k30", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "crimsoncat510", "link_flair_text": "Glitch Pic", "time": 1722653112.4218795, "created_utc": 1722380570.0, "url": "https://i.redd.it/pri02tbqlqfd1.jpeg", "title": "Ç Ą Č Ț Ů Ş", "permalink": "/r/GlitchInTheMatrix/comments/1eg7k30/ç_ą_č_ț_ů_ş/", "selftext": "", "media": null, "score": 17, "upvote_ratio": 0.74, "comment_count": 3, "over_18": false}}}