{"_default": {"1": {"id": "16sidan", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "AvailableChoice3130", "link_flair_text": null, "time": 1696041395.2450745, "created_utc": 1695718461.0, "url": "https://i.redd.it/3vwv0lzadkqb1.png", "title": "Is this a propaganda photo op?", "permalink": "/r/conspiracy/comments/16sidan/is_this_a_propaganda_photo_op/", "selftext": "", "media": null, "score": 3321, "upvote_ratio": 0.89, "comment_count": 631, "over_18": false}, "2": {"id": "16r4mix", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "SilentSpace", "link_flair_text": null, "time": 1696041395.5903857, "created_utc": 1695579432.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/16r4mix/blackrock_the_secret_company_that_owns_the_world/", "title": "BlackRock: The Secret Company that Owns the World, 10/2021", "permalink": "/r/conspiracyfact/comments/16r4mix/blackrock_the_secret_company_that_owns_the_world/", "selftext": "Founded by Larry Fink in 1988, BlackRock is the most powerful Wall Street fund in the world with $9 trillion worth of assets under management. That’s larger than the gross domestic product (GDP) of every single country around the globe, with the exception of China and the United States. BlackRock.\nhttps://medium.com/yardcouch-com/blackrock-the-secret-company-that-owns-the-world-b96111277e0f\n​", "media": null, "score": 16, "upvote_ratio": 0.94, "comment_count": 0, "over_18": false}, "3": {"id": "16un21l", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "FWGuy2", "link_flair_text": null, "time": 1696041397.7859197, "created_utc": 1695924539.0, "url": "https://www.reddit.com/r/ufo/comments/16un21l/netflixs_new_encounters_documentary_features_ufo/", "title": "Netflix's new 'Encounters' documentary features UFO sighting of a mile-long 'spaceship' spotted by more than 300 people in Texas", "permalink": "/r/ufo/comments/16un21l/netflixs_new_encounters_documentary_features_ufo/", "selftext": "\nEngineer Bob Powell analyzed 2.8 million radar returns from the 2008 UFO case\nPowell told DailyMail.com the FAA has stopped releasing this data to the public\nREAD  MORE: From 'alien bodies' in Mexico to flying saucers in secret US  government bunkers, DailyMail.com breaks down the latest in UFO news\nhttps://www.dailymail.co.uk/sciencetech/article-12567083/Netflix-UFO-Spielberg-Encounters-Texas-Stephenville-Radar-Dublin.html\n", "media": null, "score": 591, "upvote_ratio": 0.94, "comment_count": 190, "over_18": false}, "4": {"id": "16pz60f", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Trylldom", "link_flair_text": "Article", "time": 1696041399.5722728, "created_utc": 1695458269.0, "url": "https://www.express.co.uk/news/us/1815854/NASA-military-UFO-aliens-truth", "title": "Man who hacked NASA says truth about aliens will never be disclosed", "permalink": "/r/UFOs/comments/16pz60f/man_who_hacked_nasa_says_truth_about_aliens_will/", "selftext": "A man who was accused of the \"biggest military computer hack of all time\" by officials in the United States - and claimed to have found evidence of contact with 'non-terrestrial' beings and technology as a result - believes the public will never be told the truth about UFOs, UAPs and aliens.\nScottish IT expert Gary McKinnon, now 57, illegally gained access to US Army, Navy, Air Force, Pentagon, and NASA computers in 2002. He spent nearly a decade fighting extradition to the US, where he would have faced up to 70 years in jail if convicted.", "media": null, "score": 9361, "upvote_ratio": 0.8, "comment_count": 1340, "over_18": false}, "5": {"id": "16qycpa", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "ReptilianOverlord7", "link_flair_text": "Image 📷", "time": 1696041401.4983063, "created_utc": 1695563757.0, "url": "https://i.redd.it/bw3xecykl7qb1.jpg", "title": "Nothing to see in the bottom left corner here.", "permalink": "/r/aliens/comments/16qycpa/nothing_to_see_in_the_bottom_left_corner_here/", "selftext": "", "media": null, "score": 11533, "upvote_ratio": 0.69, "comment_count": 2847, "over_18": false}, "6": {"id": "16t58og", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "DrRBoylan", "link_flair_text": null, "time": 1696041401.9700618, "created_utc": 1695774340.0, "url": "https://www.reddit.com/r/UAP/comments/16t58og/senate_passes_ufo_disclosure_act_of_2023/", "title": "Senate Passes UFO Disclosure Act of 2023", "permalink": "/r/UAP/comments/16t58og/senate_passes_ufo_disclosure_act_of_2023/", "selftext": "re UAPs/UFOs and ETs.\nToday the Senate passed the UAP [UFO] Disclosure Act of 2023. This Act is an Amendment-component of the larger and pending , which funds the entire Defense Department and other vital subprograms.\nThe NDAA is obviously a must-pass Bill, but awaits action by a Joint Legislative Reconciliation Committee which decides which amendments not cosponsored by  both houses of Congress will remain in the final Act.\nReportedly the White House has already indicated that President Biden will sign the UFO Disclosure Act, and the overall NDAA Defense Authorization Act.  So, if the Reconciliation Committee does not strip out the UFO  Disclosure component, the UFO Disclosure will become the law of the land.  The House UAP Caucus has pledged to fight to keep the UFO Disclosure Amendment intact within the NDAA Bill when the House votes on the Bill.  (Details below.)\nHere is more about the UFO Disclosure Act of 2023.\nThe Senate has passed an amendment (to NDAA) that would force government agencies to hand over any records on UFOs within 300 days and would mandate the disclosure of those UFO records to the public unless there is a compelling reason to keep them classified.\nThe UAP Disclosure Act of 2023 was passed as part of the National Defense Authorization Act for 2024, and it sets up a timeline and process to deal with reports of unidentified aerial phenomena (UAP), more commonly referred to as UFOs. The act sets up a process for disclosing information on UFOs as well as ensuring any recovered technology would belong to the government.\nThe act gives government agencies up to 300 days to turn over any information on UFOs, including records along with any samples or technology that may have been recovered.\nWhile agencies have 300 days to gather and turn over information, President Joe Biden has 90 days from when the act goes into effect to form an UAP [UFO] Independent Review Board.\nThe nine-member board cannot include anyone connected to existing UAP research or programs and has to include at least one national security officer, foreign service official, scientist or engineer, economist, professional historian and sociologist.    Once agencies have turned all their information over, the review board has 180 days to investigate and must publish its findings within 14 days after the investigation concludes.\nThe act also establishes eminent domain over any technology of unknown origin or biological remains from nonhuman intelligence. In other words, if aliens land in your backyard, you don’t get to keep them or their flying saucer.\nNow is a good time to contact your Congress[wo]man and Senators to urge that the the UAP [UFO] Disclosure Act of 2023 and the National Defense Authorization Bill (NDAA) of 2023 be passed and monitored after becoming law.\nRichard Boylan, Ph.D., Councillor\nwww,drboylan.com #UFOTwitter", "media": null, "score": 1201, "upvote_ratio": 0.97, "comment_count": 178, "over_18": false}, "7": {"id": "16u1amf", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "Basic_Bichette", "link_flair_text": "Update", "time": 1696041402.8548856, "created_utc": 1695861142.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16u1amf/baby_precious_murdered_infant_discovered_in/", "title": "\"Baby Precious\", murdered infant discovered in Portland, Oregon in 2013, identified as Baby Amara; father arrested", "permalink": "/r/UnresolvedMysteries/comments/16u1amf/baby_precious_murdered_infant_discovered_in/", "selftext": "Here's an awful horrible one I haven't seen on this subreddit; all the warnings on this one.\nOn May 28, 2013 workers at a recycling centre on Swan Island in Portland, Oregon discovered the body of a newborn baby girl on a conveyer belt. An autopsy confirmed the supposition that she had been killed, but despite numerous attempts to identify her the case soon went cold. She was dubbed \"Baby Precious\" and given a funeral.\nIn 2019 Detective Brandon McGuire of the Portland Police Bureau's Cold Case Unit was given the case, with Bode Technology hired to obtain a DNA profile from the remains and perform genetic genealogical research. After three years of work and numerous investigative leads the little girl has now been identified as Baby Amara, after a comparison with an anonymous family member.\nThe bio father and alleged perpetrator is Alnath Omar Oliver of Portland who, while in his forties, allegedly impregnated a 15-year-old child and prevented her from escaping him or even obtaining the most basic prenatal health care during her pregnancy. After he allegedly forced his victim to give birth on the floor of his apartment he took the child away, telling her he was taking her to the hospital; shortly thereafter Amara's remains were discovered at Swan Island. Oliver told investigators that the child had died \"on the way to the hospital\", and that he'd \"placed\" the body in a recycling bin. \nSure, buddy. Sure.\nAlnath Oliver is being charged with two counts of second-degree manslaughter, two counts of first-degree criminal mistreatment, third-degree rape (against the child's mother) and concealing the birth of an infant. Amara's mother was under the impression that the child had been taken to the hospital and adopted out, and was still alive; she is fully cooperating with authorities.\nEdit to add: hospitals in Oregon are designated \"safe haven\" locations, where unwanted newborns can be legally surrendered without the parents being charged. I don't know if the 15-year-old victim realized that, but in her place I might have assumed the child would be fine too. It's just heartbreaking.\nIncidentally, Amara is referred to as \"Amara Oliver\" in some sources not to honour her father but to protect her mother's (and fellow victim's) identity. I'm calling her Baby Amara.\n\nhttps://unidentified-awareness.fandom.com/wiki/Amara_Oliver\nhttps://www.kgw.com/article/news/crime/baby-precious-cold-case-recycling-center-homicide-father-identity/283-f7433203-3c1c-42e2-88fe-dd8c28ea994b\nhttps://nypost.com/2023/09/23/oregon-father-arrested-10-years-after-newborns-body-found-on-recycling-plant-conveyor-belt/\nSorry for the New York Post story, but it condenses about eight other links' info and doesn't contain anything inaccurate.", "media": null, "score": 1413, "upvote_ratio": 0.98, "comment_count": 103, "over_18": false}, "8": {"id": "16th3eh", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "Old-Cut-4197", "link_flair_text": "Adults in their 20s, not teens.", "time": 1696041403.4223835, "created_utc": 1695811195.0, "url": "https://www.tiktok.com/t/ZT8632uKa/", "title": "Officer stops teens for speeding. 14 minutes later, the same officer responds to a call discovering the same teens in a fatal car accident…", "permalink": "/r/MorbidReality/comments/16th3eh/officer_stops_teens_for_speeding_14_minutes_later/", "selftext": "Please remember to drive safe everyone…", "media": {"type": "tiktok.com", "oembed": {"provider_url": "http://www.tiktok.com", "description": "102.7K Likes, 1.7K Comments. TikTok video from True Crime w/ Em (@hiemilynoelle): \"Listening to the cop say \"get home safe\" is sad and chilling. 💔 #LuisCevallos and #AlexisRodriguez #luisfernandocevallos #officerjonnunez #northbergen #northbergenpolice\". alex rodriguez. original sound - True Crime w/ Em.", "title": "True Crime w/ Em on TikTok", "url": "https://www.tiktok.com/t/ZT8632uKa/", "type": "video", "author_name": "True Crime w/ Em", "height": 700, "width": 340, "html": "<iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.tiktok.com%2Fembed%2Fv2%2F7283358300794621226&display_name=tiktok&url=https%3A%2F%2Fwww.tiktok.com%2Ft%2FZT8632uKa%2F&image=https%3A%2F%2Fp16-sign.tiktokcdn-us.com%2Fobj%2Ftos-useast5-p-0068-tx%2F8598c3bd946d41d58506be595566590a_1695789020%3Fx-expires%3D1695981600%26x-signature%3DFurDOdO9q65D50TceBbItO6M9FM%253D&key=2aa3c4d5f3de4f5b9120b660ad850dc9&type=text%2Fhtml&schema=tiktok\" width=\"340\" height=\"700\" scrolling=\"no\" title=\"tiktok embed\" frameborder=\"0\" allow=\"autoplay; fullscreen; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe>", "thumbnail_width": 1080, "version": "1.0", "provider_name": "tiktok", "thumbnail_url": "https://p16-sign.tiktokcdn-us.com/obj/tos-useast5-p-0068-tx/8598c3bd946d41d58506be595566590a_1695789020?x-expires=1695981600&x-signature=FurDOdO9q65D50TceBbItO6M9FM%3D", "thumbnail_height": 1920, "author_url": "https://www.tiktok.com/@hiemilynoelle"}}, "score": 2554, "upvote_ratio": 0.95, "comment_count": 234, "over_18": true}, "9": {"id": "16qlurv", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "jessicamshannon", "link_flair_text": null, "time": 1696041403.6212373, "created_utc": 1695521592.0, "url": "https://imgchest.com/p/9p4n99rm7nq", "title": "Album exploring execution by mechanical garrote, a.k.a. the garrotte vil. This is my first time trying out this particular image hosting site (a necessity since imgur stopped hosting NSFW/NSFL pics) so let me know if you run into problems accessing/viewing the pics or text.", "permalink": "/r/Jessicamshannon/comments/16qlurv/album_exploring_execution_by_mechanical_garrote/", "selftext": "", "media": null, "score": 52, "upvote_ratio": 0.93, "comment_count": 17, "over_18": true}, "10": {"id": "16uinj7", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "StateSideSpoonZ", "link_flair_text": null, "time": 1696041403.8198476, "created_utc": 1695913990.0, "url": "https://i.redd.it/mxgizxozi0rb1.jpg", "title": "Music Heard On The Dark Side Of The Moon", "permalink": "/r/UrbanMyths/comments/16uinj7/music_heard_on_the_dark_side_of_the_moon/", "selftext": "", "media": null, "score": 9, "upvote_ratio": 0.8, "comment_count": 2, "over_18": true}, "11": {"id": "16u1dzq", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "fanfictionmusiclover", "link_flair_text": "Psychic Phenomena", "time": 1696041404.0538218, "created_utc": 1695861383.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/16u1dzq/mangoes/", "title": "Mangoes", "permalink": "/r/Thetruthishere/comments/16u1dzq/mangoes/", "selftext": "I don't know if this is the right flare to use but it's a very weird series event!\nHere's the timeline of events; on Sunday night I dreamed that I was eating mangoes with my sister.   \nMonday morning, I started having a mild allergic reaction to something because my eyes were itching and I was sneezing the entire day.  Dad says he is planning to buy dried mangoes to add to our cereal around October just for fun if the price isn't too high.  \nMonday late evening, I'm at evening/night school sitting in Programming (Theory) class while also working on a year-long essay about AI on my school computer while my eyes are feeling terrible since stepping foot on the school grounds at 8 pm and it was now 10 pm. My eyes start to water and they're so red, so i turn to open Facebook to ask my mum if I could do something to alleviate this pain when my computer gets an alert; \"High Pollen In Your Area, 75% Take Caution Beware Of Allergic Reactions\". I press the alert for more information because I'm slowly panicking, I've been allergic to pollen since I was a baby, it's an allergy that has stuck by me for 24 years! My town is in the red-orange part and my area is surrounded by farms! I checked and mango and grass pollen is on the rise, mango pollen at 70% and grass at 5%. I text my mum and she advises me to when i return home to wash my eyes. I do that.  \nTuesday morning 7 am wake up from the feeling of my eyes being on fire, I go to the bathroom to see the white part of the iris being pinkish red and my under eyelid also red. Wash my face and put some eyedrops and go back to bed. I dream about mangoes again! This time I'm cutting pieces to feed my dream daughter.  \nThroughout Tuesday the word mangoes and the fruit appeared on my TikTok For You Page at least seven times, my sister's best friends visited and one of them was eating Greek Yogurt with mango pieces in it. While my sister as she was getting ready she asked for a lip balm and her other best friend had one that was...you guessed it...mango flavoured!  \nAfter they left I went to spend some time with my aunt who was watching a trivia game on the TV and the word was mango. We also played a trivia game and mango came up twice. I'm painting my nails while hanging out with her and I want to put on some hand cream and she gives me one that had a mango scent.  \nIt's Wednesday, today, and I heard the word mangoes three times before 6 p.m. I'm in class again and I decided to check the pollen levels because my eyes still feel itchy and sore, still in the 75% but now you can add ambrosia the plant to the mix that is responsible for the pollen levels.  \nAnnoyed I decided to google ambrosia plant farms and mango farms in my area came up with a big fat nothing! None of those are native to my country or area.  \nI have had a few times in my life mangoes but mostly the dried and sugar-added ones. I'm not a huge fan to say that I have been craving them.  \nWhy am I hearing about mangoes so much? Is the universe trying to tell me something? Or is it a coincidence? I haven't heard a word this much in my life! Thoughts?", "media": null, "score": 16, "upvote_ratio": 0.73, "comment_count": 16, "over_18": false}, "12": {"id": "16t9o8w", "locked": false, "subreddit": "letsnotmeet", "stickied": true, "category": "Paranormal", "author": "fortunesoulx", "link_flair_text": "Mod Post", "time": 1696041404.2551508, "created_utc": 1695785825.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/16t9o8w/human_trafficking_facts_and_stats/", "title": "Human Trafficking Facts and Stats", "permalink": "/r/LetsNotMeet/comments/16t9o8w/human_trafficking_facts_and_stats/", "selftext": "Hi, everyone. Due to the nature of this subreddit and because it's a hot button topic on social media in general, we receive a lot of posts and comments about encounters being possible human trafficking.\nUnfortunately, there is a massive amount of misinformation about what human trafficking is and isn't, and the vast majority of these interactions here in this subreddit and elsewhere on social media are not how trafficking typically occurs.\nWhat is human trafficking, anyway?\nHuman trafficking is the movement of people through coercion, deception, force and any combination of those three, for exploitative sex, labor, or both. Human trafficking DOES NOT usually occur by spotting some girl alone out and about, following her and kidnapping her or \"tagging\" her to kidnap later. For sex trafficking in particular, the people trafficked almost always know and often times love or trust the person that trafficked them. \nHuman trafficking is, disgustingly, a business, and it'd be bad for business to grab some random girl that might have a rich family to look for her, and to do so in front of witnesses. While there have been a few cases of trafficking that have occurred that way (it's sensational and scary, or we wouldn't know about it), it is by far the exception and not the rule. You are more likely to be trafficked by a romantic partner than anyone else.\nHow it happens\n\"The most pervasive myth about human trafficking is that it often involves kidnapping or physically forcing someone into a situation. In reality, most traffickers use psychological means such as, tricking, defrauding, manipulating or threatening victims into providing commercial sex or exploitative labor. Another myth is that traffickers target victims they don't know. Many survivors have been trafficked by romantic partners, including spouses, and by family members, including parents.\" - Polaris Project\n\"Perpetrators of human trafficking span all racial, ethnic, and gender demographics and are as diverse as survivors. Some use their privilege, wealth, and power as a means of control while others experience the same socio-economic oppression as their victims. They include individuals, business owners, members of a gang or network, parents or family members of victims, intimate partners, owners of farms or restaurants, and powerful corporate executives and government representatives.\" - Polaris Project\nRecent Statistics\nBased on data* from the 2021 National Report by The Human Trafficking Hotline:\n\n\n72% of trafficking is for sex, 10% is for forced labor, 4% is for both sex and labor, with the remaining 14% being for unspecified purposes.\n\n\n62% of sex trafficking victims are adults, 28% are minors. In some cases, demographic information is not provided to the hotline, which is why the percentage here doesn't add up to 100%.\n\n\n84% of sex trafficking victims are female, 8% are male, with the remaining 8% having another gender identity, defined as someone who identifies as any identity other than cisgender male or female.\n\n\nIn the vast majority of cases (33%), the country of origin of victims was unknown. When the country of origin was known, the majority of victims were US citizens. \n*note: this data is all from substantiated tips received by the hotline from January 1, 2021 until December 31, 2021, the vast majority of which came from victims themselves. \nAdditional Info & Sources\nFor more information, please visit Polaris Project, a wonderful resource for information about human trafficking and ways to help if you are interested, or The Human Trafficking Hotline, which keeps one of the most extensive data sets on human trafficking in the United States.\nIf you believe you or someone you know is a victim of human trafficking, you can also call +18883737888 (open 24/7) to make a report (this is a United States number, if you suspect human trafficking in another country, please refer to your country’s national human trafficking hotline).\nYou can also text 233733 with HELP or INFO to get more information or to report suspected human trafficking in the United States.\nHere is a story from this exact subreddit that we approved with verification that describes OP's experience.\nAny misinformation about trafficking in this thread will result in it being locked.  Any off topic comments will be removed.", "media": null, "score": 204, "upvote_ratio": 0.97, "comment_count": 20, "over_18": true}, "13": {"id": "16v72hp", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "Turtlesquadz", "link_flair_text": null, "time": 1696041404.4733377, "created_utc": 1695980287.0, "url": "https://youtu.be/uk3oc2vmiWk?si=FjjQEYyvJo7KUVa_", "title": "Dubbed the babysitter killer, A serial killer in the 1960s-1970s killed multiple children and would neatly lay their bodies around town (bathed & cleaned). At least 4 victims are believed to be linked to him, all around Oakland. He was never been caught/confidently identified.", "permalink": "/r/MorbidHistory/comments/16v72hp/dubbed_the_babysitter_killer_a_serial_killer_in/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The serial killer who still hasn't been caught.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/uk3oc2vmiWk?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The serial killer who still hasn&#39;t been caught.\"></iframe>", "author_name": "Late Night Ashes", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/uk3oc2vmiWk/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@LateNightAshes"}}, "score": 10, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "14": {"id": "16do2su", "locked": false, "subreddit": "crimescene", "stickied": false, "category": "Crime", "author": "vaughndag", "link_flair_text": "MURDER", "time": 1696041404.6910918, "created_utc": 1694211414.0, "url": "https://www.reddit.com/r/CrimeScene/comments/16do2su/removed_by_reddit/", "title": "[ Removed by Reddit ]", "permalink": "/r/CrimeScene/comments/16do2su/removed_by_reddit/", "selftext": "[ Removed by Reddit on account of violating the content policy. ]", "media": null, "score": 545, "upvote_ratio": 0.98, "comment_count": 53, "over_18": true}, "15": {"id": "16rrlvy", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "x14157", "link_flair_text": null, "time": 1696041404.8848243, "created_utc": 1695647341.0, "url": "https://i.redd.it/ye7503x3ieqb1.jpg", "title": "In the fall of 1930, 16-year-old Alice Woltman was attacked in her family’s South Bend, Indiana home. Despite sharing her bedroom with three siblings, Alice’s killer slit her throat without waking a single person. Sadly her case remains unsolved.", "permalink": "/r/truecreepy/comments/16rrlvy/in_the_fall_of_1930_16yearold_alice_woltman_was/", "selftext": "", "media": null, "score": 39, "upvote_ratio": 0.99, "comment_count": 2, "over_18": false}, "16": {"id": "16qfoi7", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "clumsyprincess", "link_flair_text": null, "time": 1696041405.0988216, "created_utc": 1695504166.0, "url": "https://www.reddit.com/r/threekings/comments/16qfoi7/how_soon_is_too_soon_for_the_shoebox_telephone/", "title": "How soon is too soon for the shoebox telephone?", "permalink": "/r/threekings/comments/16qfoi7/how_soon_is_too_soon_for_the_shoebox_telephone/", "selftext": "My grandfather passed away today very suddenly. I would have loved to speak to him one last time. I would like to try the shoebox telephone to try and communicate with him. I’m wondering if it’s okay to try this very soon after his passing or if I should wait to let things settle down spiritually.", "media": null, "score": 7, "upvote_ratio": 0.9, "comment_count": 1, "over_18": false}, "17": {"id": "16qpngn", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Creative_Skirt9150", "link_flair_text": null, "time": 1696041406.0483687, "created_utc": 1695534338.0, "url": "https://v.redd.it/611udxo365qb1", "title": "Ghost caught on camera when  the video wasn't about ghosts", "permalink": "/r/Ghosts/comments/16qpngn/ghost_caught_on_camera_when_the_video_wasnt_about/", "selftext": "Watch the wall behind the guy on the bottom screen ", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/611udxo365qb1/DASH_480.mp4?source=fallback", "height": 480, "width": 532, "scrubber_media_url": "https://v.redd.it/611udxo365qb1/DASH_96.mp4", "dash_url": "https://v.redd.it/611udxo365qb1/DASHPlaylist.mpd?a=1698633405%2CNjE1ODM4YWMyZDVmY2QxNDc5ODVmNGJhNjE5OTc3OTE1Yzk5MTVjZTg0YjY4NWMxNGFkODkzNzExNTc0ZDIyMQ%3D%3D&v=1&f=sd", "duration": 43, "hls_url": "https://v.redd.it/611udxo365qb1/HLSPlaylist.m3u8?a=1698633405%2CODZkMjg2M2U2Y2M3NTc1YTk2MDdhYjM4ZTlhZWU3ODdkODhmMTc0ZDZjYjM0Y2IyNGQ2ZDg1YjFmMDM1YmZlZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2767, "upvote_ratio": 0.96, "comment_count": 117, "over_18": false}, "18": {"id": "16qxozk", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "poison_heart96", "link_flair_text": "Glitch Pic", "time": 1696041406.3782654, "created_utc": 1695561869.0, "url": "https://i.redd.it/np28xs9vf7qb1.png", "title": "The Developers Are Checking In On Us", "permalink": "/r/GlitchInTheMatrix/comments/16qxozk/the_developers_are_checking_in_on_us/", "selftext": "", "media": null, "score": 113, "upvote_ratio": 0.94, "comment_count": 13, "over_18": false}, "19": {"id": "16qbcf3", "locked": true, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "arihasbigdenergy", "link_flair_text": "shitpost", "time": 1696041407.0572724, "created_utc": 1695493074.0, "url": "https://i.redd.it/tyv1awier1qb1.jpg", "title": "It’s a valid question…", "permalink": "/r/bigfoot/comments/16qbcf3/its_a_valid_question/", "selftext": "", "media": null, "score": 525, "upvote_ratio": 0.93, "comment_count": 113, "over_18": false}, "20": {"id": "16qzi3e", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "CollarLimp3852", "link_flair_text": "Discussion ", "time": 1696041407.845976, "created_utc": 1695566826.0, "url": "https://www.reddit.com/gallery/16qzi3e", "title": "I know these are fake, but these Utahraptor pics are actually Fu@#$ing terrifying.", "permalink": "/r/Cryptozoology/comments/16qzi3e/i_know_these_are_fake_but_these_utahraptor_pics/", "selftext": "https://twitter.com/Archesuchus/status/1705078448518045713?t=3BiZFj6V7xL64Sf9FwXs3w&s=19\nAnd I thought bigfoot and dogmen were bad enough. Now there's a feathered hellspawn", "media": null, "score": 351, "upvote_ratio": 0.91, "comment_count": 86, "over_18": false}, "21": {"id": "16u5fm0", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "ScaryScience09", "link_flair_text": "Possible abduction", "time": 1696041408.2094793, "created_utc": 1695872445.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/16u5fm0/my_parents_strange_encounter_in_1990/", "title": "My parents strange encounter in 1990", "permalink": "/r/Humanoidencounters/comments/16u5fm0/my_parents_strange_encounter_in_1990/", "selftext": "My parents have told this story to me numerous times throughout my life and both of them and my older brother corroborate this story in exact detail. They seem genuinely terrified of what happened and they have told very few people about this experience.\nIn the summer of 1990 my Mom (31), Dad (35) and brother (15) attended an Aerosmith concert in Ohio. After the concert the 3 of them were walking to the parking lot in a huge crowd of people. My parents were standing on one side of the street about to step off the curb when they saw 2 hooded figures across the street. By the time their foot hit the pavement the figures were directly in front of them. They seemed to float without feet and moved from one side of the street to the other in an instant.\nThe next thing they know they are standing alone, not in the exact same place that they were, with their arms outstretched from the elbow palms facing up and their hands and forearms are tingling.\nThey made their way back to the car and no one else was around. The parking lot was empty except for their car. My brother was sitting on the bumper waiting for them and said he had been waiting for them for about 2 hours. My parents have no recollection of what happened during that 2 hour period. My brother says that he was walking and he turned around and they were gone and he just went back to the car and waited.\n2 weeks after this incident my mom finds out that she is pregnant with me. They believe this may be the reason they were approached.\nI personally have never experienced anything unexplainable like this but I do believe their story. I have never known them to make things up and they are not psychotic. They believe this encounter was some kind of extraterrestrial being. I believe their experience was genuine but I’m not certain that aliens are the explanation but I’m also not ruling it out.\nThis happened in a post concert crowd with hundreds of people around. Has anyone had a similar experience or any insight on what could have happened to them?\nUpdate: For those of you saying they were dosed, I agree that this is strong possibility but I am not aware of any drug that can cause this. I shared this to r/psychonauts to see if they have any input. I’ll update if I get any traction there.", "media": null, "score": 506, "upvote_ratio": 0.97, "comment_count": 152, "over_18": false}, "22": {"id": "16ridbz", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "BlueDragonfire_", "link_flair_text": null, "time": 1696041408.9622035, "created_utc": 1695616047.0, "url": "https://i.redd.it/jgksbx62xbqb1.jpg", "title": "Cuddly cryptid", "permalink": "/r/cryptids/comments/16ridbz/cuddly_cryptid/", "selftext": "I bought this mystery pin yesterday. I know what all the cryptids are except the one I got. Please help me id the pin I got. Tia", "media": null, "score": 144, "upvote_ratio": 0.97, "comment_count": 26, "over_18": false}, "23": {"id": "16tmk3b", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Lordquas187", "link_flair_text": null, "time": 1696041410.174948, "created_utc": 1695826035.0, "url": "https://www.reddit.com/r/conspiracy/comments/16tmk3b/am_i_the_only_person_that_remembers_am_i/", "title": "Am I the only person that remembers? Am I completely misremembering?", "permalink": "/r/conspiracy/comments/16tmk3b/am_i_the_only_person_that_remembers_am_i/", "selftext": "I've been in multiple spats with people over the years over this. As I remember it, Hillary Clinton conspired with the DNC to rob Bernie Sanders of the Democratic nomination. Bernie won largely in most of the states, and then in the state (I forget which exactly) that would make or break the nomination, he won, but the Democratic reps of that state went against the public's vote (as I believe they technically can legally do) and voted Hillary in instead. \nThis was heavily covered in her leaked emails. It's why we got Trump as president, because America couldn't stand the idea of that crazy bitch being in charge of us. In a long and somewhat indirect way, it's way the left is so annoying and whiny to this day, and if you doubt a single decision made on that side, you're labeled a Trump supporter. I can't even say something negative about Hillary these days (I've always hated her, her vibes have always been so Purge-y) without insane backlash about how she's great and again, I'm apparently a Trump supporter. It seemed like people forgot almost immediately about the nomination theft, but nowadays, they have forgotten that she's always been a piece of shit.\nSomebody tell me I mostly got this right, or if not, please correct me because I feel like I'm losing my mind.", "media": null, "score": 2149, "upvote_ratio": 0.85, "comment_count": 814, "over_18": false}, "24": {"id": "16qk60c", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Affectionate_Bet_793", "link_flair_text": null, "time": 1696041410.5281093, "created_utc": 1695516427.0, "url": "https://odysee.com/@AlienTom:f/Joe-Biden%27s-HIT-Rap-Song-about-his-grandma-and-guns.-Grandma-Said-Spread-Em%2C-Ghost-Guns!:3?r=EWpf5QAbLFCP4cVuB5YscvEDn4PFZDwt", "title": "Joe Biden's rap song about his sexy grandma. \"Grandma Said Spread It\"", "permalink": "/r/conspiracyfact/comments/16qk60c/joe_bidens_rap_song_about_his_sexy_grandma/", "selftext": "", "media": {"type": "odysee.com", "oembed": {"provider_url": "https://odysee.com", "description": "WEBSITE https://sites.google.com/view/alientom/home", "title": "Joe Biden's rap song about his grandma and guns. \"Grandma Said Spread It. Ghost Guns!\"", "type": "video", "author_name": "ALIEN TOM", "height": 315, "width": 560, "html": "<iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fodysee.com%2F%2524%2Fembed%2F%2540AlienTom%253Af%252FJoe-Biden%2527s-HIT-Rap-Song-about-his-grandma-and-guns.-Grandma-Said-Spread-Em%252C-Ghost-Guns%21%253A3%3Fr%3DEWpf5QAbLFCP4cVuB5YscvEDn4PFZDwt&display_name=Odysee&url=https%3A%2F%2Fodysee.com%2F%40AlienTom%3Af%2FJoe-Biden%2527s-HIT-Rap-Song-about-his-grandma-and-guns.-Grandma-Said-Spread-Em%252C-Ghost-Guns%21%3A3%3Fr%3DEWpf5QAbLFCP4cVuB5YscvEDn4PFZDwt&image=https%3A%2F%2Fthumbnails.odycdn.com%2Fcard%2Fs%3A1280%3A720%2Fquality%3A85%2Fplain%2Fhttps%3A%2F%2Fthumbs.odycdn.com%2F15a8538db0824b82995ffdeb191df570.webp&key=2aa3c4d5f3de4f5b9120b660ad850dc9&type=text%2Fhtml&schema=odysee\" width=\"560\" height=\"315\" scrolling=\"no\" title=\"Odysee embed\" frameborder=\"0\" allow=\"autoplay; fullscreen; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe>", "thumbnail_width": 1280, "version": "1.0", "provider_name": "Odysee", "thumbnail_url": "https://thumbnails.odycdn.com/card/s:1280:720/quality:85/plain/https://thumbs.odycdn.com/15a8538db0824b82995ffdeb191df570.webp", "thumbnail_height": 720, "author_url": "https://odysee.com/@AlienTom:f"}}, "score": 2, "upvote_ratio": 0.6, "comment_count": 0, "over_18": false}, "25": {"id": "16swyfo", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "brats699", "link_flair_text": "Discussion", "time": 1696041412.7868593, "created_utc": 1695755564.0, "url": "https://www.howandwhys.com/2006-chicago-ohare-ufo-sighting-22ft-long-alien-craft-witnessed-by-many/", "title": "At least 22ft long UFO was seen by more than dozens of people at Chicago O’Hare Airport Gate C-17. Could it be the most famous UFO cover-up? And there is an alleged UFO photo. Why it wasn't investigated properly?", "permalink": "/r/ufo/comments/16swyfo/at_least_22ft_long_ufo_was_seen_by_more_than/", "selftext": "", "media": null, "score": 512, "upvote_ratio": 0.91, "comment_count": 257, "over_18": false}, "26": {"id": "16tm1i8", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "xfallensheep", "link_flair_text": "Clipping", "time": 1696041414.3318298, "created_utc": 1695824754.0, "url": "https://v.redd.it/ypyhx4sn5tqb1", "title": "Disturbed John Kirby video", "permalink": "/r/UFOs/comments/16tm1i8/disturbed_john_kirby_video/", "selftext": "Hey guys just sharing this gold video here. I'm afraid that youtube is removing it, I've found just this video alone with only 700 views in youtube, at the time of this interview we had a lot of copies in yt, it all gone. He is clearly disturbed by the question and don't even can finish his \"answer\".", "media": {"reddit_video": {"bitrate_kbps": 450, "fallback_url": "https://v.redd.it/ypyhx4sn5tqb1/DASH_270.mp4?source=fallback", "height": 262, "width": 480, "scrubber_media_url": "https://v.redd.it/ypyhx4sn5tqb1/DASH_96.mp4", "dash_url": "https://v.redd.it/ypyhx4sn5tqb1/DASHPlaylist.mpd?a=1698633413%2CNzlmY2FkNWYxMGI2YjYxZDgzNjY5YTUzNjBiODk2MmU0NDU1OGM2OWU1Y2I3YjRkMDE0ZWM3ZmRmOGFjY2UyNg%3D%3D&v=1&f=sd", "duration": 48, "hls_url": "https://v.redd.it/ypyhx4sn5tqb1/HLSPlaylist.m3u8?a=1698633413%2CZjdmMGNmYjNiZmYzMjlkYzBjYjViM2Q0NjJlYjBmNjQzNGFmMjRmNTZjOGQzODdjNWYwMzM0MzljMWRkM2QyNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3980, "upvote_ratio": 0.89, "comment_count": 806, "over_18": false}, "27": {"id": "16svas8", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Arroz-Con-Culo", "link_flair_text": "Video", "time": 1696041416.1134906, "created_utc": 1695751819.0, "url": "https://x.com/unexplained2020/status/1706711890343108784?s=46", "title": "“We are the Aliens” Apollo 15 Astronaut", "permalink": "/r/aliens/comments/16svas8/we_are_the_aliens_apollo_15_astronaut/", "selftext": "“We came from somewhere else. Go pick a book on ancient Sumerians they will tell you straight out the bat.”\n -Apollo 15 Astronaut", "media": null, "score": 2968, "upvote_ratio": 0.9, "comment_count": 765, "over_18": false}, "28": {"id": "16s3e37", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Article", "time": 1696041416.542104, "created_utc": 1695674719.0, "url": "https://public.substack.com/p/dozens-of-government-ufo-whistleblowers", "title": "Dozens Of Government UFO Whistleblowers Have Given Testimony To Congress, Pentagon, And Inspectors General, Say Sources", "permalink": "/r/UAP/comments/16s3e37/dozens_of_government_ufo_whistleblowers_have/", "selftext": "", "media": null, "score": 260, "upvote_ratio": 0.95, "comment_count": 74, "over_18": false}, "29": {"id": "16tx6zs", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "TheBonesOfAutumn", "link_flair_text": "Update", "time": 1696041417.4403675, "created_utc": 1695851331.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16tx6zs/it_has_just_been_announced_the_remains_of_missing/", "title": "It has just been announced the remains of missing Colorado mom Suzanne Morphew, have been recovered.", "permalink": "/r/UnresolvedMysteries/comments/16tx6zs/it_has_just_been_announced_the_remains_of_missing/", "selftext": "49-year-old Suzanne Morphew was reported missing from her home in Chaffee County, Colorado on Mother’s Day, May 10, 2020, after she never returned home from a bike ride. Her husband, 55-year-old Barry Morphew, was arrested almost a year later on charges including first-degree murder and tampering with physical evidence in connection with his wife's disappearance, however all charges were dropped in April 2022, just days before he was set to stand trial.\nJust moments ago it was announced that Suzanne’s remains have been found. According to CBS, “Investigators were searching in the area of Moffat in Saguache County on an investigation not related to the Morphew disappearance when the remains were discovered.”\nNo arrests have been made as of yet, however the story is still developing. \nSources:\nhttps://www.cbsnews.com/colorado/news/suzanne-morphew-remains-found-colorado-missing-mother-barry-chaffee-county-disappearance/\nhttps://www.foxnews.com/us/remains-colorado-missing-mom-suzanne-morphew-found-three-years-disappearance", "media": null, "score": 1323, "upvote_ratio": 0.98, "comment_count": 266, "over_18": false}, "30": {"id": "16q28kn", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "danceswithronin", "link_flair_text": null, "time": 1696041418.0640595, "created_utc": 1695468931.0, "url": "https://www.msn.com/en-us/news/crime/runaway-teen-girl-shoots-herself-dead-as-cop-tries-to-convince-her-to-return-home/ar-AA1h7PqT?ocid=msedgntp&cvid=8d1d77cb751144e9923f00debebb557c&ei=17", "title": "Fourteen-year-old runaway shoots herself dead as cop tries to convince her to return home in Aurora, Kansas.", "permalink": "/r/MorbidReality/comments/16q28kn/fourteenyearold_runaway_shoots_herself_dead_as/", "selftext": "", "media": null, "score": 2550, "upvote_ratio": 0.99, "comment_count": 294, "over_18": true}, "31": {"id": "16pw4jn", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "CatPooedInMyShoe", "link_flair_text": null, "time": 1696041418.2687697, "created_utc": 1695447202.0, "url": "https://i.redd.it/ptqmthczyxpb1.jpg", "title": "Erwin Heilbronner, a German-Jewish soldier in World War I, in 1917. He was awarded the Iron Cross but it did not save him. Heilbronner and his wife died in Auschwitz in 1942.", "permalink": "/r/Jessicamshannon/comments/16pw4jn/erwin_heilbronner_a_germanjewish_soldier_in_world/", "selftext": "", "media": null, "score": 42, "upvote_ratio": 0.94, "comment_count": 3, "over_18": true}, "32": {"id": "16rt9e6", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "happypants69", "link_flair_text": null, "time": 1696041418.4724605, "created_utc": 1695651218.0, "url": "https://www.youtube.com/shorts/hXw7aEV3gio", "title": "A Rare Golden Langur - Sacred Monkey From Heaven According To Legend. Researchers Have Said That This Species Works Hard To Avoid Human Interaction, Making Them Extremely Difficult To Observe In The Wild.", "permalink": "/r/UrbanMyths/comments/16rt9e6/a_rare_golden_langur_sacred_monkey_from_heaven/", "selftext": "", "media": null, "score": 9, "upvote_ratio": 1.0, "comment_count": 2, "over_18": true}, "33": {"id": "16tzxe8", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "LuneriaNight", "link_flair_text": "Discussion/Advice", "time": 1696041418.6872785, "created_utc": 1695857662.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/16tzxe8/spirit_and_entities/", "title": "Spirit and Entities", "permalink": "/r/Thetruthishere/comments/16tzxe8/spirit_and_entities/", "selftext": "English is not my first language so please bare with me. \nI (26F) used to stay at my friend's (35F) house in Alabang, here in the Philippines since I am currently working on a different city from my place. The first time I stayed there, I'm always having headaches and it feels like the energy in the house is heavy. I didn't mind it at first but things got more worse than I expected.\nI never experienced any of this from any other place, it all started there. \nI always sleep on the bed with my friend then it always feels like someone is watching me. I always shrugged off that feeling at first then I keep on seeing a woman with a long hair and white dress watching me sleep. I always wake up at 3am and it scares the sh*t out of me. I ignored it at first but one time I woke up and she was beside the bed, standing and when I checked her face, her head is crooked and she was looking at me. I immediately shook my friend to wake her up and she was not there anymore. \nI keep on seeing her and even had a nightmare about it so I got used to it. I asked my friend since I keep on getting headaches whenever I walk the hall beside the stairs and that's when she told me the story of the house.\nThe last owner of the house hang herself up in the second floor and I got chills after hearing that stories. I even told her to get rid of the doll facing the stairs that leads to that room. \nSince I got used to her, I just always try to ignore her when she's there. \nThen one time, I was preparing my coffee at 3AM and if I don't walk on the hallway beside the stairs to go to the kitchen, I had to go around the dining area with a big mirror on it. Like the mirror that you have on a dance studio or a ballet studio. I'm done with my coffee so I decided to go back to our room, when I was walking back to our room, I was looking outside and I saw a black figure besides the pool with a yellow glowing eyes. We were staring at each other for like 15 secs because I want to make sure that what I'm seeing was real and I was frozen on what I saw. I walked and acted normally when I went back to the room, I decided to wake up my friend and I was shaking.\nThis was before I experienced this https://reddit.com/r/Ghoststories/s/biGYGZeLpq at my ex boyfriend's house.\nSo yeah, that's when it all started. So whenever I'm in a different house or different place I always choose to go home instead of staying on a unfamiliar place.", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "34": {"id": "16qxf44", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "edamamekid", "link_flair_text": null, "time": 1696041418.886875, "created_utc": 1695561055.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/16qxf44/could_someone_please_help_explain_this_weird/", "title": "Could someone please help explain this weird intruder behaviour?", "permalink": "/r/LetsNotMeet/comments/16qxf44/could_someone_please_help_explain_this_weird/", "selftext": "I’ll post the whole story for context. \nLast night I got home from work at about midnight, and went to bed. I asked my partner to check the door before we went to bed because we live in a council block and just want to be safe. \nMy flatmate works at a nightclub, and she got back at around 5-7am I’m guessing. I think she didn’t close the door properly, she has done this before, and this is how the intruder got in. \nI woke up at about 8am and heard the bathroom door opening and shutting, the toilet seat opening and closing. We don’t get on with our other flatmates and they argue with us whenever we talk to them (lol) so I assumed it was one of them in a bad mood. The thing that really panicked me was when our bedroom door was opened, and when I said ‘hello’ the door quickly shut. It was very frantically opened. \nWhen my partner got dressed and went to the kitchen, we heard the front door close - the person left. Nothing had been taken but the storage cupboard door was open and toilet roll packaging was pulled out onto the bathroom floor. \nUpon speaking to my flatmates, one person was out and the other person who came home from work was asleep, so it was an intruder. \nWhy would they be opening and shutting  stuff in our bathroom? Really very disturbed by this. \nthanks", "media": null, "score": 96, "upvote_ratio": 0.96, "comment_count": 27, "over_18": true}, "35": {"id": "16v9f7d", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "CryptoWiz99", "link_flair_text": null, "time": 1696041419.1192968, "created_utc": 1695988048.0, "url": "https://youtube.com/watch?v=cyXb_tYeLwk&si=MBLN-phXx8hhDb90", "title": "Apartheid 20th Century Slavery 1971 UN Documentary Report on South Africa", "permalink": "/r/MorbidHistory/comments/16v9f7d/apartheid_20th_century_slavery_1971_un/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Apartheid 20th Century Slavery 1971 UN Documentary Report on South Africa", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/cyXb_tYeLwk?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Apartheid 20th Century Slavery 1971 UN Documentary Report on South Africa\"></iframe>", "author_name": "Marvelous Movies", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/cyXb_tYeLwk/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@Marvelous_Movies"}}, "score": 6, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "36": {"id": "16vabdx", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "sasbergers", "link_flair_text": null, "time": 1696041419.6232247, "created_utc": 1695990506.0, "url": "https://www.youtube.com/watch?v=WJYmHU5oywQ", "title": "The unsolved Hinterkaifeck Murders, in which six inhabitants of a small Bavarian farmstead were decapitated. Days before the murders, they had noticed tracks in the snow leading to the farm, but, oddly, no footprints leading out of the farm. Sounds were also heard in the attic that night.", "permalink": "/r/truecreepy/comments/16vabdx/the_unsolved_hinterkaifeck_murders_in_which_six/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Unsolved: The Mysterious Hinterkaifeck Murders Feat. Edina Pasic", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/WJYmHU5oywQ?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Unsolved: The Mysterious Hinterkaifeck Murders Feat. Edina Pasic\"></iframe>", "author_name": "The Strangest", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/WJYmHU5oywQ/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@TheStrangest"}}, "score": 14, "upvote_ratio": 0.89, "comment_count": 1, "over_18": false}, "37": {"id": "16tdsps", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "thefemcelbreeder", "link_flair_text": null, "time": 1696041419.796573, "created_utc": 1695798805.0, "url": "https://www.reddit.com/r/threekings/comments/16tdsps/what_are_your_recommend_youtubers_for_this_kind/", "title": "What are your recommend youtubers for this kind of topic?", "permalink": "/r/threekings/comments/16tdsps/what_are_your_recommend_youtubers_for_this_kind/", "selftext": "body text", "media": null, "score": 5, "upvote_ratio": 0.86, "comment_count": 3, "over_18": false}, "38": {"id": "16s98je", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Southern_Nature_5416", "link_flair_text": null, "time": 1696041421.0658305, "created_utc": 1695689048.0, "url": "https://www.reddit.com/r/Ghosts/comments/16s98je/i_think_my_dog_gets_in_bed_each_night_husband/", "title": "I think my dog gets in bed each night, husband thinks I'm crazy.", "permalink": "/r/Ghosts/comments/16s98je/i_think_my_dog_gets_in_bed_each_night_husband/", "selftext": "(On mobile, sorry for bad formatting)\nMy dog developed a fast growing cancer during the Holidays in 2021. We had no other option based on his age and health to put him down right before new years. He always used to sleep in bed with me, and I would always know it was him getting on the bed by the way my legs would dip as he put his weight on the mattress. Lately I am feeling this happen at night, a lot. I told my husband and he thinks I'm crazy. Think my dog could still be chillin at the foot of my bed each night?", "media": null, "score": 896, "upvote_ratio": 0.97, "comment_count": 193, "over_18": false}, "39": {"id": "16scns7", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "chese_sheep", "link_flair_text": "Glitch Vid", "time": 1696041421.5143569, "created_utc": 1695698578.0, "url": "https://v.redd.it/gq7700ffqiqb1", "title": "bros laggy", "permalink": "/r/GlitchInTheMatrix/comments/16scns7/bros_laggy/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/gq7700ffqiqb1/DASH_360.mp4?source=fallback", "height": 640, "width": 360, "scrubber_media_url": "https://v.redd.it/gq7700ffqiqb1/DASH_96.mp4", "dash_url": "https://v.redd.it/gq7700ffqiqb1/DASHPlaylist.mpd?a=1698633421%2COTdkZWUxOTA5MGU4MDU5YTFmM2U2ZGZhYjlkMDk4MWU0ZTc0MjZhMTJmMjA4ZDNjY2FiNDhjYjU5Njg4OWNmOA%3D%3D&v=1&f=sd", "duration": 5, "hls_url": "https://v.redd.it/gq7700ffqiqb1/HLSPlaylist.m3u8?a=1698633421%2CMWYxZDA1ZjI5MjlmYjBmOWMyZGE5MDU1NmM3Y2M5OTg5YzQwNDEzNjUzNTFmNjZlMWRlOTE2NmRkNDcxM2MyMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 81, "upvote_ratio": 0.9, "comment_count": 10, "over_18": false}, "40": {"id": "16v1vjs", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Jean_Claude_Van_Darn", "link_flair_text": null, "time": 1696041422.2203052, "created_utc": 1695961576.0, "url": "https://i.redd.it/bfwcmj3ig4rb1.jpg", "title": "What’s the Worst “evidence” you’ve seen for Bigfoot?", "permalink": "/r/bigfoot/comments/16v1vjs/whats_the_worst_evidence_youve_seen_for_bigfoot/", "selftext": "Thought it would be fun to post some bad evidence.", "media": null, "score": 227, "upvote_ratio": 0.96, "comment_count": 149, "over_18": false}, "41": {"id": "16t2yme", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Geoconyxdiablus", "link_flair_text": "Discussion ", "time": 1696041423.1868303, "created_utc": 1695768797.0, "url": "https://www.reddit.com/gallery/16t2yme", "title": "For some reason, I am obsessed today with the Raystown Ray, one of the many municipal lake cryptids of the US, and how despite being called a Ray, the creature isn't depicted as as any kind of Batoid at all. Such a thing really annoys me even though it has no reason to.", "permalink": "/r/Cryptozoology/comments/16t2yme/for_some_reason_i_am_obsessed_today_with_the/", "selftext": "", "media": null, "score": 153, "upvote_ratio": 0.94, "comment_count": 19, "over_18": false}, "42": {"id": "16siasc", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Young_oka", "link_flair_text": "Possible abduction", "time": 1696041423.455657, "created_utc": 1695718205.0, "url": "https://v.redd.it/q9udlt4uckqb1", "title": "An ai recreation of my experience (edit with date and location)", "permalink": "/r/Humanoidencounters/comments/16siasc/an_ai_recreation_of_my_experience_edit_with_date/", "selftext": "So I saw something that looked like this during strange sleep paralysis once, and I figured I should use my skills to tell yall what happened\nIt was 2019 in east Texas \nI was 20 at the time\nI was laying in my bed beside my girlfriend when I wake up and look toward the see something vary similar to this, standing In the doorway, I start sitting up at this point (completely able to move) and about that time it rushes at me, and it like hopped like a cricket in 3 long steps\nAnd as it gets over to me I punch it in the face, I felt it's skin, it kinda felt like a mushroom, as my fist made contact with it, there was a bright white flash, and I wake up again laying perfectly straight flat on my back in my bed (not how I sleep at all),\nHere is my exact description of what I saw (to illustrate how much the ai recreation differs in appearance)\nI think had reverse jointed legs, I couldn't see its feet because it was dark , human like thighs \nIt had praying mantis like arms were tipped by four long fingers\nIt looked like it was emaciated because I could see it's skeleton (I do not recall seeing its muscles move) (maybe an exoskeleton) \nIt's skin was a greenish gray that almost looked see-through\nI had a big elongated head kinda of like a xenomorph or pumpkin head for you horror movie fans out there\nIt's eyes wrapped around it's head big and were glossy almost like obsidian, no eyelids. \nIt's head kind of looked like a wasp \nSo yeah just figured I'd share,  please let me know what you think\nEdit: Sorry for the re upload", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/q9udlt4uckqb1/DASH_720.mp4?source=fallback", "height": 1038, "width": 720, "scrubber_media_url": "https://v.redd.it/q9udlt4uckqb1/DASH_96.mp4", "dash_url": "https://v.redd.it/q9udlt4uckqb1/DASHPlaylist.mpd?a=1698633423%2CNDJiZTMxZTc2YjVmYzBkZjliMjdkMjlhZDQ4ZDdkN2E4Yzg3MzNiM2ZlOTdiZjliMTY5NjQ5ZTdhYTE0NmFmOA%3D%3D&v=1&f=sd", "duration": 14, "hls_url": "https://v.redd.it/q9udlt4uckqb1/HLSPlaylist.m3u8?a=1698633423%2CNDc0MmI4NTBmODc3OWIzOTEyZjhkNWUzMDcwMDI4MGJlMzFkYjhjMzlmZmFhOTE2YTY0NDQ1MGEwOGZiYTIwYQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 327, "upvote_ratio": 0.91, "comment_count": 79, "over_18": false}, "43": {"id": "16uocnf", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "dukecityzombie", "link_flair_text": null, "time": 1696041424.5348241, "created_utc": 1695927602.0, "url": "https://i.redd.it/0xwjl07hn1rb1.jpg", "title": "Extinct Quoll Caught in Australia", "permalink": "/r/cryptids/comments/16uocnf/extinct_quoll_caught_in_australia/", "selftext": "Does this mean there is still hope for the thylacine?\nhttps://www.newsweek.com/spotted-tail-quoll-assumed-extinct-seen-south-australia-1830573?amp=1", "media": null, "score": 139, "upvote_ratio": 0.97, "comment_count": 6, "over_18": false}, "44": {"id": "16sr3ow", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "PepeLives00", "link_flair_text": null, "time": 1696041425.74734, "created_utc": 1695742169.0, "url": "https://i.imgur.com/wkNEi60.jpg", "title": "Let’s pretend this is normal", "permalink": "/r/conspiracy/comments/16sr3ow/lets_pretend_this_is_normal/", "selftext": "", "media": null, "score": 2085, "upvote_ratio": 0.8, "comment_count": 776, "over_18": false}, "45": {"id": "16t1ez6", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1696041426.0890038, "created_utc": 1695765410.0, "url": "https://youtube.com/live/Rzo4bawhm1A", "title": "Loch Ness Monster vs The Kraken | What's The Bigger Story?", "permalink": "/r/conspiracyfact/comments/16t1ez6/loch_ness_monster_vs_the_kraken_whats_the_bigger/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 0.67, "comment_count": 1, "over_18": false}, "46": {"id": "16tyzx1", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "quetzalcosiris", "link_flair_text": "Discussion", "time": 1696041428.0691645, "created_utc": 1695855429.0, "url": "https://www.usatoday.com/story/entertainment/tv/2023/09/26/encounters-netflix-2023-docuseries/70968349007/", "title": "New Netflix series explores reported UFO 'Encounters'. It couldn't come at a better time. [USA Today]", "permalink": "/r/ufo/comments/16tyzx1/new_netflix_series_explores_reported_ufo/", "selftext": "", "media": null, "score": 436, "upvote_ratio": 0.96, "comment_count": 81, "over_18": false}, "47": {"id": "16r88s4", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "emveetu", "link_flair_text": "Video", "time": 1696041429.6712205, "created_utc": 1695588281.0, "url": "https://v.redd.it/9o09ktthm9qb1", "title": "MUFON #133930 - \"...two unusual elliptical objects resembling UFOs, which exhibited unique flight patterns and disappeared without sound.\"", "permalink": "/r/UFOs/comments/16r88s4/mufon_133930_two_unusual_elliptical_objects/", "selftext": "Details in comments.", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/9o09ktthm9qb1/DASH_720.mp4?source=fallback", "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/9o09ktthm9qb1/DASH_96.mp4", "dash_url": "https://v.redd.it/9o09ktthm9qb1/DASHPlaylist.mpd?a=1698633428%2CMDNjM2FlNGE2ZDYzMWRiMGFlMTFiN2M0YzFmMzcxMDYwMmJlYmJkNGZhMTQ5NmFjNjFmZmY3ZWU1M2M5ZWZkMA%3D%3D&v=1&f=sd", "duration": 78, "hls_url": "https://v.redd.it/9o09ktthm9qb1/HLSPlaylist.m3u8?a=1698633428%2CNzBiNmM1MWNiMzZjOTlkMzQ3OTExMGUzMzljNDAyNTM0ZDhkMjBiZTE1MGFjNWU1NGI2ZjhkZTRiM2EyOTQ2Mw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3575, "upvote_ratio": 0.92, "comment_count": 581, "over_18": false}, "48": {"id": "16r2s1v", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "ReptilianOverlord7", "link_flair_text": "Image 📷", "time": 1696041431.2140348, "created_utc": 1695574880.0, "url": "https://i.redd.it/vcdb3u8gi8qb1.jpg", "title": "Nothing to see in the top middle, a little down, by the edge of earth, if you Zoom in.", "permalink": "/r/aliens/comments/16r2s1v/nothing_to_see_in_the_top_middle_a_little_down_by/", "selftext": "", "media": null, "score": 2810, "upvote_ratio": 0.8, "comment_count": 1036, "over_18": false}, "49": {"id": "16uw94y", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "ilikeover9000turtles", "link_flair_text": null, "time": 1696041431.7398417, "created_utc": 1695945906.0, "url": "https://www.reddit.com/r/UAP/comments/16uw94y/call_to_action_the_house_did_not_include_the_uap/", "title": "Call To Action: The House Did Not Include The UAP Disclosure Act In Their Version Of The NDAA. Call Your Elected Officials NOW, And Report Back", "permalink": "/r/UAP/comments/16uw94y/call_to_action_the_house_did_not_include_the_uap/", "selftext": "The House's version of the FY24 NDAA that was passed, H.R.2670, DOES NOT include the UAP Disclosure Act. \nWhat happens next is called reconciliation, and the UAP Disclosure Act may be negotiated out of the final bill. \nYou need to call all your elected officials, you need to have your friends and family call as well. \nYou need explain that you strongly support the inclusion of the original UAP disclosure act in the final bill. \nPlease do this, and then repeat the calls every couple of weeks if possible, until the final NDAA is passed later this year.\nSample script:\n\"I strongly support government UAP transparency and declassification. I'd like a clear yes or no response, in writing (provide your full name and contact info), as to whether Representative Or Senator XYZ supports the full inclusion of the UAP Disclosure Act in the FY24 National Defense Authorization Act. I absolutely want to see this legislation included in the final bill, intact, and I expect my elected officials to support it, and to encourage their colleagues to support it. I will be paying attention, and I will call back regularly until I receive a clear response from the representative regarding this specific piece of legislation.\"\nCall your representatives and call your two Senators' DC offices, as well as the White House, and tell all of them that you expect them to use their influence to push for the UAPDA's inclusion in the final FY24 NDAA.\nPlease do this before the end of next week! Right now is the time for the public to be very loud in supporting this legislation. It is not a panacea. But if we lose this, it will hurt the momentum around UAP declassification by the US government, and we cannot allow that to happen.\nPlease do this, and then repeat the calls every couple of weeks if possible, until the final NDAA is passed later this year.\nhttps://www.usa.gov/elected-officials\n(call)\nhttps://declassifyuap.org/action/\n(email)", "media": null, "score": 156, "upvote_ratio": 0.91, "comment_count": 47, "over_18": false}, "50": {"id": "16r2lzi", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "Actual_Study_5112", "link_flair_text": "Disappearance", "time": 1696041432.6502247, "created_utc": 1695574484.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16r2lzi/what_happened_to_amy_lynn_bradley/", "title": "What Happened to Amy Lynn Bradley?", "permalink": "/r/UnresolvedMysteries/comments/16r2lzi/what_happened_to_amy_lynn_bradley/", "selftext": "For those who are unfamiliar with this case, here's a quick summary:\nAmy Lynn Bradley disappeared on March 24, 1998. At the time, she and her family were traveling on Royal Caribbean's Rhapsody of the Seas. She and her brother went to a party the night before and returned to their room around 3:30 AM. The two of them hung out on the balcony until around 5:30 AM. For the next 30-60 minutes, her actions are unknown, and her family discovered she was missing between 6:00-6:30 AM. She's never been seen since. \nHere's a link to The Charley Project with more info: https://charleyproject.org/case/amy-lynn-bradley\nI was researching this case for my blog, and I honestly have no idea what happened. From what I've seen, the main theories are that:\n\nshe was murdered and thrown overboard\nshe fell overboard or jumped\nshe was kidnapped/became a victim of human trafficking\n\nIt seems like you can make a case that any of these theories could fit, but there's not enough evidence to definitively say for sure. For example, there were several compelling sightings after Amy disappeared, but none of them have ever been verified. \nObviously, she didn't just vanish into thin air. Something happened to her, and someone knows something. \nWhat do you think happened?", "media": null, "score": 1215, "upvote_ratio": 0.91, "comment_count": 663, "over_18": false}, "51": {"id": "16rito6", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "PlantZenGuy", "link_flair_text": null, "time": 1696041433.2892215, "created_utc": 1695617566.0, "url": "https://www.reddit.com/gallery/16rito6", "title": "45 years ago on this Monday morning, Sept 25th 1978, PSA Flight 182 collided with a private Cessna over San Diego slamming into the ground at 300 mph killing seven San Diegans on the ground, the Cessna's two occupants and all 135 aboard the jet.", "permalink": "/r/MorbidReality/comments/16rito6/45_years_ago_on_this_monday_morning_sept_25th/", "selftext": "My roommate was 15 at he time and attended Saint Augustine high school a few blocks from the crash site. \nHe was outside on the grounds of the school walking at the moment of impact and heard a firecracker sound \nand looked up at the sky and saw PSA plane wing on fire then watched it crash.\nThe gym of his high school instantly turned into a makeshift morgue.\nHe also said four Priests who had gone to give the last rites at the crash site did not return to the school the following semester because they were so traumatized by what they saw. \nMy roommate had nightmares for months after the incident and went to therapy for two years. He said it was very difficult to process and un see what he saw that day at such an early", "media": null, "score": 2534, "upvote_ratio": 0.99, "comment_count": 96, "over_18": true}, "52": {"id": "16vqyxw", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "TDuarte11", "link_flair_text": null, "time": 1696041433.665827, "created_utc": 1696030032.0, "url": "https://www.reddit.com/r/UrbanMyths/comments/16vqyxw/im_living_in_your_walls/", "title": "I'm living in your walls", "permalink": "/r/UrbanMyths/comments/16vqyxw/im_living_in_your_walls/", "selftext": "https://youtube.com/shorts/DVcgMAASmZs?si=jndy4gAb52yVELpG", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 0, "over_18": true}, "53": {"id": "16tuvri", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "SchizoidDreams", "link_flair_text": null, "time": 1696041433.8899298, "created_utc": 1695846016.0, "url": "/r/SleepParalysisStories/comments/16l3wjv/a_hooded_woman_tormented_me_during_sleep_paralysis/", "title": "A hooded woman tormented me during sleep paralysis", "permalink": "/r/Thetruthishere/comments/16tuvri/a_hooded_woman_tormented_me_during_sleep_paralysis/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 3, "over_18": false}, "54": {"id": "16umq3y", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "Mynameis__--__", "link_flair_text": null, "time": 1696041434.32566, "created_utc": 1695923714.0, "url": "https://www.youtube.com/watch?v=fxItHcffd10", "title": "How Abolitionists Put The Body At The Center Of The Fight Against Slavery", "permalink": "/r/MorbidHistory/comments/16umq3y/how_abolitionists_put_the_body_at_the_center_of/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Kathleen Brown - How Abolitionists Put the Body at the Center of the Fight Against Slavery", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/fxItHcffd10?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Kathleen Brown - How Abolitionists Put the Body at the Center of the Fight Against Slavery\"></iframe>", "author_name": "UNE Center for Global Humanities", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/fxItHcffd10/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@unecgh"}}, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "55": {"id": "16vpug6", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "mfranz630", "link_flair_text": null, "time": 1696041434.775893, "created_utc": 1696027311.0, "url": "https://youtu.be/gm0op4Al0Ds", "title": "Serial killer who dissolved 100 children in acid", "permalink": "/r/truecreepy/comments/16vpug6/serial_killer_who_dissolved_100_children_in_acid/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Serial killer who dissolved 100 children in acid | Javed Iqbal |", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/gm0op4Al0Ds?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Serial killer who dissolved 100 children in acid | Javed Iqbal |\"></iframe>", "author_name": "Dervish Diaries", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/gm0op4Al0Ds/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@DervishDiaries"}}, "score": 3, "upvote_ratio": 0.8, "comment_count": 0, "over_18": false}, "56": {"id": "16rozg9", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Legitimate_Steak6202", "link_flair_text": null, "time": 1696041434.980925, "created_utc": 1695639946.0, "url": "https://www.reddit.com/r/threekings/comments/16rozg9/rituals_for_good_luck/", "title": "Rituals for good luck?", "permalink": "/r/threekings/comments/16rozg9/rituals_for_good_luck/", "selftext": "Looking to make my gambling addiction more profitable", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 0, "over_18": false}, "57": {"id": "16rbdo9", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "divurchic", "link_flair_text": null, "time": 1696041436.177875, "created_utc": 1695595828.0, "url": "https://www.reddit.com/r/Ghosts/comments/16rbdo9/i_believe_my_dad_let_me_know_he_was_still_around/", "title": "I believe my dad let me know he was still around after he died.", "permalink": "/r/Ghosts/comments/16rbdo9/i_believe_my_dad_let_me_know_he_was_still_around/", "selftext": "This may sound weird but here goes…when my dad was dying of lung cancer June 2009, he was living with me before hospice.  For dinner one night I mixed a blueberries, strawberries and blackberries in a bowl and topped it with vanilla yogurt.  My dad ( born June 20, 1943) refused to eat the berry dish.  After a couple minutes he started to try it and loved it!  He asked if I could make it again.  \nAbout eight months after he died I made this dish again, my kids and I were eating and a breeze came through the dining area.  It moved my hair.  Windows and French doors all closed it was dark outside.  I believe to this day it was my dad, I know, know one will believe me.", "media": null, "score": 490, "upvote_ratio": 0.94, "comment_count": 101, "over_18": false}, "58": {"id": "16qihdr", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "RyzRx", "link_flair_text": "Glitch Vid", "time": 1696041436.5366275, "created_utc": 1695511595.0, "url": "https://v.redd.it/awm3yhjka2qb1", "title": "A strange red cloud has appeared in Cape Town.", "permalink": "/r/GlitchInTheMatrix/comments/16qihdr/a_strange_red_cloud_has_appeared_in_cape_town/", "selftext": "", "media": null, "score": 72, "upvote_ratio": 0.94, "comment_count": 11, "over_18": false}, "59": {"id": "16swecg", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Havenator", "link_flair_text": "wholesome", "time": 1696041437.2241457, "created_utc": 1695754287.0, "url": "https://i.redd.it/ivi21q04cnqb1.png", "title": "Cool or dumb?", "permalink": "/r/bigfoot/comments/16swecg/cool_or_dumb/", "selftext": "I started a Sasquatch themed 4runner account on instagram to give me something to do during my lunch hour. Made these cards and stickers to hand out in the wild.", "media": null, "score": 176, "upvote_ratio": 0.86, "comment_count": 67, "over_18": false}, "60": {"id": "16qi975", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Evidence", "time": 1696041437.977642, "created_utc": 1695510975.0, "url": "https://i.redd.it/b1yjuurl83qb1.jpg", "title": "Someone recently posted this image on Reddit possibly showing a kouprey, a type of ox thought to have gone extinct in 1969. Does anyone have more info on this photo?", "permalink": "/r/Cryptozoology/comments/16qi975/someone_recently_posted_this_image_on_reddit/", "selftext": "", "media": null, "score": 133, "upvote_ratio": 0.92, "comment_count": 12, "over_18": false}, "61": {"id": "16q3r0x", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Tinfoil_Tales", "link_flair_text": "Unidentified", "time": 1696041438.2393844, "created_utc": 1695473475.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/16q3r0x/weird_creatures_in_the_road/", "title": "Weird Creatures in the Road", "permalink": "/r/Humanoidencounters/comments/16q3r0x/weird_creatures_in_the_road/", "selftext": "I have started sharing my encounter in Indiana back in 2007 around recently, in a couple other subs, but this one also seems like a good place.\nI’ll TL;DR at the end for those who hate reading.\nI worked night shift and a coworker and I were both driving down a county road after work, probably around 4:45 AM, still dark outside. I saw his taillights get brighter like he was hitting his brakes, then he swerves down into the ditch line, and comes back out on the road and keeps going. As I approached the same area, I see this really tall, black figure walking in the road. It’s moving in a very weird unnatural gait, like it was kind of blowing in the wind, but it clearly wasn’t. I first thought it was a really tall person wrapped up in a big black blanket because I didn’t see any arms or head, just two big legs and a torso. I had to swerve over to avoid it too, but I basically came to a full stop, and the thing walks passed my drivers window. It had to have been around 7 foot tall, as it was leaning forward and was at least a foot or so taller than the top of my vehicle. As it got behind my vehicle, I could see the taillights illuminating it’s legs, but couldn’t make out any details like hair or anything like clothing. Just large, thick, black legs. \nI took off down the road once it was behind me and saw that my coworker pulled into a gravel parking lot, so I pulled up beside him. He’s freaking out asking if I saw it, and how it didn’t have a head, and other ramblings. I said we should go back and try to see what the hell this thing is, because it seemed oblivious to us driving right at at. He didn’t want to, but he ended up following behind me. We drove back the way we came and in around the same area, there was a large black dog laying across the road. This was not your normal size canine, it was much larger than any normal dog, but it looked dead. It wasn’t there when we just drove through there less than 3 or so minutes beforehand. \nAnyway, I decided I was going to get out and go see if it’s alive or not, and move it off to the side of the road because you can’t really drive around it without going off the edge of the road on either side because the way it was laying across the road. As I get about 15 feet away, it raises its head up and looks back at me. It’s eyes are glowing yellow, but I still say that was due to the vehicle lights causing eye shine. It lets out a low, deep, rumbling guttural growl and I stop instantly. It attempts to stand up, seems like it has some sort of issues with its front legs, but it stands up and continues to stand up, on two legs…like a person would. \nIt only stood on its back legs for a second or two, enough time for it to look at me, but then it hunkers back down to what looks like on all fours and runs off to the wooded area, but there’s a pretty tall fence there so I don’t really know how it managed to disappear because it would of had to go over, under, or through the fence…or it just vanished. I also don’t think it was using its front legs when it ran off, because I never saw them really moving.\nNow after all this, there was one last strange happening. My coworker gets out of his car after the dog thing ran off, and he comes up to me to basically say wtf was that, and as we are talking, I noticed a mouse standing between us. It was also on its hind legs, kind of sitting as it is washing its face. I nudged it with my shoe, and it doesn’t even seem to care. Kind of like the first thing that was walking, it was completely oblivious to our presence. It just kept on cleaning itself. \nWe left and went our separate ways. I woke up later in the day and started looking into werewolves and come across dogman stories. The only thing I will say about all of that is, this didn’t have the hands and feet like is often claimed by witnesses. It had normal dog paws. It just had a large black wolf style look about itself, but it’s fur was really fluffy, which didn’t really seem to match with the normal wolf type fur. It wasn’t a bear, it didn’t have mange, I know the difference between a bear or something like that. It just looked like a very large black dog. \nThe first thing we saw, some people said sounds like a Fresno Nightcrawler but those have been white in appearance, and not nearly as thick and tall. Someone recently asked if maybe it had wings and that’s what was concealing it’s arms and head, as if they were draped around the front of it. I never thought about that before, and can’t say one way or another because I didn’t see any sort of details on its body, just blackness. The way it moved just seemed very odd, otherworldly. I always think of those inflatable tube man that flap around in the wind at car dealers or some sort of events when I try to describe it’s movements. Just really weird. \nThe mouse, that might the oddest thing to me because I physically touched it, so I know it was real, but it just didn’t seem to care. It wasn’t until recently I made the connection that all three of the creatures were on two legs at one point. Are they all connected? Who knows.\nI never saw anything like that ever again, and I only live about 4 miles from where it happened and I drive through that area often. I wish I had more answers but all I get is more questions.\nAs someone who’s been pretty skeptical most of my life, I’ve tried to explain it away in some logical manner but I can’t. I have said the dog was playing with the mouse, must of got hit and it’s front legs were hurt, that would explain why it was walking on its back legs, and why the movement seemed unnatural. The mouse was traumatized from the dog messing with it, that explains why it looked all wet and why it was cleaning itself. That’s the version I accepted for many years. The only problem with that is whatever was originally walking down the road was so much larger than the dog. When the dog stood up it was maybe 6 foot tall, but whatever walked by my window was at least 7 foot leaning forward. The walking torso was also a lot thicker than the dog, as the legs were very thick, the dogs were normal dog legs.\nTL;DR version: a coworker and I encountered a large black headless/armless walking torso, we turned around and went back to see what it was and found a large black dog that stood up on two legs, then ran off. While standing in the road talking about what happened, noticed a mouse standing upright cleaning itself next to us. Nudged it with my foot and it wasn’t afraid, never ran off.", "media": null, "score": 133, "upvote_ratio": 0.98, "comment_count": 64, "over_18": false}, "62": {"id": "16tx5ju", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": null, "time": 1696041439.0588496, "created_utc": 1695851239.0, "url": "https://i.redd.it/s2pkpdqecvqb1.jpg", "title": "The water elephant is an African cryptid described as a small tapir-like elephant that is semi-aquatic. It was first sighted by a hunter who wrote about it in his notes but failed to bag them. Notably the elephant didn't have any visible tusks. No African tapir species are known", "permalink": "/r/cryptids/comments/16tx5ju/the_water_elephant_is_an_african_cryptid/", "selftext": "", "media": null, "score": 135, "upvote_ratio": 0.98, "comment_count": 18, "over_18": false}, "63": {"id": "16qy5qr", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "ReptilianOverlord7", "link_flair_text": null, "time": 1696041440.389344, "created_utc": 1695563223.0, "url": "https://i.redd.it/g2ggqaizj7qb1.jpg", "title": "Nothing to see in the bottom left corner here.", "permalink": "/r/conspiracy/comments/16qy5qr/nothing_to_see_in_the_bottom_left_corner_here/", "selftext": "NASA Sauce in comments.", "media": null, "score": 2028, "upvote_ratio": 0.84, "comment_count": 388, "over_18": false}, "64": {"id": "16s0b7t", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1696041440.749267, "created_utc": 1695667555.0, "url": "https://youtube.com/live/gqf8-JVqgBM", "title": "Travel to Berkshire: The UFO encounter that tore a US community apart With Thom Reed", "permalink": "/r/conspiracyfact/comments/16s0b7t/travel_to_berkshire_the_ufo_encounter_that_tore_a/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 0.67, "comment_count": 1, "over_18": false}, "65": {"id": "16rkajs", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Apprehensive-Ear2685", "link_flair_text": "Discussion", "time": 1696041442.5896719, "created_utc": 1695622669.0, "url": "https://www.reddit.com/r/ufo/comments/16rkajs/david_gruschs_real_message_during_the_hearing_and/", "title": "David Grusch's real message during the hearing, and why its important to not let this go.", "permalink": "/r/ufo/comments/16rkajs/david_gruschs_real_message_during_the_hearing_and/", "selftext": "My post's here recently have been getting a ton of views and people are generally upset, but I really want to drive this home. And these posts have everything to do with UAP's/UFO's/ more importantly disclosure and transparency.\nThis hearing was definitely to do with UAP's/UFOs, but at the same time he really wanted to drive home the serious actions of the misappropriation of funds without congressional oversight. One of the reasons I'm sure why David Grusch came forward like he did is because.\n\nHe's a Patriot and Loves his country\nHe was 100% in charge and given the job to inspect various military branches SAP's and the DoD as a whole, and what he found after speaking to 40+ witnesses of the highest clearance level are this...\n\nDavid Grusch - \"Yes there are numerous SAP's that are operating without congressional oversight, which is illegal under U.S. law, not only are they operating without oversight, during my investigation I learned that there was a serious disinformation campaign against the American Populace to hide these SAP's, what these witness's provided was evidence that there was also an apparent Reverse Engineering/Crash-Retrieval/Non-Human Biologics recovery, I can only tell you about what was told to me from said witness's, but all my evidence I have shared with the ICIG(Who has authority to investigate said claims and deemed me credible and findings \"Urgent\") but also with congress and provided 10 + hours of testimony in a legal secured setting, I am only going off the evidence of first hand witness I deemed credible and have no reason to doubt any of said claims.\"\nAnd Congress is looking at this man going.... Oh shit he is extremely credible and has an extensive background in the agencies and programs that would actually really have evidence of this.\nUAP's/UFOs was heavily used in this to get the sleeping American public to wake up and get you irate and in your head that your government is seriously F'ing you.... the average U.S. Citizen, the man and women who pay taxes without representation at this point, our forefathers literally revolted and started a country for the same reason. Do not forget this fact, it is very important you remember that yeah disclosure would be great, but they will not disclose a damn thing if the people paying their salaries are not going to do something about it.", "media": null, "score": 300, "upvote_ratio": 0.91, "comment_count": 117, "over_18": false}, "66": {"id": "16u1tbt", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Dex507", "link_flair_text": "Witness/Sighting", "time": 1696041444.0823493, "created_utc": 1695862508.0, "url": "https://v.redd.it/mir5lzxo9wqb1", "title": "What the hell just happened far off the coast of Rhode Island???", "permalink": "/r/UFOs/comments/16u1tbt/what_the_hell_just_happened_far_off_the_coast_of/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/mir5lzxo9wqb1/DASH_360.mp4?source=fallback", "height": 360, "width": 626, "scrubber_media_url": "https://v.redd.it/mir5lzxo9wqb1/DASH_96.mp4", "dash_url": "https://v.redd.it/mir5lzxo9wqb1/DASHPlaylist.mpd?a=1698633443%2CYWVkMWUzY2M3ZWQwNmMxNzRkN2Q4ZWQ2ZjcxZmY5YTIwNGYxZGI5OGE1NzU1NDlhNzVmMWY3NDg4OGJmYTY2Yw%3D%3D&v=1&f=sd", "duration": 112, "hls_url": "https://v.redd.it/mir5lzxo9wqb1/HLSPlaylist.m3u8?a=1698633443%2CNTU5Y2ZkNWM2ZWM5NzhmZTlhZmVkMzY2MDQ5YTZlZjMyMDEzMzgwNmQzMTkxODVmZjkyYTBkYmU4Yzc0NGExNA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2813, "upvote_ratio": 0.87, "comment_count": 442, "over_18": false}, "67": {"id": "16u0cpe", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "dreadpirateSito", "link_flair_text": "Video", "time": 1696041445.6458519, "created_utc": 1695858764.0, "url": "https://v.redd.it/osxg2uiryvqb1", "title": "UFO’s in the Bronx?", "permalink": "/r/aliens/comments/16u0cpe/ufos_in_the_bronx/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/osxg2uiryvqb1/DASH_1080.mp4?source=fallback", "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/osxg2uiryvqb1/DASH_96.mp4", "dash_url": "https://v.redd.it/osxg2uiryvqb1/DASHPlaylist.mpd?a=1698633444%2CMDBjMzc0NTUxMzZiMWE1YzU4MTYwNTFkMzdmYjgzZTdhYjdlMTA5YzEwMDA5YzBmYmY2YmE5Nzc4YTVkYTEzNA%3D%3D&v=1&f=sd", "duration": 19, "hls_url": "https://v.redd.it/osxg2uiryvqb1/HLSPlaylist.m3u8?a=1698633444%2CZDY0MWIzNmUxMzU4ZDAyNWMxMTA5NzYzMDRjZDhkMGY5Y2YxMjdlNTBjMTRiNTU3ODlmYTUwZGJhMGNmMzUxOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2689, "upvote_ratio": 0.78, "comment_count": 600, "over_18": false}, "68": {"id": "16rq0cg", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "disclosurediaries", "link_flair_text": null, "time": 1696041446.4283721, "created_utc": 1695643043.0, "url": "https://www.reddit.com/r/UAP/comments/16rq0cg/a_summary_of_all_the_relevant_disclosure_updates/", "title": "A summary of all the relevant Disclosure updates from Sep 18-24", "permalink": "/r/UAP/comments/16rq0cg/a_summary_of_all_the_relevant_disclosure_updates/", "selftext": "This past week in Disclosure:\nSeptember 18th – a FOIA request on David Grusch's cleared statements raises more questions than it answers\nJohn Greenewald, who is known for submitting and publishing a constant stream of UAP-related Freedom of Information Requests (FOIA), unveiled the (heavily redacted) statements that Grusch submitted to the Defense Office of Prepublication and Security Review (DOPSR) before going public with his claims.\nThe release most notably contains a set of 10 question/answer pairs, which Grusch had prepared for review (ostensibly with his upcoming public appearances in mind). While the questions certainly align with the general gist of Grusch's claims, the answers to those questions were completely redacted. Three of the ten questions also appear to have been redacted.\nAt this time, it is not clear why questions/answers that were officially cleared for public release have been redacted so heavily for this FOIA request. An appeal will almost certainly be submitted to provide clarification.\n​\nSeptember 20th – U.S. Air Force officially reports mysterious Gulf of Mexico incident to the Pentagon's UFO Offic, AARO\nThe Department of Defense officially confirmed to Liberation Times that the US Air Force has submitted a report about an incident involving an unknown object that occurred earlier this year to AARO, which is the DoD's Unidentified Anomalous Phenomena (UAP) office.\nThis incident was previously introduced into the public record by Rep. Gaetz during the July 26 UAP Hearing, where he made the following statement, emphasis mine (some sections [paraphrased] for brevity):\n\n\"Several months ago my office received a protected disclosure from Eglin Air Force Base indicating that there was a UAP incident that required my attention [...] We asked to see any of the evidence that had been taken by flight crew in this endeavor and to observe any radar signature.  \n[...after initially being denied access, Gaetz was eventually shown an image from the encounter...]  \nThe image was of something that I am not able to attach to any human capability, either from the United States or from any of our adversaries*. And I'm somewhat informed on the matter, having served on the Armed Services Committee for seven years, having served on the committee that oversees DARPA and advanced technologies for several years.\"* Source, pages 41-42\n\nAARO will look to publish a public report on the incident, once cleared. A video summarising Gaetz's statements can be viewed here.\n​\nSeptember 21st – NASA provides a private briefing on their UAP-related findings to Congress\nThe Oversight Committee invited NASA to conduct a bipartisan, full Committee, Member-level briefing on their findings. The briefing was closed to the public and media but additional public hearings on UAPs in the near future are anticipated to follow.\nRep. Burchett took to Twitter after the session to complain about the fact that NASA are seemingly acting \"elusive\" on the topic. NASA stated that they only explored unclassified sources during their investigations, much to the apparent frustration of Rep. Burchett amongst others.\nIt's unclear why a private briefing was necessary to brief Congress on an investigation with an unclassified scope.\n​\nSeptember 22nd – US Customs and Border Patrol release a collection of UAP-related documents and videos\nThe US Customs and Border Patrol (CBP) released a variety of UAP-related documents and videos, most of which had already been circulating in the public sphere for some time. It is not clear what the specific motivation for this release was. Former Deputy Assistant Secretary of Defense for Intelligence, Christopher Mellon, appeared on NBC to elaborate. He used the opportunity to highlight the fact that he believes the general public is more than ready to see the full extent of various UAP-related videos the DoD has in its possession (that, to this day, have never been publicly released).\n​\nSeptember 23rd – Senator Mike Rounds provides an update regarding his perspective on UAP\nIn a quick interview this week, Senator Mike Rounds (one of the co-sponsors of the UAP Disclosure Act of 2023) gives Ask a Pol a further glimpse into his thinking when asked directly to elaborate on the UAP topic:\n“My concern from the Department of Defense is, I just don't simply want our ongoing programs disrupted or limited because of additional scrutiny on what we are doing and what our adversaries are doing in some very unique programs”\nRounds is quick to add: “These aren't new types of programs. They’re the types of programs that have always existed, stealth is a good example.”\n---\nThings to look out for in the near future:\nSeptember\n\nSteven Spielberg's production company will launch a 4 part docu-series covering UAP/UFO Encounters on Netflix on September 27th (Link)\n\nNovember\n\nThe SOL Foundation is holding its first annual conference at Stanford University on November 17-19, 2023. Covering everything from the scientific study of UAP data to philosophical questions raised by it to related global security issues, the meeting brings together Avi Loeb, Charles McCullough, Cristopher Mellon, Garry Nolan, Jacques Vallée, and other leading academic and government voices on UAP.\n\nBeyond/currently unknown\n\nWhile the US Senate passed the NDAA for FY24 – which included the UAP Disclosure Act of 2023 as an amendment – the coming months will still require Senators and Members of Congress to reconcile the two chambers’ versions of the NDAA and produce a final compromise bill. Most commentators don't expect this to happen before December 2023.\nFollowing the UAP hearing on the 26th of July, Members of Congress have called for a select committee with subpoena authority, to “go about the task of collecting information from the Pentagon and elsewhere” on unidentified flying objects. There have been conflicting messages from various Members of Congress on whether this is likely to happen anytime soon.\nAccording to Senator Gillibrand – an updated UAP report from AARO can be expected by January 2024. This update was originally expected in August 2023, but faced delays.\nReps. Moskowitz, Luna, and Burchett have repeatedly stated their intent to hold field hearings to overcome stonewalling from the Pentagon and military establishment – \"I think we [Congress] should try to get into one of these places [housing UAP evidence]...and if they won't let us in I think we should have a field hearing right outside the building...and the military will have to explain why that is.\" – Rep. Moskowitz (D). It is currently unknown when we might expect that to occur.\nSeveral journalists have indicated that first-hand witnesses of the alleged UAP legacy programs are in the process of providing testimony/evidence to the relevant authorities (e.g. the IC IG) and/or are on the verge of making public statements in the near future (Example 1, example 2, example 3)\n\nReminder – Call your Reps!\nThe House Armed Services Committee (HASC) is deliberating key UAP legislation in the next days/weeks, so I put together a list of names, emails, & numbers (+ handy scripts/templates) in one easy place. If you have the time, please do call/contact these reps & remind them sunlight is the best disinfectant! It's especially important that we voice our support for Senator Schumer/Rounds' UAP Disclosure Act legislation, which is (in my opinion) a great first step towards furthering UAP transparency as a whole.\n--------\nOther Credits (def. missing some...):\n\nRonak P\nu/Schadensfall\nu/aryelbcn\nDrDisclosure89\nRoss\nDefense Scoop\nGood trouble show\nAskapol\n", "media": null, "score": 81, "upvote_ratio": 0.99, "comment_count": 11, "over_18": false}, "69": {"id": "16tkaop", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "kbth7337", "link_flair_text": "Update", "time": 1696041447.7868063, "created_utc": 1695820494.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16tkaop/update_brooks_houck_arrested_in_connection_to/", "title": "Update: Brooks Houck Arrested in Connection to Crystal Rogers Case", "permalink": "/r/UnresolvedMysteries/comments/16tkaop/update_brooks_houck_arrested_in_connection_to/", "selftext": "I’ve posted before about updates on Crystal Rogers, who has been missing from Bardstown, KY, since 2015. It’s always been suspected by locals and her family that her boyfriend, Brooks Houck is responsible for her disappearance. \nOn September 7, 2023, Joseph Lawson was arrested on charges of conspiracy to commit murder and tampering with evidence. This morning (September 27) local news announced that Brooks Houck has been arrested on charges related to Crystal’s disappearance. \nI truly hope her family can get the answers and justice they deserve. \nNews Article \nPrior post on the topic \nFor more information on Crystal’s case and others in the Bardstown area, I highly recommend listening to the Bardstown Podcast hosted by Shay McAlister.", "media": null, "score": 1005, "upvote_ratio": 0.98, "comment_count": 144, "over_18": false}, "70": {"id": "16qqglw", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "acidscorpio", "link_flair_text": null, "time": 1696041448.2822344, "created_utc": 1695537204.0, "url": "https://hollywoodunlocked.com/indianapolis-woman-admits-mistakenly-stabbing-1-year-old-niece-instead-dog-stole-chicken-sandwich/", "title": "Indianapolis Woman Admits To Mistakenly Stabbing 1-Year-Old Niece Instead Of Dog Who Stole Her Chicken Sandwich", "permalink": "/r/MorbidReality/comments/16qqglw/indianapolis_woman_admits_to_mistakenly_stabbing/", "selftext": "", "media": null, "score": 2046, "upvote_ratio": 0.99, "comment_count": 149, "over_18": true}, "71": {"id": "16r19wz", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "GeneralDavis87", "link_flair_text": null, "time": 1696041449.342265, "created_utc": 1695571266.0, "url": "https://youtu.be/gy9OElrD7cE?si=Py9kmZu-mU8nzygs", "title": "WWII - Why We Fight! Divide and Conquer (1943) Frank Capra", "permalink": "/r/MorbidHistory/comments/16r19wz/wwii_why_we_fight_divide_and_conquer_1943_frank/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "WWII - Why We Fight!  Divide and Conquer (1943) Frank Capra", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/gy9OElrD7cE?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"WWII - Why We Fight!  Divide and Conquer (1943) Frank Capra\"></iframe>", "author_name": "Marvelous Movies", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/gy9OElrD7cE/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@Marvelous_Movies"}}, "score": 0, "upvote_ratio": 0.5, "comment_count": 0, "over_18": false}, "72": {"id": "16uk5cr", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Slappyb27", "link_flair_text": null, "time": 1696041450.8891604, "created_utc": 1695917496.0, "url": "https://v.redd.it/a6szhlx7t0rb1", "title": "IDK WTF this was, happened a few years ago at my house caught on security cam", "permalink": "/r/Ghosts/comments/16uk5cr/idk_wtf_this_was_happened_a_few_years_ago_at_my/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/a6szhlx7t0rb1/DASH_1080.mp4?source=fallback", "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/a6szhlx7t0rb1/DASH_96.mp4", "dash_url": "https://v.redd.it/a6szhlx7t0rb1/DASHPlaylist.mpd?a=1698633450%2CMDBiMDA1NDUwNjc5MWVhOGQ0YjBmNDZmZGRkYTdmNTcxM2FlMzAwNjZkNmE5YzQxZTAyMmY5MTcyNzE1MDEwOA%3D%3D&v=1&f=sd", "duration": 30, "hls_url": "https://v.redd.it/a6szhlx7t0rb1/HLSPlaylist.m3u8?a=1698633450%2COWVmMWEwMTY4ZTc1MGJhNmMyYjI0NTdmNjY4YTFkZTZhMzE0MTQ0OGMwMGFkMzc3ZmZlMGY3YjM1NzVmNTVjYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 433, "upvote_ratio": 0.77, "comment_count": 140, "over_18": false}, "73": {"id": "16q2evg", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Cuber8280", "link_flair_text": "Glitch Pic", "time": 1696041451.2217803, "created_utc": 1695469523.0, "url": "https://i.redd.it/4z92ufpbtzpb1.jpg", "title": "Accidental Tissues Transparency Glitch", "permalink": "/r/GlitchInTheMatrix/comments/16q2evg/accidental_tissues_transparency_glitch/", "selftext": "", "media": null, "score": 53, "upvote_ratio": 0.84, "comment_count": 6, "over_18": false}, "74": {"id": "16tkwwp", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "ky420", "link_flair_text": "merchandise", "time": 1696041452.0234666, "created_utc": 1695821966.0, "url": "https://i.redd.it/isknhgq5xsqb1.jpg", "title": "Wife got us a new comforter for this winter.....I approve of this change.", "permalink": "/r/bigfoot/comments/16tkwwp/wife_got_us_a_new_comforter_for_this_winteri/", "selftext": "", "media": null, "score": 156, "upvote_ratio": 0.94, "comment_count": 22, "over_18": false}, "75": {"id": "16tmuqe", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1696041452.8018773, "created_utc": 1695826781.0, "url": "https://i.redd.it/px36tkfobtqb1.jpg", "title": "The water elephant is an African cryptid described as a small tapir-like elephant that is semi-aquatic. It was first sighted by a hunter who wrote about it in his notes but failed to bag them. Notably the elephant didn't have any visible tusks. No African tapir species are known", "permalink": "/r/Cryptozoology/comments/16tmuqe/the_water_elephant_is_an_african_cryptid/", "selftext": "", "media": null, "score": 104, "upvote_ratio": 0.98, "comment_count": 25, "over_18": false}, "76": {"id": "16t1byp", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "emilos260", "link_flair_text": "Humanoid", "time": 1696041453.142274, "created_utc": 1695765226.0, "url": "https://i.redd.it/ijuek9eh8oqb1.jpg", "title": "A biker-like humanoid seen by Antonio Guirao Carrillo, 16, his cousin Jose Carrillo and their friends near Sangonera La Verde, Murcia, Spain. July 1, 1979. [full encounter in the comments]", "permalink": "/r/Humanoidencounters/comments/16t1byp/a_bikerlike_humanoid_seen_by_antonio_guirao/", "selftext": "", "media": null, "score": 65, "upvote_ratio": 0.92, "comment_count": 19, "over_18": false}, "77": {"id": "16qcbq6", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": null, "time": 1696041453.8452492, "created_utc": 1695495583.0, "url": "https://i.redd.it/n0z00p3vy1qb1.jpg", "title": "The adjulé is a Mauritanian cryptid described as a wolf-like predator. It was seen hunting in packs by hunters back in 1992. They're thought to possibly be African wild dogs, although they're not believed to live in Mauritania.", "permalink": "/r/cryptids/comments/16qcbq6/the_adjulé_is_a_mauritanian_cryptid_described_as/", "selftext": "", "media": null, "score": 42, "upvote_ratio": 0.93, "comment_count": 9, "over_18": false}, "78": {"id": "16ug9t0", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "PepeLives00", "link_flair_text": null, "time": 1696041455.0403392, "created_utc": 1695908155.0, "url": "https://i.imgur.com/cDlXtWd.jpg", "title": "Zillow changed the value of Trump’s house from $422 million to $24million.", "permalink": "/r/conspiracy/comments/16ug9t0/zillow_changed_the_value_of_trumps_house_from_422/", "selftext": "", "media": null, "score": 1779, "upvote_ratio": 0.81, "comment_count": 699, "over_18": false}, "79": {"id": "16vijn7", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1696041455.3724823, "created_utc": 1696010360.0, "url": "https://youtube.com/live/ygHHXlD5PDU", "title": "Is Taylor Swift a Genetically Made Clone?", "permalink": "/r/conspiracyfact/comments/16vijn7/is_taylor_swift_a_genetically_made_clone/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 0.56, "comment_count": 1, "over_18": false}, "80": {"id": "16qlhfu", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Apprehensive-Ear2685", "link_flair_text": "Announcement", "time": 1696041457.1962328, "created_utc": 1695520455.0, "url": "https://www.reddit.com/r/ufo/comments/16qlhfu/in_november_2022_dod_failed_its_fifth_consecutive/", "title": "\"In November 2022, DOD failed its fifth consecutive audit, unable to account for sixty-one percent of its $3.5 trillion in assets.\"", "permalink": "/r/ufo/comments/16qlhfu/in_november_2022_dod_failed_its_fifth_consecutive/", "selftext": "Never forget, this goes so much deeper than the UAP/UFO issue.\nInvestigating DOD’s failure to prevent waste, fraud, and abuse after its failure to account for 61% of its $3.5 trillion in assets\nWASHINGTON — House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) and Subcommittee on Government Operations and the Federal Workforce Chairman Pete Sessions (R-Texas) are probing the U.S. Department of Defense (DOD) for its failure to prevent waste, fraud, and abuse after the department failed its fifth consecutive audit in November. In a letter to Defense Secretary Lloyd Austin, the Republican lawmakers request a staff-level briefing to acquire additional information on the DOD’s failed audit, financial management practices generally, and what it is doing to implement outstanding recommendations for improvement.\n“The Committee on Oversight and Accountability is investigating the Department of Defense’s (DOD) failure to prevent waste, fraud, and abuse. In November 2022, DOD failed its fifth consecutive audit, unable to account for sixty-one percent of its $3.5 trillion in assets. The U.S. Government Accountability Office (GAO) also recently reported that DOD continues to fail to accurately account for hundreds of billions of dollars of government furnished property in the hands of contractors,” wrote both Republican lawmakers. “DOD’s inability to adequately track assets risks our military readiness and represents a flagrant disregard for taxpayer funds, even as it receives nearly a trillion dollars annually.”\nDOD’s financial management and contractor management have consistently been included in GAO’s High-Risk List. In January 2023, GAO reported that DOD failed to accurately account for much government furnished property provided to contractors including weapons, equipment, technology, and other defense articles. DOD last estimated in 2014 that contractors were in possession of $220 billion in government furnished property but GAO says that estimate is “significantly understated.” GAO has also recommended several changes to DOD weapons systems acquisition, business systems modernization, and overall financial tracking.\n“DOD’s lax financial management and inability to adequately track weapons, equipment and other defense articles have raised serious concerns about DOD’s stewardship of taxpayer dollars, especially as DOD’s budget approaches thirteen figures. Failure to address these issues has limited DOD’s ability to produce auditable financial statements which would enable adequate oversight of DOD’s financial management practices,” continued both Republican lawmakers.", "media": null, "score": 288, "upvote_ratio": 0.97, "comment_count": 55, "over_18": false}, "81": {"id": "16tu32l", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "manwhore25", "link_flair_text": "Photo", "time": 1696041458.8414624, "created_utc": 1695844179.0, "url": "https://www.reddit.com/gallery/16tu32l", "title": "Bob Lazar posts 3D renderings of the craft he worked on at S4", "permalink": "/r/UFOs/comments/16tu32l/bob_lazar_posts_3d_renderings_of_the_craft_he/", "selftext": "", "media": null, "score": 2761, "upvote_ratio": 0.89, "comment_count": 630, "over_18": false}, "82": {"id": "16qf6lk", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "lakerconvert", "link_flair_text": "News :illuminati:", "time": 1696041460.6258414, "created_utc": 1695502921.0, "url": "https://x.com/unexplained2020/status/1705642858240156021?s=46&t=Euzax2pfoUGaoyTHrviLrA", "title": "Gary McKinnon, who hacked into the Pentagon and NASA in search of proof of aliens, says, \"They will never tell us the truth\" in response to NASA's latest claims.", "permalink": "/r/aliens/comments/16qf6lk/gary_mckinnon_who_hacked_into_the_pentagon_and/", "selftext": "", "media": null, "score": 2522, "upvote_ratio": 0.85, "comment_count": 431, "over_18": false}, "83": {"id": "16t0neh", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Just-Ad1274", "link_flair_text": null, "time": 1696041461.2473865, "created_utc": 1695763769.0, "url": "https://www.reddit.com/r/UAP/comments/16t0neh/do_we_have_any_real_evidence_that_these_uap_arent/", "title": "Do we have any REAL evidence that these UAP aren't just classified black budget American tech??", "permalink": "/r/UAP/comments/16t0neh/do_we_have_any_real_evidence_that_these_uap_arent/", "selftext": "Besides the US Defense's word. It sounds like our defense budget is soooooo ahead of its time that they rather keep the American people and our foreign adversaries guessing and thinking it's aliens. It seems like the perfect covert response to keep people from exploring our oceans and skies further. And ofc the pilots who have witnessed this phenomenon are above their pay grade or not in the need to know regarding even US Navy and Air Force sightings. I don't doubt at all that they witnessed these encounters but wouldn't the perfect training grounds for OUR tech be within our borders testing on our own military personnel since they are the best of the best they seem like the perfect test subjects.This all only came to mind when I find out in the 60s we had built crafts that could go 4,500mph. So isn't it fair to assume that 50 years later it wouldn't be a stretch that we have capabilities to go over 20,000mph. I may be grasping for straws but it's hard to really gauge how far ahead we are technologically advanced without a reference point and even harder to jump to aliens being the conclusion when we don't even know what our unlimited military budget and best and brightest scientific minds are really capable of because it is classified. I would feel a lot better at least if it's just US flexing our muscles and testing waters than an alien invasion just saying.", "media": null, "score": 80, "upvote_ratio": 0.73, "comment_count": 131, "over_18": false}, "84": {"id": "16rqlwg", "locked": true, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "Philodemus1984", "link_flair_text": "Update", "time": 1696041462.278989, "created_utc": 1695644679.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/16rqlwg/investigators_looking_at_new_persons_of_interest/", "title": "Investigators looking at ‘new persons of interest’ in JonBenet Ramsey murder case", "permalink": "/r/UnresolvedMysteries/comments/16rqlwg/investigators_looking_at_new_persons_of_interest/", "selftext": "I hadn’t seen this recent article posted here yet, so I thought that I would post it: https://themessenger.com/news/jonbenet-ramsey-new-persons-of-interest-murder-boulder.\nUnfortunately there isn’t much information other than what’s said in the title. It’s noted that earlier this year, police began using new DNA technology to test previously unexamined evidence, but it’s unknown whether these tests are what have led to new persons of interest.\nI assume most on this sub are familiar with the unsolved 1996 murder of 6 year  old JonBenet Ramsey, but here is the Wikipedia article anyway: https://en.m.wikipedia.org/wiki/Killing_of_JonBenét_Ramsey. Very briefly, she was found strangled to death in the basement of her home. Many have suspected someone in her family, particularly her 9 year old brother, of committing the crime. Several men have confessed to the crime but none have been charged. The case became a media sensation, partly because JonBenet was a child beauty queen. \nThe whole case is quite byzantine and I am sure that there are people on this sub who know more about it than what’s on the Wikipedia page, so please feel free to provide further information. I personally have no strong opinions on who may have committed the crime.", "media": null, "score": 973, "upvote_ratio": 0.95, "comment_count": 316, "over_18": false}, "85": {"id": "16t1wkx", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "dalia666", "link_flair_text": null, "time": 1696041462.798336, "created_utc": 1695766450.0, "url": "https://news.sky.com/story/amp/sadistic-british-crocodile-expert-adam-britton-admits-sexually-abusing-and-killing-dozens-of-dogs-12970110", "title": "'Sadistic' British crocodile expert Adam Britton admits sexually abusing, torturing, and killing dozens of dogs", "permalink": "/r/MorbidReality/comments/16t1wkx/sadistic_british_crocodile_expert_adam_britton/", "selftext": "The rumours were true. It was him the whole time.\nBackground info for anyone unfamiliar ⬇️\nhttps://screamer.wiki/1_Bitch_9_Pups", "media": null, "score": 1796, "upvote_ratio": 0.98, "comment_count": 338, "over_18": true}, "86": {"id": "16sswqb", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Creative_Skirt9150", "link_flair_text": null, "time": 1696041465.4710736, "created_utc": 1695746380.0, "url": "https://www.reddit.com/gallery/16sswqb", "title": "Something I found in reference to ghost caught on accident", "permalink": "/r/Ghosts/comments/16sswqb/something_i_found_in_reference_to_ghost_caught_on/", "selftext": "", "media": null, "score": 343, "upvote_ratio": 0.86, "comment_count": 105, "over_18": false}, "87": {"id": "16s80yq", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Serbia-Stronk21984", "link_flair_text": "Glitch Pic", "time": 1696041465.8435304, "created_utc": 1695685810.0, "url": "https://i.redd.it/tix79mtbohqb1.jpg", "title": "The game “real life” failed to render 3 strawberry’s and accidentally combined them", "permalink": "/r/GlitchInTheMatrix/comments/16s80yq/the_game_real_life_failed_to_render_3_strawberrys/", "selftext": "", "media": null, "score": 12, "upvote_ratio": 0.62, "comment_count": 7, "over_18": false}, "88": {"id": "16qzd8s", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "WoobiesWoobo", "link_flair_text": "discussion", "time": 1696041466.6251307, "created_utc": 1695566464.0, "url": "https://www.reddit.com/r/bigfoot/comments/16qzd8s/the_vietnam_war/", "title": "The Vietnam War", "permalink": "/r/bigfoot/comments/16qzd8s/the_vietnam_war/", "selftext": "So right now I am reading a lot on “Rock Apes” in the Vietnam War. \nTo my understanding the first documented sightings are in the early 1800’s. During the Vietnam War, American soldiers very shortly upon entering the jungles of Vietnam, encountering apelike wild men standing approximately 6ft tall covered in reddish brown, brown, or black hair. The largest documented primate of that area is the Gibbon but they just don’t fit the bill as far as descriptions go. \nFrom what I am reading, they were able to rule out anything known to science and there was evidence of something inhabiting the jungles of Vietnam. Finding footprints that are not human or known ape but again, no bones or bodies.\nNot sure how credible the sources are out there because there is VERY little \n(Compared to other cryptids) on this particular subject as far as I can find.\nI came to this after reading about the Minnesota Iceman and never til recently giving thought to the version of the story that it came from Vietnam. \nDoes anyone in our group have some good info on the subject? From what I am seeing I am kind of puzzled why this doesn’t get brought up more in the Sasquatch discussion. Maybe y’all l know something I don’t. Fill me in!", "media": null, "score": 90, "upvote_ratio": 0.9, "comment_count": 92, "over_18": false}, "89": {"id": "16rabyv", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "justa-human", "link_flair_text": null, "time": 1696041467.7429605, "created_utc": 1695593219.0, "url": "https://www.reddit.com/gallery/16rabyv", "title": "Found this book I stole from my school library 6 years ago (in gta)", "permalink": "/r/Cryptozoology/comments/16rabyv/found_this_book_i_stole_from_my_school_library_6/", "selftext": "Fuck this guy trey the explainer and monster quest made me hate this guy even more", "media": null, "score": 96, "upvote_ratio": 0.89, "comment_count": 7, "over_18": false}, "90": {"id": "16riyz3", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "GilgameshvsHumbaba", "link_flair_text": "Outside site", "time": 1696041468.0001903, "created_utc": 1695618062.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/16riyz3/serephines_bigfoot_abduction_circa_1890s/", "title": "Serephines Bigfoot abduction circa 1890s", "permalink": "/r/Humanoidencounters/comments/16riyz3/serephines_bigfoot_abduction_circa_1890s/", "selftext": "Before doing so, however, I should explain that among the natives of Canada - both Indians and Eskimos - there is a shortage of marriageable girls. Probably a similar condition exists among the sasquatch, thus explaining the action of the wild giant in this case. I should also like to add that although her present day photograph hardly bears this out, the evidence of her contemporaries goes to show that in her girlhood, Serephine Long was considered one of the most comely girls in her tribe. Here is the story:\n\"I was walking toward home one day many years ago carrying a big bundle of cedar roots and thinking of the young brave Qualac (Thunderbolt), I was soon to marry. Suddenly, at a place where the bush grew close and thick beside the trail, a long arm shot out and a big hairy hand was pressed over my mouth. Then I was suddenly lifted up into the arms of a young sasquatch. I was terrified, fought, and struggled with all my might. In those days, I was strong. But it was no good, the wild man was as powerful as a young bear. Holding me easily under one arm, with his other hand he smeared tree gum over my eyes, sticking them shut so that I could not see where he was taking me. He then lifted me to his shoulder and started to run.\nHe ran on and on for a long long time - up and down hills, through thick brush, across many streams never stopping to rest. Once he had to swim a river and then perhaps I could have gotten away, but I was so afraid of being drowned that I held on tightly with my arms about his neck. Although I was frightened I could not but admire his easy breathing, his great strength and speed of foot. After reaching the other side of the river, he began to climb and climb. Presently the air became very cold. I could not see but I guessed that we were close to the top of a mountain.\"\n\"At last the sasquatch stopped hurrying, then he stooped over and moved slowly as if feeling his way along a tunnel. Presently he laid me down very gently and I heard people talking in a strange tongue I could not understand. The young giant next wiped the sticky tree gum from my eyelids and I was able to look around me. I sat up and saw that I was in a great big cave. The floor was covered with animal skins, soft to touch and better preserved that we preserve them. A small fire in the middle of the floor gave all the light there was. As my eyes became accustomed to the gloom I saw that beside the young giant who had brought me to the cave there were two other wild people - a man and a woman. To me, a young girl, they seemed very very old, but they were active and friendly and later I learned that they were the parents of the young sasquatch who had stolen me. When they all came over to look at me I cried and asked them to let me go. They just smiled and shook their heads. From then on I was kept a close prisoner; not once would they let me go out of the cave. Always one of them stayed with me when the other two were away.\"\n\"They fed me well on roots, fish and meat. After I had learned a few words of their tongue, which is not unlike the Douglas dialect, I asked the young giant how he caught and killed the deer, mountain goats and sheep that he often brought into the cave. He smiled, opening and closing his big hairy hands. I guessed that he just laid in wait and when an animal got close enough, - he leaped, caught it and choked it to death. He was certainly big enough, quick enough and strong enough to do so.\"\n\"When I had been in the cave for about a year I began to feel very sick and weak and could not eat much. I told this to the young sasquatch and pleaded with him to take me back to my own people. At first he got very angry, as did his father and mother but I kept on pleading with them, telling them that I wished to see my own people again before I died. I really was ill and I suppose they could see that for themselves because one day after I cried for a long time, the young sasquatch went outside and returned with leaf full of tree gum. With this he stuck down my eyelids as he had done before. Then he again lifted me to his big shoulder.\"\n\"The return journey was like a very bad dream for I was light headed and in much pain. When we re-crossed the wide river, I was almost swept away; I was too weak to cling to the young sasquatch but he held me with one big hand and swam with the other. Close to my home, he put me down and gently removed the tree gum from my eyelids. When he saw that I could see again he shook his head sadly, pointed to my house and then turned back into the forest.\n\"My people were all wildly excited when I stumbled back into the house for they had long ago given me up as dead. But I was too sick and weak to talk. I just managed to crawl into bed and that night I gave birth to a child. The little one lived only a few hours, for which I have always been thankful. I hope that never again shall I see a sasquatch.\"\nThat is Serephine Long's story, the only one on record of a sasquatch ever abducting an Indian girl. I could relate more instances concerning the wild giants of British Columbia - seemingly well-attested cases that I have collected over a period of many years - but in this article the few I have recounted must suffice.", "media": null, "score": 60, "upvote_ratio": 0.91, "comment_count": 15, "over_18": false}, "91": {"id": "16subld", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": null, "time": 1696041468.7486825, "created_utc": 1695749631.0, "url": "https://i.redd.it/69i8c8z9ymqb1.jpg", "title": "In 1987 an expedition to the Orkneys in the United Kingdom to look for surviving great auks was announced after recent sightings in the area. The expedition turned out to be a promotional stunt for a whiskey brand, who pursued a remote controlled mechanical great auk", "permalink": "/r/cryptids/comments/16subld/in_1987_an_expedition_to_the_orkneys_in_the/", "selftext": "", "media": null, "score": 22, "upvote_ratio": 0.93, "comment_count": 4, "over_18": false}}}