{"_default": {"1": {"id": "18hjqq0", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Awstun_", "link_flair_text": null, "time": 1702704268.8582067, "created_utc": 1702482467.0, "url": "https://i.redd.it/sqdzsbfg236c1.jpg", "title": "Navy Rear Admiral Backs Grusch’s Claims.", "permalink": "/r/ufo/comments/18hjqq0/navy_rear_admiral_backs_gruschs_claims/", "selftext": "Oceanographer and Navy Rear Adm. Tim Gallaudet told Ross Coulthart he believes there is a cover-up of NHI engaging with our planet. \nFull interview airs tonight at 6pm est on NewsNation. /#CatastrophicDisclosureSeries", "media": null, "score": 1163, "upvote_ratio": 0.96, "comment_count": 132, "over_18": false}, "2": {"id": "18fc23y", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "News", "time": 1702704270.3271546, "created_utc": 1702238779.0, "url": "https://v.redd.it/9u4vzwdmxi5c1", "title": "CNN just called out Mike Turner for blocking UFO disclosure", "permalink": "/r/UFOs/comments/18fc23y/cnn_just_called_out_mike_turner_for_blocking_ufo/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/9u4vzwdmxi5c1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 478, "width": 854, "scrubber_media_url": "https://v.redd.it/9u4vzwdmxi5c1/DASH_96.mp4", "dash_url": "https://v.redd.it/9u4vzwdmxi5c1/DASHPlaylist.mpd?a=1705296269%2COWY2NTQzM2NhMWUxZTI2MDllMzczOWExZGI5YWYxN2Y4ZDNkMGYxZTEyM2U1YTZjZmEzZDYxY2Y5Y2Y0OWQ3Mw%3D%3D&v=1&f=sd", "duration": 36, "hls_url": "https://v.redd.it/9u4vzwdmxi5c1/HLSPlaylist.m3u8?a=1705296269%2CMGVmYzhhMDI1YmY2MjFiN2M4ZjhkOTFjNjE0ZmQwMWZiZjY1Nzg4M2M1ZGY5MzUzMGUyODJjMDg3NGRhOTJlZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4384, "upvote_ratio": 0.89, "comment_count": 234, "over_18": false}, "3": {"id": "18iyosp", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Streay", "link_flair_text": "Discussion :table:", "time": 1702704272.005152, "created_utc": 1702642232.0, "url": "https://www.reddit.com/gallery/18iyosp", "title": "Am I crazy or do all these aliens have the same indents in their head", "permalink": "/r/aliens/comments/18iyosp/am_i_crazy_or_do_all_these_aliens_have_the_same/", "selftext": "You can see how the first “alien” has 3 small indents going up its head, just like the other two. \nMaybe I’m just crazy, what’s your thoughts?", "media": null, "score": 2129, "upvote_ratio": 0.8, "comment_count": 557, "over_18": false}, "4": {"id": "18hohje", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Smurphilicious", "link_flair_text": "News", "time": 1702704273.2724595, "created_utc": 1702494597.0, "url": "https://www.c-span.org/video/?c5097853/user-clip-schumerrounds", "title": "Schumer: \"The United States Government has gathered a great deal of information about UAPs over many decades, but has refused to share it with the American people. That is wrong, and additionally it breeds mistrust.\"", "permalink": "/r/UAP/comments/18hohje/schumer_the_united_states_government_has_gathered/", "selftext": "", "media": null, "score": 629, "upvote_ratio": 0.96, "comment_count": 61, "over_18": false}, "5": {"id": "18gru7y", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "ClockworkSkyy", "link_flair_text": null, "time": 1702704274.613764, "created_utc": 1702403517.0, "url": "https://i.redd.it/954qt00pjw5c1.jpg", "title": "How many of you watched it and instantly knew it was a psyop movie? Pure garbage.", "permalink": "/r/conspiracy/comments/18gru7y/how_many_of_you_watched_it_and_instantly_knew_it/", "selftext": "Let's go boys!", "media": null, "score": 2197, "upvote_ratio": 0.78, "comment_count": 981, "over_18": false}, "6": {"id": "18jg464", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1702704274.9479427, "created_utc": 1702690880.0, "url": "https://youtu.be/m1fJzgM-hvA", "title": "Pamela Stonebrooke- Enjoys Sex With an Alien", "permalink": "/r/conspiracyfact/comments/18jg464/pamela_stonebrooke_enjoys_sex_with_an_alien/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Pamela Stonebrooke- Enjoys Sex With an Alien", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/m1fJzgM-hvA?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Pamela Stonebrooke- Enjoys Sex With an Alien\"></iframe>", "author_name": "Paranormal Highway", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/m1fJzgM-hvA/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@ParanormalHighway"}}, "score": 2, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "7": {"id": "18hx84v", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Allourep", "link_flair_text": "Debunked ", "time": 1702704275.6019635, "created_utc": 1702518034.0, "url": "https://i.redd.it/yju2itt7066c1.jpg", "title": "Footprint found last night in CA Sierras.", "permalink": "/r/bigfoot/comments/18hx84v/footprint_found_last_night_in_ca_sierras/", "selftext": "I will not be providing any further information. \nPictured next to a size 11 work boot print. \nThought you’d enjoy", "media": null, "score": 450, "upvote_ratio": 0.81, "comment_count": 136, "over_18": false}, "8": {"id": "18gwnq5", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "CrofterNo2", "link_flair_text": null, "time": 1702704276.2474458, "created_utc": 1702415856.0, "url": "https://i.redd.it/uthq7uayjx5c1.jpg", "title": "In 1930, zoologist Martin Eisentraut observed a giant pig in the Gran Chaco, but failed to shoot it when his gun misfired. Years later, a local rancher gave him a description of the same rare animal, called quimilero. The Chacoan peccary, the largest known peccary, was officially discovered in 1971.", "permalink": "/r/Cryptozoology/comments/18gwnq5/in_1930_zoologist_martin_eisentraut_observed_a/", "selftext": "", "media": null, "score": 123, "upvote_ratio": 0.97, "comment_count": 16, "over_18": false}, "9": {"id": "18gr8hd", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Consistent_Ad1062", "link_flair_text": "Bedroom", "time": 1702704276.4367893, "created_utc": 1702402002.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/18gr8hd/visited_in_the_night_and_intentionally_woken_up/", "title": "Visited in the night and intentionally woken up", "permalink": "/r/Humanoidencounters/comments/18gr8hd/visited_in_the_night_and_intentionally_woken_up/", "selftext": "2 weekends ago I had visitors in my bedroom.\nI live on a military base in MD, USA. This occurred around 3 am. I had no trouble falling asleep in the first place that night, but I do remember tracking a white circular light even with my eyes closed right before I nodded off.\nAfter the experience I was awake for probably an hour before getting back to sleep again.\nI was sleeping when I felt someone's hand pressing on my butt. Left cheek specifically. I thought it was one of my kids come into the bed so I shooed it away and lifted my blanket up so whoever could crawl in with me.\nThen a hand pressed real firm on the same left cheek  like it wanted my attention right that moment ya know.\nI got up on one elbow, no kid in bed, doors closed. So I'm looking around like \"what the?\"\nThen. There. Right there. Right at the foot of the bed. Standing 4 ft tall, unmistakable silhouette, large head small body just right THERE! \nI sat straight up. When I did, the other one moved. It was right next to me, looking over me. I didn't notice it when I first turned around. But when I sat up it moved up and away from me. Like it had been hunched over me. It's face right next to mine. It had to be 7 ft tall. Tall and thin but it's head was proportionate to its body.\nIt was dark so I couldn't see features. Just movement and shape. They didn't look solid. Like they had this swirling liquid smoke moving across their bodies. I think they were partially cloaking themselves. It looked like in between the liquid smoke there was nothing. Like little swirling liquid windows, that I could see the wall and carpet and dresser through. \nSo I'm sitting straight up looking at the small one. I wasn't scared but my senses were all the way up. I think fear might have been trying to creep up and I didn't want to ruin whatever this moment was about to be. \nI said \"are you really here?!\" In my normal daytime volume voice, and it slowly started to move backwards. I saw that and lurched towards it as fast as I could and stretched my arms out wildly grabbing to where it was. But I missed it. \nI watched it phase out of sight...both of them. \nThe whole experience lasted mere seconds.\nThey woke me up. They wanted me to see them. To know that they were there.\nHonestly I feel like it was a gift. It was an absolutely remarkable experience and I hope they show themselves again.", "media": null, "score": 71, "upvote_ratio": 0.9, "comment_count": 19, "over_18": false}, "10": {"id": "18hqxsd", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "am8o", "link_flair_text": null, "time": 1702704277.412206, "created_utc": 1702500939.0, "url": "https://i.redd.it/cykynisdl46c1.jpg", "title": "What do y'all think", "permalink": "/r/cryptids/comments/18hqxsd/what_do_yall_think/", "selftext": "", "media": null, "score": 119, "upvote_ratio": 0.95, "comment_count": 42, "over_18": false}, "11": {"id": "18ggljd", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "T0A5TH3AD", "link_flair_text": "Discussion/Advice", "time": 1702704277.698249, "created_utc": 1702366615.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/18ggljd/i_work_security_for_a_100_year_old_hotel_and_ive/", "title": "I work security for a 100 year old hotel and I’ve seen some strange things", "permalink": "/r/Thetruthishere/comments/18ggljd/i_work_security_for_a_100_year_old_hotel_and_ive/", "selftext": "For context, I am highly skeptical, but no stranger to the paranormal, I’m the type that believe demons exist, but most ghost stories are overreactions of easily explained phenomena or simply hoaxes. About 3 months ago I started working security for a hotel that was built back in the 1920’s by a major hotel chain that has changed hands multiple times and is now owned by one of the biggest hotel chains. I’m not saying which so the company can’t sue me. \nNow from what I’ve been told paranormal activity is not a common occurrence in the hotel, but some years back the make-a-wish foundation started sending some children here because well it’s a major resort at one of the most popular beaches on the east coast why wouldn’t they? However the hotel was not informed of this and didn’t realize what was happening until several children died in their rooms over the course of a few weeks. Supposedly on quiet nights you can hear children playing with a ball in the North tower ballrooms at night. For years guests complained of children playing ball loudly next to their rooms even and when security would check there would be no one there. This has not happened in a while, but going into this story you should understand that my opinion on the cause of what I’ve seen may be warped by being told this story. \nNow every shift we do a floor check, especially on night shift when I work. At first I never noticed anything strange, I got a little creeped out by the quiet of the floors at night but nothing supernatural. The hotel has two separate towers separated by a restaurant and shopping area that connects them. About a month into the job and suddenly I started feeling like something was following me on my floor checks especially in the ST which is the biggest and tallest and where I understand most Jumpers choose because all the rooms facing the ocean have sliding glass doors with a short railing in front and you can put the rest together from there. Anyway it got really bad in October, maybe the spooky season had an effect on me, but this feeling of being watched and followed never went away. \nAs the weeks have gone on, I started seeing distorted faces in windows as I passed by to the point I no longer look at them. The floor pattern sometimes reflects on the glass and the mind could easily make a face with the pattern, but some of these faces were up further on the glass where this wouldn’t have been possible. When I focus up there sometimes I can almost hear whispers in the back of my mind, urging me to commit suicide or lambasting me for the mistakes I’ve made or even telling me insecurities I have about myself I’ve never told anyone about. In the last few weeks some strange physical and auditory phenomena have occurred. Part of what we do on floor checks is close doors we find open, and some of the doors lately have been more difficult to close, one in particular I had to use all my strength to slam shut. The ice machines on each floor sometimes make a banging noise while in operation so I usually attribute any noise I hear from the vending area to that, but sometimes it almost has sounded like something was rummaging in the garbage cans and when I’d go to investigate I’d hold my keys so they wouldn’t jingle in case it was a person, and as soon as I do the rummaging noise will stop. On a couple of occasions I’ve felt what I can only describe as hands touching me while closing certain doors sometimes just a tickle and other times a brush against the back of my hand and even a feeling like someone on the other side of the door is pulling it in the opposite direction against me. I now dread the floor checks especially after 3am I’m not trying to make this seem scarier than it is, but these things intensify the closer it gets to that hour. Whatever they are they aren’t friendly and I think they know I can sense them. They really don’t like that I can sense them, like some nights that watched and followed feeling is more like a burning hatred directed towards my existence, like being stalked by an enemy or a predator. I’m pretty religious, and whenever these things happen I always pray to god and when I do it usually goes away whatever it is. The scariest thing though is the last time it was that intense I heard something growl next to my ear. I’ve never been hurt by them so my assumption is they can’t hurt anyone physically, but they try to communicate often and want their presence acknowledged. Almost as though that’s where their power comes from. My grandmother told me once that demons truly have no power, they are only capable of whatever we believe them to be capable of. My mounting fear is feeding them whatever they are. \nMy experiences could be just m seeing things or looking too much into something completely explainable idk this is just what I’ve seen and heard. Whatever it is hunting me at night my coworkers don’t know about it, or at least they aren’t telling anyone. I am bipolar, but medicated and I’ve never had hallucinations. Maybe I’m just crazy and seeing things, but if that’s the case why am I not having any other signs of a manic episode or psychosis and why am I only seeing things in that one part of the building?", "media": null, "score": 240, "upvote_ratio": 0.97, "comment_count": 52, "over_18": false}, "12": {"id": "18getkl", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Zennialmillennial", "link_flair_text": null, "time": 1702704277.935029, "created_utc": 1702359657.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/18getkl/someone_has_been_coming_into_my_house_when_im_not/", "title": "Someone has been coming into my house when I’m not home", "permalink": "/r/LetsNotMeet/comments/18getkl/someone_has_been_coming_into_my_house_when_im_not/", "selftext": "I moved in with my elderly grandmother a few months ago because I got a new job down the street from her house and she said she’d be happy to have me stay with her.\nSome context: I used to come visit my grandmother about one weekend a month. About a year ago while I was visiting, one of her neighbors a couple houses down came to talk to us while we were sitting on the front porch. She informed us that the adult son of the man who lived across the street from them was mentally ill and a peeping tom. Supposedly he would come stand in this neighbor’s yard and just stare into her windows. She got her husband to yell at him and when he kept doing it they eventually called the cops. My grandmother remarked that she had seen the cops at this man’s house for years and that supposedly a single dad lived there with this adult son who struggled to mange his mental problems.\nFlash forward to a couple weeks ago. Now living with my grandmother full time, I got home after dark a couple weeks ago and the front door was cracked open. My grandmother is a bit of a safety freak so she always has her doors locked. I was nervous but tried to hope for the best thinking my grandmother had forgotten to close the door on the way in with groceries. I go to her room and she said she was certain she locked the door. I tried not to worry about it since nothing had been moved or stolen.\nThe next day when I got home her car door was cracked open. At this point I assumed both instances were her and that she was just being forgetful (however she’s never left either of these things open before).\nWell tonight, my grandmother and I go out for dinner and therefore I am the one who locked the front door on the way out. She has a door knob lock and a deadbolt lock above it. I distinctly remember struggling to lock the deadbolt (they both use the same key). Sometimes you have to shimmy the door to get the deadbolt to lock but I got sick of trying and just left it unlocked, satisfied with the doorknob being locked. Funnily enough, as I walked away from the door I thought to myself, I hope no one breaks in.\nWell we get back from dinner and I go to unlock the doorknob and to my surprise the door wouldn’t open because the deadbolt had somehow been locked! It was in that moment I immediately knew someone had been in the house while we were gone and locked the deadbolt back when they left. Once again, nothing had been moved or stolen. The creepy part is that this person is intentionally leaving the doors open and locking back locks that had not been locked on purpose just to creep us out. And he was obviously watching us out his windows to see when we left tonight.\nI feel certain that it is this mentally ill man who must’ve gotten hold of a key that my grandmother hid under a mat or something. Why would anyone else do this? If it was a robber, they would have taken something. Reminds me of the first season of American Horror Story where Jessica Lange’s autistic daughter would just randomly sneak into Connie Britton’s house. I’m just hoping that if it is this guy down the street that he is as harmless as that AHS character (I’ve never actually laid eyes on this mentally ill neighbor before, Let’s Not Meet). \nI’m going to get the locks changed as soon as possible and install a ring doorbell camera. What I’m most nervous about is that once I get the locks changed this guy (or whoever it is) will know we’re onto them and may get mad because they won’t get access to their twisted pastime anymore. We live in a gun friendly state (we don’t own any) but I’m afraid of what this guy may do in retaliation. The neighbor who had the peeping tom incident literally called the cops on him and she’s still alive so I just hope he leaves us alone and doesn’t bother us anymore.\nDo y’all agree that most signs point to the creeper down the street as the culprit?", "media": null, "score": 893, "upvote_ratio": 0.98, "comment_count": 102, "over_18": true}, "13": {"id": "18hivl8", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "StateSideSpoonZ", "link_flair_text": null, "time": 1702704278.1391432, "created_utc": 1702480133.0, "url": "https://i.redd.it/9ltj44aiv26c1.png", "title": "The Campden Wonder - In 1660, a local English man vanished without a trace. After an investigation, three individuals were hanged for his murder. Two years later, the supposed victim appeared, telling a story of having been abducted and enslaved in Turkey", "permalink": "/r/truecreepy/comments/18hivl8/the_campden_wonder_in_1660_a_local_english_man/", "selftext": "", "media": null, "score": 36, "upvote_ratio": 0.95, "comment_count": 2, "over_18": false}, "14": {"id": "18h1qxi", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "LazyWinter666", "link_flair_text": null, "time": 1702704278.3765087, "created_utc": 1702425780.0, "url": "https://www.reddit.com/r/threekings/comments/18h1qxi/is_tominos_hell_real/", "title": "Is tomino’s hell real ?", "permalink": "/r/threekings/comments/18h1qxi/is_tominos_hell_real/", "selftext": "So i got bored and decided to give the poem a shot and to my surprise something actually happened—i got incredibly sick, my tonsils got so big they nearly suffocated me- is Tomino’s hell the cause of this or is it just coincidence? (I mean it is flu season)", "media": null, "score": 19, "upvote_ratio": 1.0, "comment_count": 7, "over_18": false}, "15": {"id": "18f1w1j", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Own-Medicine-2753", "link_flair_text": "Is this undeniable evidence?", "time": 1702704279.2658954, "created_utc": 1702208751.0, "url": "https://i.redd.it/6ta6lctjgg5c1.jpg", "title": "Does someone have an explanation 🤷‍♀️ look by the driver side (right side)", "permalink": "/r/Ghosts/comments/18f1w1j/does_someone_have_an_explanation_look_by_the/", "selftext": "So earlier in the year I had a car accident. A 4x4 did an illegal u turn and t boned my car. I was driving and my partner was in the passenger seat. Once everyone was out and by the side of the road away from the accident I quickly wanted to grab some photos of the accident I took four pictures and I was very shaky when taking the pics and one came out the most clear. In the pic I have attached nobody was there when I took the photo but standing by the driver side door (where I was) looks to me like a man who actually reminds me of my grandfather who passed away when I was 12 and then people who knew him think it’s him too. May I add my accident happened right near a cemetery But yeah lemme know what you guys think.", "media": null, "score": 3462, "upvote_ratio": 0.92, "comment_count": 727, "over_18": false}, "16": {"id": "18fgbsf", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "bluebluegreen90", "link_flair_text": "Glitch Pic", "time": 1702704279.5247858, "created_utc": 1702250329.0, "url": "https://i.redd.it/ua3hh0u6wj5c1.png", "title": "Cojoined delivery trucks out the window.", "permalink": "/r/GlitchInTheMatrix/comments/18fgbsf/cojoined_delivery_trucks_out_the_window/", "selftext": "", "media": null, "score": 65, "upvote_ratio": 0.92, "comment_count": 8, "over_18": false}, "17": {"id": "18eh7ui", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Godzillakong2000", "link_flair_text": "Rumors", "time": 1702704281.2367485, "created_utc": 1702139447.0, "url": "https://i.redd.it/n0m8hgchqa5c1.jpeg", "title": "28 aliens speces", "permalink": "/r/ufo/comments/18eh7ui/28_aliens_speces/", "selftext": "This time it's real", "media": null, "score": 1053, "upvote_ratio": 0.89, "comment_count": 459, "over_18": false}, "18": {"id": "18g7snn", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Humanity_Updated", "link_flair_text": "Video", "time": 1702704282.7348309, "created_utc": 1702337817.0, "url": "https://v.redd.it/1qgbru484r5c1", "title": "David Grusch has first hand knowledge of a UAP program, will release an op ed in the coming weeks about what that knowledge", "permalink": "/r/UFOs/comments/18g7snn/david_grusch_has_first_hand_knowledge_of_a_uap/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/1qgbru484r5c1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 592, "width": 1280, "scrubber_media_url": "https://v.redd.it/1qgbru484r5c1/DASH_96.mp4", "dash_url": "https://v.redd.it/1qgbru484r5c1/DASHPlaylist.mpd?a=1705296281%2CNTdkNjNkMmIyNWMwY2YxNDAzM2VlNTQyYTU5ZDg3ZmVhNTM0MGFlNTFlYTUxZDc2NzY5MWIwODNmYzFmOWMxZg%3D%3D&v=1&f=sd", "duration": 64, "hls_url": "https://v.redd.it/1qgbru484r5c1/HLSPlaylist.m3u8?a=1705296281%2CYWQzYTU2NTk4ZWQ0Y2Y5YTNlYTk5MjNlYjUxNzZiMzI3ZDE4MWYyNzkwYWU0MGY4NjJkNjc2ODZjZWIzY2RjOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4343, "upvote_ratio": 0.83, "comment_count": 1039, "over_18": false}, "19": {"id": "18icjp1", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "PetiteSpinnerLuvr", "link_flair_text": "Analysis Required :snoo_thoughtful:", "time": 1702704284.5957124, "created_utc": 1702571659.0, "url": "https://v.redd.it/q6qd8t5ofa6c1", "title": "Said to be filmed somewhere in Florida", "permalink": "/r/aliens/comments/18icjp1/said_to_be_filmed_somewhere_in_florida/", "selftext": "Sadly not enough info of this clip. Posted on someone's IG social with not much to go on. ", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/q6qd8t5ofa6c1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1278, "width": 720, "scrubber_media_url": "https://v.redd.it/q6qd8t5ofa6c1/DASH_96.mp4", "dash_url": "https://v.redd.it/q6qd8t5ofa6c1/DASHPlaylist.mpd?a=1705296283%2CMTVjNzY0MWY1NjI3NGE4YzM2MWYwNzFjNTMxNTA3ODQ2YTYzMWM4NzViZDEwYWVlZDc5NjZiYzRhMGFiOWU4MQ%3D%3D&v=1&f=sd", "duration": 90, "hls_url": "https://v.redd.it/q6qd8t5ofa6c1/HLSPlaylist.m3u8?a=1705296283%2CNWJjMDkxMTFkMzQyMDIxZTFhMGYzZGE3ZWQ3ZDBkMWNjOGMzNzAwNzJlN2FiNzk1ZGRjZjgwNjIwNzdmNTE1ZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1305, "upvote_ratio": 0.75, "comment_count": 421, "over_18": false}, "20": {"id": "18hvoex", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Interview", "time": 1702704285.5969837, "created_utc": 1702513462.0, "url": "https://twitter.com/tuckercarlson/status/1735083523050975277?s=46", "title": "[Tucker Carlson] It’s becoming obvious that the US government has made contact with nonhuman beings. So why are they lying to us about it? We asked UFO whistleblower Dave Grusch. (Hour long interview with Grusch)", "permalink": "/r/UAP/comments/18hvoex/tucker_carlson_its_becoming_obvious_that_the_us/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/TuckerCarlson/status/1735083523050975277", "author_name": "Tucker Carlson", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">Ep. 51  It’s becoming obvious that the US government has made contact with nonhuman beings. So why are they lying to us about it? We asked UFO whistleblower Dave Grusch. <a href=\"https://t.co/IP1dV29KnI\">pic.twitter.com/IP1dV29KnI</a></p>&mdash; Tucker Carlson (@TuckerCarlson) <a href=\"https://twitter.com/TuckerCarlson/status/1735083523050975277?ref_src=twsrc%5Etfw\">December 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n", "author_url": "https://twitter.com/TuckerCarlson", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 602, "upvote_ratio": 0.8, "comment_count": 356, "over_18": false}, "21": {"id": "18g9omd", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Content-Carpenter833", "link_flair_text": "Rule 10 Reminder", "time": 1702704286.883781, "created_utc": 1702343246.0, "url": "https://www.reddit.com/gallery/18g9omd", "title": "Extremely suspicious listings on Etsy, thousands of dollars for just encrypted downloads and very weird choice of pictures for them. Thoughts?", "permalink": "/r/conspiracy/comments/18g9omd/extremely_suspicious_listings_on_etsy_thousands/", "selftext": "", "media": null, "score": 2083, "upvote_ratio": 0.89, "comment_count": 538, "over_18": false}, "22": {"id": "18ipk9f", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1702704287.1689405, "created_utc": 1702607419.0, "url": "https://www.youtube.com/watch?v=Z6miMUgmGNE", "title": "This UFO caused the closure of Hangzhou Airport, China. Looks like an exploratory mission.", "permalink": "/r/conspiracyfact/comments/18ipk9f/this_ufo_caused_the_closure_of_hangzhou_airport/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "This UFO caused the closure of Hangzhou Airport, China. Looks like an exploratory mission.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/Z6miMUgmGNE?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"This UFO caused the closure of Hangzhou Airport, China. Looks like an exploratory mission.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/Z6miMUgmGNE/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 1, "upvote_ratio": 0.57, "comment_count": 1, "over_18": false}, "23": {"id": "18grdjw", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "KevinsSmellyDogRuby", "link_flair_text": "humor", "time": 1702704287.7796347, "created_utc": 1702402351.0, "url": "https://i.redd.it/qgp66ox7gw5c1.jpg", "title": "Poor guy.", "permalink": "/r/bigfoot/comments/18grdjw/poor_guy/", "selftext": "", "media": null, "score": 255, "upvote_ratio": 0.95, "comment_count": 15, "over_18": false}, "24": {"id": "18ia0s5", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1702704288.4347808, "created_utc": 1702564663.0, "url": "https://i.redd.it/dkvednwuu96c1.png", "title": "In the early 1900s while looking for mammoths in Northeastern Siberia, Eugen Pfizenmayer was informed that the local Lamut people hunted a kind of wild horse. It was described as having greyish-white fur, and some believed they could be surviving ice age horses", "permalink": "/r/Cryptozoology/comments/18ia0s5/in_the_early_1900s_while_looking_for_mammoths_in/", "selftext": "", "media": null, "score": 108, "upvote_ratio": 0.99, "comment_count": 14, "over_18": false}, "25": {"id": "18fd9lh", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "xspineofasnakex", "link_flair_text": null, "time": 1702704289.7482302, "created_utc": 1702242020.0, "url": "https://i.redd.it/8m86un9h7j5c1.jpg", "title": "Mothman has found a present... OwO", "permalink": "/r/cryptids/comments/18fd9lh/mothman_has_found_a_present_owo/", "selftext": "What could be inside?!", "media": null, "score": 68, "upvote_ratio": 0.97, "comment_count": 3, "over_18": false}, "26": {"id": "18ej4yi", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "ChampionFlimsy6439", "link_flair_text": "Picture/Evidence", "time": 1702704289.945714, "created_utc": 1702144852.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/18ej4yi/real_fairy_encounter/", "title": "Real Fairy Encounter", "permalink": "/r/Thetruthishere/comments/18ej4yi/real_fairy_encounter/", "selftext": "Hi everyone! I wanted to share my experience with a fairy when I was a child. I'm currently 19, and all my life I've been obsessed with fairies. As a kid, I read books about them, researched them, and left offerings out to them in my backyard. And one time I saw one with no doubt. I was about 9-10 years old and I was at my cottage. This cottage is about 3 hours north of Toronto. The cottage has a huge forest in it's backyard, and I was alone waiting at the top of the stairs leading into the forest. Suddenly, a tiny creature flew up to my face. I can't fully picture it, but I know it was mainly brown with long limbs and wings. It had a human-likw face, and it made a motion with it's hand saying \"come here\" or \"follow me\" and then it flew off towards the front of my cottage. \nI've had other smaller supernatural experiences at this cottage, but this one changed my life. Or solidified my belief in fairies, and even now, almost 10 years later I still doubt it. Let me know if you guys have any other similar experiences, and thank you for reading!!\n🧚🏻‍♀️💗", "media": null, "score": 75, "upvote_ratio": 0.86, "comment_count": 13, "over_18": false}, "27": {"id": "18gkwnq", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "ChairRude1070", "link_flair_text": null, "time": 1702704290.1763813, "created_utc": 1702384549.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/18gkwnq/stalked_by_a_rapist/", "title": "Stalked by a rapist", "permalink": "/r/LetsNotMeet/comments/18gkwnq/stalked_by_a_rapist/", "selftext": "Posting from a throwaway, not sure that this belongs here but it was harrowing for me. \nI'm not gonna get into the details of this here, but I met a man who was much older than me at 18 (he was around 40 or something, maybe a little older) who sexually assaulted me. He seemed to be lying throughout the entire event about what he was actually doing, trying to convince me nothing was happening, and baby-talking me as if I were a small child. Obviously I was fucking hysterical at this. For reference, this happened in his house, in the middle of nowhere. It's a long drive out and surrounded by a bunch of forest, and to the back of the house there's a field full of stalks you have to wander through in order to reach the main trail, which opens up onto the side of a lake and heavy forest. \nAfter he was done assaulting me and finally let me go, I launched up from his bed and immediately began searching for my clothes, which he refused to help me find at first. It was 2am in the late fall and everything was pitch-black in this house. I could only feel around the floor, forcing my back to him sometimes. Eventually, he got up from the bed without saying a single word and pulled my underwear out from underneath his bed (where he had hid it along with my phone and bra). That always gets to me when I think about that, the fact that he hid them. I thanked him profusely and stole away what clothes I could find along the floor, then hurried to the kitchen, so that I could dress there with my back facing the front door. \nWhile I was getting dressed, he followed me out and stood naked a few paces away from me, just watching me change. First he tried to gaslight me, and tell me nothing had happened, and that I was overreacting and panicking \"as if he had done something to me\". Now at this point I would've said anything and done anything, so I firmly agreed with whatever he told me, and even told him anything that happened was in fact my fault, whole-heartedly agreeing so I could keep him occupied with talking as long as I was changing into my clothes. I kept feeling like if I let the conversation drop and let us drift into silence, he was going to hurt me. \nAt some point, while I was talking, his face turned completely cold. It was like a switch going off, totally dead eyes. He kept staring at me, in utter silence, just watching me with no emotion -- and at this point I broke into tears finally, because I was sure he would rape me again or kill me (as he had threatened to hurt me before). I asked him through tears if he was mad at me. He didn't say a thing, just watched me get changed with no emotion on his face. I begged him not to be mad at me. He got hard while I was crying. Finally, when I was changed, he told me to wait where I was, he was leaving the house also and needed to get dressed. I don't know why I waited but I did, I was rooted with fear. I felt like I should run but I couldn't. He finally comes back out of his bedroom wearing nothing but a pair of boxers and holding a condom. At this point, I finally bolted.\nAs I said earlier, in order to access the main trail to this house, you need to traverse a small field of stalks, but the ground was slippery and wet there as it was late fall, and it was so dark I couldn't properly see where I was walking without a light. I used the last of my phone battery on a flashlight, getting as close to running as I could without actually running. I was terrified of slipping there. I couldn't shake the horrible thought that if I just stood still for one moment, he was going to come find me and catch me, or pop out from behind me. I made it out of the field and onto the main trail, and luckily there was an older lady there walking her dog by the woods who was able to give me directions for the nearest bus-stop. I just tore off in that direction after thanking her. Looking back on it, I wish I had told her what had happened and asked for help, but in the moment all I wanted was to get home as soon as possible, and I was embarrassed, already feeling like I could tell nobody ever about what had happened that day. \nIt was a long trail, and my phone died on me at some point, but I was able to see where I was going eventually because the bus stop was light up by a street lamp, perched on a kind of slope that overlooked this trail below. When you stood at the top of that stop looking downwards, the entire trail and forest looked almost pitch-black, except for faint outlines in the darkness. You certainly couldn't see a person in the shadow. The bus that would take me home came in 30 minutes. The bus that would take me in the wrong direction came in 15. There was a digital clock counting down the time, as most bus stops have in my country (this was a place where public transport is generally excellent, so the last buses were still arriving at this hour).\nAt some point, maybe about 7 minutes before the bus in the wrong direction would have arrived, I heard a man yelling in the darkness. He kept yelling and yelling and like I said, this was 2am, so there was nobody else outside. As far as I knew I was completely alone, except for that woman I had passed who I had left much, much further away down on the trail. It's common to have drunks in the area so I thought it could've been nothing, but I crouched in the corner of the bus-stop (which was really a horrible place to hide) and tried to make myself as small as possible anyway. I was still shaking and kind of silently weeping from what had just happened. I'm glad I crouched. The shouts became clearer, and transformed into my name. At this point I was crying and praying, begging for any bus to arrive, while this man continued shouting my name in the darkness below, searching for me. \nNothing else happened, luckily. The shouting stayed on the trail below, and I stayed crouched at that bus-stop until the soonest bus arrived, in the wrong direction. I burst into fresh tears again as soon as I was on the bus, I'm sure I looked like I was on drugs, but nobody questioned me or said anything. I eventually made it home safely with a bit of a detour.\nSo, to the rapist who followed me through the dark at 2am, looking for me for God knows what -- let's not meet again.\nEdit: please do not post this or read this aloud anywhere. This story is deeply raw for me and I am not consenting for it to be retold, outside of my own parameters. ", "media": null, "score": 123, "upvote_ratio": 0.96, "comment_count": 22, "over_18": true}, "28": {"id": "18hy9aa", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "forhealthy", "link_flair_text": null, "time": 1702704290.3638802, "created_utc": 1702521198.0, "url": "https://www.youtube.com/watch?v=Z6miMUgmGNE", "title": "This UFO caused the closure of Hangzhou Airport, China. Looks like an exploratory mission.", "permalink": "/r/truecreepy/comments/18hy9aa/this_ufo_caused_the_closure_of_hangzhou_airport/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "This UFO caused the closure of Hangzhou Airport, China. Looks like an exploratory mission.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/Z6miMUgmGNE?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"This UFO caused the closure of Hangzhou Airport, China. Looks like an exploratory mission.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/Z6miMUgmGNE/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 2, "upvote_ratio": 0.6, "comment_count": 1, "over_18": false}, "29": {"id": "18fmmbv", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Ok_East_283", "link_flair_text": null, "time": 1702704290.5791967, "created_utc": 1702270293.0, "url": "https://www.reddit.com/r/threekings/comments/18fmmbv/candles/", "title": "Candles", "permalink": "/r/threekings/comments/18fmmbv/candles/", "selftext": "Hi everybody, hope you’re doing amazing. I came here looking for some information, I’ve been so into candles recently and I’d love to know more about their power and how to use them properly, the different meanings of their colors, how to intention a candle, etc. If anyone could help me with that, I would really appreciate it.", "media": null, "score": 4, "upvote_ratio": 1.0, "comment_count": 3, "over_18": false}, "30": {"id": "18falkx", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "34103410", "link_flair_text": "Is this undeniable evidence?", "time": 1702704291.6948237, "created_utc": 1702234912.0, "url": "https://v.redd.it/m69e9mtsli5c1", "title": "Was this a Ghost in my Airbnb? Watch the shoe! ", "permalink": "/r/Ghosts/comments/18falkx/was_this_a_ghost_in_my_airbnb_watch_the_shoe/", "selftext": "Someone tell me this is something other than a ghost. \nI went to Tucson for a UofA basketball game (go cats) and after the whole night we were crashing and eating food. I started video taping our drunk friend and during the video here, my dog is blank staring and my shoe flips right side up. So weirdddd. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/m69e9mtsli5c1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/m69e9mtsli5c1/DASH_96.mp4", "dash_url": "https://v.redd.it/m69e9mtsli5c1/DASHPlaylist.mpd?a=1705296290%2CNjZkNDNhN2RmMjcwMDQxNzE3MjBhYTljOGY3ZmU3MTZmNDQ1MTMyMWQzZDkwNDNiYmE0MzAwNzE3NWEwOWRjNQ%3D%3D&v=1&f=sd", "duration": 32, "hls_url": "https://v.redd.it/m69e9mtsli5c1/HLSPlaylist.m3u8?a=1705296290%2CYzE3OGIzNzZjNWFhNDU4Yzg5YzQ0ZTlkYmNmMmMwNGZlNDc1MDA4MDNmNjE4OThhNTEwNDY3MWJhNjQ3NDE5NA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 811, "upvote_ratio": 0.71, "comment_count": 336, "over_18": false}, "31": {"id": "18gg7mv", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "DashcamAdelaide", "link_flair_text": "Glitch Pic", "time": 1702704291.947585, "created_utc": 1702364992.0, "url": "https://i.redd.it/m97418y0dt5c1.jpeg", "title": "These two cars have a number plate that is off by one number,", "permalink": "/r/GlitchInTheMatrix/comments/18gg7mv/these_two_cars_have_a_number_plate_that_is_off_by/", "selftext": "", "media": null, "score": 48, "upvote_ratio": 0.9, "comment_count": 7, "over_18": false}, "32": {"id": "18gqjxs", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Ad1714", "link_flair_text": null, "time": 1702704293.4299033, "created_utc": 1702400321.0, "url": "https://www.tweaktown.com/news/94918/ufo-whistleblower-david-grusch-says-when-he-will-reveal-first-hand-knowledge/index.html", "title": "UFO whistleblower David Grusch says when he will reveal 'first-hand' knowledge", "permalink": "/r/ufo/comments/18gqjxs/ufo_whistleblower_david_grusch_says_when_he_will/", "selftext": "", "media": null, "score": 762, "upvote_ratio": 0.9, "comment_count": 481, "over_18": false}, "33": {"id": "18hlsvl", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "wormpetrichor", "link_flair_text": "Video", "time": 1702704294.8676112, "created_utc": 1702487809.0, "url": "https://www.c-span.org/video/?c5097853/user-clip-schumerrounds", "title": "Schumer Admits USG Has Great Amount of Info on UAPs That is Being Withheld, Re-Iterates Allegations of Rogue Programs", "permalink": "/r/UFOs/comments/18hlsvl/schumer_admits_usg_has_great_amount_of_info_on/", "selftext": "", "media": null, "score": 3691, "upvote_ratio": 0.89, "comment_count": 521, "over_18": false}, "34": {"id": "18i5he8", "locked": true, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Arethum", "link_flair_text": "Video", "time": 1702704296.6022086, "created_utc": 1702548663.0, "url": "https://v.redd.it/77sjmjc8j86c1", "title": "\"They're close.\"", "permalink": "/r/aliens/comments/18i5he8/theyre_close/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/77sjmjc8j86c1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 478, "width": 854, "scrubber_media_url": "https://v.redd.it/77sjmjc8j86c1/DASH_96.mp4", "dash_url": "https://v.redd.it/77sjmjc8j86c1/DASHPlaylist.mpd?a=1705296295%2COTc5ZjE0NDJmY2M4MzhiMGYxMGFhYzU2NzZhM2I0ODIxNmYwNDY1OWEwMTkyYWQxOWRkY2YxOWQ3MWM4NTEzYg%3D%3D&v=1&f=sd", "duration": 116, "hls_url": "https://v.redd.it/77sjmjc8j86c1/HLSPlaylist.m3u8?a=1705296295%2CMTYyMTFhNDE1OGE1ODg1MmYzZDg3YmVmOTUyMjQ4NWFjOGY3M2UxZTIzM2JlYjlmYjY2M2Q4NmVlM2JhZjVhNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1048, "upvote_ratio": 0.84, "comment_count": 349, "over_18": false}, "35": {"id": "18eiyeg", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Smurphilicious", "link_flair_text": "Discussion", "time": 1702704297.7623146, "created_utc": 1702144337.0, "url": "https://www.reddit.com/r/UAP/comments/18eiyeg/sheehan_we_now_have_recognition_from_both_houses/", "title": "Sheehan: \"We now have recognition from both houses of Congress that information exists of extraterrestrial spacecraft in our possession, and biological evidence of a non-human intelligent and highly technologically developed species. These are important official concessions that are being made\".", "permalink": "/r/UAP/comments/18eiyeg/sheehan_we_now_have_recognition_from_both_houses/", "selftext": "Sheehan's last interview was so much more than the 'bombshells' he dropped with DeclassifyUAP about Radiance Technologies etc. Everyone should really listen to everything Sheehan says in this interview. The whole thing is only 50min, and it's the reason I fell asleep with a big smile on my face last night. It's pure gold.\nThe title quote is @ 33:27\nHere's the main bullet points from the interview, a TL;DW if you need it.\n\n\nLuis Elizondo hires Sheehan after the Pentagon disavows him because Sheehan has gone toe to toe with the Pentagon in the past and won.\n\n\nSheehan filed the complaint with the Inspector General on Elizondo's behalf, demanding there be a way for military members to report these sightings without retaliation. That filing is what triggered the chain of events that led to AARO (All-domain Anomaly Resolution Office). \n\n\nSheehan reiterates that the Senate approved the bill regarding controlled disclosure over a seven year period 48 to 11, during which they would have disclosed the voluminous amount of information they have regarding this extraterrestrial civilization and the UFO phenomenon through a Review Board\n\n\nMichael Turner \"joined forces\" with Mike Rogers, and they campaigned to kill the review board, subpoena power, and eminent domain.\n\n\nMichael Turner did so at the behest of the Aerospace industry, and that Michael Turner's home district is where Patterson Air Force Base is, where the craft was taken after the Roswell incident.\n\n\nMike Rogers' district is the home of the Redstone missile testing facility and the home office of Radiance Technology\n\n\nSheehan acknowledges that although a process will be in place after Dec 21st through the \"barely passable\" NDAA language, they'll still refuse to turn over the information the same way they refused when he was working on the Iran-Contra case\n\n\nHe reiterates that the Iran-Contra case is when Sheehan & Co \"filed the Federal Criminal Racketeering lawsuit against them and dragged them into court kicking and screaming and finally forced Congress to hold a set of public hearings on Iran\". He acknowledges they were hoping they wouldn't have to file in this case, but it is what it is\n\n\nHis New Paradigm Institute is a civilian group that intends oversight on this topic, and is the only civilian group authorized to be functioning inside the Federal Enclave. They're \"immediately next door to the Senate\" they will continue to mobilize the citizenry\n\n\nSheehan says that for the US Congress to pass a law that acknowledges that there is this information in the hands of the government, and that it pertains to UFOs and NHI, is both an achievement and a ratification of David Grusch's assertions.\n\n\nHe reiterates that we now have recognition from both houses of Congress that information exists of an extraterrestrial spacecraft in our possession, and of biological evidence of a non-human intelligent and highly technologically developed species. \"These are extraordinarily important official concessions that are being made\".\n\n\nHe acknowledges that they did not succeed in obtaining the ability to extract more information from the government.\n\n\nSheehan refers to the Pentagon Papers again and says the same tactics are being used now like when they were trying to avoid the \"catastrophic disclosure\" of the Pentagon Papers. He recalls how the CIA retaliated against Senators Church and Clark for opposing them\n\n\n@40:25 \"Do you think that abductions will end up in the legislative process?\" Sheehan: \"They've made it clear to us to not ask for that to be made public yet\"\n\n\nSheehan mentions his NewsNation interview on Monday, talks about the Hill also covering the topic, reminds us that the New York Times has a vested interest in following up on this since they were the ones that published the tictac story.\n\n\nSheehan says they're going to be bringing the information they have and utilizing academic and religious institutions to bring the information to the public\n\n\nSheehan says \"newparadigminstitute.org will be the platform where we're going to be providing the information and one of the outlets for the information that's coming forward\".\n\n\n\nThe point is, they have 100% lost containment. There is literally no way to sweep this under the rug again. \nDisclosure will start slow, and then it will snowball very quickly. All it would really take is just one follow-up story from the NYT and then it would cascade from there.\nThis TED talk is a good example of what I mean", "media": null, "score": 506, "upvote_ratio": 0.95, "comment_count": 83, "over_18": false}, "36": {"id": "18evq9y", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "randomredhead10", "link_flair_text": null, "time": 1702704299.0311315, "created_utc": 1702183514.0, "url": "https://i.redd.it/xtij0djide5c1.jpg", "title": "Uhm? He died tomorrow?", "permalink": "/r/conspiracy/comments/18evq9y/uhm_he_died_tomorrow/", "selftext": "", "media": null, "score": 1573, "upvote_ratio": 0.85, "comment_count": 404, "over_18": false}, "37": {"id": "18hm216", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1702704299.3603082, "created_utc": 1702488445.0, "url": "https://youtu.be/djGEwEN1vi0", "title": "Intimate Encounters with Extraterrestrials: A Psychic Stephany Fay Cohen Tale", "permalink": "/r/conspiracyfact/comments/18hm216/intimate_encounters_with_extraterrestrials_a/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Intimate Encounters with Extraterrestrials: A Psychic Stephany Fay Cohen Tale", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/djGEwEN1vi0?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Intimate Encounters with Extraterrestrials: A Psychic Stephany Fay Cohen Tale\"></iframe>", "author_name": "Paranormal Highway", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/djGEwEN1vi0/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@ParanormalHighway"}}, "score": 1, "upvote_ratio": 0.57, "comment_count": 2, "over_18": false}, "38": {"id": "18e7brt", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "halfbreed_prince", "link_flair_text": "art", "time": 1702704299.9586034, "created_utc": 1702103158.0, "url": "https://i.redd.it/stulbtpkq75c1.jpg", "title": "Sure hope it’s the wind", "permalink": "/r/bigfoot/comments/18e7brt/sure_hope_its_the_wind/", "selftext": "", "media": null, "score": 220, "upvote_ratio": 1.0, "comment_count": 16, "over_18": false}, "39": {"id": "18g1nv2", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1702704300.6598191, "created_utc": 1702322534.0, "url": "https://i.redd.it/b7nhh75vup5c1.png", "title": "Encounters Between U-Boats and Cryptids", "permalink": "/r/Cryptozoology/comments/18g1nv2/encounters_between_uboats_and_cryptids/", "selftext": "", "media": null, "score": 87, "upvote_ratio": 0.97, "comment_count": 11, "over_18": false}, "40": {"id": "18j2lc9", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "minecraftmarbles2", "link_flair_text": null, "time": 1702704301.7367713, "created_utc": 1702653988.0, "url": "https://i.redd.it/9u1bq16h8h6c1.jpeg", "title": "Have you ever seen a shadow figure??", "permalink": "/r/cryptids/comments/18j2lc9/have_you_ever_seen_a_shadow_figure/", "selftext": "Shadow figures or apparitions, are sometimes caused by sleep paralysis. Which is the most terrible thing.", "media": null, "score": 56, "upvote_ratio": 0.85, "comment_count": 52, "over_18": false}, "41": {"id": "18fjap0", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Sunny_of_Floriduh", "link_flair_text": "Discussion/Advice", "time": 1702704301.9622533, "created_utc": 1702259291.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/18fjap0/teleported_while_driving/", "title": "Teleported? While Driving", "permalink": "/r/Thetruthishere/comments/18fjap0/teleported_while_driving/", "selftext": "Yesterday I was driving to meet my sister. I was NOT tired, sick, drinking, doing drugs or distracted in any way. In fact, my memory leading up to it was very acute. I was following a brown truck and passed them. We came to an intersection where I needed to make a left turn and shortly after would be making a left onto the highway. The left turn light was red and I stopped. The brown truck went straight and had a green light so they passed me. My light turned to a flashing yellow arrow so I waited for 6-7 cars to move through the intersection so I could make the left. I looked in the rearview mirror worried the driver behind might be frustrated with waiting and saw it was a purpleish SUV. I was finally able to make the turn and saw the SUV follow but as soon as I finished the turn and looked back forward, my navigation was showing that I needed to turn around like I was going the wrong way. I was really confused as I knew I had been going the right way.  I really didnt know where I was because the area looked totally different, like there was no highway overpass ahead. I followed the navigation directions and ended up at the same light making the left turn again. At first I thought maybe I had turned left on some side street before the highway entrance. But here is the thing. There was NO place to turn becuase the intersection is right next to the highway. There is no possible way I could have ended up going back onto that road and in that direction without driving at least 1/4 mile including passing under the highway overpass, going through 2 lights, making a u-turn and then going back though all if that before making a right turn to get back on the original street. Also it was instantaneous. I did not \"lose any time\". I've had strange experiences before but nothing like this and I don't know what to make of it.", "media": null, "score": 43, "upvote_ratio": 0.88, "comment_count": 17, "over_18": false}, "42": {"id": "18gvesc", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Aurora9794", "link_flair_text": null, "time": 1702704302.21075, "created_utc": 1702412611.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/18gvesc/someone_keeps_knocking_at_my_door_late_at_night/", "title": "Someone keeps Knocking at my Door Late at Night.", "permalink": "/r/LetsNotMeet/comments/18gvesc/someone_keeps_knocking_at_my_door_late_at_night/", "selftext": "In june of this year i moved out of my parents apartment as i finally got a steady job and longed for some sort of freedom, i looked for apartments that were affordable in my city and found one thats a 2 or 3 minute walk from my parents apartment. To me it was perfect, id get to live alone and my parents would still be nearby so i could visit them whenever i wanted or pop in to have breakfast with them. The apartment itself is great, its not really much to look at but for a single male its more than enough.\nMy apartment has a long corridor connecting each room together from the sides, with my front door being at the start of the corridor, my bedroom is the second room on the left but since the walls are pretty thin you can literally hear people in the apartment complex walking,talking,etc. from my bedroom (and any room for that matter).\nLast week i came home from the pub after meeting up with a few friends, it wasnt really late (around 10:15 or 10:30-ish) and i had the day off so i took a shower and hopped into bed to watch Netflix, it was probably around midnight when i heard a feint knock coming from the front door. I stopped the show that i was watching and listened for a minute or so and just thought that it was my mind playing tricks on me. I continued watching Netflix when once again i heard a two motion knock on my door, i sat up from bed went to the door and look through the peep hole and sure enough it was pitch black i once again shrugged it off and went back to my room but before i could even sit down properly i heard a slightly louder knock knock. \nAt this point i thought it was my friends playing a prank on me so i called my friend and asked if he was knocking on my door and if he was it wasnt amusing, he paused for a second and said \"dude im at home, i have to be up at like 7 30\" i believed him and hung up the phone, i was talking pretty loudly so whoever was knocking probably heard me and as soon as i hung up i heard another knock. At this point i was pretty pissed off so i walked to the door looked through the peep hole and saw nothing, i then unlocked the door took a peak and closed the door and locked it, me being angry and a bit intoxicated i decided to wait and catch whoever was knocking, so i spent a solid 10 minutes silently looking through the peep hole before being a bit startled as someone put their hand over the peep hole and knocked again, i immediately started unlocking the door and ran out to the apartment hall, i heard someone booking it down the steps and heard him (supposedly) lean against the wall as his jacket shrugged the wall, so i ran a few steps down before realizing that whoever this is, was waiting behind the corner to get the jump on me. I hurried back inside and called the cops, they were there within a few minutes and scanned the building and the street but couldnt find anyone, they told me that it could just be some kids pulling a prank and to never run after someone, they kept a patrol car around the entire night and the knocking stopped.\nIt could have been some kids being dumb, but the part that gave me the fucking creeps was the fact that whoever it was ran down the stairs and stopped behind the corner, he didnt keep running. If it were some pranksters i find it more likely that they would have just booked it outside. As i said its been a week and the knocking stopped, it kept me on edge for a few days because i just expected to be jumped by someone when walking into my apartment but so far nothing has come of it.\nIve let it go atp and just hope that it wont happen again.", "media": null, "score": 116, "upvote_ratio": 0.96, "comment_count": 28, "over_18": true}, "43": {"id": "18ibhve", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Selim_210", "link_flair_text": null, "time": 1702704302.6270447, "created_utc": 1702568794.0, "url": "https://www.reddit.com/r/threekings/comments/18ibhve/im_super_new_to_this_ritual_and_game_stuff_so_i/", "title": "I'm super new to this ritual and game stuff so i have a question.", "permalink": "/r/threekings/comments/18ibhve/im_super_new_to_this_ritual_and_game_stuff_so_i/", "selftext": "Is this stuff just creepypasta, something like SCP which is just creative writing community. There's probably a better way to ask this question but you know what i'm trying to ask.", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "44": {"id": "18hwt6l", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Streay", "link_flair_text": "Personal Encounter ", "time": 1702704303.560933, "created_utc": 1702516775.0, "url": "https://www.reddit.com/gallery/18hwt6l", "title": "This is where my father and I experienced the scariest feeling imaginable", "permalink": "/r/Ghosts/comments/18hwt6l/this_is_where_my_father_and_i_experienced_the/", "selftext": "This was (now demolished) the Doris Duke mansion at Duke Estates in Hillsborough New Jersey.\nBefore this was removed, me and my father had one of the scariest encounters in our life here.\nBack in the late 00’s, me and my father went to the estate for a boy scout outting. After everything was over, my father, my friend, my friends father and I decided to walk around for a little bit.\nWe stumbled upon the closed down mansion, and decided to sneak past the gates to have a look around. After we last those gates, I started to get a really weird anxious feeling, but just brushed it off. My friend and his father ran somewhere, and my dad and I were at the side of the house.\nWe both instantly freeze up, and get this absolute dread and fear coursing through our bodies. I’m in absolute tears, but we can’t move. \nMy dad recounts that he heard a voice screaming “LEAVE NOW”, but he replied, “I’m a follower of Jesus Christ and God, you can’t hurt us”. The feeling then slowly subsided, and we can move. We got out of there quickly, and didn’t talk about it for about a decade. \nWhen I brought this up a few years ago, he was surprised I even remembered. We talked it over and we both remember the same exact events and how it played out.\nMy friend and his father didn’t experience this though, just us two. \nHas anyone else had an experience like this? I can still vividly remember that horrible feeling.", "media": null, "score": 677, "upvote_ratio": 0.9, "comment_count": 108, "over_18": false}, "45": {"id": "18eauag", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "FlashpointConsulting", "link_flair_text": "Glitch Vid", "time": 1702704303.8267605, "created_utc": 1702118012.0, "url": "https://youtu.be/7JdiPXrPTwQ", "title": "the matrix showing what happens when all the news agencies have the same owner", "permalink": "/r/GlitchInTheMatrix/comments/18eauag/the_matrix_showing_what_happens_when_all_the_news/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "the matrix showing what happens when all the news agencies have the same owner", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/7JdiPXrPTwQ?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"the matrix showing what happens when all the news agencies have the same owner\"></iframe>", "author_name": "James Cook", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/7JdiPXrPTwQ/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@moneymotion904"}}, "score": 45, "upvote_ratio": 0.89, "comment_count": 7, "over_18": false}, "46": {"id": "18i546m", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Hard_reboot_button", "link_flair_text": "Mainstream Media", "time": 1702704305.4991627, "created_utc": 1702547049.0, "url": "https://youtu.be/M01DWnEQeSI?si=ebnc_FivUIlWKS3p", "title": "NHI Contact with Humans Confirmed by Former Head of NOAA and Former Admiral Gallaudet", "permalink": "/r/ufo/comments/18i546m/nhi_contact_with_humans_confirmed_by_former_head/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "NHI Contact with Humans Confirmed by Former Head of NOAA and Former Admiral Gallaudet", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/M01DWnEQeSI?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"NHI Contact with Humans Confirmed by Former Head of NOAA and Former Admiral Gallaudet\"></iframe>", "author_name": "Unidentified Anomalous Phenomena", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/M01DWnEQeSI/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@UnidentifiedAerialPhenomena0"}}, "score": 522, "upvote_ratio": 0.96, "comment_count": 161, "over_18": false}, "47": {"id": "18huurk", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "showmeufos", "link_flair_text": "News", "time": 1702704306.8943853, "created_utc": 1702511154.0, "url": "https://www.reddit.com/r/UFOs/comments/18huurk/tim_gallaudet_i_think_its_about_time_that_we_do/", "title": "Tim Gallaudet: \"I think it's about time that we do disclose we are in contact with non-human intelligence. That's what needs to be put out there in the public.\"", "permalink": "/r/UFOs/comments/18huurk/tim_gallaudet_i_think_its_about_time_that_we_do/", "selftext": "Retired Rear Admiral Tim Gallaudet was just interviewed by Ross Coulthart on NewsNation's \"Elizabeth Vargas Reports\" program.\nLINK TO THE VIDEO OF THE FULL TIM GALLAUDET INTERVIEW\nFull Transcript:\n\nRoss: \"Tim, you've said, publicly, that you think UFO's, UAP's are the story of the century.\"\nTim: \"We're being visited by nonhuman intelligence with technology we don't understand, with intentions we don't understand either.\"\nRoss: \"Now really I'm surprised to hear that from a former high ranking flag officer from the US navy that you're stating categorically that you believe NHI, non-human intelligence, are real.\"\nTim: \"Absolutely.\"\nTim: \"One of my jobs in the navy I was the chief meteorologist of the navy, at the time when (unclear) Ryan was encountering UAP off the US East Coast. People know that I received a secret email with the go-fast video attached to it, from my boss, my bosses operations officer, where I learned that these were happening in training air space and causing near mid-air collisions. So that safety issue is important, and I couldn't believe... well I understood why... but the Navy didn't do anything about that and actually pulled back that email from my computer on the secret network.\"\nRoss: \"Clearly you believe there's a cover up.\"\nTim: \"Yes.\"\nRoss: \"Why are they covering it up? You're probably one of the more highly cleared public officials from the military, past serving, that's basically come out publicly and said this is real. Why do you think there's this cover up? What are they concealing?\"\nTim: \"This is technology we're still trying to learn about, and it could give us an advantage in any military conflict. So that's a good reason to not disclose the nature of the technology. We don't want to release and disclose all of the technology we have recovered. However, I think it's about time that we do disclose we are in contact with non-human intelligence. That's what needs to be put out there in the public.\"\nRoss: \"Shouldn't it be really important that... somebody certainly at your level in the Navy, should be allowed to openly to your colleagues about the flight safety risks that these kind of things are posing?\"\nTim: \"Absolutely, this is a safety issue.\"\nRoss: \"The problem Tim is that a lot of the government is in absolute denial, I mean you talk about a fact about the crash retrieval program, and we're talking here about retrieved non-human technology, aren't we?\"\nTim: \"Yes.\"\nRoss: \"And yet there are people here in the government still saying we've seen no credible evidence of this phenomenon. What do you say to that?\"\nTim: \"So what you have going on right now, again... legacy classified programs, special access programs, without congressional direction, and without Whitehouse policy... that's not going to change.\"\n\nTim Gallaudet made several notable statements in this interview, including:\n\n\"We're being visited by nonhuman intelligence with technology we don't understand.\"\n\"This is technology we're still trying to learn about, and it could give us an advantage in any military conflict. So that's a good reason to not disclose the nature of the technology.\"\n\"We don't want to release and disclose all of the technology we have discovered.\"\n\"I think it's about time that we do disclose we are in contact with non-human intelligence. That's what needs to be put out there in the public.\"\n\"This is a safety issue.\"\n\"So what you have going on right now, again... legacy classified programs, special access programs, without congressional direction, and without Whitehouse policy... that's not going to change.\"\n\nRoss Coulthart made several statements following the interview when he was chatting 1-on-1 with Elizabeth Vargas:\n\n\"I can tell you this is a measure of the depth of feeling at the highest levels of military and intelligence community leadership that it's really time people start speaking out about this issue.\"\n\"I think the intransigence by the house republicans to stopping the UAP disclosure legislation is just going to force greater public disclosure. Because there is impatience at the highest levels of military that this is a safety and national security issue that needs to be urgently addressed. When you see a Rear Admiral, Retired, at the caliber of Tim Gallaudet making those statements, I find it quite sobering.\"\n\"I think it's time the public was told the truth, and so do very serious people in the US government, military, and intelligence community.\"\n\"There's a view very strongly in the congress, and that's expressed in what Senator Schumer and Senator Rounds have said today. They've made very very clear the battle is not over, they want that presidential records review panel, and they're not going down without a fight.\"\n\"I know he [Gallaudet] knows a lot more than he's able to say publicly.\"\n\"What I can tell you is we have not seen the last of first-hand witnesses prepared to come forward to talk about this issue. And once again, I re-iterate, if there ever was a time for leadership to be shown at the highest levels of government, this is the moment. If the US really does want to control the narrative and make sure the public is let into this story gently, now is the time.\"\n\nMy personal thoughts: It appeared to me as if this Tim Gallaudet interview was a short segment of a much longer interview he held with Ross. I wonder if we'll see the rest sometime soon.", "media": null, "score": 3467, "upvote_ratio": 0.91, "comment_count": 531, "over_18": false}, "48": {"id": "18f8mqe", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Blassonkem", "link_flair_text": "LMAO :snoo_trollface: (Sundays Only)", "time": 1702704308.5901916, "created_utc": 1702229528.0, "url": "https://i.redd.it/qx74ar7c6i5c1.jpeg", "title": "2023/2024", "permalink": "/r/aliens/comments/18f8mqe/20232024/", "selftext": "", "media": null, "score": 1042, "upvote_ratio": 0.93, "comment_count": 138, "over_18": false}, "49": {"id": "18imz3m", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Video", "time": 1702704309.6690824, "created_utc": 1702599519.0, "url": "https://v.redd.it/1ux0am2eqc6c1", "title": "Dr. Garry Nolan interviewed by Ross Coulthart: \"There’s something that they’re trying to hide. You have the government twisting itself into pretzels to try to not admit what's going on. There’s somebody smarter than us. You can’t wait for daddy government to tell you what you think you already know\"", "permalink": "/r/UAP/comments/18imz3m/dr_garry_nolan_interviewed_by_ross_coulthart/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/1ux0am2eqc6c1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1274, "scrubber_media_url": "https://v.redd.it/1ux0am2eqc6c1/DASH_96.mp4", "dash_url": "https://v.redd.it/1ux0am2eqc6c1/DASHPlaylist.mpd?a=1705296308%2CZjRiMmY4OGE3YWRiNDhjYTEwNzA3ODdjOGE2YjM2NDg5NzQwY2VmYWYxNjYzMTNlODRkOTU0NDA3NmE3ZjNkZA%3D%3D&v=1&f=sd", "duration": 356, "hls_url": "https://v.redd.it/1ux0am2eqc6c1/HLSPlaylist.m3u8?a=1705296308%2CYjc1MGU1MTQ3MWNkYjU2M2E5ZjIwMDA4ZjdjOGIyMjBmMDc0M2Y5ZDZlNGUzNGJlY2Y5OTM2NmU5MmRkMjZjNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 333, "upvote_ratio": 0.97, "comment_count": 43, "over_18": false}, "50": {"id": "18icpks", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "unwokemillenial_", "link_flair_text": null, "time": 1702704311.1974144, "created_utc": 1702572099.0, "url": "https://www.reddit.com/gallery/18icpks", "title": "Never forget the death of the Dislike button.", "permalink": "/r/conspiracy/comments/18icpks/never_forget_the_death_of_the_dislike_button/", "selftext": "It's been exactly 2 years since YouTube took away the dislike button as the W H was repeatedly disliked into oblivion.  \nThe original screenshots showing dislikes were from November 2021. By mid-December, the dislike button disappeared for good. \nThis was one month out from the launch of the Canadian freedom convoy over Biden's border vaccine mandates. Unvaccinated people were told not to gather over Christmas.  They censored the majority and made us feel crazy, isolated, and demoralized.", "media": null, "score": 1464, "upvote_ratio": 0.87, "comment_count": 155, "over_18": false}, "51": {"id": "18ey0lq", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1702704311.5327785, "created_utc": 1702192421.0, "url": "https://youtu.be/ZJZsQ55G29I", "title": "Twin Sisters Audrey and Debbie Have Been Together on Alien Abductions", "permalink": "/r/conspiracyfact/comments/18ey0lq/twin_sisters_audrey_and_debbie_have_been_together/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Twin Sisters Audrey and Debbie Have Been Together on Alien Abductions", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/ZJZsQ55G29I?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Twin Sisters Audrey and Debbie Have Been Together on Alien Abductions\"></iframe>", "author_name": "Paranormal Highway", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/ZJZsQ55G29I/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@ParanormalHighway"}}, "score": 1, "upvote_ratio": 0.67, "comment_count": 1, "over_18": false}, "52": {"id": "18fymn1", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "aceoftrachs", "link_flair_text": "humor", "time": 1702704312.4729655, "created_utc": 1702312521.0, "url": "https://i.redd.it/z8bgzyf41p5c1.jpeg", "title": "God gives the toughest challenges to the strongest bipedal humanoid hair-apes.", "permalink": "/r/bigfoot/comments/18fymn1/god_gives_the_toughest_challenges_to_the/", "selftext": "", "media": null, "score": 171, "upvote_ratio": 0.94, "comment_count": 11, "over_18": false}, "53": {"id": "18eq9ba", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "zbird8596", "link_flair_text": "Art", "time": 1702704313.1581438, "created_utc": 1702165177.0, "url": "https://i.redd.it/xl8xeysyuc5c1.jpg", "title": "White River Monster sketch", "permalink": "/r/Cryptozoology/comments/18eq9ba/white_river_monster_sketch/", "selftext": "Working on some cryptids from Arkansas for a project.", "media": null, "score": 89, "upvote_ratio": 0.98, "comment_count": 14, "over_18": false}, "54": {"id": "18g1z3k", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": null, "time": 1702704314.303414, "created_utc": 1702323298.0, "url": "https://i.redd.it/dzy8jbj4xp5c1.png", "title": "Encounters between German U-boats and cryptids are surprisingly common. Here's an image with the four known alleged encounters.", "permalink": "/r/cryptids/comments/18g1z3k/encounters_between_german_uboats_and_cryptids_are/", "selftext": "", "media": null, "score": 54, "upvote_ratio": 0.96, "comment_count": 8, "over_18": false}, "55": {"id": "18hed8d", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "feelmar", "link_flair_text": "Discussion/Advice", "time": 1702704314.5363922, "created_utc": 1702465310.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/18hed8d/obe_or_going_crazy/", "title": "OBE or going crazy", "permalink": "/r/Thetruthishere/comments/18hed8d/obe_or_going_crazy/", "selftext": "Something weird that I’ve never experienced before has been happening the past few days.\nEvery night for the past like almost a week, when I go to sleep and I’m drifting off, I get this almost out of body experience that I’m doing something I’m not. I mean, I know I’m supposed to be in bed and falling asleep, but my mind goes to a completely different place. For example, the one thing that’s been happening every night is, I see and feel myself being outside smoking and telling myself “why am I smoking outside rn I need to go to bed I’m supposed to be in bed” and then I have to open my eyes and do a reality check so I can be 100% sure I’m in bed. When I do that, I see my room, look around for a few seconds and am like “whaat was that” and this keeps happening almost until I finally fall asleep or somehow try and “control” myself.\nThere have been a few different “visions” like me being in the bathroom or sth but this one is the one that keeps happening the most. It feels too real to the point I’m utterly confused when I open my eyes and I can’t explain it, could it really be an OBE without me controlling it? If not, how else can this be explained?", "media": null, "score": 7, "upvote_ratio": 0.71, "comment_count": 9, "over_18": false}, "56": {"id": "18hdy36", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "YouAreSoGorgeous", "link_flair_text": null, "time": 1702704314.7664192, "created_utc": 1702463557.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/18hdy36/my_neighbour_threatened_to_kill_me/", "title": "My neighbour threatened to kill me.", "permalink": "/r/LetsNotMeet/comments/18hdy36/my_neighbour_threatened_to_kill_me/", "selftext": "Back when I was 17 I lived alone in a small unit that was part of a divided house. At first everything was completely normal, I never saw my neighbours and there was certainly no aggression. After a few weeks of living there it began, every night my neighbour would bang on the wall that adjoined our units... it was always between the hours of 2am to 4am and sometimes would last hours... as a 17 year old girl living alone I was petrified. I'm not sure what was louder.. the banging or the sound of my heart thumping in my chest.   \nI told my mother about it but she didn't believe me, she would visit for a few nights at a time and when she was there the banging would stop... until one night it didn't. She heard it and  made the decision to start banging back against the wall. \nThe next day when I was at school he approached my mum, I'm not sure what he said but she later told me he had threatened my life. \nOver the next few weeks I was couch surfing, only going back to my unit to get the stuff that I needed and each time I was there the door had been broken in. A total 8 times (before we managed to break lease) he broke in, he never stole anything. We reported it and the police concluded that he was the person breaking in and was simply smoking in the corner of my living room. After about 5 weeks of fighting we managed to break the lease and get my stuff out of there... the realestate were real cunts about it. \nI remained homeless for the rest of the year. He was never charged with anything. I still can't sleep alone.", "media": null, "score": 94, "upvote_ratio": 0.98, "comment_count": 7, "over_18": true}, "57": {"id": "18iaz3f", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Selim_210", "link_flair_text": null, "time": 1702704315.1666608, "created_utc": 1702567318.0, "url": "https://www.reddit.com/r/threekings/comments/18iaz3f/is_the_10_day_dream_curse_real/", "title": "Is the 10 Day Dream curse real?", "permalink": "/r/threekings/comments/18iaz3f/is_the_10_day_dream_curse_real/", "selftext": "The Ghost In My Machine says that you automatically start playing once you read the instructions.", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "58": {"id": "18jfu9b", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Acrobatic_Force_4215", "link_flair_text": null, "time": 1702704315.972704, "created_utc": 1702690000.0, "url": "https://i.redd.it/wwk8mtwj7k6c1.png", "title": "What do you think this blue flame is above my Dad and his dog as he sat by a fire?", "permalink": "/r/Ghosts/comments/18jfu9b/what_do_you_think_this_blue_flame_is_above_my_dad/", "selftext": "My dad and his dog on Thanksgiving this year.", "media": null, "score": 274, "upvote_ratio": 0.82, "comment_count": 167, "over_18": false}, "59": {"id": "18eau80", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ro_cco", "link_flair_text": "Glitch Pic", "time": 1702704316.2412634, "created_utc": 1702118005.0, "url": "https://i.redd.it/irykzm0qy85c1.jpg", "title": "Walnut Glitch", "permalink": "/r/GlitchInTheMatrix/comments/18eau80/walnut_glitch/", "selftext": "", "media": null, "score": 23, "upvote_ratio": 0.83, "comment_count": 3, "over_18": false}, "60": {"id": "18hctks", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Hard_reboot_button", "link_flair_text": "Mainstream Media", "time": 1702704317.7623918, "created_utc": 1702458663.0, "url": "https://youtu.be/vjqCXKIebPI?si=qbz9IMI7j-8ciWJI", "title": "The Gruschinator has had enough of your shit", "permalink": "/r/ufo/comments/18hctks/the_gruschinator_has_had_enough_of_your_shit/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "David Grusch calls on Americans to make UAPs an election issue | Vargas Reports", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/vjqCXKIebPI?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"David Grusch calls on Americans to make UAPs an election issue | Vargas Reports\"></iframe>", "author_name": "NewsNation", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/vjqCXKIebPI/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@NewsNation"}}, "score": 477, "upvote_ratio": 0.92, "comment_count": 199, "over_18": false}, "61": {"id": "18g8bek", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "tinosaladbar", "link_flair_text": "Video", "time": 1702704319.2110956, "created_utc": 1702339292.0, "url": "https://v.redd.it/darabqfd8r5c1", "title": "David Grusch on Newsnation ", "permalink": "/r/UFOs/comments/18g8bek/david_grusch_on_newsnation/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/darabqfd8r5c1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/darabqfd8r5c1/DASH_96.mp4", "dash_url": "https://v.redd.it/darabqfd8r5c1/DASHPlaylist.mpd?a=1705296318%2CNTM2ZDFhODNjYTQyYjMwMTRjNjMyMmFlMzBjMmE1ZjE2ZmE0NzVhMGEzNmZjZTg0MjZkNTdkYmMzOWQwZDc5Nw%3D%3D&v=1&f=sd", "duration": 562, "hls_url": "https://v.redd.it/darabqfd8r5c1/HLSPlaylist.m3u8?a=1705296318%2CNTA0Mzk0YjgwODNlZDUyNDU5ZmU5MzJjYWY5YjFhMGMwYzk4NWJmMTdlZDRiYjYyYmZkMDg0YzQ4M2U0OWRkYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2838, "upvote_ratio": 0.96, "comment_count": 353, "over_18": false}, "62": {"id": "18ess9i", "locked": true, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "gringoswag20", "link_flair_text": "Discussion :table:", "time": 1702704320.909363, "created_utc": 1702173137.0, "url": "https://www.reddit.com/gallery/18ess9i", "title": "Our Ancients and Religions Have Been Warning us about Aliens.", "permalink": "/r/aliens/comments/18ess9i/our_ancients_and_religions_have_been_warning_us/", "selftext": "Someone recently made a post like “I think this is the disclosure.\n I think the entities are in control of our government/world government.\nThe president asked for free energy and a new propulsion system and the shadow government blocked it. “\nNot just because this is my hypothesis,\nbut I genuinely think it’s the most realistic guess according to the teachings and lessons of all combined religions.\nI came to this conclusion because I had been studying ancient Sumerians, Zulu, Gnostic Christianity, Islamic Sufism, Taoism, Buddhism, and Hinduism.\nIn the last post, I mentioned how every religion is saying the same truth and teachings. We are all reflections of god. God having a hallucination and thinking it’s you.\nIf someone can look within, and see through your ego and the material world. You can see death is an illusion and this reality is an illusion/maya.\n We can only see light from the fraction of reality we can’t even comprehend. \nWe are blind relatively. \nAll religions and all prophets warn us not to forget who we are. \nTo not be tricked and led to a lower frequency; enslaved to this world never waking up to your true nature. \nEndless death, endless rebirth. \nThink of how many people are starting to wake up all at the same ‘time’.\nIf this full bill got passed we would have had free energy, a new anti-gravity propulsion system, and most likely some time of space-time/ wormhole stuff… now\nBut no it is endless wars, inflation, pandemics, etc.\nIt’s all a game by these beings who are controlling the shadow gov; making us forget we are god so we can be enslaved\nI see truth in the prophecy and Thoth, and Hermes, and the second coming of a “Christ” (anointed) consciousness I feel is on the horizon. \nThe creator, maybe working through other beings, or a manifestation through us, has to right its creation.", "media": null, "score": 999, "upvote_ratio": 0.8, "comment_count": 377, "over_18": false}, "63": {"id": "18gepr1", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Smurphilicious", "link_flair_text": "Interview", "time": 1702704321.9489303, "created_utc": 1702359280.0, "url": "https://www.reddit.com/r/UAP/comments/18gepr1/sheehans_latest_interview_made_me_skeptical_then/", "title": "Sheehan's latest interview made me skeptical, then immediately humbled me", "permalink": "/r/UAP/comments/18gepr1/sheehans_latest_interview_made_me_skeptical_then/", "selftext": "@ 34:42\n\nthe technology of being able to integrate uh sentient Consciousness into a machine is what's going on with AI right now that they're actually they're actually using human stem cells to put into the computers to generate human dendrites and synapses from the brain uh into the computers\n\nI hear Sheehan say this and I instantly paused the video because there's no way this story he's telling is true, it can't be. I immediately fact check it.\nIt's true. They've been integrating brain cells with computers for AI.\nhttps://www.technologyreview.com/2023/12/11/1084926/human-brain-cells-chip-organoid-speech-recognition/\n\nFeng Guo and his team at Indiana University Bloomington generated a brain organoid from stem cells, attached it to a computer chip, and connected their setup, known as Brainoware, to an AI tool. They found that this hybrid system could process, learn, and remember information. It was even able to carry out some rudimentary speech recognition. The work, published today in Nature Electronics, could one day lead to new kinds of bio-computers that are more efficient than conventional computers.\n\nhttps://www.msn.com/en-us/health/other/ai-made-from-living-human-brain-cells-performs-speech-recognition/ar-AA1ll1Ma\nhttps://www.nature.com/articles/d41586-023-03975-7\nhttps://techxplore.com/news/2023-03-real-ai-biology-powered-human.html\nIt's blowing my mind. Not the idea of it, but the fact that they've already done it. That first article was published today, Dec 11th 2023.\nThis is my Ontological Shock 2: Electric Boogaloo.", "media": null, "score": 330, "upvote_ratio": 0.93, "comment_count": 80, "over_18": false}, "64": {"id": "18godil", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "UniversalSurvivalist", "link_flair_text": "Rule 10 Reminder", "time": 1702704323.2329779, "created_utc": 1702394723.0, "url": "https://i.redd.it/l33n9lujtv5c1.png", "title": "Its ok to spread lies about \"science\" when gangsters and bent governments are the gatekeepers of scientific journals, it's not ok for Alex Jones to do it", "permalink": "/r/conspiracy/comments/18godil/its_ok_to_spread_lies_about_science_when/", "selftext": "", "media": null, "score": 1438, "upvote_ratio": 0.79, "comment_count": 400, "over_18": false}, "65": {"id": "18etrz2", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1702704323.556793, "created_utc": 1702176496.0, "url": "https://www.youtube.com/watch?v=3QbrCl-XdZA", "title": "Watch one of the closest and clearest video footage of a UFO - exciting scenes and details.", "permalink": "/r/conspiracyfact/comments/18etrz2/watch_one_of_the_closest_and_clearest_video/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Watch one of the closest and clearest video footage of a UFO - exciting scenes and details.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/3QbrCl-XdZA?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Watch one of the closest and clearest video footage of a UFO - exciting scenes and details.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/3QbrCl-XdZA/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 1, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "66": {"id": "18ebz0n", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Aimerfii", "link_flair_text": "humor", "time": 1702704324.1820447, "created_utc": 1702122503.0, "url": "https://i.redd.it/c08p3in3c95c1.jpg", "title": "True", "permalink": "/r/bigfoot/comments/18ebz0n/true/", "selftext": "", "media": null, "score": 153, "upvote_ratio": 0.95, "comment_count": 6, "over_18": false}, "67": {"id": "18j8rvh", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "jaxdav", "link_flair_text": "Art", "time": 1702704324.8265653, "created_utc": 1702670298.0, "url": "https://i.redd.it/ui9fotjyki6c1.jpeg", "title": "My drawing of a Luna Mothman!", "permalink": "/r/Cryptozoology/comments/18j8rvh/my_drawing_of_a_luna_mothman/", "selftext": "", "media": null, "score": 84, "upvote_ratio": 0.95, "comment_count": 10, "over_18": false}, "68": {"id": "18euzc0", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "schug", "link_flair_text": null, "time": 1702704326.007248, "created_utc": 1702180781.0, "url": "https://i.redd.it/lq35h8yd5e5c1.png", "title": "Flatwoods Monster Tattoo by Theo Mindell at Spider Murphy's in San Rafael, CA", "permalink": "/r/cryptids/comments/18euzc0/flatwoods_monster_tattoo_by_theo_mindell_at/", "selftext": "Part 3 of my cryptid sleeve", "media": null, "score": 38, "upvote_ratio": 0.93, "comment_count": 3, "over_18": false}, "69": {"id": "18id0xt", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Zealousideal-Dog3022", "link_flair_text": null, "time": 1702704326.463216, "created_utc": 1702572947.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/18id0xt/someone_tried_to_break_into_my_house_and_find_me/", "title": "Someone tried to break into my house and find me.", "permalink": "/r/LetsNotMeet/comments/18id0xt/someone_tried_to_break_into_my_house_and_find_me/", "selftext": "This story happened 3 years ago, around the time that COVID started so it was a while back but still worthy of a post.\nIt was early 2020 and i had just gotten a new job in a small town near my area, while looking for a place to live my sister offered to rent her house to me, she had bought the house 2 years prior but she and her husband didnt really take to it and their commute to work was long so they moved out and the house was uninhabited. \nLuckily for me it was actually pretty close to my work place (around a 40 minute drive) and my sister pretty much rented it for free to me, i just paid for the water and electricity and looked after the house. \nI was living there for a solid 2 or 3 months and had already gotten used to it, one night after coming back from work and parking my car, as i walked towards my door i noticed something odd, there was a cigarette butt on the curb to my house, i leaned down and picked it up thinking that it might have been mine since im a smoker but after looking at the brand name i realized that it wasnt mine and threw it away, i didnt think much of it and just shrugged it off as some asshole throwing it at my curb. I went on with my night and nothing unusual happened.\n2 Days later i was once again walking to my house when i spotted a few more cigarette butts, this time near my porch, needless to say i was pissed off and thought that someone sat on my porch and smoked but since i didnt know who it was there was nothing i could do about it, i noticed that they were put out pretty recently so whoever it was probably walked off as i was approaching.\nThat night i was watching a movie on my laptop and it was pretty late (past 1AM) so i was surprised when i heard a car passing by, its a suburban neighbourhood and it was covid so people rarely ventured out at night but i didnt think much of it. \nAround half an hour later i was surprised when i heard chattering nearby, i listened intently but i couldnt hear what they were talking about as their voiced seemed almost muffeled and quiet, by this point i was getting a bit unnerved so i stopped the movie and quietly got off my sofa and walked to the front door to make sure that it was locked, as i was approaching the door i froze mid step as i heard the two approaching my porch and reducing their talking to a whisper, i realized right away that whoever this was wanted to break in. \nI leaned against my front door and waited, expecting a loud bang against the door or the doorknob being shaken but it was oddly quiet. I decided to walk over to my window to see if they had walked away or changed their mind. My windows have bars from the inside out that you have to unlock so that you could move the curtains or look out the window comfortably.\nI slowly unlocked the bar mechanism and lifted it up, i moved the curtains and was taken aback, leaning up against my window was a man, he was as startled as i was because he basically stuttered over his own steps as he jumped back, he tightened his hoodie to cover his face so all i could really see was his big blue eyes looking at me, his friend realized what was going on and right away started to kick the door in, he kicked it a solid 4 or 5 times but the door wouldnt budge, all the while i was staring at them frozen in fear and trying to comprehend the situation, i snapped out of it and slammed the bars over my window, locking them and running up stairs to the storage room where i pushed a table up to the door and called the cops. \nAs i listened and expected the two to come inside any minute i heard a loud crash and the bars from the windows being shaken aggresively, when they realized that they couldnt get in one of them let out a long angry scream that probably woke up half the neighbourhood, by the time the cops came they were long gone.\nThe police couldnt find out who it was but were more active in the neighbourhood in the following weeks, regardless i wasnt to keen on staying there so shortly after i moved out. my sister sold the house a few months later and as far as i know nothing similar ever happened since.\nI honestly dont know what they wanted or why they were so determined to get in, but whoever it was, lets not meet again.", "media": null, "score": 75, "upvote_ratio": 0.93, "comment_count": 10, "over_18": true}, "70": {"id": "18ewu1b", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Ill_Assistant_9543", "link_flair_text": null, "time": 1702704326.8826847, "created_utc": 1702187670.0, "url": "https://www.reddit.com/r/threekings/comments/18ewu1b/a_christian_guide_to_cursing_your_enemies/", "title": "A Christian Guide to \"Cursing\" Your Enemies - Offensive Spiritual Warfare", "permalink": "/r/threekings/comments/18ewu1b/a_christian_guide_to_cursing_your_enemies/", "selftext": "Introduction:\nMany falsely believe Christianity to be a religion of pure forgiveness and mercy. That is not always the case. Christianity teaches the battle is spiritual rather than physical, but never speaks you cannot use offensive spritual warfare. Take the gruesome Imprecatory Psalms of Psalm 109.\nThe deity Yahweh/Yeshua will cast curses as required. Yahweh chastises even his followers with death if needed (1 Corinthians 11:27-32). Take Yahweh casting a demon onto King Saul and sending foes onto King Solomon, Prophet Elisha casting leprosy on a wicked man, Apostle Peter announcing Ananias' death, Yahweh also sends a demon to discipline Paul.\nThe Melchizadek Priesthood does not use only the Christian equivalent of \"white magic,\" but allows \"black magic\" in many situations. But, this \"magick\" is to be used in a mostly defensive manner in practice.\nHere's a few examples of Christian \"black magic.\"\n- One example is Apostle Paul's rebuke towards the historical illegitimate Jewish High Priest, Ananias. His condemnation of Ananias came true in 66 A.D. with Ananias' death during the Jewish Revolt.\n- Apostle Peter announces Ananias' (not the high priest) death for directly disobeying an order from HaShem.\nHow do you use Christian \"magic?\"\nLet's say somebody was actively putting your life at risk and you have done everything within your grasp to try getting them to stop. Yahweh will punish that person accordingly to their knowledge in both life and death (Romans 2:12-16).\nInstructions:\n- Take your situation. Pray and explain everything to Yeshua. Explain the whole situation- how everything begun, your role, the other party's role, and your request for retribution or stopping the other person's crimes.\nThe reason for explaining your own part is to show Yahweh your heart and intentions. You are to understand what you are asking for. Wording a situation to fit your agenda will not make the prayer more effective because Yahweh will know your intentions as God.\nRules:\n- This ritual cannot be done without faith in Yeshua. To any skeptic, this sounds psychological, but hear me out first. All religion requires faith in order for magick to work. Take wicca and invoking deities, buddhism and usage of chakara, Judaic Kabbalah, and similar religious activities. It is not objects or the planet, but yourself that must create the spiritual connection.\n- You cannot be a polytheist. Yahweh is a jealous deity, therefore you must worship him solely or he will not hear you.\n- Yahweh holds some strict dogma. Notice Yahweh has a religious book that has been unchanged for thousands of years opposed to Greek, Egyptian, Mesopotamian, Mesoamerican, Inuit, Chinese, and various deities. This means Yahweh fulfills wishes according to his own knowledge, not your own.\nDONT'S\n- Don't expect results to be instant. Yahweh often allows wicked people to survive for a reason beyond our understanding. Take the King of Tyre. Their final judgement comes after death.\n- Do not expect Yahweh to make you wealthy. Similarly to Mesopotamian deities, Yahweh expects you to embrace suffering in life for your own growth. Suppose you got a bunch of money, that does not mean your personal problems and financial discipline itself is set.\n- Do not cast curses when you are clearly in the wrong. You are responsible to examine the whole situation first before \"casting\" your prayer. Examine the situation's circumstances, your role, and the other party's role. This should be obvious, but doing so may lead to negative repurcussions.\n- I will emphasize again. If you are not willing to worship Yahweh and are a practicing pagan, you will be tormented by demons. Do not use even Yahweh to cast demons away without faith, the demons will return with 7 more for each demon (Matthew 12:43-45). Multiple of my friends have done so and are now worse off.", "media": null, "score": 2, "upvote_ratio": 0.75, "comment_count": 0, "over_18": false}, "71": {"id": "18es1om", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "vegemitebikkie", "link_flair_text": "Personal Encounter ", "time": 1702704327.7966983, "created_utc": 1702170729.0, "url": "https://www.reddit.com/r/Ghosts/comments/18es1om/my_dads_ghost_visited_my_mum_at_3am_im_not_sure/", "title": "My dad’s ghost visited my mum at 3am. I’m not sure how to process this.", "permalink": "/r/Ghosts/comments/18es1om/my_dads_ghost_visited_my_mum_at_3am_im_not_sure/", "selftext": "My dad passed away unexpectedly on Friday 13th October this year. He was 74 and had been mums carer since her nervous breakdown 20 years ago. He took care of all the bills and money etc. so mums been thrown in the deep end and has been struggling with it all. So today she tells me she had a visitor at 3 o’clock.\n She says at first she thought it was an intruder because it was a solid person standing next to her bed. Then she realised it was dad, then he slowly faded from the knees up. She said she wasn’t panicked or scared at all. Just felt calm. I don’t know what to do with this information but I can’t stop crying.", "media": null, "score": 211, "upvote_ratio": 0.89, "comment_count": 70, "over_18": false}, "72": {"id": "18gb0pc", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ShamanicGuide", "link_flair_text": "Glitch Pic", "time": 1702704328.06741, "created_utc": 1702347286.0, "url": "https://i.redd.it/bajv0hthwr5c1.png", "title": "I Just Completely Understood A Foreign Song , I Know Only One Language , Listened Multiple Times Since & There Are No English Verses.. {○¡○}", "permalink": "/r/GlitchInTheMatrix/comments/18gb0pc/i_just_completely_understood_a_foreign_song_i/", "selftext": "", "media": null, "score": 20, "upvote_ratio": 0.75, "comment_count": 5, "over_18": false}}}