{"_default": {"1": {"id": "1hega4s", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "dailymail", "link_flair_text": null, "time": 1734749867.8312306, "created_utc": 1734221299.0, "url": "https://www.dailymail.co.uk/news/article-14193123/Drones-new-york-hochul-jersey.html", "title": "Drone scandal explodes as airport is shut and New Jersey senator shares eerie new details: 'It's gone too far'", "permalink": "/r/ufo/comments/1hega4s/drone_scandal_explodes_as_airport_is_shut_and_new/", "selftext": "", "media": null, "score": 2722, "upvote_ratio": 0.97, "comment_count": 690, "over_18": false}, "2": {"id": "1hel9h3", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "tryingtobuildapc1234", "link_flair_text": "Likely Identified", "time": 1734749869.2321737, "created_utc": 1734238304.0, "url": "https://v.redd.it/15c4ng5s0y6e1", "title": "Close Up of Drone from Airplane", "permalink": "/r/UFOs/comments/1hel9h3/close_up_of_drone_from_airplane/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/15c4ng5s0y6e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 960, "width": 720, "scrubber_media_url": "https://v.redd.it/15c4ng5s0y6e1/DASH_96.mp4", "dash_url": "https://v.redd.it/15c4ng5s0y6e1/DASHPlaylist.mpd?a=1737341868%2CNTZlOTZmNzJmNzVhMTdiMTkwNTJkNzhhODk1ZWI1MzE3MDY4ODAzNWE1YjhhY2I4NmMxZGZmZGUzODIwOTBjNQ%3D%3D&v=1&f=sd", "duration": 9, "hls_url": "https://v.redd.it/15c4ng5s0y6e1/HLSPlaylist.m3u8?a=1737341868%2CYTJkNWIyM2U5NzE0YTU2MzIzODZjNWZlOTQ3OWRkZmE1NzcxOTBjZTI5N2U2NjY0YjM5NTgxNDU2ZjVlOGZmMg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 24945, "upvote_ratio": 0.84, "comment_count": 4432, "over_18": false}, "3": {"id": "1hg5gxb", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "genericexistence", "link_flair_text": "Video", "time": 1734749870.925097, "created_utc": 1734420508.0, "url": "https://v.redd.it/rrl5phqj2d7e1", "title": "It begins.", "permalink": "/r/aliens/comments/1hg5gxb/it_begins/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/rrl5phqj2d7e1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/rrl5phqj2d7e1/DASH_96.mp4", "dash_url": "https://v.redd.it/rrl5phqj2d7e1/DASHPlaylist.mpd?a=1737341869%2CNWQ0YzQzNzY2NmYwZmE3ZmUwYWY4MTEyYjk2ZjAyOGIzODYzYzg3MjhhMGNiNzVlN2UxNTE3OWRmYjliZTM5Nw%3D%3D&v=1&f=sd", "duration": 127, "hls_url": "https://v.redd.it/rrl5phqj2d7e1/HLSPlaylist.m3u8?a=1737341869%2CMWEyNDY4ZDg4ZWZiYzA2MzljYjk3NTA4NGUxZmY0OWJhZGYwYjJiNzBlZjJhNTU4YjMwYWUzYTUwZGU0MjBjZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 18024, "upvote_ratio": 0.81, "comment_count": 3208, "over_18": false}, "4": {"id": "1hexztp", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "elohim_ephraim", "link_flair_text": null, "time": 1734749872.8142028, "created_utc": 1734284968.0, "url": "https://v.redd.it/37cg3w3mv17e1", "title": "Pay attention people ", "permalink": "/r/UAP/comments/1hexztp/pay_attention_people/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/37cg3w3mv17e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/37cg3w3mv17e1/DASH_96.mp4", "dash_url": "https://v.redd.it/37cg3w3mv17e1/DASHPlaylist.mpd?a=1737341871%2CMDZjZWZlOTZmNmU1MmFhNGVmZTQ2NWQyNWJkMmI5MzIzOGY3MWFiMzFiMzkwNDJmNjEwMzNmNDM4OGNlN2U5Yw%3D%3D&v=1&f=sd", "duration": 158, "hls_url": "https://v.redd.it/37cg3w3mv17e1/HLSPlaylist.m3u8?a=1737341871%2CM2M5NDdiMzAyZDJkYTM3ZGEyMDQ1ZThlNmI4ZTEwNzAyMDVkOTllOTI1ZTVkZjdjOGM2NjhmNWFlMmViMDkwMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1897, "upvote_ratio": 0.93, "comment_count": 306, "over_18": false}, "5": {"id": "1hi2r6g", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "alllovealways", "link_flair_text": null, "time": 1734749874.0064125, "created_utc": 1734641451.0, "url": "https://i.redd.it/51hl86dlbv7e1.jpeg", "title": "does this all seem strangely surreal and scripted to anyone else? ", "permalink": "/r/conspiracy/comments/1hi2r6g/does_this_all_seem_strangely_surreal_and_scripted/", "selftext": "", "media": null, "score": 7553, "upvote_ratio": 0.94, "comment_count": 1191, "over_18": false}, "6": {"id": "1hh3cbg", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "NewWorm", "link_flair_text": null, "time": 1734749874.2323258, "created_utc": 1734533856.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1hh3cbg/a_gluten_free_diet_will_irrevocably_damage_the/", "title": "A gluten free diet will irrevocably damage the health of children without Celiac Disease.", "permalink": "/r/conspiracyfact/comments/1hh3cbg/a_gluten_free_diet_will_irrevocably_damage_the/", "selftext": "The health issues children with Celiac Disease suffer is not because of the CD, it is because of the gluten free diet they are forced to eat. If you put healthy children onto a gluten free diet, they will suffer exactly the same as the inflicted children. Good luck finding anything that is not \"Gluten Free!\" in the grocery store, I've looked, couldn't find any, it's almost like a big CONSPIRACY. I am so grateful my kid has already grown up nice and tall. How many people do you know that have told you their child has stopped growing and Doctor doesn't know why? They know exactly why, and now you do too.\nAnti-pituitary antibodies in children with newly diagnosed celiac disease: a novel finding contributing to linear-growth impairment.\nAn explorative study identifies miRNA signatures for the diagnosis of non-celiac wheat sensitivity\nAppropriate age range for introduction of complementary feeding into an infant's diet\nEndocrine aspects of coeliac disease.\nGrowth hormone impaired secretion and antipituitary antibodies in patients with coeliac disease and poor catch-up growth after a long gluten-free diet period: a causal association?\nHigh prevalence of anti-thyroid autoantibodies in children with coeliac disease (CD): relationship with thyroid function and gluten-free diet\nLack of growth recovery and growth hormone deficiency in patients with coeliac disease after a prolonged time-span of gluten free diet can be caused by an autoimmune hypophysitis.\nPotential celiac disease in type 1 diabetes: A multicenter study\nSpirulina, A Sustainable Microorganism to Enrich Baked Goods with Precious Nutrients\nExperimentation and clinical analysis of the relationships between dental damage and celiac disease.\nWhole lipid profile and not only HDL cholesterol is impaired in children with coexisting type 1 diabetes and untreated celiac disease\nTracking celiac disease-triggering peptides and whole wheat flour quality as function of germination kinetics", "media": null, "score": 6, "upvote_ratio": 0.87, "comment_count": 9, "over_18": false}, "7": {"id": "1hhbh4s", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "little-miss-believer", "link_flair_text": "humor", "time": 1734749875.0383942, "created_utc": 1734555191.0, "url": "https://i.redd.it/1uhh9qt47o7e1.jpeg", "title": "when u forget the camera ", "permalink": "/r/bigfoot/comments/1hhbh4s/when_u_forget_the_camera/", "selftext": "", "media": null, "score": 406, "upvote_ratio": 0.98, "comment_count": 5, "over_18": false}, "8": {"id": "1herfl4", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "ApprehensiveRead2408", "link_flair_text": "Discussion ", "time": 1734749875.9622173, "created_utc": 1734265044.0, "url": "https://www.reddit.com/gallery/1herfl4", "title": "Cameleopard is a creature from africa that was reported by ancient greek & arab people. It look like a mix between camel & leopard", "permalink": "/r/Cryptozoology/comments/1herfl4/cameleopard_is_a_creature_from_africa_that_was/", "selftext": "", "media": null, "score": 1304, "upvote_ratio": 0.92, "comment_count": 148, "over_18": false}, "9": {"id": "1he03ry", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Toxic_Koala0826", "link_flair_text": "Self", "time": 1734749876.1608021, "created_utc": 1734171611.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1he03ry/werewolfdogman_of_monterey_hills_los_angeles/", "title": "Werewolf/Dogman of Monterey Hills, Los Angeles", "permalink": "/r/Humanoidencounters/comments/1he03ry/werewolfdogman_of_monterey_hills_los_angeles/", "selftext": "(So, as I’m writing this, I’ve realized that I’m not that great of a writer so bear with me if there are any typos or grammar errors. Thanks.)\nBefore I get into my story, here’s some background info: Every day, usually after finishing homework or if I was just bored and had nothing to do, I’d take my dirt bike on a run to the nearest grocery store which was about 3 miles away from where I live. To get there, I had to bike through one-way streets that snaked throughout the secluded neighborhoods of the area. All of the houses in these neighborhoods looked surprisingly upper middle class, which was strange considering my neighborhood (which was just down the hill) looked nowhere near as rich. But I didn’t mind it too much, focusing more on how quiet and peaceful the drive through these streets was. To get to these streets, I had to chug my bike up multiple hills, which was a bit of a drag since my bike did pretty badly uphill, but taking these streets was safer than taking the main roads. \nThis happened on the 15th of last month. It was a Friday, which meant that I could stay up late and play video games. My friends from school whom I typically played with, weren’t online so I had nothing to do. In the mood for some chocolates, I decided to take a night-time bike ride. My ride to the grocery store was normal. I parked my bike, got my chocolates, and headed back. Since it was nighttime, I decided to take the normal streets since there weren’t many cars on the road. As I exited the normal streets and began my descent down the one-way streets that cut through the secluded neighborhoods, I noticed a car following close behind. This guy’s headlights were cranked all the way up, which reflected through my bike’s side mirrors, blinding me through my helmet. I decided to pull over and let the guy pass. I stopped my bike behind a car parked in front of the house. Like all of the houses on the block, the lights inside were off, so I wasn’t worried of the owner of the house seeing me and thinking “why is that suspicious biker just sitting there behind my car?” Also, I was mostly wearing all black so I wouldn’t be surprised if someone could mistake me for someone shady. \nI was probably sitting on my bike for about a minute waiting for this guy to pass, but his car hadn’t turned the last corner. I didn’t see any headlights coming down the road so I figured he wasn’t coming. Before I continued on my way, I decided to take in the night air. I flipped open the visor of my helmet and took in a deep breath. I turned off my bike’s motor. It may sound like I’m sugarcoating this but once I turned off my motor, the entite area fell dead silent. All that could be heard were the faint chittering of crickets the wind blowing through the trees above. I just sat there with my head up to the sky, eyes closed and arms limb at my side. It was so peaceful. \nAll of a sudden, the distracting pitter-patter of footsteps came within earshot. Turning towards the footsteps, I noticed that they were coming from across the street. The footsteps didn’t sound like a typical person’s. They sounded much heavier. Suddenly, I saw a tall black figure emerge from behind a garden hedge in front of a home across the street from me. Whatever this thing was was tall and fast. If I had to estimate how tall it was, I’d say that it was nearing the seven-foot range. At this point, I was frozen with fear. The only part of me that moved was my head as I watched the figure run down the driveway of the home (the one with the garden hedge) and run the opposite way from me across the street. But as the figure crossed the street, the moonlight illuminated it, giving me somewhat of a clear picture of it. It looked like a stereotypical depiction of a werewolf: sharp claws, bent legs, mangy fur, pointed ears, a toothy muzzle, ETC. Basically just a wolf-human hybrid. My heart sank. The creature dissapered in the shadows cast by the homes across the street but I could still hear its heavy footsteps as they grew further and further away. A minute passed. Then another. I was left sitting on my bike, confused and frozen in fear. I didn’t want to move, let alone turn on my bike’s motor and alert everything in the area where I was. But I had no choice. I silently hopped off my bike and manually turned it the opposite way. I got on my bike and the instant I turned on my bike’s motor, and sped off. The ride back was a blur. All I remember was me zooming down the streets. I definitely was not going the speed limit, never the less stopping at stop signs. I just had to get out of there as fast as I could. Thank God that thing didn’t see me hiding in the darkness. \nThe second I got home, I told my parents the whole thing. Of course, they didn’t believe me. I looked up on my computer if tonight was a full moon. To my horror, it was. I didn’t get any sleep that night, fearing that thing followed me home and was stalking me through my window. Jesus. I’m getting chills as I write this. I’ve kept this story a secret from my friends as I know that if I tell them they’d think I’m crazy. This is the first time I’ve talked about the story in full. I’ve been hit by a truck, bitten by a pitbull (I promise I’m not a werewolf lol), and almost drowned, but this was by far the scariest thing I have ever encountered. I haven’t gotten on my bike since. \nI imagine that if werewolves did live in or near Los Angeles, the area where I live, Monterey Hills, would be the best place for them to hide as its on the outskirts of everything and each neighborhood is surrounded by empty hills. I attached a photo of the street where this occurred. What do you guys think? I feel good getting this off my chest :)\nhttps://preview.redd.it/qbtaj05eis6e1.png?width=2012&format=png&auto=webp&s=d482d8cf0658200ce65b10022f506e2dae49a940", "media": null, "score": 141, "upvote_ratio": 0.95, "comment_count": 25, "over_18": false}, "10": {"id": "1hh4kq6", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "ArtisticDragonKing", "link_flair_text": null, "time": 1734749876.5456238, "created_utc": 1734537279.0, "url": "https://i.redd.it/htgk2e1vpm7e1.jpeg", "title": "IS THIS THE JERSEY DEVIL?", "permalink": "/r/cryptids/comments/1hh4kq6/is_this_the_jersey_devil/", "selftext": "", "media": null, "score": 1301, "upvote_ratio": 0.98, "comment_count": 94, "over_18": false}, "11": {"id": "1hhpmhc", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Platomik", "link_flair_text": null, "time": 1734749876.7895916, "created_utc": 1734602336.0, "url": "/r/AskReddit/comments/1hhj6cc/military_veterans_of_reddit_whats_the_creepiest/", "title": "Military veterans of Reddit, what's the creepiest thing you ever saw while deployed that you couldn't explain?", "permalink": "/r/Thetruthishere/comments/1hhpmhc/military_veterans_of_reddit_whats_the_creepiest/", "selftext": "", "media": null, "score": 168, "upvote_ratio": 0.97, "comment_count": 46, "over_18": false}, "12": {"id": "1he7qtx", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "KITTYCat0930", "link_flair_text": null, "time": 1734749877.0140696, "created_utc": 1734197181.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1he7qtx/i_was_assaulted_by_a_friend_who_was_in_love_with/", "title": "I was assaulted by a friend who was in love with me", "permalink": "/r/LetsNotMeet/comments/1he7qtx/i_was_assaulted_by_a_friend_who_was_in_love_with/", "selftext": "This happened over 10 years ago but I still think about how close I came to dying. \nI was already with my future husband when I met his cousin. We had a lot in common. We’d both struggled with addiction and anorexia. \nWe’d talk on the phone and met up to eat and see a movie but he kissed me in his car so I decided it was best if we stopped talking. I told my future husband about the kiss and he was understanding. \nI didn’t tell him that his cousin got extremely upset over me turning him down. \nSometime passed and we started meeting up as friends. Since we were both starving ourselves we always went to the same place but after a couple times I felt like it wasn’t healthy for either of us to meet up. \nHe asked me to meet up one last time and I stupidly said yes. We went to our place and during dinner he was talking about his apartment and job. How happy he could make me. I got uncomfortable and asked him to drive me home. \nIt was really late and instead of driving me home he drove to the forest preserve. It was pitch black because all the lights were off. I immediately felt uneasy. \nWe were alone in the parking lot and I had a horrible feeling at this point that something was going to happen. He parked and turned off his car then looked at me and said we were meant for each other  I didn’t want to upset him so I just said that he knew I was engaged and that we were just friends. He had a history of violence so I was terrified. \nHe started getting really upset and almost crying he said that he loved me. Then he put his arm around my neck and held his arm down really hard on my right side of my neck. His arm was around my neck and I’d been looking straight ahead when suddenly I woke up to a police officer at his window. \nHe was asking if I was okay. I was really scared and confused. I had some vomit on my shirt and I’d wet my pants. He’d pressed down on my carotid artery for long enough that it knocked me out. He was a wrestler in hs. \nHe was telling the officer we were fine and that I was drunk. He got a ticket but I was too afraid to say anything because if he was arrested my now husband’s family wouldn’t have blamed me but that’s what I thought. \nI said I was fine but that’s I wanted to go home now. I thought if I said it in front of the officer he would drive me home because he took our names and he wouldn’t risk trying something else. \nSo he drove me home and didn’t say anything. I don’t know if he was trying to kill me or just got so upset he went way overboard. Regardless he almost did kill me and it really fucked me up.A person doesn’t vomit and wet themselves after a neck compression unless they almost died. \nI told my now husband but not right away because I felt like it was partly my fault for meeting up with him. I only saw him a couple more times at holidays and then he stopped coming. But he didn’t dare speak to me after what he did. If that officer hadn’t shown up I don’t know if I’d be here. ", "media": null, "score": 338, "upvote_ratio": 0.95, "comment_count": 39, "over_18": true}, "13": {"id": "1hge2n1", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "HamletX95", "link_flair_text": null, "time": 1734749877.2245111, "created_utc": 1734451986.0, "url": "https://i.redd.it/zq8u6l1znf7e1.png", "title": "Right before Jeffrey Dahmer was caught, he had so many bodies piled up in his apartment, that he actually stashed one in the bathtub, where he just stood over it every day for a month to take a shower.", "permalink": "/r/truecreepy/comments/1hge2n1/right_before_jeffrey_dahmer_was_caught_he_had_so/", "selftext": "", "media": null, "score": 300, "upvote_ratio": 0.97, "comment_count": 14, "over_18": false}, "14": {"id": "1he4h4t", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Dull_Wheel8586", "link_flair_text": null, "time": 1734749877.429686, "created_utc": 1734187889.0, "url": "https://www.reddit.com/r/threekings/comments/1he4h4t/rituals/", "title": "Rituals? ", "permalink": "/r/threekings/comments/1he4h4t/rituals/", "selftext": "Mmm I wanna do rituals. Maybe spells. I’ve done some before but they were like the normal ones you’d find on Google etc. \nI don’t know where to look for them. The real ones. \nBecause the websites we get on the surface obviously aren’t the real thing.  \nSo if anyone has any real rituals/good websites then please do share. \nPreferably dark stuff but open to any \nAnd just out of curiosity can be more on the side of witchcraft spells. To be honest just anything really ", "media": null, "score": 6, "upvote_ratio": 1.0, "comment_count": 3, "over_18": false}, "15": {"id": "1hduxbw", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "6_infinite_chaos_6", "link_flair_text": null, "time": 1734749878.0433257, "created_utc": 1734150302.0, "url": "https://i.redd.it/4we79cg6rq6e1.jpeg", "title": "Either yall are seeing what im seeing or im losing my marbles", "permalink": "/r/Ghosts/comments/1hduxbw/either_yall_are_seeing_what_im_seeing_or_im/", "selftext": "", "media": null, "score": 1615, "upvote_ratio": 0.9, "comment_count": 433, "over_18": false}, "16": {"id": "1hfour6", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "jucapiga", "link_flair_text": "Glitch Pic", "time": 1734749878.2605617, "created_utc": 1734371345.0, "url": "https://i.redd.it/smesqkmg097e1.jpeg", "title": "Flat tire glitch", "permalink": "/r/GlitchInTheMatrix/comments/1hfour6/flat_tire_glitch/", "selftext": "", "media": null, "score": 61, "upvote_ratio": 0.85, "comment_count": 17, "over_18": false}, "17": {"id": "1hfi38b", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "MackSix", "link_flair_text": "Article", "time": 1734749879.5791256, "created_utc": 1734352412.0, "url": "https://www.usasupreme.com/breaking-wright-patterson-air-force-base-shut-down-over-unauthorized-drone-activity-hear-the-air-traffic-audio/", "title": "BREAKING: Wright-Patterson Air Force Base Shut Down Over Unauthorized Drone Activity—Hear the Air Traffic Audio!", "permalink": "/r/ufo/comments/1hfi38b/breaking_wrightpatterson_air_force_base_shut_down/", "selftext": "", "media": null, "score": 1687, "upvote_ratio": 0.96, "comment_count": 232, "over_18": false}, "18": {"id": "1hgypfl", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Breezeoffthewater", "link_flair_text": "Discussion", "time": 1734749880.9049041, "created_utc": 1734517324.0, "url": "https://i.redd.it/lgsqd5p51l7e1.png", "title": "Professional 'drone' picture is a United Airlines 767 taken at night. The tail is invisible due to its dark livery against the night sky. Nav lights match with type of aircraft. Happy to have everyone's take on this.", "permalink": "/r/UFOs/comments/1hgypfl/professional_drone_picture_is_a_united_airlines/", "selftext": "", "media": null, "score": 22294, "upvote_ratio": 0.89, "comment_count": 2530, "over_18": false}, "19": {"id": "1hecpnu", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "littlespacemochi", "link_flair_text": "News :illuminati:", "time": 1734749882.3332312, "created_utc": 1734210932.0, "url": "https://v.redd.it/681975lbrv6e1", "title": "NJ State Senator suggests the federal gov. is hiding something so massive involving the \"drones\" that they are forced to cover it up in fear of all-out panic from the public", "permalink": "/r/aliens/comments/1hecpnu/nj_state_senator_suggests_the_federal_gov_is/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/681975lbrv6e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1276, "scrubber_media_url": "https://v.redd.it/681975lbrv6e1/DASH_96.mp4", "dash_url": "https://v.redd.it/681975lbrv6e1/DASHPlaylist.mpd?a=1737341881%2CZTcxOTQ3MmZhNTQ2NzIyOWE5Njc5ZTgxZjAxMWIxNWY4YmE5NTE3ZWRlM2NjNmMyNWIxZjUxZDNiNjk3YzUzMw%3D%3D&v=1&f=sd", "duration": 359, "hls_url": "https://v.redd.it/681975lbrv6e1/HLSPlaylist.m3u8?a=1737341881%2CZjVkYzJiZmViNmRlMDU1NTY4MWY3NjM5ZjYxNzBiYjliZTgxMGU0NTNiNzJkYzQwNjE2OGQ2NDUyNTNhMTJhZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 14094, "upvote_ratio": 0.84, "comment_count": 3658, "over_18": false}, "20": {"id": "1hfrgw1", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "ps4alldawg", "link_flair_text": "Discussion", "time": 1734749884.361138, "created_utc": 1734377849.0, "url": "https://www.reddit.com/r/UAP/comments/1hfrgw1/humanity_is_so_stupid/", "title": "Humanity is so stupid", "permalink": "/r/UAP/comments/1hfrgw1/humanity_is_so_stupid/", "selftext": "Here we have drones appearing all over the US/World, it should probably be the #1 news, you would expect countries to work together in trying to identifying what are theses, kind of like they do in the movie Arrival. But no instead we got agencies hiding information to the public and not talking to eachothers.\nWhy have we become like this, as a society?\nIt's fucking ridiculous.", "media": null, "score": 1272, "upvote_ratio": 0.89, "comment_count": 503, "over_18": false}, "21": {"id": "1hg7w2u", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "w4tchEverything", "link_flair_text": "Rule 6", "time": 1734749885.8430126, "created_utc": 1734431715.0, "url": "https://i.redd.it/jf8jpvryzd7e1.jpeg", "title": "Gaza", "permalink": "/r/conspiracy/comments/1hg7w2u/gaza/", "selftext": "", "media": null, "score": 4012, "upvote_ratio": 0.89, "comment_count": 695, "over_18": false}, "22": {"id": "1hi2679", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Brief_Medicine3336", "link_flair_text": null, "time": 1734749886.0520148, "created_utc": 1734639884.0, "url": "https://www.youtube.com/watch?v=tu5SMO28lio", "title": "🎶💉🎄 Have Yourself a Scary Little Sickness 🎄💉🎶 ", "permalink": "/r/conspiracyfact/comments/1hi2679/have_yourself_a_scary_little_sickness/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Have Yourself a Scary Little Sickness", "type": "video", "thumbnail_width": 480, "height": 200, "width": 267, "html": "<iframe width=\"267\" height=\"200\" src=\"https://www.youtube.com/embed/tu5SMO28lio?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Have Yourself a Scary Little Sickness\"></iframe>", "author_name": "Alan Alien", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/tu5SMO28lio/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@AlanAlienOfficial"}}, "score": 1, "upvote_ratio": 0.6, "comment_count": 0, "over_18": false}, "23": {"id": "1hgcanf", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "blobsquatch", "time": 1734749886.663764, "created_utc": 1734447142.0, "url": "https://i.redd.it/cadt3g1u9f7e1.jpeg", "title": "A photograph of bigfoot taken in the 1970s near Fort McMurray Alberta. A man had been snowmobiling in the area when a creature crossed the road in front of him. He was able to take this photo of the beast using a Kodak camera.", "permalink": "/r/bigfoot/comments/1hgcanf/a_photograph_of_bigfoot_taken_in_the_1970s_near/", "selftext": "", "media": null, "score": 359, "upvote_ratio": 0.87, "comment_count": 72, "over_18": false}, "24": {"id": "1hh0vwk", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Cryptozoologist", "time": 1734749887.7276525, "created_utc": 1734526238.0, "url": "https://i.redd.it/wovpqrz0tl7e1.jpeg", "title": "The only known photograph of Vladimir Pushkarev, a Russian geologist who went missing on an expedition for the yeti. Possibly the most aura of any cryptozoologist photograph", "permalink": "/r/Cryptozoology/comments/1hh0vwk/the_only_known_photograph_of_vladimir_pushkarev_a/", "selftext": "", "media": null, "score": 415, "upvote_ratio": 0.93, "comment_count": 33, "over_18": false}, "25": {"id": "1heg57u", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "LoganXp123", "link_flair_text": null, "time": 1734749888.269661, "created_utc": 1734220892.0, "url": "https://i.redd.it/uuq4n9s1lw6e1.jpeg", "title": "The 2 Types of r/cryptid users ", "permalink": "/r/cryptids/comments/1heg57u/the_2_types_of_rcryptid_users/", "selftext": "", "media": null, "score": 322, "upvote_ratio": 0.97, "comment_count": 57, "over_18": false}, "26": {"id": "1hiruxw", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Miko_2008", "link_flair_text": null, "time": 1734749888.4920614, "created_utc": 1734723605.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1hiruxw/the_leather_man/", "title": "The Leather Man", "permalink": "/r/Thetruthishere/comments/1hiruxw/the_leather_man/", "selftext": "So I'm just gonna jump right into this. About 8 or 10 years ago, it's kind of hard to remember the exact time period now but it was around 2015 to 2019, me and  my brother and my babysitter, we're going for a walk to the park. It was a local park was like 510 minute. Walk and as we get there. I see this man sitting on a bench.  I pay him no attention But as we get close to the bend, she gets up and walks away. Which I think is reasonable because me and my brother are to annoy little brats going to stream and play on the swings, but it was weird because he left the park, but he didn't leave the park. He was still around in the area, so I'm walking around and for some context. We are in the middle of Eastern Canada, summer, 35°C outside. He is in a full leather trench Coat with a leather cowboy looking hat. When we eventually leave, I see the man not following us but walking in the same direction. I thought he was following us but a lot of people live in that direction. So I just assumed he was walking home and I'm paying more attention to him. My babysitter also starts to seem again. We start to pick up Pace. I seem walk behind a truck. Right outside an old pawn shop that I can see the door distinctly separated away from the truck so he couldn't walk inside.  As he's walking, he walks behind the truck and he doesn't walk away from the truck. He's go across the street to see if he's there. There's nothing he just vanished. Now. I'm a kid and I had an over exaggerated imagination, but my babysitter saw it and I saw it so I don't know what it is. Has anything like this ever happened to you guys?", "media": null, "score": 6, "upvote_ratio": 0.71, "comment_count": 8, "over_18": false}, "27": {"id": "1hehoq6", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "MindOdd4457", "link_flair_text": null, "time": 1734749888.7191775, "created_utc": 1734225697.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hehoq6/i_met_an_australian_tinder_swindler_and_he/", "title": "I met an Australian Tinder Swindler and he deserves his own Netflix doco", "permalink": "/r/LetsNotMeet/comments/1hehoq6/i_met_an_australian_tinder_swindler_and_he/", "selftext": "Writing this so hopefully no one else has to deal with this flea of a human, it’s gonna be a wild ride so grab your popcorn and get comfy.\nSo back in June 2022 I met ‘Wilton Wallace’ on Hinge. I’m from Victoria, Australia - he was from Queensland but was working in Victoria and was 28 at the time (I was 24). We hit it off and within a day of chatting he asked to meet me in the city for drinks, he seemed friendly and cute so why not get dressed up and give him a chance? Funnily enough my spidey senses were tingling already but I just thought it was usual nerves of a first date. I should have trusted my gut but he hadn’t given me any red flags yet..\nHe met me at Flinders Street Station, first impression was he dressed really nice, suit and long coat, clearly took pride in his looks. Instantly he was super affectionate, way more than I’m used to. He kissed my cheek, picked me up, squeezed the crap of me and we were hand in hand from the get go. Although I was taken aback, he was of Brazilian descent and I know their culture can be quite forward. I wasn’t overly alarmed but this was within 10 seconds of meeting 😅\nSo we decide to go for drinks and he recommends a very well known fancy bar. I’m just a nurse so way above my pay grade but he said would like to cover the whole night. It become apparent very quickly he’s super chivalrous, charming and a sweet talker. It felt like a soppy 2000’s rom com, I can’t lie. \nHe was super open about his life, and because he was, so was I. We had so much in common and everything just felt right. It makes me want to gag now I know the real him… If it feels too good to be true, it probably is.\nBasically the ‘life story’ he threw up all over me was that he was born in Brazil, his parents had a family business and were well off but lost it somehow, think he said his dad died, RIP dad. His mum couldn’t afford to care for him and his 4 sisters alone so she gave him up for adoption and he moved to Portugal. I guess he was the runt of the litter because she kept the 4 girls. \nSo he grew up in Portugal from about 5 until he was 17 when he decided to move back to his biological mother. He said his Portuguese family were lovely but incredibly religious and he didn’t like the constraints, arranged marriage, no boinking before marriage type deal. \nSo at 17 he moves back to Brazil and builds his relationship with his biological mother and eventually he decided to move to Australia. He moved over to study some aerodynamic bullshit degree for some career I don’t give a flying fuck about. Fast forward 11 years to 2022 and now he works in Queensland as some manager for shipping companies and flies to and from Melbourne for work every few weeks.\nNow you’re up to speed with that crock of shit, let’s get back to the date. I had a traumatic upbringing (neglect, poverty, raised by grandparents and so on), so hearing all that really touched me, the man had me in the palm of his slimy hands. I felt at times he was cocky and had an ego on him but he even mentioned he can come across cocky and reassured me that’s how some people perceive him but he’s not at all (so clearly someone’s pulled him up for being an arrogant twat before). The date is progressing and we’re having huge dnms, he was ticking so many boxes. \nWe spoke about how I love to dance and always wanted to learn salsa so he suggested a studio that does weekend night classes, but it had sold out. So he asked if I’d go back to his place, just to ‘hang out’ 🤦🏼‍♀️ idk what this man put in my drink (not literally just fyi) but my common sense was gone. I told him I needed to go home before midnight and was only coming over to talk, anyway we get to his apartment and like the scene from ‘crazy stupid love’ he lights candles, puts on salsa music, pours a heavy glass of red for us and asks if he can teach me how to salsa in his tiny living room. Like, was I Kate Hudson in how to lose a guy in 10 days? \nI oblige because my fanny flutters are in full control of my functioning at this point. We end up making out and things get hot and heavy but I stuck to my guns and didn’t let him past my chastity belt. Don’t get me wrong, I have had one night stands before but I had turned a new leaf and my rule was now 3 dates minimum. Long story short but not short at all, we ended up falling asleep together and I was full clothed, how about that. We woke up the next morning and he took me out for breakfast before ordering me an uber home… Keep in mind that was the one and only time I physically met him and it was PG rated…\nA few days later things were getting weird. he started making grandiose gestures and love bombing. Without asking he bought me lingerie (he didn’t know my size and had never seen me in lingerie), he bought me jewellery for my birthday just 1 week after we met and then the grand prize - an all inclusive holiday to QUEENSLAND. I said yes because ‘yolo’, right? Like literally, I might die but at least my tombstone would say I was living my best life. \nHe told me on the trip we’d go to private restaurant his friend owns, a helicopter ride, and a cruise on a yacht, amongst a bunch of other completely insane things. He paid for the flights and told me not to bring lingerie because he had that covered 🤮 My red flag alarms were going off at this point, like is he a sugar daddy or am I about to be trafficked in the lingerie and jewellery he just bought me? Think about it… Dude works for a shipping company, perfect way to ship me off to the market.\nSo at this point my stomach is turning and I’m getting sus. I realised I hadn’t really done much digging on him and if I was going interstate with this schmoozy wet sock I needed to know everything. I spent hours with my housemate investigating. His facebook was on total lockdown (this was before you could lock your profile) and his insta had no signs of family. He barely had any tagged photos with people and the photos he did have were from years ago in Brazil. All the photos he had were just him solo and travelling, so I started questioning everything - was his name even Wilton Wallace??? Doesn’t sound Brazilian or Portuguese, sounds more like Donald Duck or Chucky Cheese to me. \nSo we searched his number on my bank app using PayID, low and behold ‘W Veiga Dos Santos’ comes up 🤯🤯 (changed for anonymity) I’m shitting bricks now, like who the fuck is this toenail I’ve been wasting my time with?! So I go deeper, I’m going through all of his insta followers looking for any remanence of him. I find a mutual in the deep dark cave I’ve got myself into and there it is - a group photo of him from around 2016, holding a Brazilian woman that looks about 35 and the comments mention ‘love you both, can’t wait to see you two again’. Couldn’t confirm if they were married but that’s where my money was…\nI dig more and more to find who she is. I can’t find anything but I had a lead on what her name might be so I head to google and search both her name and his Veiga Dos I’m a fucking liar name… After sifting through countless pages I can’t read because they’re in Spanish and poorly translated - I find a settlement document. It was a civil dispute about a debt but both their full names were there. To my delight his full name in the case was Wilton Wallace Veiga Dos Santos. I don’t blame him for going by the easiest of the 5 name, but one truth doesn’t fix a truck of lies.\nSo now I’m thinking I’ve gone mad and overthinking, maybe he’s just divorced and doesn’t post a lot?? NOPE. Whilst doing our investigations I asked him to send his passport so my friends had his details ‘when I went to Queensland’, to be safe. He sends me his passport after hours of waiting and he had blacked out info and covered his face. Dumb fuck didn’t cover his date of birth well enough though because would you look at that - this absolute toad was born in 1986, making him 36! \nNow, I saw through his bullshit but I wanted to flip the game for a little while, I had to do it for the plot. I confronted him about it, he made up some shit about how when he was registered in Portugal they stuffed up the date.. Didn’t know a 5 year old could look 13 but there you have it. Over the next few weeks he kept cancelling and changing Queensland plans days before each rescheduled flight, there was always another issue. I went along with it, I had no intention of going but wanted to see his cunning plot come to fruition.\nMaybe it wasn’t trafficking, maybe he was going to magically lose all his money and get cancer and need my help to survive? And then I get a message that broke the camel’s back - his grandma in Portugal was sick so he had to fly there ASAP. I literally laughed when I read it. I was super short and apathetic with him, next day grandma died of a stroke, boo hoo. \nSome may think my digging went a bit too far at this point but I ended up messaging the woman from the insta photo and legal document because I just had a horrible gut feeling there was more to all of this and I was sick of the games. It definitely felt like I was crossing a line but I had to know. She ended up messaging me back that she unfortunately did know him and wanted to tell me everything over the phone…\nWhat she told me blew my fucking mind. Excuse my language but this C*NT was the biggest narcissistic, pathological lying, cheating scumbag I had ever had the displeasure of knowing.\nHe had lied about it all. He was 36, born and raised by his mum and dad in Brazil his entire life. He had brothers, not 4 sisters. He never lived in Portugal. Grandma was still alive and kicking. He studied social work and was now studing to become a physiotherapist, nothing to do with aerowhatever the fuck. I don’t even know what the shipping container place has to do with any of it (but he’d sent me insta stories of him ‘working’ there so that’s scary). He was the same charming suave man to his ex wife, who he married in Brazil and they moved to Queensland shortly after. As soon as they arrived he became, financially and emotionally abusive to her and refused to get a job. She worked and paid for the bills, his social work degree, random ‘business’ trips and whatever else this scumbag pretended he did.\n(Side note, please do not try and find her, she would like to remain anonymous as she is scared of her ex-husband and what he is capable of)\nAfter being in Queensland for 5 years, she got a message from a 24 year old Australian girl. (Same age I was at the time) and it turned out they’d been dating for 3 years. They’d met at uni and he’d been using her to do all his university work. She was told the same life story as me but the poor thing never questioned it, she believed the crap about his age too. \nShe realised through a mutual uni friend that saw a photo of him and said she thought he was married, thank fuck for that friend. So Wilton and his wife get divorced and the 24 year old kicks him to the curb but only a year later, another girl reaches out to his now ex-wife - same story: 24 year old Australian girl, told the same bullshit life story and believed it, they’d been together 4 years and he was using her to pay for his lifestyle and clothes. Two years go by, his ex wife just hoped he had finally come to his senses but afraid not, I was the third girl to reach out to her.\nMy guess is he’s still got a few girls on the go at a time, his plans probably kept changing because of them and one of them probably pays for his plane trips every few weeks. Fuck, the holiday, jewellery and lingerie was probably some other woman’s hard earned money as well.\nNeedless to say I was furious! I ended up ghosting him because that’s the best way to piss of a narcissist. He messaged me for weeks on text, insta, whatsapp and fb. Eventually I decided to give him a taste of his own medicine. I told him I knew some things and he needed to come clean. I never mentioned what or how I knew but he said he’d be fully transparent and fly down to Melbourne to see me. He probably thought I knew 1% of the truth. I thought about actually seeing him and seeing what bullshit he’d come up with next but I was done - \nI told him I was about 5 hours from the city, in a town that’s so small there’s only 1 train to get there a day. I said I couldn’t pick him up from the airport but he could stay a few days, I’d show him the real Australian country and I’d drive him back to the airport at the end of his visit. \nSo after catching 2 and half hour flight and sitting on a train for 5 hours to go to the middle of nowhere I asked him to send a photo of where he was so I could find him… He’d actually done it 😂 I was at home in my pyjamas watching a movie and he was at a train station in the rain, 5 fucking hours away from the airport and stuck until the next day! Pure gold! I can only imagine how pissed he would have been. I sent him a message I had ready and waiting for that exact moment. I waited for a reply so I knew he got it, then blocked the piece of shit on everything and never looked back.\nSo there ya go. Stay safe out there and always trust your instincts! Years ago I posted this on a Melbourne forum and unfortunately there were a lot of girls that had met him online or for a date but thankfully they all got the same vibes as me before it went too far. However, I was the only one crazy enough to find out who the scumbag really was!\nI just hope he hasn’t been able to trick any more since my run in with him, and if they have been I hope they find out the truth. \nIf you somehow find this asshole on the streets or online do as you please… Just please don’t contact his ex wife for her protection 😇 \nThanks for coming on this journey with me x", "media": null, "score": 208, "upvote_ratio": 0.95, "comment_count": 21, "over_18": true}, "28": {"id": "1hi17x3", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "sasbergers", "link_flair_text": null, "time": 1734749888.907014, "created_utc": 1734637337.0, "url": "https://i.redd.it/rmrqeapdzu7e1.png", "title": "In Haitian folklore, there are two kinds of zombies: the corporeal zombie, which is missing its spirit, and the \"zombie astral,\" which is missing its body. The origin of zombies was brought by enslaved people from Africa to Haiti, voodoo priests would use the fear of zombification to control slaves", "permalink": "/r/truecreepy/comments/1hi17x3/in_haitian_folklore_there_are_two_kinds_of/", "selftext": "", "media": null, "score": 23, "upvote_ratio": 0.85, "comment_count": 1, "over_18": false}, "29": {"id": "1hhzfz0", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Dan_The_Man003", "link_flair_text": null, "time": 1734749889.1199055, "created_utc": 1734632722.0, "url": "https://www.reddit.com/r/threekings/comments/1hhzfz0/wish_granting_rituals/", "title": "Wish Granting Rituals", "permalink": "/r/threekings/comments/1hhzfz0/wish_granting_rituals/", "selftext": "I’m looking for rituals to play that grant wishes. I can do ones that are not as dangerous because I live with other people that don’t really mess with that kind of stuff. My wish has good intentions but I don’t know what to play or what to do so any help would be appreciated ", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "30": {"id": "1hfa3s1", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "MrLAXadaisical", "link_flair_text": "Personal Encounter ", "time": 1734749889.672203, "created_utc": 1734319703.0, "url": "https://i.redd.it/cvzs8ikwq47e1.jpeg", "title": "When I was five, I saw this woman in my bedroom. It was the most vivid thing I had ever seen. I remember it so well till this day. ", "permalink": "/r/Ghosts/comments/1hfa3s1/when_i_was_five_i_saw_this_woman_in_my_bedroom_it/", "selftext": "It’s been almost 20 years and this shit still fucks me up. She was wearing Hawaiian shirt and was telling me to “shhhh” because I was screaming. I closed my eyes and opened them and she was still there. My mom ran into my room and when she turned the light on, she disappeared. \nGoing in that room still gives me extremely unsettling vibes. This happened maybe a year after my dad unexpectedly died. My dad also used to wear hawian shirts, like the ghost lady. \nI’ve always kinda wrote it off as my mind playing tricks on me. I don’t understand how my brain could have created such a vivid picture and it stayed there even after closing and opening my eyes. \nHas anyone had a similar experience? Do you think this was my mind playing tricks on me since I was so young and traumatized? This shit still makes me cry till this day just thinking about it. I would love some closure on this but unfortunately I’ll probably never really know. ", "media": null, "score": 398, "upvote_ratio": 0.91, "comment_count": 114, "over_18": false}, "31": {"id": "1hixuru", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "KingAJK30", "link_flair_text": "Glitch Pic", "time": 1734749889.8730304, "created_utc": 1734740668.0, "url": "https://i.redd.it/7ji5b5eni38e1.jpeg", "title": "Obvious Reused Car Assets", "permalink": "/r/GlitchInTheMatrix/comments/1hixuru/obvious_reused_car_assets/", "selftext": "", "media": null, "score": 4, "upvote_ratio": 0.84, "comment_count": 0, "over_18": false}, "32": {"id": "1hhdzmi", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "StrongMidwstrnEnergy", "link_flair_text": null, "time": 1734749891.2298696, "created_utc": 1734561795.0, "url": "https://www.reddit.com/r/ufo/comments/1hhdzmi/weve_just_witnessed_at_raf_lakenheath_at_least_10/", "title": "\"We’ve just witnessed at RAF LAKENHEATH at least 10 jets take off one after another with full burner going\"", "permalink": "/r/ufo/comments/1hhdzmi/weve_just_witnessed_at_raf_lakenheath_at_least_10/", "selftext": "https://x.com/rickyives9/status/1869474629754183927", "media": null, "score": 1402, "upvote_ratio": 0.87, "comment_count": 342, "over_18": false}, "33": {"id": "1hfo52h", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Aza_Never", "link_flair_text": "News", "time": 1734749892.3606572, "created_utc": 1734369555.0, "url": "https://v.redd.it/jzow1l25v87e1", "title": "Donald Trump's official comment about the drones ", "permalink": "/r/UFOs/comments/1hfo52h/donald_trumps_official_comment_about_the_drones/", "selftext": "\"Our military knows, and our president knows...\nSomething strange is going on, for some reason they don't want to tell the people.\"\nIncoming President Donald Trump on the mystery drones.", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/jzow1l25v87e1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 640, "scrubber_media_url": "https://v.redd.it/jzow1l25v87e1/DASH_96.mp4", "dash_url": "https://v.redd.it/jzow1l25v87e1/DASHPlaylist.mpd?a=1737341891%2CYTlmMTgzNmY3OWUwMjA5NDc3MjE3ZWJlMDNiMWNhZTIwNTEyZDM1ZTY5MWI2YjYwNjcxOTRjYmJmODQzYmI0Mw%3D%3D&v=1&f=sd", "duration": 68, "hls_url": "https://v.redd.it/jzow1l25v87e1/HLSPlaylist.m3u8?a=1737341891%2CMmVlYTljYTE4NjJjMDc0NzY2ZTdkN2E2NWIyMzRlNDBkNmM4Yzc4YmI0NDNhMzRhZjc0ZWEzNTZiNmRjNjQ0YQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 16316, "upvote_ratio": 0.75, "comment_count": 6604, "over_18": false}, "34": {"id": "1hdwtd1", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Walkend", "link_flair_text": "News :illuminati:", "time": 1734749893.6870341, "created_utc": 1734157451.0, "url": "https://v.redd.it/c4pd85jfcr6e1", "title": "Are we in disclosure? ABC News aired 30 seconds of this orb.", "permalink": "/r/aliens/comments/1hdwtd1/are_we_in_disclosure_abc_news_aired_30_seconds_of/", "selftext": "Interesting…", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/c4pd85jfcr6e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 590, "width": 1280, "scrubber_media_url": "https://v.redd.it/c4pd85jfcr6e1/DASH_96.mp4", "dash_url": "https://v.redd.it/c4pd85jfcr6e1/DASHPlaylist.mpd?a=1737341892%2CMmU3MmMwZWI4NmIyNzY0NzkyMDVjZGIzMjY5ZWM5NWJlZTA4YjZhZGM5ZGE2YjNkY2RmNGYwMjI2MDAwNjZhOQ%3D%3D&v=1&f=sd", "duration": 39, "hls_url": "https://v.redd.it/c4pd85jfcr6e1/HLSPlaylist.m3u8?a=1737341892%2CYjczZmU2ODM2YzE5ZTJlNjhhYTE5ZmYxNjgxYzJiMTc1NDQ0YmVkNjcyYzE2ZjA0ODQ5YjZkMWFlMmYyMjQ4MQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 8225, "upvote_ratio": 0.87, "comment_count": 1773, "over_18": false}, "35": {"id": "1hf5h5h", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": null, "time": 1734749895.534964, "created_utc": 1734305432.0, "url": "https://v.redd.it/0adpmrbgk37e1", "title": "Senator Chuck Schumer Acknowledges Drones as UAP", "permalink": "/r/UAP/comments/1hf5h5h/senator_chuck_schumer_acknowledges_drones_as_uap/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/0adpmrbgk37e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 592, "width": 1280, "scrubber_media_url": "https://v.redd.it/0adpmrbgk37e1/DASH_96.mp4", "dash_url": "https://v.redd.it/0adpmrbgk37e1/DASHPlaylist.mpd?a=1737341894%2CNmYyZjEwYjhiMzg4ZGEyYjE4ZmU4YjUyOTUwYjdiODg4N2Q2N2E1Y2FhMjBmMGM0OGU3Yzk0ODNjYzljMGFiNQ%3D%3D&v=1&f=sd", "duration": 83, "hls_url": "https://v.redd.it/0adpmrbgk37e1/HLSPlaylist.m3u8?a=1737341894%2CMjdkMjY0NjdhMWI2MWM5NDI5ZDIwZWYwYmRjZTRlODBjYTYxMGM5MDY2M2UxYzEwNzMwNGQwYTUyODQ3OWIwOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1264, "upvote_ratio": 0.93, "comment_count": 241, "over_18": false}, "36": {"id": "1hgp32l", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Orangutan", "link_flair_text": null, "time": 1734749896.860874, "created_utc": 1734481266.0, "url": "https://x.com/ProudSocialist/status/1868660360695407086", "title": "Joe Biden has pardoned a doctor who diluted the chemo of cancer patients, a judge who locked up kids for cash, a CEO who led a $19 million fraud scheme, a local official who stole $53 million from a small town, and his own son. He literally pardoned fraud, bribery and corruption.", "permalink": "/r/conspiracy/comments/1hgp32l/joe_biden_has_pardoned_a_doctor_who_diluted_the/", "selftext": "", "media": null, "score": 3726, "upvote_ratio": 0.9, "comment_count": 415, "over_18": false}, "37": {"id": "1hfai9b", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Substantial_Pace9900", "link_flair_text": null, "time": 1734749897.08163, "created_utc": 1734321095.0, "url": "https://v.redd.it/z2y31984847e1", "title": "Understanding the January 6th Insurrection Hoax", "permalink": "/r/conspiracyfact/comments/1hfai9b/understanding_the_january_6th_insurrection_hoax/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.45, "comment_count": 0, "over_18": false}, "38": {"id": "1hfmir0", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "CartoonCreator", "link_flair_text": "holiday cheer", "time": 1734749897.7819152, "created_utc": 1734365374.0, "url": "https://i.redd.it/aopi8eipi87e1.jpeg", "title": "Merry Squatchmas! ", "permalink": "/r/bigfoot/comments/1hfmir0/merry_squatchmas/", "selftext": "I’ve been making original cartoon Bigfoot paintings and selling them in my store here: https://www.etsy.com/shop/MattJonesOriginalArt ", "media": null, "score": 346, "upvote_ratio": 0.98, "comment_count": 10, "over_18": false}, "39": {"id": "1hhx0ya", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Emeraldsinger", "link_flair_text": "Discussion ", "time": 1734749898.6855, "created_utc": 1734626530.0, "url": "https://i.redd.it/473037p73u7e1.jpeg", "title": "Thoughts on surviving prehistoric centipedes, can they still exist? ", "permalink": "/r/Cryptozoology/comments/1hhx0ya/thoughts_on_surviving_prehistoric_centipedes_can/", "selftext": "", "media": null, "score": 358, "upvote_ratio": 0.89, "comment_count": 78, "over_18": false}, "40": {"id": "1hehlwj", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "BonesAndBlues", "link_flair_text": null, "time": 1734749899.3080494, "created_utc": 1734225446.0, "url": "https://i.redd.it/ywh2skpmyw6e1.jpeg", "title": "My friend got criticized for drawing Bigfoot with pants so I made this for her", "permalink": "/r/cryptids/comments/1hehlwj/my_friend_got_criticized_for_drawing_bigfoot_with/", "selftext": "", "media": null, "score": 232, "upvote_ratio": 0.98, "comment_count": 20, "over_18": false}, "41": {"id": "1hi6kef", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "gyrottta", "link_flair_text": null, "time": 1734749899.5414405, "created_utc": 1734651923.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1hi6kef/multiple_things_revolving_around_dreams_of_mine/", "title": "multiple things revolving around dreams of mine", "permalink": "/r/Thetruthishere/comments/1hi6kef/multiple_things_revolving_around_dreams_of_mine/", "selftext": "i feel as if i've had multiple dreams of me in a gore website / video. i have this vivid description of one of the parts. it was in some empty, kinda trap house but boujee. there were people just running around and shooting each other and people with blown off faces. idk kinda weird. I think it was even like revolved around a real website. \nrepeated dreams. i feel as if i've also had dreams repeated in the same setting and as if my brain knows it was from a previous dream in my dream. this happens quite frequently but like i can sometimes feel when i dream that i'm dreaming so maybe this is that skill inserting itself??? idk just thought it'd be interesting to share. i have dreams in weird povs", "media": null, "score": 5, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "42": {"id": "1hf5u84", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Salty_Thing3144", "link_flair_text": null, "time": 1734749899.7630231, "created_utc": 1734306517.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hf5u84/my_parents_helped_my_stalker/", "title": "My Parents HELPED My Stalker!", "permalink": "/r/LetsNotMeet/comments/1hf5u84/my_parents_helped_my_stalker/", "selftext": "I never wanted to become involved with this guy in the first place. It's one of my weirdest and upsetting experiences ever - and I'm a senior citizen now. \nMy parents, especially my mother, fought me tooth and nail and basically helped this guy stalk me! I've never quite figured out why. \"You're making the biggest mistake of your life,\" she sobbed. (No way. Even thinking about him still makes my skin crawl.)\nIt might have been a control thing - \"Ah, she thinks she's going to get away from us. She thinks she's gonna do whatever she wants and we can't do anything about it. Ohoho, well. We're friends with Rich, and after they're married he and we will be taking care of what goes in and out of her head for the rest of her life!\"\nAnyway, here's what happened. I got even by sending him to hell. Etiquette Hell. Here's my story as I posted it there years ago.\nhttps://www.etiquettehell.com/content/eh_everyday/dating/dating.shtml\nThis happened in 1978, but I may never recover. If it had happened in the era of stalker awareness I would have been terrified!\nFirst some back story...I was adopted, which isn't a bad thing, except that my parents had wanted a Perfect Dream, Barbie Doll, Daughter and I was supposed to live out their script. They were very controlling, and coupled with alcohol abuse, by the time I was a teen the breach was so bad I wasn't living in their house most of the time. I'd try to move back and fix things but it never worked. What finally broke my back was a guy I'll call \"Rich.\"\nRich called my house one afternoon and asked for a date. I told him I didn't know him (true) and that I wasn't allowed to date (also true). He seemed annoyed because I didn't know who he was. \"I'm on the student council. I am head of our Junior Achievement Club.\" (Big deal so what.)\nI asked how he got my number because it was unlisted and he said he volunteered in the school office and pulled my number from student records. That should have been my first clue, but remember I was only 15. Any way, I told him no and hung up, thinking this was the end of it.\nThe next day I get home from school and find mom all excited. She's gotten a call from El Creepo AND his mother, and was sooooo impressed that she decided I could go out with him. His mom was going to pick us up and bring me home, so it was okay. I told her I didn't even know the guy, but she thought this was soooo sweet that he had his mother introduce him.\nWe went out for pizza and a movie, and I thought he was a nice enough guy, but I really wasn't interested in him. However, he decided this one date meant I was his girlfriend now. He was aided and abetted in this by my mother, who thought he was \"perfect\" and \"just what we always wanted for you.\"\nExplaining to her that I wasn't interested in him just brought up a monologue about what a great guy he was, what a good family he comes from, why would I rather be home reading a book than out having a good time. (Telling her I didn't have a good time didn't compute in her brain)\nI never got to see my other friends because he was monopolizing all my time. Weekends I had to go to his house for dinner and watch TV. First we watched \"The Love Boat\" then we watched \"Fantasy Island\" and I had to endure his siblings running around the living room flapping their arms and yelling \"the plane the plane\" - (I wish I was making this up.) On Saturday and Sunday we played Atari at his house. At least he had good games. Sunday mornings, as soon as Rich wakes up, he calls me.\nI tried telling him I wasn't interested in a relationship and I didn't want to see him anymore. He started to freaking CRY. I had to shake his hands off me. While I was walking home he called mom in tears \"to tell her goodbye....\" and \"I guess I just didn't love her enough....\" and the psycho blasted me when I walked in the door for being so mean to this sweet guy.\nHe quickly learned the way to force me out on dates was to ask in front of her because she would roll over any excuse I came up with. He began trying to get rid of my friends by complaining that \"they don't like me\" (true) and asked mom to make sure they weren't invited over when he was there. My friends either didn't like him or were a bad influence on me.\nHe griped about my clothes and makeup. He hated lipstick especially. I told my mom, thinking she'd agree how STUPID this was, but when I got dressed for school the next day she blew up. \"What are you doing with that makeup on? Rich told you he doesn't like that! You get in there and wash your face!\" I was flabbergasted, but said hell no to both of then and wore whatever I liked. He'd scowl and screw his face up into the ugliest sneers, saying I \"look like a streetwalker.\" (Over lipstick, eye shadow and mascara!)\n\"A girl your age has no business wearing a bikini. That top is too low-cut. Why don't you show some self-respect?\" (I was the flattest of flat-chested girls!)\nI wish he'd been really abusive, because then my parents would have agreed to get rid of him. But he was an honor student, from a good family, not a troublemaker. At school the teachers liked him and although the other kids thought he was a number one nerd, didn't bully him because he stomped everybody's behind academically. I don't know why he fixated on me, maybe because I was the shyest kid in school. He never hit me or was verbally abusive, I just couldn't peel him off.\nChristmas was the worst. He gave me a list: this is what he wants for Christmas, this is what his sister wants for Christmas, this is what his mother wants for Christmas! He expected me to buy gifts for his family! I wasn't even planning to get him anything, and he wanted an Atari game. We couldn't afford an Atari system for ourselves, but mom of course buys it for him. She gets everything on the list and tells me to hush because they're getting me something too. I asked Rich for a gift certificate to the bookstore but his mom says gift certs are tacky. They will get me a real gift. So I'm thinking something cool.\nHe gets me, I kid you not, a set of lady's handkerchiefs. I saw them 2 for 5 bucks at K-Mart! After he demanded an Atari game! His sister gets me nothing. His mom buys me a football jersey (I am not a football fan) like the one Rich wears. Mom goes ga-ga saying how cute that we'll match, and be sure to wear it next Friday so they'll see how much I like it. I quietly throw it away.\nI blasted my parents for manipulating and interfering and moved out again. They gave Rich my new address and phone number. I moved and changed numbers again and didn't give them the number. He had mom go to one of my friends and wheedle it out of her. I almost got fired from a job because he wouldn't stop calling me. He waited for me outside the door of my work and followed me, begging and crying. He followed another guy I was dating and tried to convince him we were engaged. I called the cops but they said he wasn't breaking any laws and even lectured me for \"not being forceful enough.\"\nSometimes he would disappear for a few months but always turned up again. My roommate came home from work one day to find him mowing the lawn at the duplex we were renting! At this time the word stalking didn't exist, or I would have been terrified.\nThe harassment ended only when I moved out of town!!! I went back for a family funeral and found he had gone to pay respects and introduced himself to everyone as my boyfriend! ICK! I told everyone if they told him where I was living I'd shoot them first and him second! I never went to my high school reunions because I was afraid of seeing him there.\nI wonder sometimes if he ever got married. I feel sorry for the girl if he did.  Rich - LET'S NOT MEET!!!!!", "media": null, "score": 196, "upvote_ratio": 0.96, "comment_count": 38, "over_18": true}, "43": {"id": "1hgilfu", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "OccasionallyNotAlive", "link_flair_text": null, "time": 1734749900.2001002, "created_utc": 1734463631.0, "url": "https://www.reddit.com/r/threekings/comments/1hgilfu/dark_reflection_ritual_nothing_happened/", "title": "Dark Reflection Ritual (Nothing Happened)", "permalink": "/r/threekings/comments/1hgilfu/dark_reflection_ritual_nothing_happened/", "selftext": "I did the Dark Reflection Ritual back on Sept 1, 2024 using a mirror owned and used by my parents and then by me for about 20 years.\nNothing happened that night or in the next few days.", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "44": {"id": "1hdvhdj", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Bkenning45", "link_flair_text": "Captured Apparition ", "time": 1734749900.7506793, "created_utc": 1734152366.0, "url": "https://i.redd.it/pglrd2qbxq6e1.jpeg", "title": "Captured a very strange apparition at this tower a while back… ", "permalink": "/r/Ghosts/comments/1hdvhdj/captured_a_very_strange_apparition_at_this_tower/", "selftext": "(See comments for backstory) \n- right in-front of the tree in the bottom right ", "media": null, "score": 328, "upvote_ratio": 0.88, "comment_count": 76, "over_18": false}, "45": {"id": "1hfj8wq", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "leafy4twenty", "link_flair_text": "Glitch Pic", "time": 1734749900.9720411, "created_utc": 1734356247.0, "url": "https://i.redd.it/ne9plsbou67e1.jpeg", "title": "The other day a lady got stuck with her car in a pillar. Her comment was ‘’ I backed into this and Idk what happened- help’’", "permalink": "/r/GlitchInTheMatrix/comments/1hfj8wq/the_other_day_a_lady_got_stuck_with_her_car_in_a/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.41, "comment_count": 15, "over_18": false}, "46": {"id": "1hicmk0", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Infinite_Watch668", "link_flair_text": null, "time": 1734749901.974906, "created_utc": 1734671652.0, "url": "https://www.reddit.com/r/ufo/comments/1hicmk0/final_post_video_evidence_and_the_4chan_ufo_leak/", "title": "Final Post: Video Evidence and the 4Chan UFO Leak", "permalink": "/r/ufo/comments/1hicmk0/final_post_video_evidence_and_the_4chan_ufo_leak/", "selftext": "Seeing is believing...\nHello everyone. It's been a weird few weeks, hasn't it? It's been weird for me, at least.\nI came home today and saw, with my own eyes, mechanical drones flying above my neighborhood in Georgia. FAA lights, flying low, unmarked and unseen on my flight radar. While I was a firm believer before in the situation, with all the video evidence floating around here, it's another thing entirely to see the phenomenon happen right before your eyes. I'm not going to bother posting another fuzzy iPhone camera video, there's plenty of those out there already and better.\nThat aside, let's get into the meat of this.\nThe Infamous 4Chan Leak\nI'm sure everyone here has heard of the UFO 4Chan leak, but if you haven't let me catch you up to speed.\nThe Post:\nhttps://imgur.com/a/4chan-whistleblower-NXjWQaN\n(Text Transcription):\nhttps://www.reddit.com/r/UFOs/comments/1hfpg0k/since_people_keep_referencing_it_while_talking/?share_id=jt3qzfk2KcJwXWnwoLo0Z&utm_medium=ios_app&utm_name=ioscss&utm_source=share&utm_term=1\nI cannot and will not summarize the whole thing. Go read it for yourself, it's fascinating.\n...You back yet? Good.\nThe Probes\nFrom here on out, I will be referring to the \"orbs of orange light\" as Probes, because... well, that's what they are. They are cameras equipped with an omnidirectional light source that appears as an orange \"orb\" when in Scanning Mode, and then when in Combat Mode, the light quickly disappears and is replaced with a red light.\nHow do I know this? Well for starters, check this out:\nhttps://www.reddit.com/r/UFOs/s/xPsjx3pp35\nThis post depicts a video of two \"Mechanical\" drones (they look like traditional 4-rotor drones, except supersized and equipped with FAA-approved lighting, but do not appear on any radar scanning tech) and one Probe.\nAll is fine, until the Mechanical drones get too close. At that moment, the orb of light rises into the air, retreating from the Mechanical Drones, and the light transforms from a glowing orb of light into two red lights.\nWeird, right?\nUp until now, we have been thinking they are on the same side. They are clearly not.\nThe Hammers\nIf you read the 4Chan post above (which you should have!!!) something in that video should jump out at you immediately: the light transforming into two lights.\nIn the 4Chan leak (which came out BEFORE the current events, in April 2023) the author discusses the Probes briefly, what their purpose is and what they do.\n\"Research/science vessels sometimes have mobile light­ producing \"cameras\" used for multiple purposes from scouting to keeping threats contained or at bay. These are shaped like hammers and when operated are extremely bright. Red lights are a sign of hostility or caution to deploy weapons. Orange lights are usually for spotting minerals or living things.\"\n\nMULTIPLE TIMES, the author of the post states information about the Probes:\n\"Shaped like a hammer but when activated yes they appear like spheres due to the intense light. They see light differently and looking into the sun for them isn't an issue like it is for us. I can't speak for the psionic abilities if any since I've only heard rumors in passing. We believed the lack of communication was inherent to their personal beliefs about us. As mentioned previously but active serious discussion about destruction gets them going.\"\n\n\"Do you mean orbs in the sky? Or do you mean landed craft deploying them? I've mentioned previously that there are tools that are shaped like \"hammers\" They emit extremely bright light and are used as a sort of drone or scout. They are able to view almost 360 degrees and detect everything from minerals to bio. If a human encounters them they usually are deployed to keep watch and figure out when to wrap up and leave.\"\n\nNow, having read that information, go back and watch the video above.\nMy Conclusions\nNow, having laid all that out before you, let me propose my theory on the current situation. This is Speculation, but it is an EXTREMTLY EDUCATED GUESS. I'm not the type of person to just go out on faith just because I \"Want to believe.\" I feel that we already have compelling evidence enough to piece together a story out of this situation.\nNow, here are my thoughts:\n\nNon Human Intelligence is real.\nCurrently, we are in the middle of a global event in which the Non-Human Intelligences are finally revealing themselves to us in a way that is undismissable, unexplainable and unavoidable.\nThe Mechanical Craft we see are the U.S. Government's drones as they scout out and assess the situation. They understand that we are about to witness a global event, and I believe most of the more \"base\" Politicians see this as an existential threat and an \"invasion,\" so they are closely monitoring the situation.\nThe orbs of light that we see are Probes, multipurpose unmanned vessels deployed by NHI ships and the mothership \"factory\" itself, which sits at the bottom of the ocean off the Atlantic Coast. Specifically, in the Bermuda area. The factory attacks anything that gets close, or otherwise flees underwater and disappears for weeks at a time before returning back to it's original spot. It's been here for a while, anywhere from 100 years to a few thousand.\nThere is nothing else we can do but witness what is about to happen.\n\nHappy Trails!\n\"So.... what now?\"\n.... truthfully, I don't know. None of us do, really. This has never happened before in our known history of humanity. I know, I know, ancient aliens and all that, but let's get real: there was never going to be a way to solve this mystery just based on old heiroglyphs, cuniform and religions that have gone through the telephone game so much that I can't even make out the words anymore.\nIf it was ever going to happen, it would happen exactly like this.\nAlright, by for now everyone! Stay safe out there, good luck and remember:\nNo matter what happens next, just take it in stride. We Humans are so strong, so courageous, so adaptible and smart, that we will figure out a way to survive this... mentally, physically and spiritually.\nSee you, Space Cowboy/\n", "media": null, "score": 1113, "upvote_ratio": 0.9, "comment_count": 322, "over_18": false}, "47": {"id": "1hg2sgs", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "EasilyAmusedEE", "link_flair_text": "Sighting", "time": 1734749903.3130596, "created_utc": 1734410056.0, "url": "https://v.redd.it/pc3ozh4b7c7e1", "title": "12/16 UA2359 ORD to EWR", "permalink": "/r/UFOs/comments/1hg2sgs/1216_ua2359_ord_to_ewr/", "selftext": "Some video clips from my flight to Newark NJ. There’s another 15m of video that I still have. \nThe flashing blue lights were interesting because I could never see that with my naked eye.", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/pc3ozh4b7c7e1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/pc3ozh4b7c7e1/DASH_96.mp4", "dash_url": "https://v.redd.it/pc3ozh4b7c7e1/DASHPlaylist.mpd?a=1737341902%2COGJmMzliOWMwOWZmYzYwNDE4MzYxMjk2YWY1YWM5YmU3NTE5NDM2ZjUwOTczYjUzNmQ3ZWEwZDQ1ZTc5NjU3OQ%3D%3D&v=1&f=sd", "duration": 127, "hls_url": "https://v.redd.it/pc3ozh4b7c7e1/HLSPlaylist.m3u8?a=1737341902%2CNzllMGE5ZjBiOWFkNjNjYmQ3OWI2OGFjZGU0YjYyN2ViNTg2OWFlY2E5NWNmMDQ2ZTkwYzM4ZTE1NmRmMjhlNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 15308, "upvote_ratio": 0.9, "comment_count": 2631, "over_18": false}, "48": {"id": "1hfx9w9", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Iitaps_Missiciv", "link_flair_text": "Image 📷", "time": 1734749904.7181103, "created_utc": 1734392961.0, "url": "https://i.redd.it/zi99e1nqsa7e1.jpeg", "title": "Same playbook, different year", "permalink": "/r/aliens/comments/1hfx9w9/same_playbook_different_year/", "selftext": "Eerily Similar ", "media": null, "score": 6701, "upvote_ratio": 0.84, "comment_count": 366, "over_18": false}, "49": {"id": "1hhuyjm", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Retrocausalityx7", "link_flair_text": "Discussion", "time": 1734749906.5911732, "created_utc": 1734621015.0, "url": "https://i.redd.it/4xun80dtmt7e1.jpeg", "title": "it's happening everywhere", "permalink": "/r/UAP/comments/1hhuyjm/its_happening_everywhere/", "selftext": "", "media": null, "score": 1236, "upvote_ratio": 0.92, "comment_count": 275, "over_18": false}, "50": {"id": "1heiisn", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "flemay222", "link_flair_text": null, "time": 1734749907.8525817, "created_utc": 1734228483.0, "url": "https://i.redd.it/bjvaggnn7x6e1.jpeg", "title": "Can't Make This Stuff Up ", "permalink": "/r/conspiracy/comments/1heiisn/cant_make_this_stuff_up/", "selftext": "And that's just a short hand version of her list of crimes. Seems to me someone ought to do a deep dive into this. I'm sure there is more to this story than meets the eye... ", "media": null, "score": 3442, "upvote_ratio": 0.72, "comment_count": 514, "over_18": false}, "51": {"id": "1hh0w7y", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "lore", "time": 1734749908.7403946, "created_utc": 1734526266.0, "url": "https://i.redd.it/bn37y1o3tl7e1.jpeg", "title": "The only known photograph of Vladimir Pushkarev, a Russian geologist who went missing on an expedition for the yeti. ", "permalink": "/r/bigfoot/comments/1hh0w7y/the_only_known_photograph_of_vladimir_pushkarev_a/", "selftext": "", "media": null, "score": 310, "upvote_ratio": 0.97, "comment_count": 20, "over_18": false}, "52": {"id": "1hevz0f", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Right_Housing2642", "link_flair_text": "Hoax", "time": 1734749909.621666, "created_utc": 1734279517.0, "url": "https://v.redd.it/dfqwzt9xhc6e1", "title": "Bigfoot!! Bigfoot!!", "permalink": "/r/Cryptozoology/comments/1hevz0f/bigfoot_bigfoot/", "selftext": "", "media": null, "score": 244, "upvote_ratio": 0.87, "comment_count": 33, "over_18": false}, "53": {"id": "1he7f5t", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Final-Committee-3624", "link_flair_text": null, "time": 1734749910.2831905, "created_utc": 1734196261.0, "url": "https://i.redd.it/93od8wbuju6e1.jpeg", "title": "Nessie meme ", "permalink": "/r/cryptids/comments/1he7f5t/nessie_meme/", "selftext": "", "media": null, "score": 142, "upvote_ratio": 0.97, "comment_count": 3, "over_18": false}, "54": {"id": "1hgvxp9", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Glittering-Cable9978", "link_flair_text": null, "time": 1734749910.724196, "created_utc": 1734504478.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hgvxp9/almost_kidnapped_from_my_school/", "title": "almost kidnapped from my school", "permalink": "/r/LetsNotMeet/comments/1hgvxp9/almost_kidnapped_from_my_school/", "selftext": "this is definitely not as intense as some of the other stories i’ve read but it still freaks me out to think about.\nthis happened when i was in elementary school. the school i went to was very strict and had a very particular set of rules. one of the rules was that no child was allowed to leave the school on their own and absolutely had to be picked up by a parent. \nthe school provided each parent with a laminated card that had their child’s full name and grade on it. the school was heavily gated so someone would stand at the entrance and let parents in as long as they showed them one of those cards. once inside the school, the parent would find their child sitting on the grass with everyone else and be able to leave with them through a different entryway with another person making sure you have both the card and the child. \non this particular day, my mom was taking a bit longer than usual to pick me up but i thought nothing of it and just sat on the grass talking to some friends until she got there. all of a sudden, i noticed a woman i had never seen before sort of waving in my direction trying to get my attention. at first i thought she was talking to someone else until i realized there was nobody else that close to me. i pointed at myself in confusion and she nodded. i didn’t get up but she instead came up to me and said something along the lines of “hi sweetie! i’m your moms friend, she asked me to come pick you up today.” being as i’d never seen this woman in my life, i was immediately skeptical. i asked her “where’s my card?” and as soon as i said this her smile dropped, she looked around, and walked away extremely fast. \nthe gates around the school were very wide so i could see out into the street super easily. i watched as this woman sped walked to the back of the school which was not as heavily guarded, and eventually i caught sight of her getting into an old beaten up van with an older man. she did not have a child with her and i have no idea how she managed to get in without someone checking her. \nmy mom picked me up about 3 minutes after this happened and when i told her she immediately met with the principal and the next week i noticed the back part of the school being just as guarded as the front where most parents picked up their children. \ni know exactly what that woman’s intentions were and think back to this every now and then. i truly hope she’s remained unsuccessful in any other attempts she may have had to lure children her way. to the woman who attempted to take me from my elementary school and that man waiting for her in that old beaten van, let’s not meet. ", "media": null, "score": 100, "upvote_ratio": 0.92, "comment_count": 9, "over_18": true}, "55": {"id": "1hild6z", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "DanceLogical211", "link_flair_text": null, "time": 1734749911.0940697, "created_utc": 1734706098.0, "url": "https://www.reddit.com/r/threekings/comments/1hild6z/what_ritual_was_jack_parsons_doing/", "title": "What ritual was jack Parsons doing?", "permalink": "/r/threekings/comments/1hild6z/what_ritual_was_jack_parsons_doing/", "selftext": "To contact Belarion Armillus Al Dajjal,", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 0, "over_18": false}, "56": {"id": "1hdtnr9", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Ed_95", "link_flair_text": "Captured Apparition ", "time": 1734749911.6397357, "created_utc": 1734145898.0, "url": "https://www.reddit.com/gallery/1hdtnr9", "title": "My cousing and her husband went camping, they live in Dublin.", "permalink": "/r/Ghosts/comments/1hdtnr9/my_cousing_and_her_husband_went_camping_they_live/", "selftext": "They took pictures of the campfire and surprise.", "media": null, "score": 298, "upvote_ratio": 0.79, "comment_count": 95, "over_18": false}, "57": {"id": "1hg52th", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Infinite_Watch668", "link_flair_text": null, "time": 1734749913.3387108, "created_utc": 1734418817.0, "url": "https://www.reddit.com/r/ufo/comments/1hg52th/psa_do_not_panic_were_gonna_be_alright/", "title": "PSA: DO NOT PANIC! We're gonna be alright :)", "permalink": "/r/ufo/comments/1hg52th/psa_do_not_panic_were_gonna_be_alright/", "selftext": "It’s come to my attention as I’ve been researching the current Drone/UAP crisis happening across the planet that there seems to be a deliberate effort by the U.S. Government to hide the truth of what’s happening. The State Government and local officers are assisting as much as they can, but they are vastly unequipped for the current situation.\nHowever, I want to make something clear, because this is my I believe this is the key takeaway of all this: We Must Not Panic.\nNot once, for as often as those drones have flown over our military bases and civilian houses, have these drones attacked or hurt anyone.\nNot once have any of these craft shown signs of ill intent, other than their unexplainable appearance.\nNot only that, but combined with reports of UAP’s shutting down nuclear missiles during crisises, it’s clear to see that whatever these things are don’t mean us any harm. If they did, clearly they would have done something by now. We cannot even damage their vessels.\nSo, after hearing tons of politicians say what they think, seeing the situation unfold for myself, and also as a person who is seeking some sort of solution or truth in this situation, here’s my solemn advice to everyone:\nDont panic! It’s gonna be okay!\nNo matter what way you slice it, whether it’s a secret U.S. program or extraterrestrials (🌊) visiting Earth, whatever is going on, I am almost entirely certain these drones are not a threat.\nThe only threat we have, however, is fear. Fear that we won’t know what’s coming, fear of the impossibility of the situation, fear of the unknown… we cannot let this fear and anxiety rule over us in this time of change and crisis! No matter what you believe, make a commitment here and now, before things evolve and change into a less or more drastic situation:\n\nBe good to others during this time of panic. People are scared and upset, and do all kinds of things that hurt others and themselves when they act out of fear. It is not your responsibility to inform everyone of the \"truth,\" only to be there as an anchor when clarity can cut through the confusion.\nAll kinds of people who believe one thing or another are going to be confronted with their worst nightmare: a complete spiritual or belief system breakdown. As someone who has gone through (and is still going through) Christian Deconstruction, I can tell you firsthand it is horrible, heartbreaking and a time of mourning and grief. While you and I may get the opportunity to gloat and tell everyone that we were right along (and darnit, we do deserve to gloat after the years and years of ridicule), we must restrain ourselves and see instead the immense pain and grief that our loved ones and community members will be going through. Be compassionate, be loving, be a light in the darkness.\nThe government will not take a systemic change lying down, nor will other national governments. Be prepared for a time of crisis and tumult as society bends and breaks in accordance with these new worldviews and facts. Do not listen to others who are diminishing the problem, but also do not panic yourself; calmly and efficiently gather what you and your family need to get through 2-4 weeks of no running water or food.\nDo not forget to take time to look at how beautiful the world is. I believe it is why they are here, after all.\n\nSo do yourself, and everyone else, a huge favor: turn on the news, but make sure you chill while you do it.\nStay safe everyone!\n….\nEDIT:\nThank you all for reading, commenting and engaging with each other through my post. It's been a pleasure to read your comments and share this with you.\nI am going to post one last post for now, and then I am going to step away from the news, reddit and most everything else. I feel that I have seen and read enough to understand the situation, and my mental health tells me it's time to turn off the tv for now.\nI'll link it here when I am done, for whoever wishes to read my thoughts on the situation, what is happening and what we can do about it.\nIn the meantime, thank you all, each and every one of you. Stay safe out there, drink water, and don't forget:   \nWe will find a way through this moment in time, regardless of what happens next.", "media": null, "score": 874, "upvote_ratio": 0.87, "comment_count": 359, "over_18": false}, "58": {"id": "1hhjzew", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "9thArrow", "link_flair_text": "Likely Identified", "time": 1734749914.8651998, "created_utc": 1734579758.0, "url": "https://v.redd.it/u8ux97d58q7e1", "title": "Helicopter Chasing two UAPs/Orbs", "permalink": "/r/UFOs/comments/1hhjzew/helicopter_chasing_two_uapsorbs/", "selftext": "A Helicopter Chasing two UAPs/Orbs. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/u8ux97d58q7e1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1390, "width": 1080, "scrubber_media_url": "https://v.redd.it/u8ux97d58q7e1/DASH_96.mp4", "dash_url": "https://v.redd.it/u8ux97d58q7e1/DASHPlaylist.mpd?a=1737341913%2CNmUwY2NmNTA0MjFkYTJiMGQ4YjcxY2U5ZjQ1NDljMjgzNWM3MTQ0ODExOTk1NjUxNTFhYzZjYzE4NmY0ZmY3Yg%3D%3D&v=1&f=sd", "duration": 32, "hls_url": "https://v.redd.it/u8ux97d58q7e1/HLSPlaylist.m3u8?a=1737341913%2CY2FjNzRmZjU1OWFiZjljZjY2OWQxMGUwNzBjYjM4NDk4MDVkNTA1NDY1N2ZhNWNhYTM2NjBmMDFmOWU1MDkwYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 11713, "upvote_ratio": 0.72, "comment_count": 2483, "over_18": false}, "59": {"id": "1hgbjwz", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "YourMagicalUnicorn", "link_flair_text": "Video", "time": 1734749916.089696, "created_utc": 1734444977.0, "url": "https://v.redd.it/ln9t69oe3f7e1", "title": "UFO/UAP at Cabin Creek", "permalink": "/r/aliens/comments/1hgbjwz/ufouap_at_cabin_creek/", "selftext": "UAP in Cabin Creek. The UAP starts to circle around itself and by the end it simply swirls at a rate unomprehensibly fast. Do you think this is the way it takes off? Maybe it teleports? Or creates a portal?", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/ln9t69oe3f7e1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 394, "scrubber_media_url": "https://v.redd.it/ln9t69oe3f7e1/DASH_96.mp4", "dash_url": "https://v.redd.it/ln9t69oe3f7e1/DASHPlaylist.mpd?a=1737341915%2CZTMyNDAzYmVjNjc1OWFjZGNkODM4ZWUyM2Y5Zjc1NWM1NjRkYjU3NmQ3NjgwNjUzOGUyNDE2MzY3MDhkNDgwZQ%3D%3D&v=1&f=sd", "duration": 11, "hls_url": "https://v.redd.it/ln9t69oe3f7e1/HLSPlaylist.m3u8?a=1737341915%2CODg0ODFiZTkwODQ0MjNjODY4MDQxN2QzNmRhZDk4MzliMGE5YjYzYTE1ZmNhYWNkYTdjMTQ2NjhiOWJmM2QyNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 5664, "upvote_ratio": 0.84, "comment_count": 834, "over_18": false}, "60": {"id": "1hemszl", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "ExcuseBitter7203", "link_flair_text": null, "time": 1734749917.7136555, "created_utc": 1734244435.0, "url": "https://www.reddit.com/r/UAP/comments/1hemszl/resident_of_north_nj_here_time_for_something_new/", "title": "Resident of north NJ here, time for something new to be attempted ", "permalink": "/r/UAP/comments/1hemszl/resident_of_north_nj_here_time_for_something_new/", "selftext": "Last night I witnessed an incident with these \"drones\" in North Haledon NJ while parked on top of a mountain overlooking the reservoir. \nDozens of these things were moving around and 3 of what I can only describe as orbs were interacting with them. The orbs then shot away like shooting stars. The \"drones\" went dark and were practically invisible against the night sky. I was on the phone with my mother at the time and she has never heard me so frightened before. \nI am a logical person, and I am an educated person (not that it matters, but I thought relevant considering) I have experience in aviation equipment and I have 3 actual drones I use for surveying contracts. My wife has her pilots license. \nI cannot \"debunk\" what I witnessed and I don't have video proof. It was very quick. This is my off season for my work and I have a lot of time on my hands right now. I have the means to travel anywhere in the state at any time of day/night. \nI don't have FLIR equipment as of now but my wife has access to a plane. We are going to plot the hotspots. She will fly and I will document with video. Please submit any questions down below. If we are able we will bring FLIR to test the thermal theory. Any other advice on what to test please share here. This will be costly but we feel it's necessary at this point for our own peace of mind. We're not getting any answers from officials only more questions. \nWe don't post much on reddit but we are frequent visitors. I will update this post with a link to our thread containing our findings. I will not be sharing specifics regarding our departure. \nWhat is happening here is extraordinary and we intend to document and research from a vantage point we haven't seen yet. We are aware this isn't a complete throwaway account. We share. Don't believe the officials, they are lying. ", "media": null, "score": 1203, "upvote_ratio": 0.98, "comment_count": 198, "over_18": false}, "61": {"id": "1he6a83", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "slightstoopkid", "link_flair_text": null, "time": 1734749919.005807, "created_utc": 1734193058.0, "url": "https://www.reddit.com/r/conspiracy/comments/1he6a83/i_am_an_american_journalist_and_the_government_is/", "title": "I Am An American Journalist and The Government is Trying to Kill Me", "permalink": "/r/conspiracy/comments/1he6a83/i_am_an_american_journalist_and_the_government_is/", "selftext": "My name is Rebecca Barglowski. I am a digital journalist, and throughout most of my career, I focused primarily on pop culture for outlets like intomore.com, hiphopdx.com, and post-trash.com. My love for pop culture conspiracy theories and gossip also extends into investigative work, like this piece: I Learned My Hometown, In New Jersey, Welcomed The KKK, for Cracked.com. \nAs of late, my most recent investigation has led me to the discovery that New Jersey’s drinking water is and has been incredibly contaminated. While this singular article focuses only on how NJ’s drinking water has been contaminated with PFAs chemicals for over 20 years, a deeper look at the Raritan and Middlesex Water Systems reveals even more possibilities of contamination from fecal bacterias, radioactive radon, disinfection byproducts, and lead. \nIn the process of doing research for this article, all the documents utilized were public documents from various government agencies. The more I uncovered about New Jersey’s drinking water, the more I realized that all these agencies involved: the EPA, the NJDEP, the USGS, and more, know fully well just how dangerously contaminated NJ’s tap water is.\nMy initial interest in New Jersey’s water began with a visit to New Brunswick’s Robert Wood Johnson University hospital on March 16th of 2024. I went to the emergency room feeling incredibly ill. While there, they ran multiple tests on me, all of which revealed multiple physical ailments. My glucose levels were 157. My C02 levels were low at 21.1 and my Urinalysis was also incredibly abnormal. \nStill, the emergency department transferred me to the basement of the facility for behavioral or mental health services from 3/16-3/18. While in the basement, I was not only consistently denied medical attention while coughing up black mucus, but I also witnessed things like a patient being dragged across the floor and another patient who spoke Spanish and seemed to struggle with schizophrenia but was not given a translator whatsoever. The doctors then forced me to sign myself “voluntarily” into another facility by saying that if I did not sign the paperwork, they would submit me “involuntarily.” \nFrom 3/18 – 3/20, I was at Rutgers University Behavioral Health Care in Piscataway. \nWhile there, I noticed that the facility got water delivered in containers each day for the patients to drink. Something they most certainly did not do for me in the basement at Robert Wood Johnson. I also got more tests done, which further revealed just how much I needed medical treatment. \nIn addition to having the drinking water delivered at University Behavioral Health Care on Rutgers’ Busch Campus, I took note of how they were having the ceiling tiles replaced in empty rooms. I also believe that many of the rooms, mine included, had asbestos ceiling tiles. Upon signing myself out, I straight up told them I was a journalist, that I had suspicions about asbestos and the water, and I also had to write my place of occupation on the sign out form. \nI then began to take interest in New Jersey’s drinking water.\nI very quickly realized that ever since my stay at RWJ in March 2024, I have been and was being followed everywhere I went. The more I discovered for my article on the contamination of New Jersey’s drinking water, the more I feared for my life. \nPlease help me, I am so scared. \nThe full story and all the proof and pictures are on my blog: https://beccabarglowski.wordpress.com/2024/12/14/i-am-an-american-journalist-and-the-government-is-trying-to-kill-me/", "media": null, "score": 3338, "upvote_ratio": 0.92, "comment_count": 434, "over_18": false}, "62": {"id": "1hhz1bz", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "hippy2zippy", "link_flair_text": "encounter story", "time": 1734749919.9097545, "created_utc": 1734631681.0, "url": "https://i.redd.it/wpujpz2kiu7e1.jpeg", "title": "1977 News Article ", "permalink": "/r/bigfoot/comments/1hhz1bz/1977_news_article/", "selftext": "", "media": null, "score": 210, "upvote_ratio": 0.98, "comment_count": 12, "over_18": false}, "63": {"id": "1hh4jpx", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "TalonEye53", "link_flair_text": "Question", "time": 1734749920.7977595, "created_utc": 1734537201.0, "url": "https://www.reddit.com/gallery/1hh4jpx", "title": "What are the chances of these guys ever to be found? ", "permalink": "/r/Cryptozoology/comments/1hh4jpx/what_are_the_chances_of_these_guys_ever_to_be/", "selftext": "https://www.deviantart.com/leonardismos/art/The-Untouchable-Bathysphere-Fishes-1054656540", "media": null, "score": 205, "upvote_ratio": 0.95, "comment_count": 55, "over_18": false}, "64": {"id": "1hdsm8w", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Final-Committee-3624", "link_flair_text": null, "time": 1734749921.4594743, "created_utc": 1734142431.0, "url": "https://i.redd.it/57s5nu4s3q6e1.png", "title": "Bigfoot meme ", "permalink": "/r/cryptids/comments/1hdsm8w/bigfoot_meme/", "selftext": "", "media": null, "score": 122, "upvote_ratio": 0.97, "comment_count": 8, "over_18": false}, "65": {"id": "1hga3wz", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "EricShanRick", "link_flair_text": null, "time": 1734749921.8878279, "created_utc": 1734440480.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hga3wz/robbed_outside_a_gas_station/", "title": "Robbed outside a gas station", "permalink": "/r/LetsNotMeet/comments/1hga3wz/robbed_outside_a_gas_station/", "selftext": "This story isn't as dramatic as the other ones on the sub, but it was incredibly terrifying for me to experience. It happened to me yesterday late in the afternoon. I had just finished buying some snacks from the gas station when a man approached me as I was walking home. It was dark out so the only thing I could make out was that he was about two inches taller than me, had a green jacket with a hood on, and had fair skin.\nHe asks me what's in my backpack. I try walking away but he grabs my bag and refuses to let me go. He demands I hand him the bag. I tried my best to plead with him, saying that he could have the food inside it of he was hungry. He didn't care. He kept fighting me for the bag. I did my best holding my ground and putting up a fight. Several drivers sped past me and none of them bothered to stop and help me. I was all alone on a dark and empty sidewalk. This gas station was in a pretty ghetto part of town. Bunch of drug addicts and violent people. I used to lived there so I knew that cops were regularly called into that neighborhood. I'm glad I managed to escape that environment 2 years ago.\nEventually, the man removes his hand from his pocket and I start fearing for the worst. I almost expected him to pull out a knife but thankfully it was only his fist. He begins banging hard against my fists to the point to they bleed. I couldn't take it anymore so I handed him the bag and watched him run off. There was only some chips and juice in there so it's not like I lost anything super valuable.\nI walked through entire way home constantly looking over my shoulder in case that bastard came back for more. I didn't call the police because I knew nothing would be done about it. I barely even had a description of the guy so they wouldn't really have anything to go off of. I'm currently at work with a bandaged hand, trying my best to get through the day despite the pain. I hope the guy who did all this ends up messing with the wrong person and gets the hell beaten out of him. I wish I never went to that neighborhood. I wish I had stayed home.", "media": null, "score": 38, "upvote_ratio": 0.95, "comment_count": 10, "over_18": true}, "66": {"id": "1hhmlj9", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Lola_got_a_Lazerface", "link_flair_text": null, "time": 1734749922.2989764, "created_utc": 1734589099.0, "url": "https://www.reddit.com/r/threekings/comments/1hhmlj9/how_to_summon_the_cumster/", "title": "How to summon the Cumster?", "permalink": "/r/threekings/comments/1hhmlj9/how_to_summon_the_cumster/", "selftext": "He's a crazy powerful guy, his name is a combination of cum and monster", "media": null, "score": 0, "upvote_ratio": 0.45, "comment_count": 1, "over_18": false}, "67": {"id": "1hdvxbe", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "6_infinite_chaos_6", "link_flair_text": null, "time": 1734749922.8448827, "created_utc": 1734153974.0, "url": "https://www.reddit.com/gallery/1hdvxbe", "title": "Pt 2 of Either yall are seeing what IM seeing or im losing my marbles", "permalink": "/r/Ghosts/comments/1hdvxbe/pt_2_of_either_yall_are_seeing_what_im_seeing_or/", "selftext": "The 1st pic is from the original post. Last 2 were when I was getting ready to check on my baby. Last one looks like a dog? I don’t have dogs.", "media": null, "score": 85, "upvote_ratio": 0.71, "comment_count": 68, "over_18": false}}}