{"_default": {"1": {"id": "1flwifh", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "ShortSqueeze20k", "link_flair_text": null, "time": 1727492377.7774243, "created_utc": 1726899004.0, "url": "https://www.reddit.com/r/ufo/comments/1flwifh/trump_asked_directly_2_days_ago_if_aliens_exist/", "title": "Trump asked directly 2 days ago if Aliens exist in area 51", "permalink": "/r/ufo/comments/1flwifh/trump_asked_directly_2_days_ago_if_aliens_exist/", "selftext": "33 min 43 seconds into it he gets asked if there are aliens in area 51.\nHe brings up a story when he talked to pilots who swear they were passed by objects flying \"4 times faster than their F22\"\nhttps://www.youtube.com/watch?v=tNGBB52inSk#t=33m43s\nEdit: I am disappointed most of you took this as political. Regardless of your position on this person, their security access is one of the highest. It is just another data point.\nEmotional people cannot think clearly. ", "media": null, "score": 675, "upvote_ratio": 0.84, "comment_count": 464, "over_18": false}, "2": {"id": "1foj41x", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Oneiroi_Coeus", "link_flair_text": "Article", "time": 1727492379.3610187, "created_utc": 1727201275.0, "url": "https://www.ctvnews.ca/canada/image-released-of-mysterious-object-shot-down-over-yukon-in-2023-1.7049241", "title": "Image released of mysterious object shot down over Yukon in 2023", "permalink": "/r/UFOs/comments/1foj41x/image_released_of_mysterious_object_shot_down/", "selftext": "", "media": null, "score": 5110, "upvote_ratio": 0.89, "comment_count": 1156, "over_18": false}, "3": {"id": "1flzg0p", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Remarkable-Job-6468", "link_flair_text": "Experience ", "time": 1727492380.9536989, "created_utc": 1726912163.0, "url": "https://www.reddit.com/r/aliens/comments/1flzg0p/hello_everyone_i_made_my_dad_a_promise_when_he/", "title": "Hello everyone, i made my dad a promise when he passed away last week. he worked for the pentagon from the 60s to the 80s", "permalink": "/r/aliens/comments/1flzg0p/hello_everyone_i_made_my_dad_a_promise_when_he/", "selftext": "I'm really nervous, scared and not sure what to write but il do what I can.\nI don't expect anyone to believe me, but I made my dad a promise.\nHe worked in the government and told me he was in the more secretive side. He said he worked with NASA from the pentagon closely from the 60s to early 80s, closely, very very closely.\nHe didn't tell me much on his deathbed other then what il put below. he died from pancreatic cancer and didn't care anymore about hiding things.\nI wanted to post this earlier but I was really afraid. I don't even know if this will be accepted, or deleted or if anyone will believe me? But I'm keeping a promise.\nMy dad told me that the moon landings are definitely real, but there's more to it\nHe told me the race to the moon was an invitation by aliens who watch earth. That's why both the soviets and America were so crazy to reach it.\nHe told me he saw the pictures that the public won't get to see and remembers it like yesterday. Pillars clustered together in the background and pyramid like structures, Neil was giving a wide map of earth as a gift to a creature that was half his size.\nHe told me the astronaut's were not told about this until the very last moment for security reasons. He told me the invitation was a test of humanity's capability's and that the first country to reach them would be partners with them.\nI always knew my dad as I grew up was a big shot but this is just to much. He told me he didn't think they would come after me but he set a dead man switch with someone if something happens to me because of this post.\nI don't know what else to say really, I'm so anxious I want to puke but I want to see those pictures badly.\nLike I said I don't expect anyone to believe My dad or me but I kept my promise, he was really hopeful the last 5 years before he died that things would be out there but he has been mad at the government and told me he doesn't care anymore.\nAnyway I hope you all have a good day. also, why did they remove the content of my post but not lock it? they didn't even give me a reason....\nhttps://preview.redd.it/5x60cvj4w4qd1.png?width=1017&format=png&auto=webp&s=e3498752367d506c12fe9efa2b1f5cb016cbf502", "media": null, "score": 3016, "upvote_ratio": 0.89, "comment_count": 1023, "over_18": false}, "4": {"id": "1fonke0", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "News", "time": 1727492381.7276602, "created_utc": 1727212390.0, "url": "https://www.ctvnews.ca/canada/image-released-of-mysterious-object-shot-down-over-yukon-in-2023-1.7049241", "title": "Image released of mysterious object shot down over Yukon in 2023", "permalink": "/r/UAP/comments/1fonke0/image_released_of_mysterious_object_shot_down/", "selftext": "", "media": null, "score": 104, "upvote_ratio": 0.95, "comment_count": 16, "over_18": false}, "5": {"id": "1fnb44h", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Mighty_L_LORT", "link_flair_text": "Rule 6 Reminder", "time": 1727492383.5263577, "created_utc": 1727061421.0, "url": "https://i.redd.it/295o13978hqd1.jpeg", "title": "Faster than light", "permalink": "/r/conspiracy/comments/1fnb44h/faster_than_light/", "selftext": "", "media": null, "score": 5071, "upvote_ratio": 0.97, "comment_count": 63, "over_18": false}, "6": {"id": "1flx8fw", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "abdussalem", "link_flair_text": null, "time": 1727492383.742512, "created_utc": 1726902175.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1flx8fw/from_oprah_to_the_times_of_israel_the_secret_life/", "title": "From Oprah to the Times of Israel: The Secret Life of Vicki Polin", "permalink": "/r/conspiracyfact/comments/1flx8fw/from_oprah_to_the_times_of_israel_the_secret_life/", "selftext": "Vicki Polin, a blogger for The Times of Israel (https://blogs.timesofisrael.com/author/vicki-polin/) and cousin of the late Chicago native American-Israeli hostage Hersh Goldberg-Polin (https://blogs.timesofisrael.com/hersh-goldberg-polin-hamas-murdered-a-part-of-my-dna/), reportedly executed by Hamas in late August 2024, has a controversial past. This is the same Vicki Polin who appeared on The Oprah Winfrey Show on May 1, 1989, testifying under the pseudonym \"Rachel\" that she and her extended family in the Chicago area practiced satanic rituals, including infant sacrifices, in which she claimed to have participated (https://youtu.be/hwih4niZ4MA?si=gybEZL4S8VOUk2X7).\nFollowing her appearance, she founded The Awareness Center (https://theawarenesscenter.blogspot.com/2009/04/susan-rosenbluth-harassment-bulling.html), a rape and sexual violence prevention organization for Jewish communities. To date, there have been no formal accusations directly linking her public identity to the Oprah interview. However, in this Times of Israel article, Vicki Polin links herself to working for The Awareness Center (https://blogs.timesofisrael.com/metoo-except-if-youre-a-jew-antisemitism-in-the-anti-rape-movement/), strongly suggesting that she is indeed the same person.\nHersh's parents, Rachel and Jon Polin, have gained significant public attention since his abduction on October 7th. They have met with figures such as Pope Francis and Kamala Harris, spoken at the DNC in Chicago, and appeared on shows like Face the Nation and CBC. They have been interviewed multiple times by Anderson Cooper, who reportedly discovered the video of Hersh's abduction before its official release and showed it to his parents following an interview (https://www.youtube.com/watch?v=5QqFweh3CC4).\nFurther independent investigations are needed to explore these connections and the 1989 allegations in Illinois, including the Chicago Jewish community’s involvement in rebuilding Kibbutz Nir Oz (https://nypost.com/2023/12/09/news/kibbutz-nir-oz-is-rebuilding-after-the-oct-7-hamas-attack/). While the allegations from 1989 raise significant questions, more evidence is required before drawing conclusions about the credibility of her reporting for The Times of Israel or any other related content.\nThis information may warrant further investigation by journalists and others with the resources to explore these connections.", "media": null, "score": 2, "upvote_ratio": 0.62, "comment_count": 0, "over_18": false}, "7": {"id": "1fo1sge", "locked": true, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "ChivetteH", "link_flair_text": "mod-approved apparel post", "time": 1727492384.6726453, "created_utc": 1727143872.0, "url": "https://i.redd.it/ykyhc4wg1oqd1.jpeg", "title": "Got my new shirt today ", "permalink": "/r/bigfoot/comments/1fo1sge/got_my_new_shirt_today/", "selftext": "", "media": null, "score": 484, "upvote_ratio": 0.76, "comment_count": 50, "over_18": true}, "8": {"id": "1fpnyyb", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "jjjreid", "link_flair_text": null, "time": 1727492385.70381, "created_utc": 1727324631.0, "url": "https://i.redd.it/xbqppwlyy2rd1.jpeg", "title": "Sea serpent", "permalink": "/r/Cryptozoology/comments/1fpnyyb/sea_serpent/", "selftext": "I always wondered what people meant when they described sea monsters as having a horses head… https://amp-9news-com-au.cdn.ampproject.org/v/s/amp.9news.com.au/article/a4f997bd-8729-475f-be4e-a5c759d9ca8a?amp_js_v=0.1&amp_gsa=1#webview=1&cap=swipe", "media": null, "score": 796, "upvote_ratio": 0.96, "comment_count": 56, "over_18": false}, "9": {"id": "1fnwvxa", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Allourep", "link_flair_text": "Humanoid", "time": 1727492386.3378625, "created_utc": 1727129390.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1fnwvxa/red_bluff_ca_late_90s_humanoid_encounter_shared/", "title": "Red Bluff CA late 90's humanoid encounter - shared story", "permalink": "/r/Humanoidencounters/comments/1fnwvxa/red_bluff_ca_late_90s_humanoid_encounter_shared/", "selftext": "I am telling this story second hand on the behalf of the person who experienced it. I was told this story in 2012 and it has always stuck with me. Now that I have recently discovered this subreddit, I wanted to share this encounter with others.\nThe gentleman who imparted this story to me did so after a lengthy evening of enjoying beers at the fire pit in the backyard of his at-the-time Redding CA home. He recounted the time when he was a teenager living in a nearby town called Red Bluff. He had a girlfriend who lived within walking distance of his home and he used to sneak out and head to her house in the middle of the night. He recalled how the road he would walk to her place spanned a rural distance before reaching her neighborhood.\nOn one occasion he was making his way back home early in the morning after visiting his girlfriend. It was still very much nighttime as he was walking along the road. At this particular section, the road passed through the long dark section of rural span only to be momentarily lit by the infrequent passing of car headlights.\nIt was dark and quiet as he walked when he noticed the sound of what must have been footsteps following behind him. He was immediately made uncomfortable. It was not uncommon for drugged derelicts and transients to be wandering at this time of night in this area. These would be characters you would certainly not want anything to do with at this time of night, at this location.\nHe increased his pace yet the footsteps seemed to remain just as assuredly behind him as before. His discomfort began to elevate to panic. Suddenly a car was heading toward him on the desolate road. He knew as the headlights passed, he would have a chance to see who was following him.\nThe moment came and he turned to see what this crackhead wandering in the night might look like but what he saw was nothing of the sort.\n-HUMANOID-\nHe explained to me what he could only describe as what looked like a large Great Dane walking upright on its hind legs. I believe he did say it looked like the creature had a snout. He said the skin looked grey, pale and hairless and it was very skinny to the point where you could see its skeleton underneath. The most memorable detail he kept recalling though was the way in which its rib cage protruded just like that of a Great Dane.\nThe rest of the story is short. What he saw terrified him and he started sprinting and didn't stop until he reached the nearest lit area he could find, which was a random parking lot. He stood there terrified until the sun came up, walked the rest of the way home and never went down that road at night again.", "media": null, "score": 57, "upvote_ratio": 0.97, "comment_count": 13, "over_18": false}, "10": {"id": "1fnrlbo", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Pain_Junkie_", "link_flair_text": null, "time": 1727492387.1836302, "created_utc": 1727116047.0, "url": "https://i.redd.it/62roxmmpqlqd1.jpeg", "title": "What are these?", "permalink": "/r/cryptids/comments/1fnrlbo/what_are_these/", "selftext": "", "media": null, "score": 710, "upvote_ratio": 0.97, "comment_count": 163, "over_18": false}, "11": {"id": "1fmtqbt", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Anxiteyismynormal", "link_flair_text": "HELP! IT'S HERE!", "time": 1727492387.414813, "created_utc": 1727013017.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1fmtqbt/weve_been_coexisting_for_5_years_please_help/", "title": "We’ve been co-existing for 5 years. Please help! ", "permalink": "/r/Thetruthishere/comments/1fmtqbt/weve_been_coexisting_for_5_years_please_help/", "selftext": "We live on the West side of Gerogia, USA. Own 5+ acres and have the only woods for miles. We’ve encountered 3 different types of beings and need help to figure out what they could be? \nWe live on creek/Muskogee land. We also offer food and Tobacco as good will. Only one creature seems menacing, I have no idea what they could be. I’ll describe them below! \n\n\nWe call him the Man of the Woods: we’ve seen him a handful of times, he is as a tall as a tree, with hollowed black eyes and blends in with the Forrest surrounding our home. \n\n\nUnknown: has yellow eyes, no body but when it does, it’s a very large shadow. Stays in the trees and tree lines, only comes out at night. Feels very negative when it’s around. (Nature goes quite including our dogs) \n\n\nDeer child?: first encounter was this morning: stands about 5 feet, on 2 legs, hairy like a deer and has a deer hind at its shoulders. Seems curious, not menacing \n\n", "media": null, "score": 120, "upvote_ratio": 0.86, "comment_count": 61, "over_18": false}, "12": {"id": "1fousj4", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Terrible_Kraken", "link_flair_text": null, "time": 1727492387.7134082, "created_utc": 1727233565.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1fousj4/creepy_guy_at_larp/", "title": "Creepy guy at LARP", "permalink": "/r/LetsNotMeet/comments/1fousj4/creepy_guy_at_larp/", "selftext": "Little backstory before we begin. I’m into LARPing, and for those who don’t know what it is, we basically spend the weekend in the woods dressed as medieval-fantasy characters and interact with each other. I go to these events with my friend and my partner, and we meet some more friends when we’re there.\nThere are all types of people at these events, but 99.9% are absolute angels. I had yet to meet the .1%, but wish I hadn’t. \nBefore the event started, a guy, we’ll call him Greg, swung by my tent while I was setting it up. My partner and friend were setting up the secondary tent up a path, and couldn’t see me. There were 5 other people to my right. I had never met the guy before, but as soon as he said hi, I had a bad feeling. He was around 5’10, obese, a neckbeard, basically what would fit the description of an Incel. \nHe approaches me and asks me if I’m here alone. I say no, I’m here with people, but don’t mention my partner or friend directly. He asks me if I’m a gamer, to which I say yes. From then on, he starts rambling on Ark Survival, which is a game I personally have 3000+ hours on. He tells me blatantly wrong info, misnames the dinos, tells me stuff that’s impossible to do in the game, even with mods, etc. And every time I correct him, I can see he looks to be getting even more annoyed. \nI end the conversation, saying I have to go back to setting up the tent, and he leaves. Fast forward to around 10-11pm, the event has started, which means any mention of the « real world » such as cars, tv, pop culture, etc, is forbidden by a rule called Decorum. We’re playing a campfire game with my friends and my partner, and the guy comes by to sit with us. He sits next to me, I move over. He scoots closer, I move over, he scoots. Eventually I get up and sit next to my friend. As we play the game, he keeps referring to the real world, and to video games, so we tell him either to leave or to make an effort and speak properly. He leaves. \nThe next day, I go up a trail for fake hunting(gathering ressources). As I come back down towards the village, in the middle of the woods with no camps I can hide in, he’s there waiting for me on the trail. He then asks me if I would like to go get a coffee or something sometimes, to which I answer no thanks. \nAs we go down the trail, I tell him I have to collect plants for my potions, so if he can excuse me, I’ll be going back to the village to leave my bow and collect my basket. I am walking fast. He follows me, grabs my arm and tells me « I could come with you… You, me, alone in the woods looking for plants, that looks like the perfect scenario ». I freak out and walk very fast down the trail to the village. \nMy neighbors see me and look very concerned. They ask if I need help, I tell them « in an honesty » which is a code to say take me seriously this isn’t part of the game, that this dude is being extra creepy and following me. \nThey take their weapons(foam weapons) and tell him to fuck off before they carve him a new asshole. I stay with them for a few minutes before chilling with my friends. \nNight comes, we’re having fun, stuff is happening in terms of fighting and encounters. Then at around midnight, I decide to go to the bathroom. At that point I haven’t seen the guy since around 7pm. As I come back from the bathroom, in complete darkness, this guy jumps from a bush and pins me against a tree. \nHe tells me he’s not proud of me, that I’ve been leading him on, that he doesn’t understand why I would hold another guy’s hand and hug three other guys but not him. I tell him I hold my fiancé’s hand and I do hug my friends, but he’s neither. I also tell him to stop his bs « in all honesty », to which he answer « but what if in all honesty I just want a little kiss, huh? Just a little kiss and then you can go ». \nI yell NO, and try to hit him to get away. My friends, who were right on the other side of the bridge separating us, heard me scream. They took their weapons, called upon my neighbors, and around 10 people came careening down the bridge to help. \nThe guy let me go and turned to my rescuers, saying he was just interrogating me for informations concerning the demons(our foes). My friends, who have seen the guy be an asshole before, tell him not to move, that they’re going to get the owner of the LARP to deal with him. He tried to dissuade them, but my neighbors tell him to sit down or he’ll be visiting Death’s Altar before he can move. \nI’m taken away by my fiancé who is very worried and concerned about what happened. The owner comes, I explain what happened, and he takes Greg outside the play to discuss. From what I heard, he was kindly asked not to come back for future events. \nAo Greg, my medieval stalker, let’s not meet again… ", "media": null, "score": 266, "upvote_ratio": 0.96, "comment_count": 28, "over_18": true}, "13": {"id": "1fqmyv7", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "sasbergers", "link_flair_text": null, "time": 1727492387.898314, "created_utc": 1727441482.0, "url": "https://i.redd.it/dd865hxdmcrd1.jpeg", "title": "Overtoun Bridge, in Scotland. Since its construction, first dozens, and then hundreds of dogs have gone to this place to to leap to their deaths.", "permalink": "/r/truecreepy/comments/1fqmyv7/overtoun_bridge_in_scotland_since_its/", "selftext": "", "media": null, "score": 83, "upvote_ratio": 0.91, "comment_count": 4, "over_18": false}, "14": {"id": "1fot3zu", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "astralwannabe1", "link_flair_text": null, "time": 1727492388.103289, "created_utc": 1727228310.0, "url": "https://www.reddit.com/r/threekings/comments/1fot3zu/are_there_any_rituals_for_ets/", "title": "Are there any rituals for ETs?", "permalink": "/r/threekings/comments/1fot3zu/are_there_any_rituals_for_ets/", "selftext": "Hey there everyone 👋\nI'm new to the world of rituals but am definitely interested in asking this question to you lot. \nI've read up some very basic information that there are rituals that involve more of the spiritual/paranormal area of things.\nThe question that I have, are there \"rituals\" if there was anyone interested in seeing if they can make some form of contact with ETs? I fully believe that they exist out there but haven't had any personal experiences yet. \nHave any of you while over the years working with rituals/paranormal have any ET/UFO experiences?\nLooking forward to talk about this topic with some of you. \nThanks!", "media": null, "score": 13, "upvote_ratio": 0.93, "comment_count": 1, "over_18": false}, "15": {"id": "1fmjulu", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "BellPsychological159", "link_flair_text": "Personal Encounter ", "time": 1727492389.9259868, "created_utc": 1726974777.0, "url": "https://v.redd.it/r53uesqn2aqd1", "title": "My Grandmother passed two months prior. A “Happy Grandparents day” balloon floated across 10 isles, made a left turn, and floated to me while working overnight. ❤️", "permalink": "/r/Ghosts/comments/1fmjulu/my_grandmother_passed_two_months_prior_a_happy/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/r53uesqn2aqd1/DASH_1080.mp4?source=fallback", "has_audio": false, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/r53uesqn2aqd1/DASH_96.mp4", "dash_url": "https://v.redd.it/r53uesqn2aqd1/DASHPlaylist.mpd?a=1730084388%2CYmZjNzc0NDdhODQwN2QyNmUyN2I0MzA0MzNjODRiMWRhZWQzZWI2ZDY2NjlkMTRlMmFjNDQzMWY0NTE5NWExMQ%3D%3D&v=1&f=sd", "duration": 17, "hls_url": "https://v.redd.it/r53uesqn2aqd1/HLSPlaylist.m3u8?a=1730084388%2COGQyMTUyYzcyOTE5OWJlOTc0OGY0MjkwOWFhOTcxZTk4MGU1NDJmMGRhMTFhNmI0ZTdiMjA4NWMwYmVmOWFmZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 8972, "upvote_ratio": 0.93, "comment_count": 116, "over_18": false}, "16": {"id": "1fox31y", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "maryjhaneIT", "link_flair_text": "Glitch Vid", "time": 1727492390.1891255, "created_utc": 1727241931.0, "url": "https://v.redd.it/zjaiuqj5tvqd1", "title": "Horses floating down a river", "permalink": "/r/GlitchInTheMatrix/comments/1fox31y/horses_floating_down_a_river/", "selftext": "", "media": null, "score": 728, "upvote_ratio": 0.98, "comment_count": 24, "over_18": false}, "17": {"id": "1fmz7g9", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": null, "time": 1727492392.1085515, "created_utc": 1727027657.0, "url": "https://ovniologia.com.br/2024/09/silencioso-ufo-bumerangue-e-filmado-sobre-o-texas.html", "title": "A man captures an impressive silent boomerang-shaped UFO over Texas.", "permalink": "/r/ufo/comments/1fmz7g9/a_man_captures_an_impressive_silent/", "selftext": "", "media": null, "score": 387, "upvote_ratio": 0.94, "comment_count": 146, "over_18": false}, "18": {"id": "1fq1cvm", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TheGoodTroubleShow", "link_flair_text": "News", "time": 1727492394.252827, "created_utc": 1727370567.0, "url": "https://i.redd.it/p5rtim6gr6rd1.jpeg", "title": "It was Mitch McConnell who blocked the inclusion of the UAP Disclosure Act in the Manager’s Package for the NDAA.\nLet's see what magic Senators Rounds and Schumer can muster to get this through in other ways.", "permalink": "/r/UFOs/comments/1fq1cvm/it_was_mitch_mcconnell_who_blocked_the_inclusion/", "selftext": "", "media": null, "score": 3521, "upvote_ratio": 0.91, "comment_count": 619, "over_18": false}, "19": {"id": "1fpvi41", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "upquarkspin", "link_flair_text": "Question :snoo_thoughtful:", "time": 1727492396.3837514, "created_utc": 1727355339.0, "url": "https://i.redd.it/73ufs9v9i5rd1.jpeg", "title": "Dave Grusch is an American hero, taking risks but no rewards. Is this fair?", "permalink": "/r/aliens/comments/1fpvi41/dave_grusch_is_an_american_hero_taking_risks_but/", "selftext": "Whistleblower's destiny\nThose who take risks with their lives are rarely rewarded as they deserve. Just look at figures like Jeremy Corbell (net worth $7.17M), George Knapp ($5.0M), and David Grusch ($2.0M). Despite pushing boundaries and exposing truths that challenge conventional narratives, whistleblowers financial rewards are pale compared to the risks they've taken. \nReal courage often goes unnoticed in a world that doesn't always compensate for bravery. Stand with Dave.\nhttps://peopleai.com/fame/identities/jeremy-corbell\nhttps://wikibious.com/george-knapp/\nhttps://wikibiography.in/david-grusch-wiki-bio/\n(Via Xitter)", "media": null, "score": 1814, "upvote_ratio": 0.81, "comment_count": 570, "over_18": false}, "20": {"id": "1fqqiod", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "-Falsch-", "link_flair_text": null, "time": 1727492396.8648608, "created_utc": 1727451171.0, "url": "https://www.msn.com/en-us/news/world/canadian-defense-reveals-ufo-shootdown-by-american-f-22-raptor/ar-AA1rhAsk?ocid=msedgdhp&pc=U531&cvid=b969a4c201e444c3f1cc153587a33667&ei=15", "title": "Canadian defense reveals UFO shootdown by American F-22 Raptor", "permalink": "/r/UAP/comments/1fqqiod/canadian_defense_reveals_ufo_shootdown_by/", "selftext": "", "media": null, "score": 56, "upvote_ratio": 0.9, "comment_count": 10, "over_18": false}, "21": {"id": "1fq39as", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Direct-Money-4206", "link_flair_text": null, "time": 1727492398.558549, "created_utc": 1727375285.0, "url": "https://i.redd.it/sdo05y3l57rd1.jpeg", "title": "Ellen DeGeneres wishes diddy aka Mcsnugglestuff happy birthday", "permalink": "/r/conspiracy/comments/1fq39as/ellen_degeneres_wishes_diddy_aka_mcsnugglestuff/", "selftext": "Before that tweet gets deleted. What do you guys think? She mistreated her staff and got exposed by them. Everyone silent now. ", "media": null, "score": 4061, "upvote_ratio": 0.95, "comment_count": 188, "over_18": false}, "22": {"id": "1fok587", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1727492398.766152, "created_utc": 1727203836.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1fok587/three_videos_from_colombia_england_and_usa_clear/", "title": "Three videos from Colombia, England and USA. Clear video footage of a UFO.", "permalink": "/r/conspiracyfact/comments/1fok587/three_videos_from_colombia_england_and_usa_clear/", "selftext": "Interesting UFO video scenes from different places, watch them and tell me what you think.\nThis is one of the most amazing UFO footage, captured by a pilot in the sky Colombia.\nhttps://www.youtube.com/watch?v=sfXF9k9qrQM\nClear video footage of a UFO, filmed in Spain and England at various times.\nhttps://www.youtube.com/watch?v=G7dD6j0gi_U\nScary video footage of a UFO, huge blue and yellow lights in the New York sky.\nhttps://www.youtube.com/watch?v=8hatq4Elz0A", "media": null, "score": 1, "upvote_ratio": 0.55, "comment_count": 0, "over_18": false}, "23": {"id": "1fpstw5", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Hawkeyethegnu", "link_flair_text": null, "time": 1727492399.4150858, "created_utc": 1727345921.0, "url": "https://v.redd.it/p8m6qnxnp4rd1", "title": "Cloaking?", "permalink": "/r/bigfoot/comments/1fpstw5/cloaking/", "selftext": "Taken from Prime - Paranormal Bigfoot - seems authentic.", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/p8m6qnxnp4rd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/p8m6qnxnp4rd1/DASH_96.mp4", "dash_url": "https://v.redd.it/p8m6qnxnp4rd1/DASHPlaylist.mpd?a=1730084398%2COTRmMWUxM2ZjMjU2YTRmNjNlNzRlYjllZGYzMmUzYmU2ODMxZWE3MDQ5OGI4OTVlMWE3NGZkMDg2MTI1NjM1OQ%3D%3D&v=1&f=sd", "duration": 35, "hls_url": "https://v.redd.it/p8m6qnxnp4rd1/HLSPlaylist.m3u8?a=1730084398%2CNGE4YzZmNTI0YzU2ZjM0OTlhY2U3MTU3ZTU1MzIwMDVlZDIzODlmNzJhMzU5MjY2MmZjMzhjMzkyNjU0N2FhMg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 303, "upvote_ratio": 0.85, "comment_count": 145, "over_18": false}, "24": {"id": "1fmydgh", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "TopRevenue2", "link_flair_text": null, "time": 1727492400.1325593, "created_utc": 1727025410.0, "url": "https://www.knoe.com/2024/09/19/rare-bird-believed-be-lost-55-years-is-photographed-first-time-history/", "title": "Rare bird believed to be ‘lost’ for 55 years is photographed for first time in history", "permalink": "/r/Cryptozoology/comments/1fmydgh/rare_bird_believed_to_be_lost_for_55_years_is/", "selftext": "", "media": null, "score": 269, "upvote_ratio": 0.99, "comment_count": 10, "over_18": false}, "25": {"id": "1fmu8qt", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "DeathTurkey-", "link_flair_text": "Unsolved", "time": 1727492400.3577852, "created_utc": 1727014428.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1fmu8qt/i_saw_what_felt_like_the_spirit_that_guards_the/", "title": "I saw what felt like the spirit that guards the land around my house?", "permalink": "/r/Humanoidencounters/comments/1fmu8qt/i_saw_what_felt_like_the_spirit_that_guards_the/", "selftext": "Just a thing that's been on my mind since its happened, at the time of this posting this it has been a while. This happened on August 27th, 2024 in the state of Oklahoma in the US.\n(Was told to add this to a few other threads from my original post, so here we go!)\nSo, some context, I live in a rural area that is currently being made into a big town. New stores, new neighborhoods, the whole nine. Its still in the early days so its all in construction, so my neighborhood still has woodlands on one side and just open land for a few miles on another. Since the first night I've come out here I've always felt like im being watched if im outside. Sometimes its not as direct, as if its acknowledging my presence but I'm not its priority, if that makes sense. But other times it felt I was the only thing it was looking at. Especially at night. And I've done the dumb things as challenging it by walking further out into my tree scattered yard, blocking the moonlight in places. Although some of those times were on purpose, i had to feel comfortable walking into my own backyard. So each time i did, i stayed longer, and further out until i finally got freaked out and went back inside. The entire time i state my intent, wether im just going to retrieve something or simply saying I'm only walking because this is my backyard, but that i mean no disrespect. I even began to say that I respected its presence and i dont mind it staying, but i dont appreciate it trying to make me feel scared in my own home. While i acknowledge this was its home first, my situation was not one of choice of me living here specifically. I made this known every time i felt its presence prioritize me. \nThis has been happening for a while now. But its threatening/protective presence began to fade and it was more of a curiosity. At least it felt that eay to me, i may be misinterpreting it, but the threat and fear presence started to go away. And while it started out happening only at night, i began to feel it around me during the day. When this started happening i started finding feathers on the ground. While yes i live where a lot of birds are, i haven't found any in the time I've been living here until this happened. Each time i was genuinely ecstatic to find one. It started out with just one or two a day, and then increased to about 10 a day. I have a full jar full of feathers now. It was blue jays mostly for a while, and then others started appearing. I literally turned around and an owl feather was floating in the air in front of me. I just stared at it while it landed soflty on the ground. This was my absolute favorite one to find so far. Even trunping the raven and juvenile hawk feather i have. After finding the one owl feather, i found about 5 smaller tuffs of owl feathers the next day. This continued happening for a few months with the bluejay feathers. And as its begun to trun colder, there are less birds. \nOne day, a couple weeks after the owl feathers, i was taking my dogs outside and was just walking through the yard, talking to my dogs, as any slightly sane person does, and i felt its presence again. I smiled, because at this point its become familiar and I enjoy it. Well out of the corner of my eye something moves. While i have always felt its presence, i have never had such a physical reaction as i did when i turned to watch this figure step out behind a tree on the opposite end of the yard than me. I feel the goosebumps form on my arm as if ice had just been brushed across them. Every single hair on my arms, neck, back of my head stood. I stared had trouble understanding what i was seeing for a second. \nAcross the yard stood s figure with furs drapped acreos them, and hide clothes, they had bones and sticks tied in places, and on their head sat a skull with the biggest antlers I've ever seen. They're eyes laid behind the sockets, as if wearing it as a mask. It locked eyes with me, nodded and took a step and disappeared. Two of my dogs were barking st something across the stree while my 3rd, who is very independent and doesn't like to cuddle, watched this thing, and stepped closer to me. So i know i saw it, because my dog acknowledged it. But its still throwing me for a loop.\nEdit:   as I answer or reply to comments I've realized more has happened than i thought. After the night of seeing said entity, i would hear coyotes every time i went outside for about a week straight. But one night definitely stood out. My partner had come home late from work, and we did our usual routine of, make food, and then step out for a smoke and let the dogs out. Well we did this, but this time we kept the dogs on a leash, we normally don't but for some reason we did, I don't remember why now. It was quiet while we walked the dogs, let them do their business, and as usual i felt eyes on me. Now at this point I'm somewhat used to it so i acknowledge it and say I'm just letting my dog go to the bathroom and I'll go back to my porch. But when i said this, the feeling of getting to the porch got urgent. Which hasn't happened in months. This confused me and i tried to shake it off and repeat what i said but then something fell around the trees on the opposite side of the yard. Of course me and my dog looked up and over. Immediately there was this little whisper of a thought that said \"Porch.\" And so we made our way back. More things kept snapping or falling but it didn't feel as dangerous anymore. We waited a bit and it stopped and we finally relaxed. My partner and i stood while we talked, just enjoying the stars when the coyotes started going. Usually they're like a mile away but this sounded just on the other side of the fence. Now i know they weren't right there but that's how loud it was. They've never been this close before. They sounded angry too, like they had something surrounded. I had a sense of worry, but also just in awe at the sounds of nature. I felt bad for whatever poor creature they had, but there was something beautiful about nature still happening as construction takes place around it. \nAfter it got silent there was a bird call, it was far away and I dont have the best hearing so i couldn't tell what it was. But it stuck in the back of my mind as we talked. After a moment it happened again, but this time i could make out the deeper tones in it. A few more moments and i knew it, it was an owl. And at this point i realize it's getting closer. Now I've heard it before, and obviously i have owl feathers, but i never heard when its near. We stopped talking and just listened as it went from tree to tree, closer into our yard until it was on the edge of the closest one. I listened to it for what seemed like forever but it was about 10-15 mins? It just sat there, calling out every now and then. Things began to snap on the other side of the yard and my dog began to growl. I kept her calm but her fur bristled. The owl called out again before diving at something and then taking off. After this we absolutely went inside haha. \nAnother thing I've noticed, like I've stated in a comment, was that since coming here, animals of all kinds seem to find me or be near me when they take their last breaths. It first happened with a snake. My dog found it, didn't touch it. I picked it up seeing it had an injury and went to look at it, it moved a little and then stopped breathing. I teared up and took it to our fire pit as we were going to have a bonfire soon. I wanted to give it a little moment ya know? After this incident, it started happening with spiders, and a lizard, and then recently a moth with a deformed wing. I brought the moth inside, gave it a slice of apple and let it eat off of it and set it on a log with some moss inside. I checked back later and it had passed. This doesn't happen often but often enough I've noticed it. ", "media": null, "score": 35, "upvote_ratio": 0.84, "comment_count": 22, "over_18": false}, "26": {"id": "1foj4hg", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "ArticleNew3737", "link_flair_text": null, "time": 1727492400.99698, "created_utc": 1727201304.0, "url": "https://v.redd.it/sgfdvsd8ssqd1", "title": "What do you guys think of this video? ", "permalink": "/r/cryptids/comments/1foj4hg/what_do_you_guys_think_of_this_video/", "selftext": "Seems to be authentic in my opinion. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/sgfdvsd8ssqd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 886, "scrubber_media_url": "https://v.redd.it/sgfdvsd8ssqd1/DASH_96.mp4", "dash_url": "https://v.redd.it/sgfdvsd8ssqd1/DASHPlaylist.mpd?a=1730084400%2CYTk5ZjNlZjhhYjFhY2IyMmFkMjNkOTg2ZTg1OWMwZDc2OTEzYWJkZTFlMTczNzhkZjQ2YmEyYjhhNjkwNzFmMg%3D%3D&v=1&f=sd", "duration": 21, "hls_url": "https://v.redd.it/sgfdvsd8ssqd1/HLSPlaylist.m3u8?a=1730084400%2CYWQxNmE3YWYwNzY1NzRkM2Q1NzE0N2NiYmFhZTcwMDU1Mjg4ZWYzYTZhNDcxMWY2ZThlMDYwN2U3MTM1ZDcwNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 455, "upvote_ratio": 0.8, "comment_count": 275, "over_18": false}, "27": {"id": "1fmit0n", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "psychopomp000", "link_flair_text": "Discussion/Advice", "time": 1727492401.2615633, "created_utc": 1726971137.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1fmit0n/experience_i_had_a_couple_years_ago/", "title": "Experience I Had a Couple Years Ago", "permalink": "/r/Thetruthishere/comments/1fmit0n/experience_i_had_a_couple_years_ago/", "selftext": "This happened a couple years ago, early 2019 if I remember right. I had a noise machine to help me sleep. I had it going and for some reason felt this intense feeling of dread and terror like nothing I've felt before. I'm talking pit in stomach, heart starts going crazy, adrenaline. I thought at the time I was having sleep paralysis because I've had a few experiences before with sleep paralysis but I could move my body so that rules it out. My eyes were closed tight because I didn't want to risk seeing whatever was making me feel this scared but eventually I gave in and opened my eyes. Right at the foot of my bed there was this torso. No legs, no head, no arms, just torso. Just floating in the air. It kinda sounds funny tbh thinking back on it but I was absolutely terrified. I was calling for my mom but she couldn't hear me over my noise machine. I felt for some reason it was mocking me, like I was trying to call for help but my mom couldn't hear me because of the noise machine and I was just stuck. I couldn't move either out of fear. I still don't think it was sleep paralysis because I could feel the difference between just not being able to move and not being able to move out of fear. My closet was open, very stupidly, and I don't know if this was me just imagining things but I swear I could see this shriveled, creepy face peering out of my clothes at me, this long spindly hand peering out from my clothes as well holding it open a little. Looking up there was some sort of thing looking down at me. I can't remember it for some reason I just know it was watching me. It flickers between being this flat thing against the ceiling and some sort of small humanoid. My mom eventually heard me because at this point I was screaming for her to open the door. As soon as the light hit my room everything just disappeared. I told her what happened and she was concerned but at the same time was like \"Just go back to sleep\". The weird thing was that usually I can chock it up to it being some item or pile of clothes that is shaped like something else and in the dark your mind will play tricks on you and makes it look like something else. But the thing was there was nothing that could've been the torso. It was floating, no poster where it was. Nothing. The closet thing didn't make sense because I could see my clothes moving. The ceiling thing didn't make sense either cause there was nothing on my ceiling besides a fan. It could've been the fan but where the thing was, wasn't near the fan. I've never thought to tell this because I had it out of my mind for a while but I saw this subreddit on a YouTube video and thought I'd talk about it to see what others think.", "media": null, "score": 41, "upvote_ratio": 0.94, "comment_count": 4, "over_18": false}, "28": {"id": "1fouh2h", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Katasia", "link_flair_text": null, "time": 1727492401.4670348, "created_utc": 1727232569.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1fouh2h/the_sounds_next_door/", "title": "The sounds next door", "permalink": "/r/LetsNotMeet/comments/1fouh2h/the_sounds_next_door/", "selftext": "Back in 2013, I lived in Providence, Rhode Island and had moved there for a new job. It was just me living there in a quaint and spacious townhouse with my then, 4 year daughter. We were relatively new to the area and didn’t know many people but did become familiar with the kind older gentleman who lived next door. His name (for the purpose of this story) was Ben. \nWe lived in a connected townhouse with our two units abutting each other. Our street was lined with beautiful floral trees and was quite nice but Providence is weird in that the conditions of the houses and little neighborhoods can vary drastically street by street. We were near a few rough neighborhoods but I felt relatively safe in my new home. \nI remember a few nights prior to this specific night, I saw a Facebook post with a safety tip to put your car keys next to your bedside so if anything ever happens, you can press the alarm and scare an intruder off. I’ve never been overly concerned about my safety and rarely took advantage of any tips I saw on Facebook so I’m not sure how or why I suddenly decided to heed this advice.  \nI was reading a book in bed with my light on in my second floor bedroom hours after putting my daughter to sleep, when I heard a loud sound outside. I peered out the window to take a look and saw nothing. I had taken some melatonin that evening, turned off the light and went to sleep. \nIt was maybe a half hour later or so, when I was suddenly woken up by what felt like almost an earthquake! The room shook and I heard a loud thud. Half awake, I gasped and sat up wondering if it was my imagination or if I actually felt something and immediately ran to my daughter’s room thinking she had fallen off her bed or injured herself or something. As I swung her door wide open, there she was… sleeping soundly and sweetly. I was so confused.\nI heard another loud bang and had this an eerie feeling that something was wrong but I couldn’t figure out what. I grabbed my car key fob and took it downstairs as I nervously inspected the first floor. I swore to myself if I heard one more sound, I would press the alarm just in case but I didn’t… it was silent after that. I returned to bed and took a while to fall asleep again but soon shut my eyes.\nThe next day went on like any other day when I noticed a friend of mine had repeatedly called me in the afternoon. I picked up my daughter from preschool and called the friend back. \n“Did you hear?” He said.\n“No, what?” I answered.\n“News outlets were mobbing your street about an hour ago and the news trucks were even in your driveway!”\nI sat silent, confused. \n“Three men broke into your neighbor’s place last night, tied him up at gunpoint and stole thousands of dollars worth of items, and took off with his car.”\nI immediately fell to my knees and began sobbing. I had HEARD it all happen. I ALMOST pressed the button. I almost but I DIDN’T. \nI sobbed and felt completely unsafe. I asked a friend to come over for the night to stay with us and it wasn’t until the next day I got the chance to speak to Ben.\nBen explained the whole story and told me the cops wanted to talk to me so I could share what I had heard and experienced. He said the men smashed the window in his basement and entered through there (that’s the sound I heard before going to bed). Apparently the timeline suggested that they saw my light and me peering out the window and waited 30 minutes or so until my light was out to enter the premises. They didn’t realize he was home and since he had gone to bed early that night, it was suggested that they cased his place beforehand. He had been asleep when one of them was rummaging through his stuff upstairs in his bedroom which was directly on the other side of my closets through a shared wall. The sounds and shakes I heard and felt were apparently the intruder knocking him down to the ground after realizing Ben was there and cupping his mouth to tell him if he made another sound, he would kill him. This is why I never heard another sound as I was investigating thereafter. After they tied him up, he remained tied up for over 12 hours and eventually broke free before calling the police. \nI cried again and apologized profusely to Ben and explained what I had heard and he simply said that as he was tied up, all he could think about was that he was glad it didn’t happen to me and my little girl.  I really don’t know what I would have done if my daughter and I had to experience that level of trauma firsthand. Ben seemed to be ok considering it all but it took me so long to feel safe again and for the guilt to subside. They never caught the guys and I ended up ordering a taser (which was illegal) and some mace and even for the first time in my life, considered getting a gun but I decided against it.  I have been fortunate to never experience anything close to that again and certainly don’t want to. I’m glad Ben was ultimately ok but next time I’ll listen to my instinct. It’s better to be safe than be sorry.  To the men who tied up and robbed my old neighbor, let’s not meet.", "media": null, "score": 151, "upvote_ratio": 0.99, "comment_count": 7, "over_18": true}, "29": {"id": "1foej32", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Time-Training-9404", "link_flair_text": null, "time": 1727492401.666176, "created_utc": 1727189846.0, "url": "https://i.redd.it/nnh7r8g6urqd1.jpeg", "title": "In 1994, 13-year-old Nicholas Barclay mysteriously vanished in Texas. Three years later, a man claiming to be Nicholas reappeared. He moved back in with his family, who were overjoyed. However, 5 months later, he was exposed as a French conman who was actually 23 years old.", "permalink": "/r/truecreepy/comments/1foej32/in_1994_13yearold_nicholas_barclay_mysteriously/", "selftext": "Despite differences like eye color and accent, Bourdin convinced authorities and Nicholas’s family he was their missing son.\nHe lived with the family for nearly five months, fabricating stories about his changed appearance and trauma.\nArticle about the story: https://historicflix.com/frederic-bourdin-historys-greatest-imposter/", "media": null, "score": 71, "upvote_ratio": 0.97, "comment_count": 2, "over_18": false}, "30": {"id": "1fpx4td", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Smokeless_Joint", "link_flair_text": null, "time": 1727492401.8397465, "created_utc": 1727359860.0, "url": "https://www.reddit.com/r/threekings/comments/1fpx4td/what_does_small_pile_of_rocks_mean/", "title": "What does small pile of rocks mean?", "permalink": "/r/threekings/comments/1fpx4td/what_does_small_pile_of_rocks_mean/", "selftext": "My team is constructing a bank for our clients and throughout the process the workers have found small piles of black rocks. Does this mean anything? Usually it’s on walkways or drive ways and there’s been several piles placed throughout the construction process. We believe it’s placed overnight since we have crews on site from 7am to 7pm. The rocks look like some rocks you’ll find along the lake side.\nI’ve heard about rocks relating to manifestations or fortune but what would this mean? ", "media": null, "score": 9, "upvote_ratio": 0.92, "comment_count": 6, "over_18": false}, "31": {"id": "1fnqxs6", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Kipr2", "link_flair_text": "Caught on Camera 🎥 ", "time": 1727492403.7175145, "created_utc": 1727114438.0, "url": "https://v.redd.it/6d41dv9yllqd1", "title": "Live photo of a deer in front yard, figures rapidly appear behind", "permalink": "/r/Ghosts/comments/1fnqxs6/live_photo_of_a_deer_in_front_yard_figures/", "selftext": "A family member of mine shared this live photo she took of a deer in her and her husband’s front yard. The two of them lived alone in this old southern farmhouse, previously owned by an older gentleman who had passed away in the home. She had complained a few times about walking in the attic. It was not long after this photo that they decided to move out. \nWhat appeared behind her looks to be a man holding a child or one figure standing over another’s shoulder. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/6d41dv9yllqd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1440, "width": 1080, "scrubber_media_url": "https://v.redd.it/6d41dv9yllqd1/DASH_96.mp4", "dash_url": "https://v.redd.it/6d41dv9yllqd1/DASHPlaylist.mpd?a=1730084402%2CN2QyODFmYjQ0Y2FkNTA1MzNiYmU5Njk1ODg2ZWQ1YTdkNTk2ZmU5ZTM2NjVjMWYzNDg5MGJhMjVjNTgxNTQ2Mw%3D%3D&v=1&f=sd", "duration": 9, "hls_url": "https://v.redd.it/6d41dv9yllqd1/HLSPlaylist.m3u8?a=1730084402%2CMDE4MmM1OTliNDc4YmU5NDVmYjIwMDA1NTA3YmIwYjBkZTEwNjBmZTQ5YTEyZDA2MjZkOTY5NmI5ZmU1YTZiZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2012, "upvote_ratio": 0.81, "comment_count": 360, "over_18": false}, "32": {"id": "1fq89ve", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "serpentcvlt", "link_flair_text": "Glitch Pic", "time": 1727492403.986578, "created_utc": 1727388162.0, "url": "https://i.redd.it/0p9sk5hv78rd1.jpeg", "title": "this badly rendered shadow me and my boyfriend saw in the park", "permalink": "/r/GlitchInTheMatrix/comments/1fq89ve/this_badly_rendered_shadow_me_and_my_boyfriend/", "selftext": "", "media": null, "score": 642, "upvote_ratio": 0.95, "comment_count": 33, "over_18": false}, "33": {"id": "1flzhyy", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "hwtthfr", "link_flair_text": "Discussion", "time": 1727492406.0658107, "created_utc": 1726912417.0, "url": "https://www.reddit.com/r/ufo/comments/1flzhyy/my_uncle_told_me_years_ago_that_americans_was/", "title": "My uncle told me years ago that Americans was after something in ocean years ago", "permalink": "/r/ufo/comments/1flzhyy/my_uncle_told_me_years_ago_that_americans_was/", "selftext": "My uncle was destroyer captain in our naval forces for many years, retired in early 2000's he joined many operations in our country waters plus joined many NATO operations/maneuvers/drills thought his career. Visited America, Japan and all NATO countries many times and he got good connection with other country military or civilian captains, he still has many friends.\nHe was telling us stories everything about naval warfare, ships, myths about sea and most intrestin one was about American task force after something in Atlantic ocean, he heard from and talked with many friends from different countries also American captains about this topic, it was about so called American task force combined from navy and air force was trying to recover something from ocean for years but important thing is they lost ships, submarines also fighter jets, helicopters, many sailors. Numbers changing in every story he heard but even American captains was talking about this shit. \nHe believed it was a Nazi treasury and Nazis set up some kind of automated naval mine system that's cause submarine lost but what about ships? Fighter jets? There was lot of different ideas but after i read about that alien outomated drone base/factory/ship what ever fuck it is base in oceans i put pieces togather now. I heard same shit years ago from my uncle.", "media": null, "score": 361, "upvote_ratio": 0.84, "comment_count": 311, "over_18": false}, "34": {"id": "1fmynyu", "locked": true, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Nowritesincehschool", "link_flair_text": "Discussion", "time": 1727492408.7140841, "created_utc": 1727026206.0, "url": "https://www.reddit.com/r/UFOs/comments/1fmynyu/this_jwst_leak_is_why_the_ufo_community_is_mocked/", "title": "This JWST “leak” is why the UFO community is mocked ", "permalink": "/r/UFOs/comments/1fmynyu/this_jwst_leak_is_why_the_ufo_community_is_mocked/", "selftext": "The whole community won’t stop posting about this. There is not a single shred of evidence that anything these people say is true. Not one. Not even a smidge to corroborate a single aspect of their story. \nThe “professor” is not even a professor. The SETI at home project was real but the “code” purportedly found but was unable to be broken? Nothing. Zero press reports from the time about any findings from SETI at home. Zero papers about it, zero headlines. BULL. \nThe JWST “leak”? A small podcast hosts “sources”. Right. Not a single real scientist saying anything. \nCongress emergency briefing? Zero press headlines, zero confirmation from anyone in congress that a meeting was even held. \nThis whole thing just shows how this community can’t be taken seriously. It’s embarrassing. ", "media": null, "score": 3116, "upvote_ratio": 0.87, "comment_count": 393, "over_18": false}, "35": {"id": "1fn5vp8", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Open-Storage8938", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1727492411.7062857, "created_utc": 1727045240.0, "url": "https://i.redd.it/yog8j0f3wfqd1.jpeg", "title": "The gimbal flying saucer looks like the ship from independence day", "permalink": "/r/aliens/comments/1fn5vp8/the_gimbal_flying_saucer_looks_like_the_ship_from/", "selftext": "", "media": null, "score": 1232, "upvote_ratio": 0.94, "comment_count": 94, "over_18": false}, "36": {"id": "1fpl4o4", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": null, "time": 1727492412.41334, "created_utc": 1727315111.0, "url": "https://www.askapol.com/p/rounds-says-negotiations-continue-on-uapda-in-ndaa", "title": "[AskaPol] Sen. Mike Rounds: \"Negotiations continue\" on Chuck Schumer's UAPDA amendment to NDAA", "permalink": "/r/UAP/comments/1fpl4o4/askapol_sen_mike_rounds_negotiations_continue_on/", "selftext": "", "media": null, "score": 55, "upvote_ratio": 0.97, "comment_count": 6, "over_18": false}, "37": {"id": "1fok0oo", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "North902", "link_flair_text": null, "time": 1727492414.8342109, "created_utc": 1727203519.0, "url": "https://i.redd.it/28l1kn5uysqd1.jpeg", "title": "Eventually, the public are going to learn that the world is run on blackmail.", "permalink": "/r/conspiracy/comments/1fok0oo/eventually_the_public_are_going_to_learn_that_the/", "selftext": "Sean 'Diddy' Combs' former bodyguard revealed the disgraced rap mogul kept tapes of politicians taking part in his infamous 'freak off' sessions, and claimed his arrest is tied to an alleged corruption scandal currently gripping New York City politics. \nGene Deal, a former insider who protected Diddy through the 1990s, told The Art of Dialogue podcast that the producer's indictment could expose high-profile officials and celebrities in the Big Apple. \n'This is all bigger than Diddy,' he said, without naming who the alleged tapes are of. - Source", "media": null, "score": 3976, "upvote_ratio": 0.97, "comment_count": 267, "over_18": false}, "38": {"id": "1foiv63", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Vib_ration", "link_flair_text": null, "time": 1727492415.0714707, "created_utc": 1727200671.0, "url": "/r/Spiritualchills/comments/1foip4i/nuclear_physicists_in_asia_discovered_that_what/", "title": "Nuclear physicists in Asia discovered that what people call \"Qi/Prana\" is actually a low-frequency, highly concentrated form of infrared radiation.", "permalink": "/r/conspiracyfact/comments/1foiv63/nuclear_physicists_in_asia_discovered_that_what/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 0, "over_18": false}, "39": {"id": "1fojsl4", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "El_Patrino951", "link_flair_text": "merchandise", "time": 1727492415.77333, "created_utc": 1727202962.0, "url": "https://i.redd.it/9zimrf86xsqd1.jpeg", "title": "Thought you guys would like these bad boys ", "permalink": "/r/bigfoot/comments/1fojsl4/thought_you_guys_would_like_these_bad_boys/", "selftext": "Had to rep Bigfoot on my normal feet ", "media": null, "score": 267, "upvote_ratio": 0.93, "comment_count": 25, "over_18": false}, "40": {"id": "1fp7ql5", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Video ", "time": 1727492416.5027494, "created_utc": 1727279341.0, "url": "https://v.redd.it/v4s1slv98zqd1", "title": "The Steve Piper video, taken in 2000 in the Brindabella Mountain Range of Australia. It supposedly depicts a yowie, the Australian equivalent of bigfoot. Interestingly it seems to have a limp ", "permalink": "/r/Cryptozoology/comments/1fp7ql5/the_steve_piper_video_taken_in_2000_in_the/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/v4s1slv98zqd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/v4s1slv98zqd1/DASH_96.mp4", "dash_url": "https://v.redd.it/v4s1slv98zqd1/DASHPlaylist.mpd?a=1730084415%2COWY4ZmU5NmU5MGJjMjI3OTQ2NDEzYzUyMmE0ZWJjNjU4ODZiYTk3MTA5YTUxZjM1NTc3Y2IyZGFhNGFkMjdlYw%3D%3D&v=1&f=sd", "duration": 20, "hls_url": "https://v.redd.it/v4s1slv98zqd1/HLSPlaylist.m3u8?a=1730084415%2CZWRlNWRmYTJlOTYwODE4MWNmNTA0MDI2MzYyZWFhZGMyNWU2NmE0ZGFjNGM4YmFkOGMyZjA4YTdlZTdkZmM2MQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 200, "upvote_ratio": 0.94, "comment_count": 32, "over_18": false}, "41": {"id": "1fqdr4h", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "bowlcracked", "link_flair_text": "Question", "time": 1727492416.79253, "created_utc": 1727404748.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1fqdr4h/i_am_looking_for_information_on_something/", "title": "I am looking for information on something encountered. ", "permalink": "/r/Humanoidencounters/comments/1fqdr4h/i_am_looking_for_information_on_something/", "selftext": "This happened in Canada, British Columbia, Smithers. I can't exactly remember the year but between 2019-2023. I was walking up to the camper (we lived right beside the woods on the outskirts of town) I glanced to my side, immediately as I locked eyes with it.. dread hit me like a ton of bricks, I screamed, immediately turning away. Something was crouching under the lifted part of the camper. After I turned away I felt something touch my back and barely saw a blur run into the bush. My partner said whatever it was he saw it was roughly thirteen feet tall with gray looking skin. Any ideas on what this thing was?", "media": null, "score": 34, "upvote_ratio": 0.97, "comment_count": 18, "over_18": false}, "42": {"id": "1fp5mam", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "shadowthehh", "link_flair_text": null, "time": 1727492417.9508598, "created_utc": 1727274031.0, "url": "https://i.redd.it/rub03c8isyqd1.png", "title": "PSA", "permalink": "/r/cryptids/comments/1fp5mam/psa/", "selftext": "", "media": null, "score": 383, "upvote_ratio": 0.92, "comment_count": 83, "over_18": false}, "43": {"id": "1fnk814", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Ill-Aside5138", "link_flair_text": null, "time": 1727492418.2191465, "created_utc": 1727097470.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1fnk814/demonic_nightmares/", "title": "demonic nightmares", "permalink": "/r/Thetruthishere/comments/1fnk814/demonic_nightmares/", "selftext": "Lately, I’ve been having some nightmares, and I’m not sure if I should be worried.\nThe first nightmare happened a few months ago. I dreamt that I was looking at myself from above, lying in bed, screaming like a demon to leave me alone and get out of me. Then I woke up in the exact same position I was seeing myself in the nightmare at exactly 3 AM.\nThe second nightmare was two days ago, and it messed with me even more. I dreamt that a family member tried to poison me, and when I looked in the mirror after they did it, I was covered in sores, pale, and had purple lips. At first, they said in the dream they’d never do that, but then they started laughing, this creepy demonic laugh, and their face changed. Out of nowhere, a cross appeared around my neck, and they started laughing and mocking me, saying they had already prepared my coffin. At that moment, I grabbed the cross and held it close to my chest, closed my eyes, and then woke up — again at 3 AM. After I woke up, I heard knocking sounds coming from the wall in my room for about an hour. Since that last dream, I’ve been wearing a necklace with a little cross on it.\nSince then, I’ve had this constant feeling of unease, like something’s not right, and it’s always there, lurking in the back of my mind. Also, every night my dog randomly starts barking in the hallway near my bedroom door, staring at the front door of the house like someone’s there, but there’s no one. Sometimes he comes into my room, starts staring at the mirror or at random spots, barking and growling, and it’s really hard to calm him down.\nCould these nightmares mean something? I keep dreaming about demons and waking up around the same time at night.”", "media": null, "score": 26, "upvote_ratio": 0.88, "comment_count": 10, "over_18": false}, "44": {"id": "1fmbwj0", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Bryssa_Laina24", "link_flair_text": null, "time": 1727492418.4943297, "created_utc": 1726949911.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1fmbwj0/i_had_a_stalker_once_when_i_was_in_community/", "title": "I had a stalker once when I was in community college.", "permalink": "/r/LetsNotMeet/comments/1fmbwj0/i_had_a_stalker_once_when_i_was_in_community/", "selftext": "TLDR: In college, another student began hanging out with me during my class gaps. I thought it was normal at first. He brought small gifts. Then I said some things that might have upset him. he started stalking me, showing up outside my house and at places I posted on my instagram story. I called the police, they couldn't do anything since he hadn't broken any laws. I didn't tell my parents for fear they'd overreact. Eventually, he kind of just went away. I think it's because he gave up but I honestly have no idea what he's doing now.\nThis happened like 6-7 years ago now. Feel free to ask any questions. Your questions might help me jog my memory and I'll remember more details.\nI played soccer for one year in community college after high school. I knew this guy because he worked for the athletics department. He was another student.\nTuesdays and Thursdays, I had a one-hour gap between classes. This guy noticed me in the library, asked what I was doing there, I told him I had an hour-long gap, and he started coming regularly to hang out.\nI didn't mind because he seemed like a normal guy. He wasn't waiting for anything but he just wanted to hang out. He brought me little gifts a few times, like chocolate and stuff. He was being a little too sweet for someone I barely knew. I didn't think about red flags.\nWith the gifts, I remember he always downplayed it. He'd be like \"they had extra kitkat bars today in the office. do you want some?\" He never said that he purposely bought kitkat for me. I know a lot more about boys now than I knew back then. I think he knew that that buying me gifts would be too much, but he still wanted to do it without doing it.\nThe soccer season for us ended before Thanksgiving. The only teams that kept playing after that were going to the playoffs (not us). After thanksgiving, we had finals.\nIn that brief period after the soccer season and before thanksgiving, he asked me about my classes for second semester. Tbh I hadn't been super organized with course registration and I honestly didn't know (also the counselors were completely clueless). I didn't tell him that but I remember saying I didn't want to have another gap hour like this because it wasted so much time. I don't think he was happy to hear that.\nHe also asked if I would play another season and I said no to that. I needed to manage my time better and playing soccer everyday was not helping. I think my mistake was that I just said too much and unfiltered. I used to do that a lot back then, saying too much without thinking about how it can affect other people's feelings.\nThat was on the last thursday before thanksgiving. So no more hour-gaps to hang out anymore. We had thanksgiving break, we took finals, and we had winter break. Everything was great.\nWinter break was when the real problems started. In the mornings, this guy literally showed up outside my house while sitting in his car. The first time I didn't believe it was actually him. The second time, I checked and it was. By then, it was really clear that we both knew what was going on. He was stalking me.\nAnd that wasn't all.\nI posted on my instagram story sometimes about places I was. This guy literally showed up there several times, like girly stores at the mall where he had zero business being. He did lots of things like that. He also started pointing his phone at me like he was taking pictures. That was even weirder.\nI basically stopped using social media over this.\nAfter winter break this continued. When my parents were at work, this guy came during the afternoon too. I called the cops a few times. They went and tried to talk to him, he basically told them he wasn't going to talk, and that was it. I think the cops wanted to help but they could never do anything about it because he was careful not to break the law, like he didn't trespass, he didn't make threats, he didn't show weapons, etc.\nI have no idea what he's doing now. My guess is that he gave up. Maybe his little obsession kind of became old and he found other things to pay more attention to. At least I hope so. But if he still comes by, I have no idea.\nI think the most challenging thing is that I couldn't tell my parents since I knew they would completely freak out.", "media": null, "score": 132, "upvote_ratio": 0.97, "comment_count": 17, "over_18": true}, "45": {"id": "1fmzrfl", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Time-Training-9404", "link_flair_text": null, "time": 1727492418.7635283, "created_utc": 1727029086.0, "url": "https://historicflix.com/the-haiku-stairs-mystery-what-happened-to-daylenn-pua/", "title": "In 2015, Daylenn Pua disappeared while hiking the Haiku Stairs, also known as the \"Stairway to Heaven.\" One of his last photographs appears to show a man in the far background. The mystery of what happened to him remains unsolved to this day.", "permalink": "/r/truecreepy/comments/1fmzrfl/in_2015_daylenn_pua_disappeared_while_hiking_the/", "selftext": "", "media": null, "score": 8, "upvote_ratio": 0.63, "comment_count": 0, "over_18": false}, "46": {"id": "1fmg3ao", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Thelightwithin1111", "link_flair_text": null, "time": 1727492420.7296863, "created_utc": 1726962124.0, "url": "https://v.redd.it/8pey38c119qd1", "title": "Interesting thing on baby monitor screen? ", "permalink": "/r/Ghosts/comments/1fmg3ao/interesting_thing_on_baby_monitor_screen/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/8pey38c119qd1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 640, "width": 360, "scrubber_media_url": "https://v.redd.it/8pey38c119qd1/DASH_96.mp4", "dash_url": "https://v.redd.it/8pey38c119qd1/DASHPlaylist.mpd?a=1730084419%2CYTFlYjI0MmJmMDEyNjM0ZmFjMjQ2OTgwMzA5Yjg5YWE5YTllYTNkZTliYWVmYjJlMmRmOWEzZjNmYjMxZTdkMA%3D%3D&v=1&f=sd", "duration": 22, "hls_url": "https://v.redd.it/8pey38c119qd1/HLSPlaylist.m3u8?a=1730084419%2CMWE2ZjM5NTAzMWRiN2MyN2RmOTg5NWFkYTQyZDE5N2UxNTNkM2VkMDIzYmNkNjg0NDg4ZDJlYTlmODU5MDc5Nw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 748, "upvote_ratio": 0.86, "comment_count": 136, "over_18": false}, "47": {"id": "1fouqnc", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "howcanibehuman", "link_flair_text": "Glitch Vid", "time": 1727492420.972363, "created_utc": 1727233397.0, "url": "https://v.redd.it/2i3iv3cmfvqd1", "title": "Leaf glitch idk what this leaf kept flying like it was probing ", "permalink": "/r/GlitchInTheMatrix/comments/1fouqnc/leaf_glitch_idk_what_this_leaf_kept_flying_like/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/2i3iv3cmfvqd1/DASH_1080.mp4?source=fallback", "has_audio": false, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/2i3iv3cmfvqd1/DASH_96.mp4", "dash_url": "https://v.redd.it/2i3iv3cmfvqd1/DASHPlaylist.mpd?a=1730084420%2CZTUzMzY1OTk4Yjk1ZDlhOTk3NzVkOGQ5MzdhNzA1YjkzMDgwYjZhOThmNTU2MGU1YTM4OTQ0YWYwODg0OGEwMw%3D%3D&v=1&f=sd", "duration": 173, "hls_url": "https://v.redd.it/2i3iv3cmfvqd1/HLSPlaylist.m3u8?a=1730084420%2CNTRhOWE3ZGMwYjAzMzJhM2U2NTk2YjcxOGU4ZGRlZDUzZDgwZTVkZWNhMGZkNGMxMzRhMjFlNTI5ZDYzYjMxMA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 139, "upvote_ratio": 0.82, "comment_count": 45, "over_18": false}, "48": {"id": "1fq1emq", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "blackvault", "link_flair_text": "Black Vault", "time": 1727492423.7947617, "created_utc": 1727370688.0, "url": "https://x.com/blackvaultcom/status/1839351844646064183", "title": "Rear Admiral Timothy Gallaudet had more than 2,000 pages of UAP related emails in his NOAA email box? According to NOAA - Yes.", "permalink": "/r/ufo/comments/1fq1emq/rear_admiral_timothy_gallaudet_had_more_than_2000/", "selftext": "", "media": null, "score": 281, "upvote_ratio": 0.98, "comment_count": 19, "over_18": false}, "49": {"id": "1fmhb1q", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "yuckobucko", "link_flair_text": "Sighting", "time": 1727492427.0100226, "created_utc": 1726966015.0, "url": "https://i.redd.it/lnyfb88mc9qd1.jpeg", "title": "Massive rectangular object spotted over Burbank, CA. Sep 19th, 11:25pm. Video in comments ", "permalink": "/r/UFOs/comments/1fmhb1q/massive_rectangular_object_spotted_over_burbank/", "selftext": "", "media": null, "score": 3103, "upvote_ratio": 0.92, "comment_count": 508, "over_18": false}, "50": {"id": "1fnjt6f", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "upquarkspin", "link_flair_text": "News :illuminati:", "time": 1727492429.392273, "created_utc": 1727096329.0, "url": "https://i.redd.it/mcpwn8p34kqd1.jpeg", "title": "Cosmic Cover-Up? NASA Silent as Cambridge Professor Uncovers Potential Alien Life on Distant Exoplanet", "permalink": "/r/aliens/comments/1fnjt6f/cosmic_coverup_nasa_silent_as_cambridge_professor/", "selftext": "In a potentially groundbreaking development, Professor Nikku Madhusudhan of Cambridge University may have uncovered evidence of extraterrestrial life on exoplanet K2-18b. This discovery, if confirmed, could reshape our understanding of our place in the universe.\nThe James Webb Space Telescope has detected dimethyl sulfide (DMS) in K2-18b's atmosphere - a compound exclusively produced by biological processes on Earth. This finding has sent shockwaves through the scientific community, with some researchers speculating that we may be on the brink of confirming alien life.\nInterestingly, NASA has remained unusually tight-lipped about these findings. This silence has fueled speculation among some observers that the agency may be withholding information from the public. Are they verifying the data, or is there more to this story than meets the eye?\nProfessor Madhusudhan, visibly affected by the gravity of the potential discovery, described sleepless nights as the evidence mounted. \"If this is when it's finally going to come through, it's a momentous occasion,\" he stated, hinting at the profound implications of the find.\nAs the scientific community eagerly awaits further confirmation, questions linger. Why the delay in official announcements? What might be the consequences of confirming extraterrestrial life? And perhaps most intriguingly, if life exists on K2-18b, how advanced might it be?\nThis potential discovery not only challenges our perception of life in the universe but also raises questions about the transparency of space agencies and the potential impact of such knowledge on global affairs. As we stand on the precipice of what could be the most significant scientific discovery in human history, one can't help but wonder: what other secrets might the cosmos be hiding from us?​​​​​​​​​​​​​​​​\nhttps://www.joe.co.uk/news/cambridge-scientist-discovers-signs-of-alien-life-435085", "media": null, "score": 979, "upvote_ratio": 0.94, "comment_count": 154, "over_18": false}, "51": {"id": "1fmdr4s", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": null, "time": 1727492430.08937, "created_utc": 1726955120.0, "url": "https://i.redd.it/i6pjwn46d8qd1.png", "title": "Paradigm-Changing UFO Transparency Legislation Fails In Congress For Second Consecutive Year", "permalink": "/r/UAP/comments/1fmdr4s/paradigmchanging_ufo_transparency_legislation/", "selftext": "", "media": null, "score": 47, "upvote_ratio": 0.91, "comment_count": 1, "over_18": false}, "52": {"id": "1fpavca", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "thehatstore42069", "link_flair_text": null, "time": 1727492431.8574696, "created_utc": 1727287080.0, "url": "https://i.redd.it/4vehjvyavzqd1.jpeg", "title": "Anyone ever figure this one out?", "permalink": "/r/conspiracy/comments/1fpavca/anyone_ever_figure_this_one_out/", "selftext": "Saved from many years ago on here but idk if I ever figured out what it was. If memory serves correctly it was something with Maria ambramovic", "media": null, "score": 3847, "upvote_ratio": 0.79, "comment_count": 711, "over_18": false}, "53": {"id": "1fmylrl", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "graystone777", "link_flair_text": "crosspost", "time": 1727492432.7964685, "created_utc": 1727026040.0, "url": "https://i.redd.it/idip5rykodqd1.jpeg", "title": "FOR Sasquatch SCALE: The tallest man to ever live, Robert Wadlow, poses with his family in 1935. Robert reached an astonishing height of 8'11\" and reached the weight of 439 pounds before his death at age 22.", "permalink": "/r/bigfoot/comments/1fmylrl/for_sasquatch_scale_the_tallest_man_to_ever_live/", "selftext": "", "media": null, "score": 201, "upvote_ratio": 0.97, "comment_count": 53, "over_18": false}, "54": {"id": "1fqafe2", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "TaddyMason199", "link_flair_text": null, "time": 1727492433.7562675, "created_utc": 1727394270.0, "url": "https://www.reddit.com/gallery/1fqafe2", "title": "Going 7 hours into the jungle to look for a Yowie (Bigfoot)", "permalink": "/r/Cryptozoology/comments/1fqafe2/going_7_hours_into_the_jungle_to_look_for_a_yowie/", "selftext": "So until recently I’ve never looked into Bigfoot but have always been interested in the nephilim so it’s not a stretch to look into this but not long ago my boss and I were talking about giants/ mythological creatures/ cryptids just passing the time at work. He reluctantly told me I saw something once when I was younger. Said he and a group of friends in the 80s illegally hiked up to mountain plateau through private property. A place called “the lost world”. Said as they reached the top they were rushing to set up camp because a storm was coming in. He said as he turned to the cliff area a flash of lightning lit up the area and he saw a 7+ft hairy humanoid looking at them, turn and walk off. He said he spoke to his friends afterwards who apparently had seen two other flashes light the area up and they’d seen this thing longer than my boss. A few days later I’d asked him where it was and he told me. I looked up “yowies the lost world” and found his story word for word. Turns out it was one of the other guys there that night who did this interview 10 years ago and my boss hadn’t spoken to him for over 20 years. \nAnyway, an old army buddy of mine and I are trekking 7 hours into the forest over steep razor edged cliffs to this location which is supposed to house flora and fauna not found anywhere else. \nShould make for an interesting story regardless of if we see anything. ", "media": null, "score": 152, "upvote_ratio": 0.93, "comment_count": 46, "over_18": false}, "55": {"id": "1fm76ry", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "CivilSoup1643", "link_flair_text": "Multi-Dimensional Entity", "time": 1727492433.969072, "created_utc": 1726936981.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1fm76ry/have_you_encountered_a_blue_translucent/", "title": "Have you encountered a blue translucent shapeshifter?", "permalink": "/r/Humanoidencounters/comments/1fm76ry/have_you_encountered_a_blue_translucent/", "selftext": "Gonna try to keep this short. \nSome years ago I was in my studio apartment in Miami, FL (maybe 2015 - 16ish) and I was trying to sleep because i had work the next day. I wasn't tired, more so just forcing myself. When i was kid i would sleep with covers over my head for comfort but as an adult i've kind of stopped this. Anyway this particular night i had the covers over my head for 15 mins to try to sleep but was still wide awake. After about 15 mins, i had this feeling like something was behind me. It wasn't physical, it was a mental intuition. I take the cover off, turn my head and boom! Maybe like 6 inches away from my face, this blueish translucent figure is creeping over me, its head near my head. It has 6 white eyes no pupils, and head shape was not normal, I cant remember what is was though. After about 1.5 sec of me staring at it in a WTF stare it shapeshifts into - me?! or what i think looked like me but bald and still blueish transparent. I told my girlfriend the other day it looked like the silver surfer. I get up, as soon as i start movement this thing shifts toward my hallway, so i start running after it, it looks behind it while it runs and boom! The figure vanishes or disperses through the door! I had never seen anything like it and after that experience, something weird did happen that was similar but not like that.\nKeep in mind i was not scared at all, but i was intrigued and wanted to know why it was here and i've never seen anything like this or believe in ghosts. I do believe aliens or entities that defy laws of the universe exist, and ive always been fascinated with space, ufo, aliens, disbanded military projects, etc. as a kid and would read a ton of books about it. Also want to say i was fully awake and I KNOW WHAT I SAW, shit was mad weird. I even turned the lights on and had a damn 10 min convo with myself. I was literally saying, \"just remember, you weren't asleep, you weren't tired, and fully awake, never forget, you saw what you actually saw, this was fucking real as it gets\" \nI've only told my girlfirend and the other day i tell my mom for the first time cause i think other people would think i'm crazy. She tells me her story of when she was 5, she saw a man made of static, tv snow. I have no choice but to believe her cause of my experience. I don't really believe in ghosts, however i believe that if the universe is so big, that it would be akin to being just a part of an atom thats part of some mass(Think \"Antman - Quantumania\"), then it would be foolish to think we are the only intelligent life.\nAnyways, anyone ever see something like this?", "media": null, "score": 27, "upvote_ratio": 0.85, "comment_count": 10, "over_18": false}, "56": {"id": "1fpjkaa", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Little-South-Paw", "link_flair_text": null, "time": 1727492434.7276943, "created_utc": 1727310233.0, "url": "https://i.redd.it/928mu3y4s1rd1.jpeg", "title": "The picture of the Fresno Nighcrawlers in Jeans was asked for a bit ago", "permalink": "/r/cryptids/comments/1fpjkaa/the_picture_of_the_fresno_nighcrawlers_in_jeans/", "selftext": "My sister painted this for me when she got bit by the creative bug. ", "media": null, "score": 352, "upvote_ratio": 0.98, "comment_count": 23, "over_18": false}, "57": {"id": "1fr20lo", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "UncommonWasp", "link_flair_text": "Aliens/UFOs", "time": 1727492434.961323, "created_utc": 1727482486.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1fr20lo/please_help_me_find_my_friends/", "title": "Please help me find my friends", "permalink": "/r/Thetruthishere/comments/1fr20lo/please_help_me_find_my_friends/", "selftext": "Let’s start with the words I’m going to use and me defining them so you all won’t get confused. What I am talking about is something like a dream but isn’t, I call it Travel summoning or Ascension. Others think this might be astral projection. I do still have dreams, I’m aware of dreams and can control them. That isn’t this.\nWhy am I posting this?: To get answers and to hopefully find the other people I’ve met in this situation.\nBackground/Further explanation before we get into everything: I’ve been having these ‘dreams’ in which they aren’t really dreams. I call it Travel Summoning or Accession. Others think it may be astra projection, but I don’t know much about it so I can’t really say at the moment. Before the events and traveling actually happen, I black out. Usually when I have actual dreams, I’ll feel tired and I’ll settle into bed, turning off lights, plug my phone in, set an alarm, lay down and close my eyes then diff off to sleep. With traveling however I have no recollection of ever falling asleep or even getting ready to fall asleep or feeling tired. It’s one second I’m watching something or doing something then boom I’m traveling.\nThe first travel: This has been happening for a long time, but I was a child when it first started to happen. I would suddenly be in what looked like a hospital or research facility. Because I’ve been there so many times, I know it like the back of my hand. I won’t give too much detail about the place however in hopes others who have been there can PM me and describe it to me so I can see if we really went to the same place. But when I first went it was like a doctors visit. They were super nice at first. They would explain everything they were going to do. They introduced themselves (they later said they used fake names in order to protect themselves) and explained that I was very special and that I was selected to be part of a program. It was to see if I had anything else special about me. There was other kids too. A lot of kids. We would have to do certain things, like tests. If the kids failed it they didn’t come back. I don’t think they killed them, I think that they just didn’t summon them anymore and the kids, now adults, probably think it was just some weird dream.\nThe tests: the tests are something I’ve had to do over and over. Even as I grew I had to do different ones and such. They started out as basic. Math tests, spelling tests, history tests, morality tests, gym tests, science tests. Stuff like that. We wouldn’t have classes on these subjects, but the classes we did have we did touch on the subjects here and there. The tests would then start to get weirder. They would do tests on us based on precognition/clairvoyance/telekinesis/ other stuff like that. There was more tests on different abilities, but I didn’t score high on those ones so my specific training wasn’t on those.\nEducation: We had classes of sorts to educate us and to prepare us for tests. The classes were on different abilities and such to see what child had the abilities. We had to do classes on so many abilities, because they said sometimes it takes a few times for it to be awakened. Along with these classes we of course would touch on mundane topics too like history, math, science. Mainly science as the workers were scientists and doctors.\nWorkers/Doctors: there was a bunch of adults that worked at the facility. Like I said they used fake names, wouldn’t tell anyone where they are from or their age. I could only get basic information out of them such as have they been to New York, if they like cheeseburgers, what their favorite color was, basic stuff like that. If I asked more about the training/Education/tests they would just fill me in about what they could. If I asked something they couldn’t tell me it was classified or I would learn later on when I’m bigger. I gave up quickly about trying to get to know them personally, instead I would just talk to them about things that interested me like history and stuff. They gave me some information about things in the past and the truth about some things. Such as the organization has been going on for a while now, but not too old. I think they said they are younger than the cola company?\nBetrayal: Sadly things didn’t go as smoothly as we got older. The other kids, now adults, and I that have stayed in the program are now in our 20’s and we were told we had something big to work on. It was our first assignment. We were brought into a room where there was an object. They turned it on and explained to us that we needed to go threw it. That it was a portal. Our assignment was to explore the dimension. We denied. We were arguing with them, yelling at them. We were sobbing and crying saying no, that that’s crazy. They pushed one of us in, another went after them. Some of us hesitated on going after them, but eventually we were all forced into the portal as they soon brought out weapons, giving us an ultimatum. (They later said they wouldn’t actually have killed us, that we are too high of value to kill us, they just wanted to scare us). I’m getting emotionally distressed as I type this, and I can’t continue much longer as that first dimensional trip was traumatizing. We were lost on what seemed like a new planet. We could breathe just fine, gravity was similar. We were stranded in this dimension for almost a year. We lost someone there. We were injured. But eventually we got back. Now we have been doing this for a while. Traveling to different dimensions, more training.\nI have to stop here. I know I left a lot of information out, but it’s emotionally draining and I don’t want to give everything away in hopes to find someone who has gone through this. I’ll answer any questions you have in the comments.", "media": null, "score": 7, "upvote_ratio": 0.89, "comment_count": 5, "over_18": false}, "58": {"id": "1fpq3d5", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Practical-Try9582", "link_flair_text": null, "time": 1727492435.1798859, "created_utc": 1727333406.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1fpq3d5/overnight_security_guard/", "title": "Overnight security guard", "permalink": "/r/LetsNotMeet/comments/1fpq3d5/overnight_security_guard/", "selftext": "This happened a few weeks ago, but still sticks with me and makes me double check all the locks. \nSeptember/2/2024 I was working an overnight security gig, I’ve been a guard for 15 years and other than getting into brawls at nightclubs (happens more often than you think!) I’ve had a pretty easy career, minus some contractor shit I did in Central America. \nThe night started the same way they always do, I had gotten off my first gig, and went to relieve the normal night guard Who we will refer to as D, from here on out. \nI arrive, and D looks frazzled, he’s an old martial arts guy that works the apartment job for the same reason I do, half off the rent. \nI walk in and ask him what’s up, he says he encountered a guy by the gate that quote “gave him the heebie fucking geebies” he asked if I would go back to my apartment and grab my carry firearm, I hesitantly agreed because having worked in this industry long enough, guns rarely lead to good outcomes, but D is scared green; so I agree. \nI go back and grab not only the gun, but my dog, a 120lb Anatolian Shepard, I suit her up in her harness and grab her QD muzzle on the off chance that something does go down, I’d rather have the dog ready to go. \nI arrive, and D is elated to get the fuck out of dodge, gives the dog her standard good girl chicken strip (this is a nightly ritual regardless if I okay it or not) and takes off back to his apartment, I attach the dogs lead to my waist, and we go on patrol. \nI live in Texas, and our apartments are sealed by gates that you have to have the code for, I go to check the first gate, and immediately come into contact with the person D was so worried about. \nIt’s 93 degrees out, but this dude is wearing a fucking trench coat with a hood, before we even get near him, the dog starts going ballistic, hackles up in between my legs snarling like some sort of feral monstrosity. \nI give her the command to chill, and she does, but what bothers me is the dude doesn’t even flinch, most people see a dog that big barking and snarling, and insist upon being no part of whatever it is the dog is protecting, in this case me. \nAt this point I step forward and initiate contact. \n“Hey buddy, how we doing? You alright?” \nThe man turns to face me, and at this point I see he’s horribly disfigured, one eye missing but sealed up from surgery, the other a brilliant blue, and horrible scarring on the side of the face missing the eye. \n“Yes, I am fine.”  He responds rather quietly, sort of in the way a child who’s trying to fix something on their own might respond. \n“So do you live here? Haven’t seen you around, my name is H, you new in town or?” \n“Has anybody ever told you, that you have incredible eyes?” \nThis simple statement made my blood run ice cold, at this point I tap the QD on the muzzle and it swings out of the way. \n“I’d like to think my mother used to tell me that; but can’t say it’s something I hear often? Listen man, you gotta get moving, if you don’t live here I can’t have you standing out here” \nAt this point he sort of goes rigid, and reaches in his pocket, I don’t give him the chance to do much more as I draw my weapon at this point. \n“Hey man, look you gotta leave I’m not telling you again, I don’t know where the fuck you’re from, but I know it ain’t from around here, last chance, fuck off.” \nAt this point, he sort of slowly removes his hand from his pocket, and he’s holding this little 35mm disposable, he lifts it, snaps a photo, then says. \n“Have a good evening, your eyes are beautiful.” \nAnd then off he goes. \nAbout five minutes later I’m still shaking when the cops arrive, turns out one of the apartments close to the gate heard the dog going nuts and heard me raise my voice to our oddball friend, and called. \nThey tell me they’ll up patrols, and that they hadn’t gotten any other calls about the dude. \nWeird guy with the trench coat standing by my gate…. Let’s not meet…. Ever again. ", "media": null, "score": 92, "upvote_ratio": 0.99, "comment_count": 13, "over_18": true}, "59": {"id": "1fne7e0", "locked": true, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "blooodpunch", "link_flair_text": null, "time": 1727492437.4239802, "created_utc": 1727073610.0, "url": "https://i.redd.it/xpewrksj8iqd1.jpeg", "title": "Some sort of anomaly flowing out of my cats head.", "permalink": "/r/Ghosts/comments/1fne7e0/some_sort_of_anomaly_flowing_out_of_my_cats_head/", "selftext": "I took a photo of my cat and it came out like this. Any explanations? ", "media": null, "score": 702, "upvote_ratio": 0.9, "comment_count": 142, "over_18": false}, "60": {"id": "1fnhpu7", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Dovacraft88", "link_flair_text": "Glitch Pic", "time": 1727492437.686167, "created_utc": 1727089369.0, "url": "https://i.redd.it/bvffyinejjqd1.png", "title": "Got a coke zero, for £0, and the order number was 000", "permalink": "/r/GlitchInTheMatrix/comments/1fnhpu7/got_a_coke_zero_for_0_and_the_order_number_was_000/", "selftext": "", "media": null, "score": 83, "upvote_ratio": 0.82, "comment_count": 8, "over_18": false}, "61": {"id": "1fp7o2b", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "somesortsofwhale", "link_flair_text": "Discussion", "time": 1727492439.4366891, "created_utc": 1727279159.0, "url": "https://www.reddit.com/r/ufo/comments/1fp7o2b/we_deserve_full_disclosure_not_a_fucking_edge_fest/", "title": "We deserve full disclosure, not a fucking edge fest. ", "permalink": "/r/ufo/comments/1fp7o2b/we_deserve_full_disclosure_not_a_fucking_edge_fest/", "selftext": "Why can't we just fucking know what's going on? Why all this whistle blower edging? \nI mean, if there's a risk of an event where millions will die, why are we just sitting around accepting these little droplets from these grifters?  \nI'm sick and tired, we deserve to know what's going on. I feel like we're all being played with. ", "media": null, "score": 265, "upvote_ratio": 0.88, "comment_count": 196, "over_18": false}, "62": {"id": "1fph3ug", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "PyroIsSpai", "link_flair_text": "News", "time": 1727492441.4907773, "created_utc": 1727303121.0, "url": "https://www.liberationtimes.com/home/paradigm-changing-ufo-transparency-legislation-fails-in-congress-for-second-consecutive-year", "title": "Liberation Times revises 4-day article to include stunning details with high specifity about a UFO/USO recovery program of the United States government; states on Twitter he is now in danger.", "permalink": "/r/UFOs/comments/1fph3ug/liberation_times_revises_4day_article_to_include/", "selftext": "", "media": null, "score": 2818, "upvote_ratio": 0.91, "comment_count": 443, "over_18": false}, "63": {"id": "1fojpms", "locked": false, "subreddit": "aliens", "stickied": true, "category": "Aliens", "author": "Crafty_Train1956", "link_flair_text": "Image 📷", "time": 1727492443.2797575, "created_utc": 1727202767.0, "url": "https://www.ctvnews.ca/canada/image-released-of-mysterious-object-shot-down-over-yukon-in-2023-1.7049241", "title": "Image released of mysterious object shot down over Yukon in 2023", "permalink": "/r/aliens/comments/1fojpms/image_released_of_mysterious_object_shot_down/", "selftext": "", "media": null, "score": 856, "upvote_ratio": 0.98, "comment_count": 134, "over_18": false}, "64": {"id": "1fq3qgn", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "wandering_conscious3", "link_flair_text": null, "time": 1727492443.9075696, "created_utc": 1727376500.0, "url": "https://www.reddit.com/gallery/1fq3qgn", "title": "Yukon UAP landing spot?", "permalink": "/r/UAP/comments/1fq3qgn/yukon_uap_landing_spot/", "selftext": "Saw pictures of the UAP shot down over canada last year and thought it was interesting. Recently I was just scanning through google earth for fun and came across what I think fits a landing spot for that UAP. Just curious what others think. I’ve attached a photo of the UAP, A photo of the area it was shot down over (Yukon) and a green dot for the second location. The last picture is the spot in question. \nCoordinates: \n60°39’31.40”N \n150°03’56.70”W", "media": null, "score": 50, "upvote_ratio": 0.82, "comment_count": 18, "over_18": false}, "65": {"id": "1fnqd2y", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "astralrocker2001", "link_flair_text": null, "time": 1727492445.6081219, "created_utc": 1727113033.0, "url": "https://i.redd.it/p7uzltirhlqd1.jpeg", "title": "Murder of a Real HERO: Never forget what they did to Pat Tillman", "permalink": "/r/conspiracy/comments/1fnqd2y/murder_of_a_real_hero_never_forget_what_they_did/", "selftext": "", "media": null, "score": 3764, "upvote_ratio": 0.94, "comment_count": 137, "over_18": false}, "66": {"id": "1flxlxv", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "lore", "time": 1727492446.5994818, "created_utc": 1726903834.0, "url": "https://i.redd.it/mx4utezp74qd1.jpeg", "title": "Neat fact(?), the creepy forest and house seen in the original Blair Witch film was also home to a couple of bigfoot sightings in the 90s according to the research group \"Center Force\"", "permalink": "/r/bigfoot/comments/1flxlxv/neat_fact_the_creepy_forest_and_house_seen_in_the/", "selftext": "", "media": null, "score": 155, "upvote_ratio": 0.98, "comment_count": 9, "over_18": false}, "67": {"id": "1fp1zyk", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Familiar_Ad_4885", "link_flair_text": "Discussion ", "time": 1727492447.3355286, "created_utc": 1727263298.0, "url": "https://www.reddit.com/r/Cryptozoology/comments/1fp1zyk/have_any_cryptid_animals_in_the_last_100_years/", "title": "Have any cryptid animals in the last 100 years proven to be real?", "permalink": "/r/Cryptozoology/comments/1fp1zyk/have_any_cryptid_animals_in_the_last_100_years/", "selftext": "Except for deep sea animals that never venture to the surface with the exception of the giant squid, has there been any mythical animals that were real?", "media": null, "score": 145, "upvote_ratio": 0.93, "comment_count": 179, "over_18": false}, "68": {"id": "1fr22dy", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "UncommonWasp", "link_flair_text": "Abduction Event", "time": 1727492447.5515637, "created_utc": 1727482639.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1fr22dy/please_help_me_find_my_friends/", "title": "Please help me find my friends", "permalink": "/r/Humanoidencounters/comments/1fr22dy/please_help_me_find_my_friends/", "selftext": "Let’s start with the words I’m going to use and me defining them so you all won’t get confused. What I am talking about is something like a dream but isn’t, I call it Travel summoning or Ascension. Others think this might be astral projection. I do still have dreams, I’m aware of dreams and can control them. That isn’t this.\nWhy am I posting this?: To get answers and to hopefully find the other people I’ve met in this situation.\nBackground/Further explanation before we get into everything: I’ve been having these ‘dreams’ in which they aren’t really dreams. I call it Travel Summoning or Accession. Others think it may be astra projection, but I don’t know much about it so I can’t really say at the moment. Before the events and traveling actually happen, I black out. Usually when I have actual dreams, I’ll feel tired and I’ll settle into bed, turning off lights, plug my phone in, set an alarm, lay down and close my eyes then diff off to sleep. With traveling however I have no recollection of ever falling asleep or even getting ready to fall asleep or feeling tired. It’s one second I’m watching something or doing something then boom I’m traveling.\nThe first travel: This has been happening for a long time, but I was a child when it first started to happen. I would suddenly be in what looked like a hospital or research facility. Because I’ve been there so many times, I know it like the back of my hand. I won’t give too much detail about the place however in hopes others who have been there can PM me and describe it to me so I can see if we really went to the same place. But when I first went it was like a doctors visit. They were super nice at first. They would explain everything they were going to do. They introduced themselves (they later said they used fake names in order to protect themselves) and explained that I was very special and that I was selected to be part of a program. It was to see if I had anything else special about me. There was other kids too. A lot of kids. We would have to do certain things, like tests. If the kids failed it they didn’t come back. I don’t think they killed them, I think that they just didn’t summon them anymore and the kids, now adults, probably think it was just some weird dream.\nThe tests: the tests are something I’ve had to do over and over. Even as I grew I had to do different ones and such. They started out as basic. Math tests, spelling tests, history tests, morality tests, gym tests, science tests. Stuff like that. We wouldn’t have classes on these subjects, but the classes we did have we did touch on the subjects here and there. The tests would then start to get weirder. They would do tests on us based on precognition/clairvoyance/telekinesis/ other stuff like that. There was more tests on different abilities, but I didn’t score high on those ones so my specific training wasn’t on those.\nEducation: We had classes of sorts to educate us and to prepare us for tests. The classes were on different abilities and such to see what child had the abilities. We had to do classes on so many abilities, because they said sometimes it takes a few times for it to be awakened. Along with these classes we of course would touch on mundane topics too like history, math, science. Mainly science as the workers were scientists and doctors.\nWorkers/Doctors: there was a bunch of adults that worked at the facility. Like I said they used fake names, wouldn’t tell anyone where they are from or their age. I could only get basic information out of them such as have they been to New York, if they like cheeseburgers, what their favorite color was, basic stuff like that. If I asked more about the training/Education/tests they would just fill me in about what they could. If I asked something they couldn’t tell me it was classified or I would learn later on when I’m bigger. I gave up quickly about trying to get to know them personally, instead I would just talk to them about things that interested me like history and stuff. They gave me some information about things in the past and the truth about some things. Such as the organization has been going on for a while now, but not too old. I think they said they are younger than the cola company?\nBetrayal: Sadly things didn’t go as smoothly as we got older. The other kids, now adults, and I that have stayed in the program are now in our 20’s and we were told we had something big to work on. It was our first assignment. We were brought into a room where there was an object. They turned it on and explained to us that we needed to go threw it. That it was a portal. Our assignment was to explore the dimension. We denied. We were arguing with them, yelling at them. We were sobbing and crying saying no, that that’s crazy. They pushed one of us in, another went after them. Some of us hesitated on going after them, but eventually we were all forced into the portal as they soon brought out weapons, giving us an ultimatum. (They later said they wouldn’t actually have killed us, that we are too high of value to kill us, they just wanted to scare us). I’m getting emotionally distressed as I type this, and I can’t continue much longer as that first dimensional trip was traumatizing. We were lost on what seemed like a new planet. We could breathe just fine, gravity was similar. We were stranded in this dimension for almost a year. We lost someone there. We were injured. But eventually we got back. Now we have been doing this for a while. Traveling to different dimensions, more training.\nI have to stop here. I know I left a lot of information out, but it’s emotionally draining and I don’t want to give everything away in hopes to find someone who has gone through this. I’ll answer any questions you have in the comments.", "media": null, "score": 3, "upvote_ratio": 0.71, "comment_count": 0, "over_18": false}, "69": {"id": "1fmfrgs", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "RemyLaveu", "link_flair_text": null, "time": 1727492448.3445315, "created_utc": 1726961110.0, "url": "https://i.redd.it/bfh7u301y8qd1.jpeg", "title": "Great logo or not? Credits to creator ", "permalink": "/r/cryptids/comments/1fmfrgs/great_logo_or_not_credits_to_creator/", "selftext": "", "media": null, "score": 319, "upvote_ratio": 0.98, "comment_count": 26, "over_18": false}, "70": {"id": "1fmq5jz", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "No-Advantage-241", "link_flair_text": null, "time": 1727492448.5768907, "created_utc": 1727000886.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1fmq5jz/need_advice_or_your_opinion/", "title": "Need advice or your opinion ", "permalink": "/r/Thetruthishere/comments/1fmq5jz/need_advice_or_your_opinion/", "selftext": "Need help or some advice about my friend \nSo this is happening with my friend and she needs help or any kind of advice by listening it please tell me she has mental issues or some kind of awakening so here it what happened one day she suddenly woke up and some kind of weird realisation happened with her she said in this era is going in total opposite direction and wrong people are manipulative and liar there was 50 %  good things and 50% bad things in this era of century she see her own parents true nature and become heartless does not feel much emotion like things gonna happen no one stop them life still goes on even if bad things happen or good nothing is permanent feelings, desire, emotion nothing just soul is eternal , only god is real submit yourself to God that was she saying all the time and trying to find meaning in life but does not know what to do everything feel  useless and worldly materialistic desire all is nothing but illusions , believe is magical word if you believe in something it will happen , and everyone is affected by negative entities or energy ....this realisation it eating her inside and don't know what to do ? Do she have to go to see doctor or what ??", "media": null, "score": 5, "upvote_ratio": 0.86, "comment_count": 12, "over_18": false}, "71": {"id": "1fo6tqx", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "quitenotsure1324", "link_flair_text": null, "time": 1727492448.7832036, "created_utc": 1727162738.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1fo6tqx/man_on_the_trail/", "title": "Man on the trail ", "permalink": "/r/LetsNotMeet/comments/1fo6tqx/man_on_the_trail/", "selftext": "August in 2020 I had moved in with my aunt and uncle to an insanely small rural town in california. When I first moved there a friend of mine had made it a point to show me that someone could drive across the whole town within 5 minutes and at the time I didn’t realize how important that fact would become to the safety of me and my loved ones. \nMy best friend “Hayley” and I (her 17 & me being 18 y/o at that time) were hanging out at a park that was about a 5-10 minute walk from where I lived. And i say park because there were a few tables and benches and it was technically known as a “town park” but in reality it was more a small grass clearing surrounded by woods and a dirt trail near the bank of a river. I had started to frequent this place after moving walking down to the benches and trail to smoke or sit by the water. I had never really noticed any suspicious characters before this, even though i had been plenty warned about a couple creepers that were in the area known for bothering young girls. \nHayley and I had been smoking for a bit unbothered in the clearing when we decided to finish out our trip with exploring the trail a little bit and just taking in the scenery. We had been walking and talking for about 5 minutes when I started to get this tension in my shoulders. Like that feeling you get when you know someone is looking at you. I had looked behind us and there was a man on the trail with us. Granted this path is pressed right against the side wall of a gated community so seeing people going on walks and jogging was fairly common. I told my friend of the man’s presence but she had written it off as me being anxious but she had a good point i tend to be a bit hyper-aware at times, but something about the man felt wrong in my gut. \nWe kept walking and i would periodically look back and keep tab on the dark haired middle aged man walking about 50 feet behind us. After not too long at all the man started picking up his pace behind us. Calm casual walking became more of a speed walk, and I turned around completely and started walking backwards to try and communicate to this man that I was completely aware of his presence. He had made towards the side of the trail looking like he was going to walk through the brush down to the river and I felt a bit stupid. I turned back around walking forward again when i looked back just once more to be sure he was gone. But as I was looking behind us for the last time I see the man in a full sprint coming back onto the trail straight for me and Hayley. I grabbed her sleeve with one hand and ripped out my pocket knife with the other and I can’t remember what I had said to her but we started sprinting down the trail as well.  \nI had never gone very far down the path and I had no idea where it was going to take us but the man running after us was blocking our path back to the clearing and the road but we could hear his footsteps on the dirt getting closer. I let go of Hayleys sleeve so I could pull my phone out and called my uncle as we were running. I told him we were being followed on “the trail at the park” but I couldn’t tell him exactly where on the trail because I had never been much further than the entrance and I had no idea where it lead to. My uncle had told me to stay on the phone and be loud so he could find me. I let out the loudest shrillest scream i could and we kept running until we reached what was the clear end to the path. We ran up on an old metal fence surrounding trees and what looked like an old abandoned house or shed. We had also reached the back corner of the outer wall for the gated community and in that spilt second this seemed to be our best bet. \nI ripped us off the dirt path into some trees lining the cement wall and yelled at Hayley to climb as fast as she could pushing her from the bottom so she could use a tree and the ledge to clear the top of the wall. I tossed my pocket knife and my phone over and I’m not even sure how i scaled the wall myself but I scrambled up and over as fast as physically possible. I landed next to Hayley basically face first onto a neatly trimmed patch of grass inside the gated community scaring a poor man who seemed to just be outside walking his dog. I became really aware of how strange we probably seemed, two teenagers panicking and yelling while holding a knife but this man seemed to know we were in trouble. He came over to ask us what was happening and if we needed anything and Hayley started explaining our disruption to his calm neighborhood while i got back on the phone with my uncle and told him we made it into the gated community. \nNot even a minute later my uncle came barreling towards the end of the path and we could hear him shouting to the man on the trail that he had a firearm and all the things he was going to do with it. The man with his dog lead us to a little access gate a ways back on the wall and unlocked it for us so we could meet my uncle on the path. My uncle told us that he had drove his car through the park all the way up to the trail entrance as fast as he could and started running for us but he didn’t see any man as he was going. He checked on us and i retold him what happened with more detail than i could’ve managed in my initial panic. He escorted us back down the trail to the car, firearm in full sight at the ready in case the man on the trail decided to reveal himself. \nWe didn’t see him on our walk back and I haven’t returned to this place since then but any time that i had left the house before i eventually moved I was constantly paranoid i was being followed. We were never able to figure out who this man was and I haven’t seen him since that day but to the man on the trail, let’s not meet. ", "media": null, "score": 75, "upvote_ratio": 0.98, "comment_count": 4, "over_18": true}, "72": {"id": "1fns1zf", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "TheIrishSpaceHoodie", "link_flair_text": "Captured Apparition ", "time": 1727492450.4773467, "created_utc": 1727117183.0, "url": "https://i.redd.it/pniw6vd3ulqd1.jpeg", "title": "My Nanas Ghost Pic from 2016. Can anyone debunk it or find the lady?", "permalink": "/r/Ghosts/comments/1fns1zf/my_nanas_ghost_pic_from_2016_can_anyone_debunk_it/", "selftext": "She has a lot of stories about this one. She was babysitting at a friend's house overnight when this was caught. She says theres a baby on the ghost back. The ghost is apparently the wife of a doctor who used to live in the house together. They had a baby together and both the wife and baby died young due to an illness. I dont know the whole story but my nana is adamant on this being a real ghost picture. ", "media": null, "score": 597, "upvote_ratio": 0.82, "comment_count": 274, "over_18": false}, "73": {"id": "1fmclea", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "legolas-mc", "link_flair_text": "Glitch Pic", "time": 1727492450.7175193, "created_utc": 1726951820.0, "url": "https://i.redd.it/kqu445le68qd1.jpeg", "title": "Someone needs to change their hash function", "permalink": "/r/GlitchInTheMatrix/comments/1fmclea/someone_needs_to_change_their_hash_function/", "selftext": "", "media": null, "score": 10, "upvote_ratio": 0.65, "comment_count": 2, "over_18": false}}}