{"_default": {"1": {"id": "19c54ap", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Awstun_", "link_flair_text": null, "time": 1706337858.0948167, "created_utc": 1705849034.0, "url": "https://i.redd.it/gvqtujpz4tdc1.jpeg", "title": "This is the corrupting influence Eisenhower warned of.", "permalink": "/r/ufo/comments/19c54ap/this_is_the_corrupting_influence_eisenhower/", "selftext": "", "media": null, "score": 810, "upvote_ratio": 0.94, "comment_count": 183, "over_18": false}, "2": {"id": "19e6nam", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Odd_Cry1315", "link_flair_text": "Video", "time": 1706337859.5117817, "created_utc": 1706064489.0, "url": "https://v.redd.it/9awk2xmbxaec1", "title": "This is the greatest triangle craft video ever imo (stabilized version).", "permalink": "/r/UFOs/comments/19e6nam/this_is_the_greatest_triangle_craft_video_ever/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/9awk2xmbxaec1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1440, "scrubber_media_url": "https://v.redd.it/9awk2xmbxaec1/DASH_96.mp4", "dash_url": "https://v.redd.it/9awk2xmbxaec1/DASHPlaylist.mpd?a=1708929858%2CMWRjNGQ5OGFiM2Q4YTI2OGU5NDkzZTc5NjU5ODBhZGYyZmE3NDEyOWQ3OTBiNWI1YzgxMzY5NTBjYzRkODUzMQ%3D%3D&v=1&f=sd", "duration": 62, "hls_url": "https://v.redd.it/9awk2xmbxaec1/HLSPlaylist.m3u8?a=1708929858%2COWFmZWIwMDU4NGM5NzA5ZjBlY2E5NDg1YWU3YjllZTAyMGM2ZDlmYTFkM2E3Zjk1NzU0OTUzOThhOTI1MTExZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4157, "upvote_ratio": 0.88, "comment_count": 962, "over_18": false}, "3": {"id": "19cdjor", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "lilmayo", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1706337861.2525182, "created_utc": 1705870590.0, "url": "https://www.reddit.com/gallery/19cdjor", "title": "me if u even care", "permalink": "/r/aliens/comments/19cdjor/me_if_u_even_care/", "selftext": "", "media": null, "score": 3633, "upvote_ratio": 0.92, "comment_count": 283, "over_18": false}, "4": {"id": "19dh57y", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Discussion", "time": 1706337862.1635928, "created_utc": 1705988061.0, "url": "https://i.redd.it/g2r2cqj9m4ec1.png", "title": "Lue Elizondo's statement about the group of Wikipedia editors controlling most UFO/UAP-related pages:", "permalink": "/r/UAP/comments/19dh57y/lue_elizondos_statement_about_the_group_of/", "selftext": "", "media": null, "score": 348, "upvote_ratio": 0.93, "comment_count": 57, "over_18": false}, "5": {"id": "19dr9z6", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Additional_Ad3796", "link_flair_text": null, "time": 1706337863.5929482, "created_utc": 1706024604.0, "url": "https://www.reddit.com/r/conspiracy/comments/19dr9z6/the_united_states_took_flight_mh370/", "title": "The United States took Flight MH370", "permalink": "/r/conspiracy/comments/19dr9z6/the_united_states_took_flight_mh370/", "selftext": "If you're not familiar, Malaysian Airlines Flight 370 disappeared March 8th (March 7th UTC) in 2014. There are many commonly known narratives about it's fate including the idea that it was a suicidal pilot that flew by his home town to say goodbye and took the plane on an 6+ hour joyride. This narrative is false and there's no evidence to support it. That's how easy it is for the media to convince people of a lie. The official story is that we don't know what happened to the plane.\nWhat really happened is that the United States took this plane and lied about it to the world.\nThe mainstream media is under complete control by the US government, and that's why they didn't press on the fact that we have satellites scanning the entire globe persistently with a system called SBIRS. There were US/Thai exercises going on in the Andaman sea where the plane flew directly past. We also have bases such as Diego Garcia that have capabilites to track the plane from takeoff to it's disappearance. There is no possible way the United States doesn't know exactly what happened to the plane. We know a plane the size of a 777 can't disappear without being tracked and can't crash into the ocean without leaving a debris field.\nSpace Based Infrared System - Global Persistent Infrared Surveillance\nEvery FOIA request into the plane to any agency is met with a 2009 Obama era exemption that withholds the information 'in the internet of national defense or foreign policy,' including one by Olry Taitz in 2014 to the NSA. This would not be the case if they there wasn't something to hide.\nInterest of National Defense or Foreign Relations\nSo what happened to the plane? We can say with a high degree of confidence that it was a lithium ion battery fire related to the 487lbs onboard, two pallets of which went unscreened and were in the forward cargo bay near the Main Equipment Center (MEC), also known as the electronics bay. 19 witnesses corroborate this event and all have had to be discredited to invent a phony narrative of the plane flying into the South Indian Ocean. This includes Mike McKay who saw the plane on fire when the batteries first ignited, 9 witnesses along the coast who hear loud noises at the exact same time, 8 fishermen who see the plane flying low as the crew battles the fire and the pilots try to keep the passengers alive, and finally Kate Tee who an hour later sees the plane glowing orange with no navigation lights, spewing dark smoke. The orange glow is due to a chemical reaction from the Halon 1301 releasing Bromine, a halogen gas.\nMike McKay sees burning plane for 5-10 seconds\nThe plane didn't fly for 8 hours to fuel exhaustion and that's why the official search didn't find one single piece of the plane above or below water, any black boxes, and why there was no radar signals or acoustic detections anywhere in the South Indian Ocean. If the plane crashed at 15,000ft per minute as Mike Exner of the Independent Group has claimed to me, it would have shattered into thousands of pieces. He claims all the pieces of the plane sunk, but that's not how that works. Much of the plane would have floated including all the plastic, luggage, floatation devices, bodies, etc. The debris field would have been miles wide and we would have seen it on satellite the next day.\nSearched everywhere with 80+ boats\\/planes and submersibles and found nothing\nOver a year later a few pieces linked to the plane wash ashore. The media doesn't report that no unique serial numbers were used, the unique serial plate was missing from the flaperon. Instead they used part numbers. Only a tiny fraction of the plane is acocunted for with all the combined debris found. A couple of those pieces have clear scortch/burn marks on them. Not reported is that a B777 fire suppresion device washed up in the Maldives just weeks after the plane disappeared and was ignored despite having visible serial numbers on it.\nScorch\\/Burn marks on debris with Boeing honeycomb pattern\nB777 Fire Suppression Device with visible serial number\nIt was this plane due to the 20 Freescale Semiconductor scientists onboard, far too many for a commercial flight. Freescale was linked to room temperature superconductive microchip development by a 2005 National Security Agency (NSA) report. They had just developed a microchip so small it fit in the dimple of a golf ball. The company was linked to US Aerospace and defense.\nNSA report references Freescale nine times\nIf it was a fire, why the cover up? Enter the MH370 videos. There's not a lot of reason to create an elborate cover up including multiple countries and all western media, unless whatever is being hidden is for national defense purposes. The United States, and/or one of the defense contractors such as Lockheed Martin, used advanced technology unknown to the public on the plane. Two perfectly insync videos dating just days/weeks after the plane went missing corroborate this event. The event we see could be cloaking or annihilation, but both are unlikely due to the smoke trail stopping and the lack of a larger release of energy, respectively. The event seems to be, despite how hard it is to believe, a superluminal event. 'Teleportation' of a macro sized object.\nEndothermic event disappears plane in two videos\nThe MH370 videos are the reason for the coverup because this technology is not just about there being a unification theory of quantum mechanics and general relativity (ER=EPR), it's because this technology can be used to create a doomsday weapon that would destroy the entire planet in an instant.\nSo why wouldn't Russia and/or China blow the whistle on this? First, because no one would believe them. Second because this is spycraft at the highest levels of geopolitics. And third, they did. Russia put out a report not covered in western media that the United States put a package on the plane from the Alabama Maersk where two SEALs were mysteriously found dead, both overdosed at the same time just two weeks before the plane went missing. China hacked Malaysia's government the day after the plane went missing and stole crisis meeting minute notes and classified information about the plane. They also released satellite images 5 days after the plane went missing which seem to show three orbs in a triangle formation. It was reported as debris in the South China Sea but none was found, but in reality was most likely spycraft. A message to the US Government - \"we know what you did.\"\nRussian Intelligence Report calls out US Navy\nChinese Satellite Images reported as 'debris' but none was found\nI have been investigating this case for over five months and done over 60 podcasts including Tim Pool and Alex Jones. I am absolutely certain that the United States is lying or witholding information that would reveal the true fate of MH370. You don't need to trust or believe me because I've made the evidence publicly available to all. Even if you can't believe in advanced technology kept secret from us, please help get the truth for the families and victims of the plane.\nhttps://docs.google.com/document/d/1xwgnR6w9ub93RdDkPhYu_qEC7yDkHL9UeDPXondHuj4/edit?usp=sharing\nLastly I want to send a message to a man named Lieutenant Commander Edward C. Lin. Thank you for leaking these videos and revealing the truth to the world, despite the fact that we ignored them for over nine years. You are not a traitor. You are the hero we deserve.\nNine Year Sentence for a plea deal two charges of disseminating classified information? Defense argued the information is available on the internet.", "media": null, "score": 2157, "upvote_ratio": 0.93, "comment_count": 360, "over_18": false}, "6": {"id": "19es55t", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnunnakiGod05", "link_flair_text": null, "time": 1706337863.9212563, "created_utc": 1706132443.0, "url": "https://youtu.be/ye-BTnWwaY8", "title": "The Enigma Of The Crystal Skulls. The last couple of decades there has been a growing interest in ancient crystal skulls. The most famous crystal skull, which is as big as a human skull, was discovered by Anna Mitchell-Hedges.", "permalink": "/r/conspiracyfact/comments/19es55t/the_enigma_of_the_crystal_skulls_the_last_couple/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Enigma Of The Crystal Skulls", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/ye-BTnWwaY8?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The Enigma Of The Crystal Skulls\"></iframe>", "author_name": "What We Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/ye-BTnWwaY8/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@whatweknow"}}, "score": 5, "upvote_ratio": 0.85, "comment_count": 0, "over_18": false}, "7": {"id": "19dbp2e", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Extra-Dimension-276", "link_flair_text": "New Brunswick Roar", "time": 1706337864.9369218, "created_utc": 1705971109.0, "url": "https://v.redd.it/0jv91n5z73ec1", "title": "Terrifying sounds in eastern Canada ", "permalink": "/r/bigfoot/comments/19dbp2e/terrifying_sounds_in_eastern_canada/", "selftext": "I heard a pileated woodpecker do it's alarm call and then I heard some odd noises and started recording. Doesn't sound like a lynx call or anything I know.", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/0jv91n5z73ec1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/0jv91n5z73ec1/DASH_96.mp4", "dash_url": "https://v.redd.it/0jv91n5z73ec1/DASHPlaylist.mpd?a=1708929864%2CNTk4ZDU1ZDM0MDhjNmU3YTRiY2RjZDAyMDJlZjRkZWNjN2QyOTJmYjcxYWVlM2NiNjJjM2JjYTM1YzY3MzIwZA%3D%3D&v=1&f=sd", "duration": 27, "hls_url": "https://v.redd.it/0jv91n5z73ec1/HLSPlaylist.m3u8?a=1708929864%2CZWE1MjYzOWVjZTZhOTg1NmFhNWY1OTVmMWUyOTFjM2M1OWEyODgxMjkzNjAxNGYyMThkOTBkMTExNmZhNDRlMw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3454, "upvote_ratio": 0.9, "comment_count": 1205, "over_18": false}, "8": {"id": "19cf62s", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "BrickAntique5284", "link_flair_text": null, "time": 1706337865.6542592, "created_utc": 1705874560.0, "url": "https://i.redd.it/36a47d5w8vdc1.jpeg", "title": "The Tibetan White Bear is a cryptid bear reported from remote corners of the Tibetan Himalayas. It is described simply as a white bear and has been compared to a polar bear.", "permalink": "/r/Cryptozoology/comments/19cf62s/the_tibetan_white_bear_is_a_cryptid_bear_reported/", "selftext": "", "media": null, "score": 200, "upvote_ratio": 0.98, "comment_count": 21, "over_18": false}, "9": {"id": "19evhgf", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Vivid_Plastic_741", "link_flair_text": "Flying Humanoid", "time": 1706337865.8920162, "created_utc": 1706140863.0, "url": "https://www.reddit.com/gallery/19evhgf", "title": "The Bizarre Humanoid that flew in a motorcyclist position, Emilia, Romagna, Italy, 1971", "permalink": "/r/Humanoidencounters/comments/19evhgf/the_bizarre_humanoid_that_flew_in_a_motorcyclist/", "selftext": "On August 19, 1971 in Emilia, Romagna, at 7:00 p.m., the guard Pietro Bongiorni saw, from a terrace of the Bobbio spa, a strange \"object\" approaching flying in the sky. The object, as it approached, took the form of a human being. Bongiorni then called his wife, his children and a friend, but the flying man changed direction, perhaps alarmed by the screams of witnesses who still managed to see the strange individual, although he was now moving away towards the east. Bongiorni and the other witnesses stated that the being had reddish skin and very long black hair and a beard. Then they realized, given the extreme proximity (5 meters), of the strange flight position similar to that of motorcyclists; His height was estimated at around five feet six inches. The being looked very intensely at the witness with its dark eyes, and other people also declared having seen on the bed of the Bobbio river a being in an orange jumpsuit who, after having picked up some stones, flew away. SOURCE: ALÍENÍ ÍN ÍTALÍA.", "media": null, "score": 60, "upvote_ratio": 0.89, "comment_count": 16, "over_18": false}, "10": {"id": "19e3s54", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Extra-Dimension-276", "link_flair_text": null, "time": 1706337866.662852, "created_utc": 1706056251.0, "url": "https://v.redd.it/8yq7xzf59aec1", "title": "Possible bigfoot vocalizations ", "permalink": "/r/cryptids/comments/19e3s54/possible_bigfoot_vocalizations/", "selftext": "Heard a woodpecker do it's warning call and a few strange noises so I started recording. Don't know what it is but I didn't want to find out.", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/8yq7xzf59aec1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/8yq7xzf59aec1/DASH_96.mp4", "dash_url": "https://v.redd.it/8yq7xzf59aec1/DASHPlaylist.mpd?a=1708929866%2CNWU4ZmEwMGU5MjY3ZjQ0MjRkNWM0MGJkOWFhOWQ0NDU3ZGEzMDA4Nzk3YjI5OGQxYWFiM2U0OWUxODU0M2UzMQ%3D%3D&v=1&f=sd", "duration": 27, "hls_url": "https://v.redd.it/8yq7xzf59aec1/HLSPlaylist.m3u8?a=1708929866%2CMWM0YjlmZWM1OWUzOWU4M2Q5YWJlZDdmMjRiZjhlZDM2Yjg0YmQxZWUwMzAwYmFhYTc3M2JiNTllNTFjN2EzYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 97, "upvote_ratio": 0.88, "comment_count": 22, "over_18": false}, "11": {"id": "19dp0i8", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "DueAd4408", "link_flair_text": null, "time": 1706337866.8556714, "created_utc": 1706018312.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/19dp0i8/my_deceased_dog_saved_me/", "title": "My deceased dog saved me", "permalink": "/r/Thetruthishere/comments/19dp0i8/my_deceased_dog_saved_me/", "selftext": "My wife and I had a huge Rottweiler we raised from a puppy when we started dating.  He was a HUGE asshole, fiercely protective over both of us, especially my wife, and very picky about who he was friends with.  Definitely our fault, he was an undersocialized COVID child and we didn’t have very many friends at our jobs or otherwise.  He did love us more than anything on earth and was the most loyal dog we could have asked for.  I used to joke with my wife that if someone dared to break into the house in the middle of the night, they wouldn’t have made it past the living room with all their limbs.  \nOur dog died at two years old, random heat exhaustion.  Took him for his same 20 minute walk we did every day, he never made it home.  My wife and I were shocked and devastated, especially her.  We wasted no time getting another puppy with the house being so quiet, once again a little German Rottweiler.  The two dogs couldn’t have been more different.  While protective, our current dog is the friendliest little bastard you could ask for.  We made an effort to not repeat the same mistakes we did with the first pup and got him very well socialized and adapted at a very young age.  \nFast forward to last night.  I am a long time sufferer of sleep paralysis.  I’ve seen every demon possible in my room at some point in my life, but mostly the infamous hat man.  He stands in the corner and smiles, sometimes reaches out and touches my legs on the bed.  Having been through this so many times, I’ve gotten pretty decent at snapping out of it, albeit with some good effort.  Last night was a lot different.  It started off with him in the corner per usual, I start doing my usual strategies, wiggle my toes, say a prayer, etc.  Nothing snaps me out of it.  Eventually, the hat man gets on all fours and shuffles on top of me from the corner.\nAt this point, I’m completely overcome with terror.  I’ve never seen him this close before.  His face is a few feet from mine, his black cartoonish eyes staring into me with his dark toothless grin unwavering.  I repeat my strategies trying to break out to no avail.  Suddenly piercing through the low humming noises, I hear a very deep guttural growl coming from next to me where my wife is sleeping.  I use all the effort I can to wiggle my eyes in that direction.  Standing over my wife looking dead at my demon is the angriest looking Rottweiler I have ever seen.  Teeth are bared, hackles up, letting loose a furious snarl.  I thought maybe it was my current dog and that I had perhaps managed to snap out of the paralysis until I saw the docked tail (current dog has full tail, old one didn’t).  The dog launched itself into the demon still on top of me, staring into my soul, which somehow woke me up finally.  \nI immediately teared up and went to the closet where we still kept his favorite stuffed animal (the only one he never destroyed) and just sat there holding it for a while.  Thanking my mean, nasty, fiercely loyal baby boy for continuing to protect us late into the night in this life and the next.", "media": null, "score": 357, "upvote_ratio": 0.98, "comment_count": 25, "over_18": false}, "12": {"id": "1abej2x", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "BrilliantBex1992", "link_flair_text": null, "time": 1706337867.0504205, "created_utc": 1706261501.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1abej2x/someone_is_watching_me/", "title": "Someone is watching me", "permalink": "/r/LetsNotMeet/comments/1abej2x/someone_is_watching_me/", "selftext": "UPDATES WILL BE POSTED AT THE END.\nSo, I have never posted on this sub, though I have other stories I’ve buried deep until recently, but this is happening, in the present. \nI have had people stalk and follow me before, and because of that and my true crime addiction, I’ve become supremely paranoid and a solid curtain-twitcher.\nI (31f) reside in an upstairs room that was my first room to myself as a child. I had to leave a bad situation and therefore ended up back at my childhood home.\nFor reference, when our house was built, we were told that the field to our left (with horses and a barn at the time) would one day soon be a development. It was 2000 when we were told that, and it wasn’t until 2022 that roads started being formed and foundations laid.\nI’d already had someone follow me home before when I was young, (posted about it but don’t know how to link) but I was in a different bedroom next door.\nMy parents put in a free library that’s right below my window, and nighttime security lights that are very bright and turn on if you’re within like 20’ of the side of my house my room is on.\nI’ll admit, having an open field next to me so long made me accustomed to not closing the curtains when I change, because there was never anyone to watch. Now there is.\nFor the past two weeks, the “burglar” lights next to the free library have been going off late at night. Because my one side of the curtain is open so I can use my vape, that’s the only reason I noticed at all.\nI didn’t think too much at first; we lock all the doors and windows, every night, and I’m on the second floor. I also always looked out to see if it was a car, someone walking their dog, or a deer, only to see nothing. To add, they put in a shit ton of streetlights around this area so visibility is great.\nBut it just kept happening.\nSo last night, I did my usual, and I saw the lights come on out of my peripherals. \nI acted natural, giving full view out the window I was going to bed (it was about 3am) turning the tv off, closing the window and curtains, turning the light out.\nThen I ducked down, peering through the curtains to the sidewalk below. \nI honesty thought I was going to pass out when after a few minutes, maybe 5, someone comes out from the side of my house. All silhouette, dressed in black. \nThey kept their back to me until the light turned off, but I swear I could still see them standing there, looking up like they could see me. I called the police, but while I was on the phone with the operator I saw him run off. \nThere wasn’t much they could do, except say they’d have a car drive around and look. \nMy parents are asleep and I know I have to tell them tomorrow. This scares the crap out of me. \nIf it hadn’t been happening for weeks and was a solo incident, I would probably be fine about it, but the fact that the light has been going off without me seeing activity, and what happened tonight, makes me think this person has been watching me, and watching my house.\nTo the person outside my window, let’s please never fucking meet.\nSmall update: I did tell my parents and at first they brushed me off, claiming I’d had a couple drinks and it was late, so I probably just saw someone checking out the library.\nI then had another conversation about it with just my dad, who said that there had been reports the last couple weeks of car break ins, and since my car is parked on my side of the street right outside my window, maybe they were trying to break into it.\nI pointed out that if he was trying to get into my car, why was he pressed up against the house where he wasn’t visible from my window? And why did he at no point go towards my car?\nI think I freaked him out enough that we are going to potentially get a camera for that area. Given all the development happening around us, I think it’s smart even without this incident. Thank you all for your advice and replies! I’ll update here again if anything happens", "media": null, "score": 80, "upvote_ratio": 0.94, "comment_count": 19, "over_18": true}, "13": {"id": "192j6rs", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Sanskirt90", "link_flair_text": null, "time": 1706337867.2325995, "created_utc": 1704818958.0, "url": "https://i.redd.it/mim5oqtw1gbc1.jpeg", "title": "The last photo taken by Daylenn Pua before he disappeared. Can you notice the man following him?", "permalink": "/r/truecreepy/comments/192j6rs/the_last_photo_taken_by_daylenn_pua_before_he/", "selftext": "", "media": null, "score": 219, "upvote_ratio": 0.96, "comment_count": 24, "over_18": false}, "14": {"id": "19fnpij", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Educational_Shop_471", "link_flair_text": null, "time": 1706337867.477456, "created_utc": 1706227057.0, "url": "https://www.reddit.com/r/threekings/comments/19fnpij/is_this_ritual_real_is_anyone_willing_to_try_dont/", "title": "Is this ritual real? Is anyone willing to try? ($) Dont speak to the double", "permalink": "/r/threekings/comments/19fnpij/is_this_ritual_real_is_anyone_willing_to_try_dont/", "selftext": "Hello everyone, i hope everyone is doing well here\nI wanted to ask you guys about the legitimacy of this “ritual” that i found on the subreddit threekings. It is called dont speak to the double. Can you guys read it and let me know your opinions on it and is anyone willing to play it for compensation? For some reason its been in the back of my mind and it wont go away. \nhttps://www.reddit.com/r/threekings/comments/7t1nqg/recipe_dont_speak_to_the_double/?rdt=52145\nThe main things about this that makes its seem like a work of fiction is the way its written. It sounds like a creepypasta. There is an absurd amount of details/rules which makes me question, where did they hear about this? Who has tested this? How did they even come up with it? Theres so much info about it that makes less mysterious.\nHe says his aunt told him about it and that other people have done this ritual/game, but i couldn’t find anything about this. \nOne point is that the entity (double) can take the shape of an animal, but it rarely does. Would it take the shape of any animal or the animal you own?\nAnother One of the points is that the entity will have general memories of our loved one. But if the entity is aggressive, then it will use accurate details of yours/their life (the person the double is pretending to be). \nOne thing that really bothered me is the section about the mirror. They said that the mirror is a tool and it’ll show its true appearance in the mirror. It just sounds fishy.\nIt reminds me of that one japanese game: daruma san or the bath game. Where you’ll basically hide/runaway from a spirit, honestly it’s essentially the same thing. They both make you do something and then you go to bed and you wake up and run away from said entity.\nIve talked to people from the occult subreddit and they said its fake and a creepypasta.\nhttps://www.reddit.com/r/occult/s/sViDBDBPIp\nCan you guys let me know whether this is fake or legit? I honestly can’t tell. And could someone play it? I doubt its real.", "media": null, "score": 10, "upvote_ratio": 0.86, "comment_count": 12, "over_18": false}, "15": {"id": "1abqrdg", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Mara_Bell30", "link_flair_text": "Is this paranormal?", "time": 1706337868.7072654, "created_utc": 1706297629.0, "url": "https://v.redd.it/jmvg2y4w6uec1", "title": "My sister has been in her haunted house for 8 years and still gets shaken up when stuff like this happens. ", "permalink": "/r/Ghosts/comments/1abqrdg/my_sister_has_been_in_her_haunted_house_for_8/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/jmvg2y4w6uec1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 640, "width": 360, "scrubber_media_url": "https://v.redd.it/jmvg2y4w6uec1/DASH_96.mp4", "dash_url": "https://v.redd.it/jmvg2y4w6uec1/DASHPlaylist.mpd?a=1708929868%2CZjY1M2E4N2ZlZmEyMGZiZDlhYzA5NWUxODQyMTMyNzU3YTQ1OTM5YmU2OWNiMjRhYWI2ZDA1M2VkMTNiZGQ2Nw%3D%3D&v=1&f=sd", "duration": 41, "hls_url": "https://v.redd.it/jmvg2y4w6uec1/HLSPlaylist.m3u8?a=1708929868%2CNzhjM2NkMjZkZTk1M2ZkODJkNDdjNmJiZjgzMmU4YzU4OGI5ZDUxNmEzY2Y0MGVkOTJiM2YwNzRjYThhMjU4Ng%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1282, "upvote_ratio": 0.79, "comment_count": 525, "over_18": false}, "16": {"id": "19es3zm", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "superultraabbie", "link_flair_text": "Glitch Pic", "time": 1706337869.101001, "created_utc": 1706132368.0, "url": "https://www.reddit.com/gallery/19es3zm", "title": "Van outside my window said “sample”, 20 minutes later it was a plain black van", "permalink": "/r/GlitchInTheMatrix/comments/19es3zm/van_outside_my_window_said_sample_20_minutes/", "selftext": "", "media": null, "score": 1567, "upvote_ratio": 0.9, "comment_count": 144, "over_18": false}, "17": {"id": "19fhy0v", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "ghost-story23", "link_flair_text": null, "time": 1706337870.458315, "created_utc": 1706211931.0, "url": "https://i.redd.it/5ptnv2j7abbc1.jpeg", "title": "Did this NASA astronaut see snakes in space?", "permalink": "/r/ufo/comments/19fhy0v/did_this_nasa_astronaut_see_snakes_in_space/", "selftext": "", "media": null, "score": 306, "upvote_ratio": 0.86, "comment_count": 170, "over_18": false}, "18": {"id": "19cd9mh", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Odd_Cry1315", "link_flair_text": "Video", "time": 1706337871.9359775, "created_utc": 1705869884.0, "url": "https://v.redd.it/pcbmnmplsudc1", "title": "Flying saucer over iraq in 2008 leaked by US Drone Control Center.", "permalink": "/r/UFOs/comments/19cd9mh/flying_saucer_over_iraq_in_2008_leaked_by_us/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/pcbmnmplsudc1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 636, "scrubber_media_url": "https://v.redd.it/pcbmnmplsudc1/DASH_96.mp4", "dash_url": "https://v.redd.it/pcbmnmplsudc1/DASHPlaylist.mpd?a=1708929870%2COTk3YzFmODUwYWQzMGMzMDkzNGJiMzY3ZWY0M2NhYjZlYTZmOGVjZWUyMGFmYjQwNTM4ZDQ1YTkzZDhmMzFkNw%3D%3D&v=1&f=sd", "duration": 57, "hls_url": "https://v.redd.it/pcbmnmplsudc1/HLSPlaylist.m3u8?a=1708929870%2COTM4OWI0OTNhODQwMmFkOTI4M2VhNzg3ZGE1NDU5Nzg5OWYzNjkxZDg3MTVlODlhN2MxMzI1MzM1YTFjYWQyNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4092, "upvote_ratio": 0.88, "comment_count": 533, "over_18": false}, "19": {"id": "19cf5wi", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Awstun_", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1706337873.7241929, "created_utc": 1705874547.0, "url": "https://i.redd.it/iiue6gvu8vdc1.jpeg", "title": "This is the corrupting influence Eisenhower warned of.", "permalink": "/r/aliens/comments/19cf5wi/this_is_the_corrupting_influence_eisenhower/", "selftext": "Susan Gough and her lapdog Cuckpatrick.", "media": null, "score": 1332, "upvote_ratio": 0.94, "comment_count": 215, "over_18": false}, "20": {"id": "19cs0w3", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Smurphilicious", "link_flair_text": "Discussion", "time": 1706337874.3599105, "created_utc": 1705916557.0, "url": "https://www.reddit.com/r/UAP/comments/19cs0w3/have_you_noticed_how_they_never_risk_mentioning/", "title": "Have you noticed how \"they\" never risk mentioning Cmdr Fravor?", "permalink": "/r/UAP/comments/19cs0w3/have_you_noticed_how_they_never_risk_mentioning/", "selftext": "I wanted to remind everyone of something after seeing this post from the other day. Not trying to shame anyone, I understand that not everyone has the time available to do their own research. I understand why someone would have creeping doubts. \nHere's why you don't need to doubt.\nGrusch wasn't the only one sitting there on July 26th. All \"they\" want to talk about is Grusch, leak his medical records, talk about ptsd and autism, accuse him of not having directly laid eyes on anything. The incessant, constant 'what what, Grusch Grusch'. They want ALL of your attention there, where they can twist and spin.\nCmdr Fravor was sitting there that day right next to Grusch. One of our best and brightest. Above reproach.\n\nMy name is David Fravor I'm a retired commander in the United States Navy, in 2004 I was a commanding officer of Strike Fighter Squadron 41 the world famous Black Aces\n\nhttps://youtu.be/usPustgTcDU\nHe is a firsthand witness. Not just him, but four of our best saw it with their own eyes firsthand. Craft far beyond our capabilities, on a beautiful day with a clear blue sky, as well as supporting sensor tracking data.\nhttps://www.youtube.com/live/SNgoul4vyDM\n\nIt's probably the most credible UFO sighting in history based on all the sensors that were tracking it, and then for us to get Visual and to go against the naysayers \"it's something on the screen\" or whatever... I mean there's four sets of human eyeballs, we're all very credible, of the six of us that were involved in the thing including the video, every one of us is going to do 20 plus years in the military in very responsible positions so I'd say the world needs to know that this it's not a joke.\n\nSo when the doubts creep in, or the bad faith arguments pop up in the comments about Grusch, remind people who was sitting next to him on July 26th. Remind them that Cmdr Fravor swore under oath that these craft were not of this world, and that nothing we have in our arsenal is capable of maneuvering the way these things do.\n\nThese craft had been observed for over two weeks coming down from over 80,000 feet rapidly descending to 20,000 feet, hanging out for hours, and then going straight back up. For those who don't realize, above 80 000 feet is space\n", "media": null, "score": 304, "upvote_ratio": 0.95, "comment_count": 81, "over_18": false}, "21": {"id": "19fldc8", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "TheForce122", "link_flair_text": null, "time": 1706337875.652573, "created_utc": 1706220863.0, "url": "https://i.redd.it/5rsrkqmmunec1.jpeg", "title": "Breaking: 14 States Defy Biden And Back Texas In The Fight To Secure U.S. Border", "permalink": "/r/conspiracy/comments/19fldc8/breaking_14_states_defy_biden_and_back_texas_in/", "selftext": "", "media": null, "score": 1908, "upvote_ratio": 0.81, "comment_count": 967, "over_18": false}, "22": {"id": "19e0cmz", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnunnakiGod05", "link_flair_text": null, "time": 1706337875.96702, "created_utc": 1706047298.0, "url": "https://youtu.be/gSGsfTgTfGk", "title": "Are Grey Aliens Evil - What Do We Know About Them? The earliest account of alien abduction was documented in 1957 in Mexico although it does not refer to Grey Aliens specifically. Antonio Villas Boas recounted a story of his abduction and subsequent sexual intercourse with a humanoid alien.", "permalink": "/r/conspiracyfact/comments/19e0cmz/are_grey_aliens_evil_what_do_we_know_about_them/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Are Grey Aliens Evil - What Do We Know About Them?", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/gSGsfTgTfGk?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Are Grey Aliens Evil - What Do We Know About Them?\"></iframe>", "author_name": "What We Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/gSGsfTgTfGk/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@whatweknow"}}, "score": 4, "upvote_ratio": 0.75, "comment_count": 0, "over_18": false}, "23": {"id": "19c81qn", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "SDeleonArt", "link_flair_text": "art", "time": 1706337877.101812, "created_utc": 1705856803.0, "url": "https://i.redd.it/pzp32wiyrtdc1.jpeg", "title": "enjoy my bigfoot painting. not for sale. happy sunday", "permalink": "/r/bigfoot/comments/19c81qn/enjoy_my_bigfoot_painting_not_for_sale_happy/", "selftext": "", "media": null, "score": 693, "upvote_ratio": 0.96, "comment_count": 227, "over_18": false}, "24": {"id": "19f1fmh", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Evidence", "time": 1706337877.8416889, "created_utc": 1706158708.0, "url": "https://i.redd.it/gblz6bxspiec1.png", "title": "Actor Jesus Payan Jr, best known for his role on Breaking Bad, once reported encountering a bigfoot while sleeping. This photo was one of the ones he posted of the creature, which he said was looking down on him from the opening of the tent.", "permalink": "/r/Cryptozoology/comments/19f1fmh/actor_jesus_payan_jr_best_known_for_his_role_on/", "selftext": "", "media": null, "score": 154, "upvote_ratio": 0.93, "comment_count": 39, "over_18": false}, "25": {"id": "19e3yxq", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Vivid_Plastic_741", "link_flair_text": "U.F.O. Humanoid", "time": 1706337878.0842843, "created_utc": 1706056789.0, "url": "https://www.reddit.com/gallery/19e3yxq", "title": "The Bizzare Case Of \"Nicodemus\" Rome, Italy, 1966", "permalink": "/r/Humanoidencounters/comments/19e3yxq/the_bizzare_case_of_nicodemus_rome_italy_1966/", "selftext": "On February 26, 1966 in Rome, Italy, postal worker and painter Luciano Gasbarri suddenly woke up at 2:00 a.m.: a dazzling light and a voice attracted him to his studio. There he found himself in front of a being about two meters tall with a silver suit and helmet, on whose chest he could see a kind of \"daisy\" with \"petals\" that moved and flashed. The being said that his name was \"Nicodemus\", that he had extraterrestrial origins and that he could materialize at will in a tangible body. In the helmet you could see a \"transparent window\" through which Gasbarri saw his face that seemed \"anatomically different\" from that of a human: his eyes were \"red and shiny.\" The witness recognized in the face the shapes that he had painted a few months before in a trance state. Later Gasbarri will have other encounters with other beings from various planets in the Solar System. SOURCE: ALÍENÍ ÍN ÍTALÍA.", "media": null, "score": 53, "upvote_ratio": 0.93, "comment_count": 7, "over_18": false}, "26": {"id": "19exmm7", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "CealBlanc", "link_flair_text": null, "time": 1706337878.9226227, "created_utc": 1706146865.0, "url": "https://i.redd.it/iuwujaglqhec1.jpeg", "title": "A bit of a rant about Wendigos.", "permalink": "/r/cryptids/comments/19exmm7/a_bit_of_a_rant_about_wendigos/", "selftext": "First point: wendigos ARE NOT CRYPTIDS!!! They are evil spirits.\nSecond point: the depictioin everyone keeps saying are wendigos, aren't really that, I'm not sure what to call them, notdeer or weredeer. But they aren't wendigos! The picture above is a true depiction of one. I generally don't know where exactly this misunderstanding initially took place but seriously. This is spirit of Native American folklore, and is scary enough without the deer head.\nSorry about this 😅 just been bugging me for awhile now. Also if you're wondering the picture is the wendigo from Until Dawn.", "media": null, "score": 70, "upvote_ratio": 0.83, "comment_count": 77, "over_18": false}, "27": {"id": "19fkvef", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Professor-Orange", "link_flair_text": "Aliens/UFOs", "time": 1706337879.1395593, "created_utc": 1706219570.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/19fkvef/odd_event_blue_lights_no_sound_30some_years_ago/", "title": "Odd event blue lights no sound - 30some years ago", "permalink": "/r/Thetruthishere/comments/19fkvef/odd_event_blue_lights_no_sound_30some_years_ago/", "selftext": "Figured I would post this somewhere.\nI was around 8. Late at night trying to sleep. My room had 4 windows. Everything turned blue. No sound. I hid under my blankets. Woke up the next day and had 2 small perfect straight 1/8 an inch apart lines on my arm. Scars today. I had not told anyone about this as I figured it was just something going on. The next day my mom went to visit my aunt around 5 miles away. She \"claimed\" to have seen a UFO the night before. What it was I have no clue but I know the marks on my arm were not their prior. I dont exactly believe in this stuff but it is just very odd.", "media": null, "score": 9, "upvote_ratio": 0.92, "comment_count": 3, "over_18": false}, "28": {"id": "19cemfp", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "moondreamcatcher1", "link_flair_text": null, "time": 1706337879.3538227, "created_utc": 1705873222.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/19cemfp/the_guy_down_the_street/", "title": "The Guy Down the Street", "permalink": "/r/LetsNotMeet/comments/19cemfp/the_guy_down_the_street/", "selftext": "TW: Mention of a weapon\nI (30f) used to live in a small neighborhood from ages 13-18. This took place when I was around 15. \nI spent most of my time just walking around the neighborhood listening to my mp3player. (Wow. Feel old just typing that.)\nThere was a guy around the same age as me that lived maybe 5 or so houses down from me. From neighborhood gossip I learned that he was home schooled, and had been in and out of juvie due to his anger issues. \nHe was almost always outside, and sometimes when I passed his house he would start following me. I was smart enough to always have my music down low enough to be able to hear and be aware of my surroundings. At first I just passed it off as he just ended up walking the same time of day I did (looking back I was truly dumb.) \nAs time passed, he got close and closer to me when following, until he eventually decided to come up right behind me. He said some truly heinous things that I will not repeat here. I mean he was right in my ear when he was talking. I ran home and told my sister (she was basically who raised me). She told me I was lying and to stop making up stories. \nFor a while I stopped going out walking, until I needed the fresh air and exercise and tried again after maybe two months. Sure enough, there he was, and came right up behind me and started to say things again. \nI turned my music up and ignored him. This is what I continued to do everyday, until he got tired of me ignoring him I guess, because one day he grabbed my arm, I couldn’t get away, and then he grabbed the back of my neck and told me that I should “know better” than to ignore him. \nAgain, I told my sister, she didn’t believe me, and I stopped going out again. Two weeks later I woke up to loud bangs on my bedroom wall. There was garage on both sides of the house, and the wall of my bedroom shared a wall with one of the garages. This garage was unfinished, there wasn’t even concrete down, and it was easily accessible from outside as it was missing the door at the back of the house. \nMy sister was out of town, and my dad was deaf and bed ridden so it was just me in the house able to do anything. My bedroom also had a door to go outside, so I ran over and locked it. I laid down and waited for the banging to stop, but it didn’t. My cousin and her boyfriend lived down the street so I called her and she sent her boyfriend down to see what it was. \nHer boyfriend pulled right into the backyard and right up to the door into the garage. His headlights filled the garage and out ran the guy from down the street, holding a large knife. He took off running and my cousins boyfriend followed, it was at this time I called the police. \nThey came and took a statement, but said there was nothing they could do because other than going into the garage and trespassing, he didn’t actually do anything.\nI never took a walk in that neighborhood again. I still wonder how he knew what wall to bang on? How did he know I was on the other side of it? How did he know my sister was gone or that my dad was bed ridden and couldn’t do anything? I never locked the door, so had he been in my house to know? What would have happened if I would have gone outside? \nIt still gives me the creeps.\nSo, guy down the street, let’s not meet again.", "media": null, "score": 57, "upvote_ratio": 0.93, "comment_count": 11, "over_18": true}, "29": {"id": "1aba0v1", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "LunaDDLC", "link_flair_text": null, "time": 1706337879.7542312, "created_utc": 1706243969.0, "url": "https://www.reddit.com/r/threekings/comments/1aba0v1/if_i_tell_someone_about_ten_day_dream_ritual/", "title": "if I tell someone about ten day dream ritual before the tenth night will it pass to them early?", "permalink": "/r/threekings/comments/1aba0v1/if_i_tell_someone_about_ten_day_dream_ritual/", "selftext": "I just started the ten day dream ritual and I want to tell my friend about it. It’s not day ten yet so it won’t pass to her yet right?", "media": null, "score": 5, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "30": {"id": "19e8yjr", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "OkAssistance5385", "link_flair_text": null, "time": 1706337880.636186, "created_utc": 1706071690.0, "url": "https://v.redd.it/koecd592jbec1", "title": "No one in the basement yet this happens ", "permalink": "/r/Ghosts/comments/19e8yjr/no_one_in_the_basement_yet_this_happens/", "selftext": "I am away at work and my wife sends me this. She is spooked by it. The office light turns on and off then looks the camera catches some movement. I am puzzled and have no clue how the light would go on and off like that. Anyone have some type of explanation?", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/koecd592jbec1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/koecd592jbec1/DASH_96.mp4", "dash_url": "https://v.redd.it/koecd592jbec1/DASHPlaylist.mpd?a=1708929880%2CNjQ3ZWNlY2I3ZGY5ZmRiZjJkNDAzNDRkZTljODUxOTRmMWI5OWQxYjk2ZTNjOGFkMWQ3MDkwNGI0YWU0ZGMyMA%3D%3D&v=1&f=sd", "duration": 23, "hls_url": "https://v.redd.it/koecd592jbec1/HLSPlaylist.m3u8?a=1708929880%2CYzM0MWQyMWFkOGYxMTFmM2U4ZDc4YjVmYmRiN2MxYmQwYjc0ZGU1Mzg1ZjBjZmFmMTExMWEzNTQ5Zjg3MzRkZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 980, "upvote_ratio": 0.91, "comment_count": 334, "over_18": false}, "31": {"id": "1ab8hox", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "inthesafdari", "link_flair_text": "Glitch Pic", "time": 1706337881.1098464, "created_utc": 1706239132.0, "url": "https://www.reddit.com/gallery/1ab8hox", "title": "What’s in the sky?", "permalink": "/r/GlitchInTheMatrix/comments/1ab8hox/whats_in_the_sky/", "selftext": "", "media": null, "score": 295, "upvote_ratio": 0.93, "comment_count": 59, "over_18": false}, "32": {"id": "19dxiv6", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Dull-Pianist-6777", "link_flair_text": "Discussion", "time": 1706337882.4484794, "created_utc": 1706040275.0, "url": "https://noriohayakawa.wordpress.com/2024/01/23/pentagon-official-says-no-evidence-of-aliens-only-allegations-circulated-repeatedly-by-ufo-claim-advocates/", "title": "Pentagon official says \"no evidence of aliens, only allegations circulated repeatedly by UFO claim advocates\" - - January 19, 2024, SCIENTIFIC AMERICAN", "permalink": "/r/ufo/comments/19dxiv6/pentagon_official_says_no_evidence_of_aliens_only/", "selftext": "", "media": null, "score": 282, "upvote_ratio": 0.8, "comment_count": 334, "over_18": false}, "33": {"id": "19ei40t", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "indieadventurer", "link_flair_text": "Photo", "time": 1706337883.9183462, "created_utc": 1706105874.0, "url": "https://www.reddit.com/gallery/19ei40t", "title": "Unknown object over northern Manitoba", "permalink": "/r/UFOs/comments/19ei40t/unknown_object_over_northern_manitoba/", "selftext": "A colleague of mine (an airline pilot) took these photos in November or December last year, so only a couple months ago.\nI don’t have the original copies unfortunately, just the smaller versions but could probably get them.\nThese were taken from the flight deck, over Lake Winnipeg, which is in northern Manitoba, Canada.\nDetail is not great, but does anyone have an idea of what it is? It wasn’t on TCAS and ATC had no primary target iirc.", "media": null, "score": 3149, "upvote_ratio": 0.88, "comment_count": 701, "over_18": false}, "34": {"id": "19fmoyt", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "JayBringStone", "link_flair_text": "Discussion :table:", "time": 1706337886.0836697, "created_utc": 1706224303.0, "url": "https://www.reddit.com/r/aliens/comments/19fmoyt/rogans_guest_yesterday_may_have_convinced_me_this/", "title": "Rogan's Guest Yesterday May Have Convinced Me This Isn't Just Extraterrestrial", "permalink": "/r/aliens/comments/19fmoyt/rogans_guest_yesterday_may_have_convinced_me_this/", "selftext": "I'm not exactly sure why Diana Walsh Pasulka may have changed my thinking but I was very skeptical of the interdimensional theory until I listened to the show. \nMaybe it was the way she broke it all down and how well educated she is but something clicked when her and Joe were talking about higher coinciesness and that place someone can reach when they're basically in \"the zone\".\nI clicked with that because I've been in that state and understood the flow they were talking about. \nI think some of the conversation about what's happening with this being connected to AI also clicked with me.\nIt just all made more sense. Fantastic interview! If you listened, what did you think? \nAnyone else recently just coming around to the interdimensional theory after skepticism?", "media": null, "score": 1193, "upvote_ratio": 0.86, "comment_count": 551, "over_18": false}, "35": {"id": "19ew12n", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Smurphilicious", "link_flair_text": "Discussion", "time": 1706337886.7152154, "created_utc": 1706142335.0, "url": "https://twitter.com/ChrisKMellon/status/1750294265597428216", "title": "Mellon: I introduced Dr. Kirkpatrick to the former Director of the AATIP program, Lue Elizondo, as well as Dr. Eric Davis and Dr. Hal Putoff. Each of these prominent voices associated with the AATIP program spent hours briefing Dr. Kirkpatrick in a classified setting.\"", "permalink": "/r/UAP/comments/19ew12n/mellon_i_introduced_dr_kirkpatrick_to_the_former/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/ChrisKMellon/status/1750294265597428216", "author_name": "Christopher K. Mellon", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">I was astonished by one of the central claims made by Dr. Sean Kirkpatrick in his recent article in Scientific American blasting UAP &#39;conspiracists.&#39; Specifically, his claim that: &quot;As of the time of my departure, none, let me repeat, none of the conspiracy-minded &#39;whistleblowers&#39;…</p>&mdash; Christopher K. Mellon (@ChrisKMellon) <a href=\"https://twitter.com/ChrisKMellon/status/1750294265597428216?ref_src=twsrc%5Etfw\">January 24, 2024</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n", "author_url": "https://twitter.com/ChrisKMellon", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 291, "upvote_ratio": 0.98, "comment_count": 47, "over_18": false}, "36": {"id": "1abgu8l", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "maroonblood94", "link_flair_text": null, "time": 1706337887.9324183, "created_utc": 1706270783.0, "url": "https://i.redd.it/3gc7gyd2zrec1.jpeg", "title": "One of the Dallas Weather Channels posted this today.", "permalink": "/r/conspiracy/comments/1abgu8l/one_of_the_dallas_weather_channels_posted_this/", "selftext": "", "media": null, "score": 1886, "upvote_ratio": 0.91, "comment_count": 372, "over_18": false}, "37": {"id": "1abtymx", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnunnakiGod05", "link_flair_text": null, "time": 1706337888.2404058, "created_utc": 1706305786.0, "url": "https://youtu.be/9ZWCmunOrT0", "title": "Fake Alien Invasion?!? I hope not! Some pretty interesting stuff in this video. Project Blue Beam. We discuss a fake alien invasion supposedly told by Wernher Von Braun to Dr. Carol Rosin. We have Ronald Reagan speaking at the United Nations about an alien threat.", "permalink": "/r/conspiracyfact/comments/1abtymx/fake_alien_invasion_i_hope_not_some_pretty/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Fake Alien Invasion | Project Blue Beam", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/9ZWCmunOrT0?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The Fake Alien Invasion | Project Blue Beam\"></iframe>", "author_name": "What We Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/9ZWCmunOrT0/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@whatweknow"}}, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "38": {"id": "19f7ydb", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "encounter story", "time": 1706337889.2865982, "created_utc": 1706184797.0, "url": "https://i.redd.it/ozwus1udvkec1.png", "title": "Actor Jesus Payan Jr, best known for his role on Breaking Bad, once reported encountering a bigfoot while sleeping. This photo was one of the ones he posted of the creature, which he said was looking down on him from the opening of the tent.", "permalink": "/r/bigfoot/comments/19f7ydb/actor_jesus_payan_jr_best_known_for_his_role_on/", "selftext": "", "media": null, "score": 462, "upvote_ratio": 0.95, "comment_count": 217, "over_18": false}, "39": {"id": "19f5qie", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Video ", "time": 1706337889.9997678, "created_utc": 1706175882.0, "url": "https://v.redd.it/5c341q7u4kec1", "title": "The colorful Carolina parakeet was declared extinct after the last known sighting in the wild happened in 1910. In 1937 however this footage, previously lost, was taken by an unknown cameraman in the Okefenokee Swamp of Georgia. Could the species have survived decades later?", "permalink": "/r/Cryptozoology/comments/19f5qie/the_colorful_carolina_parakeet_was_declared/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/5c341q7u4kec1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/5c341q7u4kec1/DASH_96.mp4", "dash_url": "https://v.redd.it/5c341q7u4kec1/DASHPlaylist.mpd?a=1708929889%2CYTliODQwY2FiNDA5N2UwODQyZDIwNzA0Mjg1YzcxZWVlMGQ3Y2VmNjY1MmEwZjNjNzY3NjVlNTQ5OWEzZDBjNw%3D%3D&v=1&f=sd", "duration": 51, "hls_url": "https://v.redd.it/5c341q7u4kec1/HLSPlaylist.m3u8?a=1708929889%2CYjg5OGEwNjcwZGQwMGM0MDRjMjZmMDYyYWFiNWEzNzRhNjhhYTI3MmNkODI3OWNjNWVkMDM2MmY3YTZhMzUxNA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 127, "upvote_ratio": 0.99, "comment_count": 14, "over_18": false}, "40": {"id": "19cdxcr", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "ItsHellBoy", "link_flair_text": "Alien", "time": 1706337890.2357876, "created_utc": 1705871525.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/19cdxcr/in_1957_a_farmer_named_antonio_villas_boas/", "title": "In 1957, a farmer named Antonio Villas Boas claimed to have been abducted out of his field by small humanoids and to have engaged in sexual intercourse with one of his captors...", "permalink": "/r/Humanoidencounters/comments/19cdxcr/in_1957_a_farmer_named_antonio_villas_boas/", "selftext": "This is the bizarre abduction story of Antonio Villas Boas.\n​\nhttps://www.youtube.com/watch?v=lLr8beb9Y6A&t=6s", "media": null, "score": 48, "upvote_ratio": 0.94, "comment_count": 11, "over_18": false}, "41": {"id": "19dcpz5", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Idontwanttousethis", "link_flair_text": null, "time": 1706337891.0637727, "created_utc": 1705974059.0, "url": "https://i.redd.it/bq3v591rg3ec1.jpeg", "title": "Mothman!!", "permalink": "/r/cryptids/comments/19dcpz5/mothman/", "selftext": "Also a mothman shirt I'm wearing", "media": null, "score": 62, "upvote_ratio": 0.97, "comment_count": 5, "over_18": false}, "42": {"id": "19e9wkt", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "nostalgicwinters98", "link_flair_text": null, "time": 1706337891.5115461, "created_utc": 1706074945.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/19e9wkt/mid_90s_terror/", "title": "Mid 90's Terror", "permalink": "/r/LetsNotMeet/comments/19e9wkt/mid_90s_terror/", "selftext": "I grew up in the 1990s born in the late 80s.\nI remember getting my first bike and starting to explore the area I grew up in Upstate New York.\nWhere I grew is much different now in the 90s it was more rural with clusters of neighborhoods here and there. I lived near an old capped landfill, and the main road connected a lot of semis down to some factories in a neighboring town that was a 5 min bike ride. \nWe also had an old Baptist church that was founded by an ecentric former hippie who was really good to the community. My dad who was a very serious drinker loved to fish, hunt etc. with his friend because it gave him an excuse to drink and kill something.\nBut he ended up making this deal with this Pastor and the gentleman who owned a pond behind the church to stock it with fish as at the time my dad and his friends started becoming serious competitive fishers and went in on a boat which my dad had to sell his share to eventually to keep drinking. \nSo my friends and I had permission to fish there in the summer and we would swim and all that. I lived easily less than five minutes from this pond and my friends and I go out there one summer day. This was around 1995.\nMy mom had heard on the news a week prior about a wave of kidnappings I don't remember if Amber Alerts were a thing then so she decided to make a code word with me. She came to me and told if anyone ever tried to convince me that they knew my mom or dad in the hopes to get me to get in their car to ask them for a code word. Ours was pickles.\nSo fast forward to our fishing trips my friends leave before me after we sat around and actually just swam more than anything. My friend Dennis got mad because he was serious about fishing so he and his brother left and I was alone on the road as the road once you got past this farm was a straight shot to main part of town and our road was right before the road ended. \nSo I get to my road and am about to turn and I didn't notice I was being followed by a baise pickup with this Cletus looking guy from the Simpsons in it. He greets me and tells me that my mom and dad are waiting for us at this local restaurant which I knew. \nHe tells me that they asked him to come get me and meet them there so we can all have dinner. Immediately thought of what my mom said and I started getting this evil feeling like I was in danger. So I told him that my parents specifically have a password that they give their friends. \nAnd that if he was their friend he was required to tell me, at which point he got mad and started swearing at me I didn't see one but I was certain he had a gun as he started fumbling in the truck. \nI turned and started peddling down my road screaming for help and that I was in danger. He jerked his truck to follow but I was making too much noise and was already to my house that he just took off. \nWhen I got home my mom was home and I was hysterical and asked her why she would ask such a mean friend to pick me up. And I told her what happened and she didn't believe me and she calmed me down told me I did the right thing but could tell she had a hard time believing me. She also grew up in same town and nothing like that had happened to her \nA few days later a friend of hers tell her a similar story about her son on another part of our town. The police then were involved and the cops came and talked to me and I gave them the same description of the man, truck what had happened, etc. \nIdk if the guy was ever caught I used to be very bitter at my mom for not believing me but I now understand the confusion she had and instead of reacting she just tried to console me and keep an eye on everything. My dad on the other hand was more vigilant about it and would ask me all the time when he'd take me out if someone looked like that guy it of a truck looked the same as the one I saw. \nI hope no other kids were harmed by him.", "media": null, "score": 51, "upvote_ratio": 0.97, "comment_count": 7, "over_18": true}, "43": {"id": "19e4i21", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "troughuhweight", "link_flair_text": "Is this undeniable evidence?", "time": 1706337892.8190901, "created_utc": 1706058295.0, "url": "https://v.redd.it/w9wyvhxueaec1", "title": "My son and my best friend’s daughter talked to someone in the corner of the dining room Part 2 with video", "permalink": "/r/Ghosts/comments/19e4i21/my_son_and_my_best_friends_daughter_talked_to/", "selftext": "Keep in mind you can see a few cars reflections move past at 2-3 points in the video. They talked for a solid 10 minutes. And I managed to record this video and one other that was about 45 seconds long. She screams “MAMI” right towards the end. And to me personally, I hear the word ghost. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/w9wyvhxueaec1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/w9wyvhxueaec1/DASH_96.mp4", "dash_url": "https://v.redd.it/w9wyvhxueaec1/DASHPlaylist.mpd?a=1708929892%2CNDNkYzc3MjYxM2U5ZDEzOTJmNDhmYjAxY2U0ZmVlODA4Y2JlYjVhMzI1ZTQxMDE0ZDZiMTk5YTZlNzVmNWJiYw%3D%3D&v=1&f=sd", "duration": 74, "hls_url": "https://v.redd.it/w9wyvhxueaec1/HLSPlaylist.m3u8?a=1708929892%2COWVlNjdjNWExZjAwMDllYmE3ODU4NDRkMTVhNDRjZTUyOWNkZjVkMjBmMzI5YzJjYzRlNmQ1OWZhMmFiYzY2NA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 735, "upvote_ratio": 0.81, "comment_count": 200, "over_18": false}, "44": {"id": "19caic2", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ShehrozeAkbar", "link_flair_text": "Glitch Vid", "time": 1706337893.3025305, "created_utc": 1705862981.0, "url": "https://v.redd.it/sodglpagaudc1", "title": "When your basement guest gets free of the chains", "permalink": "/r/GlitchInTheMatrix/comments/19caic2/when_your_basement_guest_gets_free_of_the_chains/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/sodglpagaudc1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 446, "scrubber_media_url": "https://v.redd.it/sodglpagaudc1/DASH_96.mp4", "dash_url": "https://v.redd.it/sodglpagaudc1/DASHPlaylist.mpd?a=1708929893%2CYmJmODE2ZTg2MTZlMWI3MGI0MmViNmZkMmM0NTc5YzBkNWJiMTNjMTg1Y2ZlNWRkNjg5YjQ4ZTFkNzNlYzI4MQ%3D%3D&v=1&f=sd", "duration": 15, "hls_url": "https://v.redd.it/sodglpagaudc1/HLSPlaylist.m3u8?a=1708929893%2CMzYzYWM1NTY0ZjBiMDQ4MjM3ZmIwMTM5NWViOTA2YjAyZDIxZDlmNWI0Nzk5MzAzODgxMjFhYTQxZmZiMjEyOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 109, "upvote_ratio": 0.83, "comment_count": 21, "over_18": false}, "45": {"id": "19fm89e", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "brats699", "link_flair_text": "Interview Notes", "time": 1706337894.6844757, "created_utc": 1706223083.0, "url": "https://www.howandwhys.com/us-congressmen-claim-bible-has-pretty-clear-evidence-of-ufos-vatican-knows-aliens-are-here/?fromredditUFO1", "title": "US Congressmen Tim Burchett and Eric Burlison claim the Bible has 'pretty clear' evidence of UFOs. David Grusch already told us that UAP phenomena are ancient, whereas Dan Sheehan claims the Vatican knows aliens are here.", "permalink": "/r/ufo/comments/19fm89e/us_congressmen_tim_burchett_and_eric_burlison/", "selftext": "", "media": null, "score": 277, "upvote_ratio": 0.84, "comment_count": 124, "over_18": false}, "46": {"id": "19drzab", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Skytrash_throwaway", "link_flair_text": "Starlink", "time": 1706337896.237501, "created_utc": 1706026422.0, "url": "https://www.reddit.com/r/UFOs/comments/19drzab/im_an_airline_pilot_and_i_saw_the_lights_on/", "title": "I’m an airline pilot and I saw “the lights” on January 19, 2024", "permalink": "/r/UFOs/comments/19drzab/im_an_airline_pilot_and_i_saw_the_lights_on/", "selftext": "Throwaway for obvious reasons.\nLast Friday on January 19th 2024 I finally saw “the lights” that have been reported multiple times by pilots on this sub and elsewhere in the news the last year or so. I was operating a commercial flight over the midwestern US and after hearing pilots discussing the lights on 121.5, I looked to the west and saw them too! While my sighting is not unique, I wanted to share my experience/observation for the sake of creating an additional data point to help reach an understanding of what this phenomenon is.\nMy sighting took place between 0214Z and 0245Z; 0914pm-0945pm eastern time while flying over Ohio and Indiana. We were at an altitude in the mid-FL300s heading west. The lights were observed at  about a 260 degree heading, roughly 1-5 degrees above the horizon. During the 31 minutes I was able to see the lights, I probably saw 6-7 sequences of light(s) appear and fade out.  \nI could hear pilots talking about their observations and theories about the nature of these lights on the emergency frequency 121.5. (LiveATC Recording - chatter starts at 20m50s) “Starlink” was mentioned by more than one pilot as an explanation for what we were observing. (I’m curious how they were able to know it was a branded Starlink and not any of the thousands of other Satellites in orbit.) I admit, I know next to nothing about the orbit patterns of satellites and the optics of reflected sunshine. However, in my 15 years of flying, I have never observed satellites behaving as these lights did.  Some sequences of lights came in pairs, others by themselves. The lights always began as a tiny point of light and increased to a peak luminosity of about the same as Planet Venus. From my vantage, I observed the lights moving in random trajectories. The lights' trajectories were inconsistent with the typical linear movement one typically observes when looking at a satellite passing overhead. These lights moved in arcs, curves, reversals in path and squiggle motions. On one sequence, I observed a singular light appear, rise up from the horizon at a speed I would estimate 3-5 times what would be normally observed when viewing a satellite passing overhead and then move in a cursive “u” pattern before then rising further away from the hoizon, moving again in the cursive “u” path, and then rising further up above the horizon before fading out. The speed at which the moved also apparent seemed to accelerate and decelerate. I have always observed satellites presenting themselves at the same luminosity as background stars (much dimmer than Venus or Jupiter) and moving in a straight linear path, crossing the sky at a speed I’ll call SU1 (Satellite Unit = 1). These lights were about the same brightness as Venus but moved at a speed I would “eyeball” to be three times SU1. Remember, I’m seeing these lights just above the horizon, and not passing overhead. I’m not going to do the math here, but considering that parallax, the movement of these lights on the horizon would be considerably faster than three times SU1. \nI did not see any “Race Track” patterns which have been reported before. \nI heard a female voice talking on 121.5, reporting to other pilots on guard that the lights she was observing were presenting at about at a 300 degree heading NW from Little Rock – the VOR I assume (25m20s in recording linked below). From our position over Ohio/Indiana we were viewing the lights at a 260 degree heading. Assuming we were seeing the same lights, our lines-of-sight would have been intersecting somewhere over Western Kansas, about 900 miles west of our position. \nBecause these lights were presenting themselves approximately over the spot on the horizon where the sun had set 3 hours earlier, I’m inclined to assume the source of the light I was seeing was the sun, reflecting off the object/satellite. I scanned the rest of the visible horizon from about 060-300 degrees during the 31 minutes we saw the lights and I didn’t see any other lights anywhere else in the sky, they were only in the 260-265 degree area of the sky, smack over where the sun had set hours prior. \nBut dammit if their random movement, fluctuations in velocity -- at times reaching speeds I’ve never observed didn’t confuse the hell out of me. Didn’t look like anything I’d ever seen before in over two decades of flying. \nThanks for reading and I’m happy to answer any questions regarding the lights. \nHere’s a link to the archived Emergency Frequency 121.5 recorded near the Memphis, TN area. Skip to 20m50s to start hearing bits and pieces of pilot conversation concerning the lights. \nhttps://archive.liveatc.net/kmem/KMEM2-Guard-Jan-20-2024-0200Z.mp3", "media": null, "score": 2179, "upvote_ratio": 0.92, "comment_count": 345, "over_18": false}, "47": {"id": "19cloz6", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Grey-Hat111", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1706337898.3071969, "created_utc": 1705892900.0, "url": "https://www.reddit.com/gallery/19cloz6", "title": "I asked ChatGPT to \"show me what the world would look like if the government didnt lie to us about UFOs and Aliens\"", "permalink": "/r/aliens/comments/19cloz6/i_asked_chatgpt_to_show_me_what_the_world_would/", "selftext": "", "media": null, "score": 1142, "upvote_ratio": 0.87, "comment_count": 313, "over_18": true}, "48": {"id": "19fni4d", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Discussion", "time": 1706337898.9134727, "created_utc": 1706226509.0, "url": "https://i.redd.it/e3mtp10eboec1.jpeg", "title": "Americans for Safe Aerospace has put out a statement regarding the unclassified UAP DoD OIG report:", "permalink": "/r/UAP/comments/19fni4d/americans_for_safe_aerospace_has_put_out_a/", "selftext": "", "media": null, "score": 172, "upvote_ratio": 0.99, "comment_count": 3, "over_18": false}, "49": {"id": "19cgto7", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "SuspiciousWarning184", "link_flair_text": null, "time": 1706337900.5229888, "created_utc": 1705878824.0, "url": "https://i.redd.it/hblehtmklvdc1.jpeg", "title": "Let us not forget Tiffany Dover, the nurse who collapsed on camera immediately after getting the clot shot and then disappeared without a trace", "permalink": "/r/conspiracy/comments/19cgto7/let_us_not_forget_tiffany_dover_the_nurse_who/", "selftext": "", "media": null, "score": 1876, "upvote_ratio": 0.75, "comment_count": 643, "over_18": false}, "50": {"id": "19fklm7", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnunnakiGod05", "link_flair_text": null, "time": 1706337900.9176366, "created_utc": 1706218753.0, "url": "https://youtu.be/VP3VkqekuSI", "title": "For millennia the true story of our origins has been hidden and smothered by tons of stone rubble, hardened mud and dust. We've been wandering the Earth blindfolded by the oblivion of the past and resigned to history textbooks from which we learn very little about what really happened in this planet", "permalink": "/r/conspiracyfact/comments/19fklm7/for_millennia_the_true_story_of_our_origins_has/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Anunnaki Gods in Exile, Are They Here? When will they ALL return, Sumerian Secrets Revealed", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/VP3VkqekuSI?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Anunnaki Gods in Exile, Are They Here? When will they ALL return, Sumerian Secrets Revealed\"></iframe>", "author_name": "What We Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/VP3VkqekuSI/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@whatweknow"}}, "score": 2, "upvote_ratio": 0.67, "comment_count": 0, "over_18": false}, "51": {"id": "1ab9n49", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Extra-Dimension-276", "link_flair_text": "New Brunswick Roar", "time": 1706337901.908162, "created_utc": 1706242706.0, "url": "https://v.redd.it/kev1l252npec1", "title": "New Brunswick roar update", "permalink": "/r/bigfoot/comments/1ab9n49/new_brunswick_roar_update/", "selftext": "Honestly, I thought you guys would think I am crazy or some fool for posting my experience, my family laughs at me and seems to think I'm crazy when I bring up the possibility of the sound being a sasquatch. Here is the other, shorter clip I recorded after the initial video, before I high tailed it out of there. I was hesitant to post this or even keep talking about what I saw at all because I don't want it to damage my reputation or people think I'm a liar or not all there. I don't know what this is, and I don't claim to. Im just sharing what I witnessed because I know you guys think it is interesting. ", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/kev1l252npec1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/kev1l252npec1/DASH_96.mp4", "dash_url": "https://v.redd.it/kev1l252npec1/DASHPlaylist.mpd?a=1708929901%2CNGFkYWJkYzY5OGJhNGNiZjYyZDU2MTg4ZTRjYmRmYWFkZDBkMmEwM2RlNTU5ZjYwY2RiOWU3OWU4NTc2ZDBkOQ%3D%3D&v=1&f=sd", "duration": 7, "hls_url": "https://v.redd.it/kev1l252npec1/HLSPlaylist.m3u8?a=1708929901%2CODNlYWQ0NDQ3OTQyYTc4YjY0ZDZhODJiOWZiNjQ2MDZiZmUyNmJjMTNlZjQ5ODM0OWIxYjBkZjk2OTkxMDg2MQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 390, "upvote_ratio": 0.95, "comment_count": 141, "over_18": false}, "52": {"id": "19d2wty", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lost Media and Evidence ", "time": 1706337902.642772, "created_utc": 1705949015.0, "url": "https://i.redd.it/rczcw37ae1ec1.jpeg", "title": "A forestry worker told South American cryptozoologist Peter Hocking that he heard of a botanist taking a photo of an unidentified black upright ape back in 1985. The botanist was collecting flowers when he snapped the photo as it moved towards him, but the photo is now lost.", "permalink": "/r/Cryptozoology/comments/19d2wty/a_forestry_worker_told_south_american/", "selftext": "", "media": null, "score": 122, "upvote_ratio": 0.94, "comment_count": 19, "over_18": false}, "53": {"id": "19eqf1f", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "ItsHellBoy", "link_flair_text": "Alien", "time": 1706337902.9063632, "created_utc": 1706128202.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/19eqf1f/in_1996_a_short_humanoid_being_with_oily_grey/", "title": "In 1996, a short humanoid being with oily grey skin and 3 knob like protrusions on its head was allegedly captured by military police in Varginha, Brazil.", "permalink": "/r/Humanoidencounters/comments/19eqf1f/in_1996_a_short_humanoid_being_with_oily_grey/", "selftext": "The story begins with multiple witnesses seeing a cigar-shaped craft with a trail of smoke streaking across the sky followed by a crash landing... The following days consisted of sightings of the possible pilots of the craft, short oily grey humanoids with large red eyes and knobs on their heads.  This is the crazy story of Brazil's Roswell aka The Varginha Incident.\nhttps://www.youtube.com/watch?v=2okFaHykLkQ", "media": null, "score": 20, "upvote_ratio": 0.83, "comment_count": 7, "over_18": false}, "54": {"id": "19d22m6", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Savings_Show_7908", "link_flair_text": null, "time": 1706337903.656727, "created_utc": 1705947005.0, "url": "https://i.redd.it/ium9f9oa81ec1.jpeg", "title": "Wendigo art", "permalink": "/r/cryptids/comments/19d22m6/wendigo_art/", "selftext": "", "media": null, "score": 60, "upvote_ratio": 0.81, "comment_count": 38, "over_18": false}, "55": {"id": "1abyx56", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Leafs-DoBetter", "link_flair_text": null, "time": 1706337904.0692945, "created_utc": 1706319046.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1abyx56/a_near_home_invasion_while_staying_alone/", "title": "A near home invasion while staying alone.", "permalink": "/r/LetsNotMeet/comments/1abyx56/a_near_home_invasion_while_staying_alone/", "selftext": "(21F) I don’t know how long this will be. It took me about four days to be able to actually type this out. Got weird mini anxiety attacks when I tried. I’ll be the first to admit that I have(had) a very “can’t happen to me” complex, and that’s kind of what occurred in this story.\nI’m a university student, and live in a rental house with five other people. It is farrrrr from ideal, but in this housing outcry that we’re living in, It takes that sting off of us having to pay a bunch of money a month to exist in a box. This has relevancy, I swear.\nI got extremely lucky last weekend when the five of the roommates I had were all out for the weekend. This has never happened, so I was ecstatic to have the house to myself. I did the whole 21 year old girl home alone stuff you can think of; watching movies with the volume loud,  taking long ass showers, walking around the house without a bra etc etc.\nIt was around 10 PM, I had finished some homework and was relaxing with a glass of wine and watching some streaming services. It sounded briefly like there was something moving on the porch. We’ve had a fox in our yard before, and the thing used to make a lot of noise on our porch, so I assumed that to be the case.\nAfter hearing some fumbling the second time, I went over to check through the window. There was nothing there. As I’m turning to head back to the living room, a piece of cement flies through our kitchen window (I didn’t know it was cement at the time, but not important).\nI think I peed myself a little bit when it happened, but I definitely screamed like a little girl. My moronic ass started unlocking the door to go outside, but common sense seized control of me again, and I locked the door back. I also ran to the back door to make sure it was still locked, even though it’s glass and wouldn’t make a difference.\nOddly enough, at this time, my grandma’s words came into my head about something her own mother had told her.\n“If someone tries breaking into your house, turn the lights off. You know the inside of your house better than they do.”\nI shut the lights off in the living room and managed to turn the TV off, which was hard because my hands were shaking. My dad used to give me and my siblings advice on protection measures, which were not resonating at this time.\nI secured myself in my upstairs bedroom (roast me if you want) and had turned all of the lights out in the house as I passed them. While walking up the stairs I could hear the door knob shaking furiously from the front door. Don’t know if there was more than one person, or if they realized they couldn’t jump the fence to get into the back yard.\nWhile calling for emergency services on speaker, I secured my hunting knife to the end of my hockey stick with hot pink duct tape (I know that’s probably one of the most Canadian things I could say). If I was going to have to use it, at least it would look fabulous.\nI stayed in the dark holding my makeshift spear for what was probably about fifteen minutes. I’m really glad I wasn’t being murdered in that amount of time.\nThe operator told me police were coming, which they eventually did. Took a very unsettling amount of time. The only reason I left the bedroom in the first place was because I heard knocking on the door downstairs, and the police lights were flashing through the window. Otherwise, someone would have had to come in and physically pull me out the room.\nStatement was given, but that’s all they did. Literally all they did. Literally. Literally all they did.  Nothing else. Literally that.\nA very nice female officer stayed with me in the house and helped me clean up the glass until my brother showed up to bring me to his place for the rest of the weekend. So shout out to Officer Cutie with the tattoos!\nI made an appointment with a Doctor to get out on anxiety medicine, as well as medicine for nightmares. I know I wasn’t in any physical danger (at that point), but I’ve had some very charming dreams about similar scenarios, and I was just finding it easier to stay awake. Maybe that’s juvenile of me, but I’m human.\nMeds are working fine, and I’m back at my house, with wall to wall people again. And honestly, I don’t hate that so much anymore.\nPlease have a fun, safe weekend!", "media": null, "score": 18, "upvote_ratio": 0.91, "comment_count": 1, "over_18": true}, "56": {"id": "1abr751", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "AliceInChainsFrk", "link_flair_text": "Paranormal Community [Discussion]", "time": 1706337905.2969785, "created_utc": 1706298769.0, "url": "https://i.redd.it/5pm2gv7aauec1.jpeg", "title": "Have any of you felt this way? I guess it could be worse…", "permalink": "/r/Ghosts/comments/1abr751/have_any_of_you_felt_this_way_i_guess_it_could_be/", "selftext": "", "media": null, "score": 482, "upvote_ratio": 0.98, "comment_count": 29, "over_18": false}, "57": {"id": "19fkb8g", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "AmEv", "link_flair_text": "Glitch Pic", "time": 1706337905.715568, "created_utc": 1706217900.0, "url": "https://i.redd.it/gn8342ollnec1.jpeg", "title": "[meta] Can we agree that posting \"fleet\" vehicles is not a \"glitch\"? Personally annoyed with that trend.", "permalink": "/r/GlitchInTheMatrix/comments/19fkb8g/meta_can_we_agree_that_posting_fleet_vehicles_is/", "selftext": "", "media": null, "score": 74, "upvote_ratio": 0.98, "comment_count": 8, "over_18": false}, "58": {"id": "19d3hiv", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "TrashyMcTrashBoat", "link_flair_text": "Mainstream Media", "time": 1706337907.5409384, "created_utc": 1705950449.0, "url": "https://www.vice.com/en/article/wxjydq/former-pentagon-ufo-investigator-is-pissed-because-congress-believes-in-conspiracy-theories", "title": "Former Pentagon UFO Investigator Is Pissed Because Congress Believes In Conspiracy Theories", "permalink": "/r/ufo/comments/19d3hiv/former_pentagon_ufo_investigator_is_pissed/", "selftext": "", "media": null, "score": 264, "upvote_ratio": 0.89, "comment_count": 172, "over_18": false}, "59": {"id": "19fhhgk", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Strange-Owl-2097", "link_flair_text": "Video", "time": 1706337908.8527822, "created_utc": 1706210743.0, "url": "https://v.redd.it/pplr3lte0nec1", "title": "2016 Cube within a sphere? Only visible on infrared", "permalink": "/r/UFOs/comments/19fhhgk/2016_cube_within_a_sphere_only_visible_on_infrared/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/pplr3lte0nec1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/pplr3lte0nec1/DASH_96.mp4", "dash_url": "https://v.redd.it/pplr3lte0nec1/DASHPlaylist.mpd?a=1708929907%2CYTgyNTcwZjQwOGZhYTBkOGYyMWI3NWVlNzlmNTczY2NmMmUxZjgyYTIyMDkxYzhjOWE3Y2UwMWIxZDFjMTQzMA%3D%3D&v=1&f=sd", "duration": 145, "hls_url": "https://v.redd.it/pplr3lte0nec1/HLSPlaylist.m3u8?a=1708929907%2CYzk3MWMzZDVlNmE1MTI0OTExYzAxZmQ5NTVjODcwMWUxMzg5MjgwZmYxNDk2NjQ4OWNmYzkxN2RjNGMwNmM2OQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2033, "upvote_ratio": 0.92, "comment_count": 423, "over_18": false}, "60": {"id": "19epo9f", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "littlespacemochi", "link_flair_text": "Discussion :table:", "time": 1706337910.6777828, "created_utc": 1706126402.0, "url": "https://v.redd.it/06x6lohq1gec1", "title": "Diana Walsh Pasulka believes some UAP are interdimensional", "permalink": "/r/aliens/comments/19epo9f/diana_walsh_pasulka_believes_some_uap_are/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/06x6lohq1gec1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 470, "width": 854, "scrubber_media_url": "https://v.redd.it/06x6lohq1gec1/DASH_96.mp4", "dash_url": "https://v.redd.it/06x6lohq1gec1/DASHPlaylist.mpd?a=1708929909%2CMDc1Y2E2ZGVkMzVkMjE3Y2U1MzY2ZGVjMmM3OTYzOGM3MDhlMjY3NDNhMjc3Y2MyNTRkYmM1ZDU3YTFiZjUyNg%3D%3D&v=1&f=sd", "duration": 586, "hls_url": "https://v.redd.it/06x6lohq1gec1/HLSPlaylist.m3u8?a=1708929909%2CZTJjYmVmNTlmZGE4ZjZlYzVkYzgwMjUwNGNmNTlmY2U0M2RmZWE1ZWU2MzBjNWJhMDE3MGQ0ZjI2NTY1OTYxYQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1121, "upvote_ratio": 0.9, "comment_count": 314, "over_18": false}, "61": {"id": "19fikzj", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "News", "time": 1706337911.4711711, "created_utc": 1706213528.0, "url": "https://www.dodig.mil/In-the-Spotlight/Article/3656428/press-release-evaluation-of-the-dods-actions-regarding-unidentified-anomalous-p/", "title": "Press Release: Evaluation of the DoD’s Actions Regarding Unidentified Anomalous Phenomena (DODIG-2023-109); Department of Defense Office of Inspector General.", "permalink": "/r/UAP/comments/19fikzj/press_release_evaluation_of_the_dods_actions/", "selftext": "", "media": null, "score": 141, "upvote_ratio": 0.99, "comment_count": 20, "over_18": false}, "62": {"id": "19et1nd", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Stimul8ed", "link_flair_text": null, "time": 1706337912.757546, "created_utc": 1706134659.0, "url": "https://i.redd.it/v6vue9fupgec1.jpeg", "title": "Texas is not backing down! Governor Abbot just released a letter explaining why Biden is violating the constitution. Texas is officially challenging the United States governments unconstitutional actions.", "permalink": "/r/conspiracy/comments/19et1nd/texas_is_not_backing_down_governor_abbot_just/", "selftext": "", "media": null, "score": 1862, "upvote_ratio": 0.79, "comment_count": 998, "over_18": false}, "63": {"id": "1ac147q", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Anthoyne_B", "link_flair_text": null, "time": 1706337913.0762181, "created_utc": 1706325710.0, "url": "/r/BallEarthThatSpins/comments/19fmazj/a_model_frequently_used_is_that_of_a_flat/", "title": "\"A model frequently used is that of a flat, nonrotating earth.\"", "permalink": "/r/conspiracyfact/comments/1ac147q/a_model_frequently_used_is_that_of_a_flat/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "64": {"id": "19ck03n", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Emptynuggets1987", "link_flair_text": null, "time": 1706337914.5661054, "created_utc": 1705887734.0, "url": "https://v.redd.it/84byge02cwdc1", "title": "Compelling video I saw on  YouTube ", "permalink": "/r/bigfoot/comments/19ck03n/compelling_video_i_saw_on_youtube/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/84byge02cwdc1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1440, "scrubber_media_url": "https://v.redd.it/84byge02cwdc1/DASH_96.mp4", "dash_url": "https://v.redd.it/84byge02cwdc1/DASHPlaylist.mpd?a=1708929913%2CMmVhYTE4M2MyMjJiMTFlOTBkYjY0MmY0NWUzOTA2NDc1MjlmMTIxNWJjY2YzZWQzMDQwYmYxZDQzNWMyYWRmYw%3D%3D&v=1&f=sd", "duration": 6, "hls_url": "https://v.redd.it/84byge02cwdc1/HLSPlaylist.m3u8?a=1708929913%2CYzZjYWZhMWUxOTU2NzgyODY0YjQ2ZGJlYjE1MjExYTk4NDU2NTVkNmU5MWM5OWRkZGNmYjc3ZTBiMjViOGM0MQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 120, "upvote_ratio": 0.73, "comment_count": 67, "over_18": false}, "65": {"id": "19fj1z8", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Art", "time": 1706337915.2687824, "created_utc": 1706214714.0, "url": "https://i.redd.it/w1r2yftbcnec1.png", "title": "Made an iceberg of cryptid evidence (photos, videos, audio recordings, and physical evidence). Very much a work in progress so suggestions (and of course, questions) are very much welcome!", "permalink": "/r/Cryptozoology/comments/19fj1z8/made_an_iceberg_of_cryptid_evidence_photos_videos/", "selftext": "", "media": null, "score": 107, "upvote_ratio": 0.97, "comment_count": 41, "over_18": false}, "66": {"id": "1abs8ig", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "AmericanIdiot420", "link_flair_text": "Unsolved", "time": 1706337915.5281167, "created_utc": 1706301393.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1abs8ig/i_saw_a_man_made_of_light_on_a_night_when_my/", "title": "I saw a man made of light on a night when my entire family thought someone had broken into the house", "permalink": "/r/Humanoidencounters/comments/1abs8ig/i_saw_a_man_made_of_light_on_a_night_when_my/", "selftext": "When I was a teenager, I went on a vacation with my extended family. This was around 2008, back in Punjab, Pakistan (where I'm originally from). We're a very tight knit group, so I had my father, mother, sibling, uncles, aunts, cousins and some of their families, etc. It was a big group of people and we were staying at my late grandfather's giant wooden house in our remote village. The place is surrounded by trees and rivers, and everything else (markets, shops, other people) are pretty far away.\nAnyway, all of us somehow managed to fit in this house, so around 20+ people sleeping in 7-8 rooms. I was sleeping with my father in a long horizontal room at the front of the house. The room had two beds, one on each side, and a central walkway that penetrated the room vertically in the middle. This walkway was basically the entrance to the main part of the house.\nSo the actual sighting was pretty short. We were all sleeping, but I suddenly woke up (maybe a few hours after midnight). I'm usually a heavy sleeper, so there must have been noise from within the house, but I don't remember hearing anything. I was still half-asleep, but I could sense there was some type of unrest in the house. I looked to my right towards the walkway and saw a man. I don't know if it was a man or not, but this man-shaped thing was standing there, maybe slightly moving. He looked to be around average height and build, but he was entirely made of light. Like I still remember that he was just light, but man-shaped and moving. The next part is a bit embarrassing for me, but I actually just went back to sleep immediately afterwards. I did not get up to check, I did not feel like I had to - I just saw him and fell asleep.\nNext morning, I start my day without even thinking about what happened yesterday. I just assumed that I had a dream about this man made of light. Imagine my shock when I learned that literally everyone in the house were convinced that someone had broken in yesterday night. I asked for details and I learned that every adult in the house woke up for some reason (maybe noise, maybe something else, this part is still unclear to us) and they convened and came to a conclusion that someone had broken in. Obviously they were scared because burglaries are common in that area. However, it was a big group and they apparently decided to search the entire house. And by search, I mean really search every nook and corner - under the beds, old cupboards, storage, upstairs, downstairs, everything. They apparently did this for an hour or more, and my father said that they did not leave one single place unturned. My father grew up in this house, so he knows it very well (along with my uncles). The result of the search expedition: they did not find anything! They were thoroughly convinced that there was something in the house, but nobody could find anything. Of course, I  immediately told them my story and they all believed it. Everything was too weird to be a big coincidence. Anyway, we all sort of moved on and went on with our lives after the vacation ended.\nThe most surprising thing to me, even to this day, is that I was not scared of what I saw. I distinctly remember how I felt when I saw this light-man, and fear was not what I was feeling. In fact, I wasn't feeling anything. I felt like he was where he needed to be.", "media": null, "score": 13, "upvote_ratio": 0.89, "comment_count": 8, "over_18": false}, "67": {"id": "1ab84z6", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "BugsAreWeird", "link_flair_text": null, "time": 1706337916.6394737, "created_utc": 1706238101.0, "url": "https://i.redd.it/3qmozbxv9pec1.jpeg", "title": "Picture with the man himself while at the mothman festival a couple months ago", "permalink": "/r/cryptids/comments/1ab84z6/picture_with_the_man_himself_while_at_the_mothman/", "selftext": "The trip was super fun, might make it an annual thing with some other festivals too", "media": null, "score": 55, "upvote_ratio": 0.91, "comment_count": 8, "over_18": false}, "68": {"id": "19d26pa", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "codykoala1", "link_flair_text": "Personal Encounter ", "time": 1706337918.2794852, "created_utc": 1705947275.0, "url": "https://www.reddit.com/r/Ghosts/comments/19d26pa/i_know_what_i_saw_and_it_haunts_me_to_this_day/", "title": "I know what I saw and it haunts me to this day", "permalink": "/r/Ghosts/comments/19d26pa/i_know_what_i_saw_and_it_haunts_me_to_this_day/", "selftext": "I was 17 years old. The “cool thing” to do at the time was go to the Embreeville Asylum in Chester County to explore. For back story, the asylum was abandoned since the 1980s. At one point it was a mental institution, then it was an elementary school, then a hospital, then a home for the mentally unwell. The asylum consists of 10-12 buildings each the size of an elementary school all of them dilapidated. There is an unmarked cemetery across the street with numbers for all the graves but no names. I went with a group of about eight people at about 10PM. We went into several of the closer buildings and they were creepy but nothing out of the ordinary. We proceeded to what we referred to as the “main asylum” building (it was the biggest and the original building). This one gave me the creeps. There were gurneys in the hallways, things were scattered everywhere, and it just had a cold vibe to it. We started moving through the building and found our way to a stairwell. I took the lead position and got walking. My buddy and I made our way to the fourth floor and realized the others were not behind us. We went on ahead anyway. We approached a hallway intersection where to the left and right of us were large “day room” type rooms that had hallways that led to open rooms that widened as you entered. Before I turned the corner my buddy asked me if I said something to which I responded “No”. He told me he swore he heard something. At this point I turned the corner and pointed my flashlight toward the day room. In clear view I saw SOMETHING cross left to right inside the threshold of the door. It had the figure of a person but with a light directly on it, it had no pigment. It was like the absence of color or light. Blacker than the night outside. It had dimensions to it. No legs. Human shaped. I turned tail and ran. I never again went back at night. I left feeling cold and terrified. It has stuck with me since that day. I think about it a lot.", "media": null, "score": 294, "upvote_ratio": 0.9, "comment_count": 68, "over_18": false}, "69": {"id": "19df0va", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "VirusZer0", "link_flair_text": "Glitch Vid", "time": 1706337918.7127745, "created_utc": 1705980978.0, "url": "https://v.redd.it/cdhyj55km3ec1", "title": "Sky bug", "permalink": "/r/GlitchInTheMatrix/comments/19df0va/sky_bug/", "selftext": "", "media": null, "score": 64, "upvote_ratio": 0.84, "comment_count": 14, "over_18": false}}}