{"_default": {"1": {"id": "1elkk63", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "No_System_2777", "link_flair_text": "Discussion", "time": 1723258012.1328356, "created_utc": 1722957709.0, "url": "https://i.redd.it/tpyb853v92hd1.jpeg", "title": "Imagine if aliens make contact and show us photos of ancient humans and civilizations", "permalink": "/r/ufo/comments/1elkk63/imagine_if_aliens_make_contact_and_show_us_photos/", "selftext": "That would be insane and incredibly helpful to humans understanding our history ", "media": null, "score": 1716, "upvote_ratio": 0.96, "comment_count": 403, "over_18": false}, "2": {"id": "1ejuj5f", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "Photo", "time": 1723258013.588949, "created_utc": 1722775947.0, "url": "https://i.redd.it/j00gtdec9ngd1.png", "title": "These are the four politicians who blocked UFO disclosure last year and will attempt to block it again this year. From left to right - Mike Turner, Mike Rogers, Mike Johnson and Jim Himes. ", "permalink": "/r/UFOs/comments/1ejuj5f/these_are_the_four_politicians_who_blocked_ufo/", "selftext": "", "media": null, "score": 3761, "upvote_ratio": 0.89, "comment_count": 619, "over_18": false}, "3": {"id": "1ek01eg", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "BuletinTerlambat", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1723258015.2368588, "created_utc": 1722790796.0, "url": "https://v.redd.it/drbwepnihogd1", "title": "Clearest pilot encounter ", "permalink": "/r/aliens/comments/1ek01eg/clearest_pilot_encounter/", "selftext": "Sizing up each other", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/drbwepnihogd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 382, "scrubber_media_url": "https://v.redd.it/drbwepnihogd1/DASH_96.mp4", "dash_url": "https://v.redd.it/drbwepnihogd1/DASHPlaylist.mpd?a=1725850014%2CMTRjYjYwY2FlNjFkMWQ0NWM2NjE2ZDA0MjJlNzllMzNkOTFkMjU2MjE0NGFlMjY1ZTJkMjE2Nzc5ODNiN2IyZg%3D%3D&v=1&f=sd", "duration": 16, "hls_url": "https://v.redd.it/drbwepnihogd1/HLSPlaylist.m3u8?a=1725850014%2CZmJhNjBmNWVmZWM1ZDAwZjg4NDg2ZGU1ZWEwMzliN2JhZjc0YWFlYzI4Yzk3OTcyZTY0MjU0YzMwM2NjMjEwYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 8579, "upvote_ratio": 0.85, "comment_count": 593, "over_18": false}, "4": {"id": "1ekxqhg", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "disclosurediaries", "link_flair_text": "Reference", "time": 1723258015.4567919, "created_utc": 1722888509.0, "url": "https://www.reddit.com/r/UAP/comments/1ekxqhg/all_the_relevant_uap_updates_from_july_29_aug_4/", "title": "All the relevant UAP updates from July 29 - Aug 4", "permalink": "/r/UAP/comments/1ekxqhg/all_the_relevant_uap_updates_from_july_29_aug_4/", "selftext": "This past week in Disclosure:\nJuly 30 – National Whistleblower Day\nNational Whistleblower Day is a day where the bravery of whistleblowers across the United States and the historic contributions they have made to society, democracy, and to anticorruption efforts across the globe are celebrated. \nNational Whistleblower Day commemorates the United State's first whistleblower law, which was unanimously signed into law during the height of the American Revolution on July 30th, 1778.\nJuly 31 – Sens. Rubio and Warner file revised UAP-related language to be included in the FY25 IAA\nAs covered by D. Johnson – Senators Mark Warner (D-VA) and Marco Rubio (R-FL), respectively the chairman and ranking Republican on the Senate Select Committee on Intelligence (SSCI), filed a revised version of the Fiscal Year 2025 Intelligence Authorization Act (IAA), including revised UAP-related language.\nAug 1 – Sen. Heinrich is added as a co-sponsor to the UAP Disclosure Act legislation\nJoining the likes of Sens. Gillibrand, Rounds and Schumer – Senate Intel Committee member Sen. Martin Heinrich (D-NM) has become a co-sponsor of the Rounds-Schumer UAP Disclosure Act of 2024.\nNotably – he had some interesting UAP-related comments in 2021: \n\n\"I can't imagine that what has been described or shown in some of the videos belongs to any government that I'm aware of\".\n\nAug 4– UK MoD confirms that 2 members of staff from Defence Intelligence attended the inaugural UAP Working Group meeting held at the Pentagon in 2023\nA FOIA request submitted by former senior MoD official Nick Pope reveals that a 2 members of staff from Defense Intelligence attended the inaugural UAP Working Group session hosted by the Pentagon in 2023. Notably, this seems to contradict recent official statements from the UK MoD that insist the UK government no longer investigates UFOs.\nMore information via Liberation Times.\n\nThings to look out for in the near future:\nAugust/September\n\nAccording to Senator Gillibrand – a public hearing in line with AARO's latest report can be expected soon, saying –\"I’m hoping July, and if not then September. But I’m trying to do July.”\nSpeaking with Askapol, Reps. Luna and Burchett indicated that the next UAP hearing is likely to come after the August recess.\nLue Elizondo has indicated his much-awaited book will be published in August 2024. Elizondo was the former director of the now defunct Advanced Aerospace Threat Identification Program (AATIP) – a program associated with the release of the Pentagon UFO videos.\n\nBeyond/currently unknown\n\nFollowing the UAP hearing on the 26th of July, Members of Congress have called for a select committee with subpoena authority, to “go about the task of collecting information from the Pentagon and elsewhere” on unidentified flying objects. There have been conflicting messages from various Members of Congress on whether this is likely to happen anytime soon. Note – a select subcommittee was formally requested on March 13th.\nReps. Moskowitz, Luna, and Burchett have repeatedly stated their intent to hold field hearings to overcome stonewalling from the Pentagon and military establishment \"I think we [Congress] should try to get into one of these places [housing UAP evidence]...and if they won't let us in I think we should have a field hearing right outside the building...and the military will have to explain why that is.\" – Rep. Moskowitz (D) It is currently unknown when exactly we might expect that to occur, however as of Jan 12 – Rep. Luna confirmed: \"I feel confident that we have enough evidence to move forward with our first field hearing. We will be announcing details soon.\"\nSeveral journalists have indicated that first-hand witnesses of the alleged UAP legacy programs are in the process of providing testimony/evidence to the relevant authorities (e.g. the IC IG) and/or are on the verge of making public statements in the near future (Example 1, example 2, example 3, example 4)\nDavid Grusch has received additional clearances through DOPSR to discuss some of his (alleged) first-hand knowledge of Legacy programs. He has mentioned he may be covering more of this information in an upcoming Op-Ed\n\nSkimmed through this post but need a quick refresher on how we got to this point? Check out this handy Disclosure Timeline to get up to speed.", "media": null, "score": 29, "upvote_ratio": 0.96, "comment_count": 2, "over_18": false}, "5": {"id": "1ek9lxk", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "rockabillyrat87", "link_flair_text": null, "time": 1723258016.8597078, "created_utc": 1722815456.0, "url": "https://i.redd.it/0awoxoduiqgd1.jpeg", "title": "This shirt is from 1999", "permalink": "/r/conspiracy/comments/1ek9lxk/this_shirt_is_from_1999/", "selftext": "", "media": null, "score": 3767, "upvote_ratio": 0.93, "comment_count": 637, "over_18": false}, "6": {"id": "1emhd7j", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1723258017.254856, "created_utc": 1723050503.0, "url": "/r/BrowardCountyFLTruth/comments/1emfx1j/how_does_debbie_wasserman_schultz_keep_getting/", "title": "Why do so-called progressives on Reddit protect Debbie Wasserman Schultz? Took 1 million dollars from AIPAC, 100s of thousands in donations from Wall Street Bankers, Real Estate billionaires, oil/ gas, big tech, from ritziest zip codes in US & wealthy global elites, all pouring into Florida election", "permalink": "/r/conspiracyfact/comments/1emhd7j/why_do_socalled_progressives_on_reddit_protect/", "selftext": "", "media": null, "score": 11, "upvote_ratio": 0.86, "comment_count": 2, "over_18": false}, "7": {"id": "1eksklx", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "video", "time": 1723258018.323473, "created_utc": 1722876194.0, "url": "https://v.redd.it/91b2f42djvgd1", "title": "The mysterious \"Jabezcascade\" bigfoot video stabilized", "permalink": "/r/bigfoot/comments/1eksklx/the_mysterious_jabezcascade_bigfoot_video/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/91b2f42djvgd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/91b2f42djvgd1/DASH_96.mp4", "dash_url": "https://v.redd.it/91b2f42djvgd1/DASHPlaylist.mpd?a=1725850017%2CZThiN2ZhMDNmOTQ3ZTRhYWE1ZTIwOTM0YTRkYTE0YTdjMTI2ZGIyY2RkMTcxYWRkYWVjMWEyMzA1NTAzZGU3Ng%3D%3D&v=1&f=sd", "duration": 53, "hls_url": "https://v.redd.it/91b2f42djvgd1/HLSPlaylist.m3u8?a=1725850017%2CZWNiOTU5NTIzNzdhZWY3OTA5OTEzNDk4MjU5ZTRmZTVhMWZmNWRlZWFiMmRkYTljMTNiYTM1MGFlYzM4NmU1MA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 943, "upvote_ratio": 0.91, "comment_count": 114, "over_18": false}, "8": {"id": "1emf1ij", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "EmronRazaqi69", "link_flair_text": "Discussion ", "time": 1723258019.142341, "created_utc": 1723045140.0, "url": "https://i.redd.it/34stzxuth9hd1.jpeg", "title": "Whats that Cryptid that you know is obviously fake but you find super cool and has a badass story i'll go first:", "permalink": "/r/Cryptozoology/comments/1emf1ij/whats_that_cryptid_that_you_know_is_obviously/", "selftext": "", "media": null, "score": 1325, "upvote_ratio": 0.95, "comment_count": 441, "over_18": false}, "9": {"id": "1ejcfuk", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Lusicane", "link_flair_text": "U.F.O. Humanoid", "time": 1723258019.3182478, "created_utc": 1722715128.0, "url": "https://i.redd.it/oop12goj8igd1.jpeg", "title": "Missouri, 1967. A farmer encounters green space penguins and their mushroom craft.", "permalink": "/r/Humanoidencounters/comments/1ejcfuk/missouri_1967_a_farmer_encounters_green_space/", "selftext": "On the morning of February 14th, 1967, farmer Claude Edwards noticed all his cattle staring in one direction. When he looked in the same direction he was startled by a large green-gray mushroom shaped craft about 70 feet away from him. He described it as smooth, metallic, covered in \"shiny silk\" and dotted with port holes through which dazzling colors shone. He stated that it was 18 feet in diameter and 8 feet tall.\n“The object just looked like a big shell, grayish-green looking outfit. And underneath there were oblong holes where the lights were coming out. They were so bright you couldn't see when you got up there… as if a color wheel was turning inside the thing.”\nEdwards approached the craft and noticed it was surrounded by a group of strange beings. Edwards would describe them as resembling penguins. They were 3 feet tall and green with no hands, neck, or visible form of locomotion. They had large dark eyes which Edwards believed may have been goggles. Near where their mouths should have been there was some sort of protrusion. Edwards believed it was either a beak or a mask. Upon reaching about 15 feet from the craft he found himself stopped by a force field.\n“I thought I was going right up to it. I got up there and there it was. I just walked up against a wall.”\nEdwards then backed up and threw a rock at the craft which bounced off the force field. He threw another which broke through the force field but skipped along the air as though it were water, landing behind the craft.\nThe space penguins then entered their vehicle and it shot straight into the sky with immense speed before zooming northeast and vanishing.\nEdwards, seemingly embarrased by the incident, remained reluctant to talk about it, telling a source only after much prodding and the promise his name would only be published after his death.", "media": null, "score": 455, "upvote_ratio": 1.0, "comment_count": 40, "over_18": false}, "10": {"id": "1el2dnf", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Rev_Levi_Ethan", "link_flair_text": null, "time": 1723258019.9004288, "created_utc": 1722899928.0, "url": "https://i.redd.it/r3tkukl1ixgd1.jpeg", "title": "Ok, who put the butthole sticker on the Mothman statue? ", "permalink": "/r/cryptids/comments/1el2dnf/ok_who_put_the_butthole_sticker_on_the_mothman/", "selftext": "", "media": null, "score": 1288, "upvote_ratio": 0.97, "comment_count": 76, "over_18": false}, "11": {"id": "1eiys5v", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Exilion874", "link_flair_text": "Discussion/Advice", "time": 1723258020.0789664, "created_utc": 1722675614.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1eiys5v/i_lost_1_hour_of_my_life/", "title": "I lost 1 hour of my life.", "permalink": "/r/Thetruthishere/comments/1eiys5v/i_lost_1_hour_of_my_life/", "selftext": "I don't know what happened, I can't find answers, a glitch in the Matrix? In reality? Was it just a dream? I don't know. \nFirst of all, this is the first time I'm making this story public (you'll soon see why) I hope I didn't make a mistake by sharing this, but I want to find answers. \nMy name is Diego, I'm a 29-year-old guy from Argentina, this happened about 2 years ago. One early morning, around 2:30 am, I was on my PC passing the time, I decided to go to bed to watch an episode of my favorite show on my cell phone and eat a bag of potato chips while watching the episode, that's the sequence: I lay down, opened the internet on my cell phone, searched for the page where the show was, found the episode where I left off and opened my bag of chips, finished watching the episode and finished the chips around 3:30 am, then I decide to close all the open apps on my cell phone, turn it off, and leave the empty bag of chips on my nightstand to throw it away the next morning, I get into bed and after a few minutes I fall asleep... Then... I wake up because I hear a noise, it was my cell phone, the episode I had already seen was playing, it was only 15 minutes into the 1-hour duration, how strange I thought... I exit the show and see the time, it was 4:30 am, what? I sit up in bed and... The bag of chips was next to me almost full of chips, at first I thought, am I dreaming? How is it that the episode was playing if I closed all the apps when I finished watching that episode and turned off my phone? Did I turn it on while asleep, go online, search for the page and find the episode? How does that explain the bag of chips being half full? And not crumpled where I left it? I remember watching the whole episode and eating all the chips... It was weird.\nThe next night, when I fell asleep, I dreamed that I was in... a place I didn't know, there was a voice that sounded above me which told me not to tell anyone what happened the night before... What happened? How did my phone turn on, which I had turned off to go to sleep, go back to the series website, which I had closed, and the bag of chips appear, which I had already finished and thrown away? What happened between 3:30 am when I fell asleep and 4:30 am when I woke up? Why did I dream that the next night? To this day, two years later, analyzing, I can't find answers.", "media": null, "score": 41, "upvote_ratio": 0.95, "comment_count": 22, "over_18": false}, "12": {"id": "1ekh6gk", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "camomydear", "link_flair_text": null, "time": 1723258020.2855, "created_utc": 1722840368.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ekh6gk/man_tried_to_grab_my_baby_from_me_on_flight/", "title": "Man tried to grab my baby from me on flight", "permalink": "/r/LetsNotMeet/comments/1ekh6gk/man_tried_to_grab_my_baby_from_me_on_flight/", "selftext": "I’ve flown with my one year old solo nearly a dozen times. Usually people are understanding/kind about me having a baby on my lap, and overall he’s a happy, easy baby. He’s also very cute, so it’s not uncommon for strangers to talk to him (usually I don’t mind).\nThe last trip I took, I sat alone in my aisle, with a man sitting by himself directly behind me. My baby was tired and fussing. I knew he was tired but there’s not a lot I could do until after we took off. Right out the gate, the man behind was talking to my baby. Saying “oh hi baby! Why sad baby? Cute, cute baby!” I smiled and replied that he was tired, sorry for the fuss, thank you.\nAfter take off, I started to get him settled for a nap. The man behind us continued to talk to my baby, putting his hand through the seats to try and grab his feet. Multiple times I asked him nicely to please stop, my baby was tired, you’re distracting him, he just needs a nap. Finally, I set my baby down next to me (he stood on the floor facing the seat next to me) so that I could make a bottle. The man behind me stood up and reached over my seat to pick him up. I immediate leaned forward to pick up baby, saying “NO thank you, I don’t need help, please no, no thank you!” The man pushed me back into my seat while mumbling “sweet baby, why baby cry?”. I replied very loudly “NO” and quickly picked up my baby. \nI thought that was the end of that. I was wrong. I tried to rock my baby to sleep, while desperately trying not to lose my cool. As I’m rocking baby, the man behind me reached through our seats to grab my arm, saying “no rocking, no rocking, you make him cry!” I pulled free from him and yelled “DO NOT touch me”. Again, I thought that’d be the end.\nI started rocking baby for a second time. This time, the man behind me reached both hands around either side of my seat to hold me in place, saying “no, no rocking, stop rocking”. I am somewhat embarrassed that I completely lost it. Clutching my baby to my chest while struggling to get free of him (it hurt). I hit the call light while screaming “LET ME GO, DO NOT TOUCH ME, LETMEGOLETMEGOLETMEGO!!” He was still holding me by my arms when the flight attendants came running. \nI could barely get anything out to the flight attendants. Every one around us was staring, I was sobbing, and all I could get out was that I could not sit there anymore and for the love of god please move me. The man behind me tried to move with me, but I told the flight attendants that I did not know him and he could not come with me. \nI had a good cry in my new seat but my baby immediately went to sleep. (I was moved to be next to the flight attendants seats.) After calming down, I explained to the flight attendants what had happened. Multiple times, the man that had been behind me got up to try to come back to my new seat, only to be turned around by one of the flight attendants.\nTowards the end of the flight, one of the flight attendants told me that they’d explained everything to the pilot, and the pilot had called the FBI and local police to escort the man off the flight. I would also be escorted off, as well as everyone around us that had watched everything happen. \nHe cheered as he was escorted off. I had to interview with the FBI, and nearly missed my next flight. After my trip was done, I had to fly back going through the same airport. It was stressful and emotional to say the least, even knowing that he was banned from the airline and the airport. I haven’t flown since. \nTo the man that tried to grab my baby from me, and then wouldn’t let go of me, let’s never f**ing meet again. ", "media": null, "score": 3022, "upvote_ratio": 0.98, "comment_count": 116, "over_18": true}, "13": {"id": "1emkv6b", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "AtmanDharma", "link_flair_text": null, "time": 1723258020.4394314, "created_utc": 1723058696.0, "url": "https://i.redd.it/k86l1zu4mahd1.jpeg", "title": "Tammy Lynn Leppert, That blonde girl, who distracts Manny in the movie Scarface, vanished shortly after filming and has never been seen or heard from since. She left her family's home in Rockledge, Florida at 11:00 a.m. on July 6, 1983, and disappeared without a trace.", "permalink": "/r/truecreepy/comments/1emkv6b/tammy_lynn_leppert_that_blonde_girl_who_distracts/", "selftext": "", "media": null, "score": 218, "upvote_ratio": 0.99, "comment_count": 6, "over_18": false}, "14": {"id": "1emni3x", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Relcrack", "link_flair_text": null, "time": 1723258020.5838199, "created_utc": 1723065053.0, "url": "https://www.reddit.com/r/threekings/comments/1emni3x/is_it_dangerous_to_make_a_short_film_where_you/", "title": "Is it dangerous to make a short film where you follow the steps of a ritual? (Three Kings)", "permalink": "/r/threekings/comments/1emni3x/is_it_dangerous_to_make_a_short_film_where_you/", "selftext": "Well, in short I'm thinking of making a short film where a guy follows the steps of the ritual and ends horribly wrong, however I'm not sure to what extent this is a \"real\" ritual, is it dangerous? I was thinking of filming this with a friend , where I record and he follows a script, (where he obviously follows the steps)", "media": null, "score": 6, "upvote_ratio": 0.75, "comment_count": 2, "over_18": false}, "15": {"id": "1ek0al2", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "According_Pangolin84", "link_flair_text": "Personal Encounter ", "time": 1723258021.0627646, "created_utc": 1722791424.0, "url": "https://i.redd.it/7cla64wejogd1.jpeg", "title": "Following up with my previous post with a better image!", "permalink": "/r/Ghosts/comments/1ek0al2/following_up_with_my_previous_post_with_a_better/", "selftext": "Here is the awaited photo some people were asking for! If you haven’t checked out my previous post on this story I’d check it out first! I reached out to an old friend in hopes they had the OG photo and they did! ", "media": null, "score": 944, "upvote_ratio": 0.91, "comment_count": 128, "over_18": false}, "16": {"id": "1ekslr3", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "WiiUBurp", "link_flair_text": "Glitch Pic", "time": 1723258021.2772424, "created_utc": 1722876272.0, "url": "https://i.redd.it/87rpeejnjvgd1.jpeg", "title": "The windows of the house are illuminated in the lake’s reflection but not in real life", "permalink": "/r/GlitchInTheMatrix/comments/1ekslr3/the_windows_of_the_house_are_illuminated_in_the/", "selftext": "", "media": null, "score": 118, "upvote_ratio": 0.93, "comment_count": 10, "over_18": false}, "17": {"id": "1ej8nqp", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "MadOblivion", "link_flair_text": null, "time": 1723258022.440811, "created_utc": 1722705418.0, "url": "https://www.reddit.com/gallery/1ej8nqp", "title": "Jellyfish UFO Photographed Orbiting The Moon.", "permalink": "/r/ufo/comments/1ej8nqp/jellyfish_ufo_photographed_orbiting_the_moon/", "selftext": "", "media": null, "score": 197, "upvote_ratio": 0.81, "comment_count": 104, "over_18": false}, "18": {"id": "1emxchh", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Nacho_Libre_Ahora", "link_flair_text": "Video", "time": 1723258023.6845357, "created_utc": 1723092816.0, "url": "https://v.redd.it/sifhhotjfdhd1", "title": "Triangle UFO/UAP video in (allegedly) either Canada or N.America.", "permalink": "/r/UFOs/comments/1emxchh/triangle_ufouap_video_in_allegedly_either_canada/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/sifhhotjfdhd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1020, "scrubber_media_url": "https://v.redd.it/sifhhotjfdhd1/DASH_96.mp4", "dash_url": "https://v.redd.it/sifhhotjfdhd1/DASHPlaylist.mpd?a=1725850022%2CMjNmMTdiNTVhYzM1NThhMTIxMmViMGYwNDdhZTg1NTI0YjU3MmIxOGJkYzE0MjQyZmM2NzI0NDEzYjk3NmMwYg%3D%3D&v=1&f=sd", "duration": 47, "hls_url": "https://v.redd.it/sifhhotjfdhd1/HLSPlaylist.m3u8?a=1725850022%2CMTJjZjFlZDEzYzFkNGFmZmViMzQ2OWI4NjdiYjlmYWE3MTJmMWFjYWU0M2M2N2IxZDNhNmJmZDc0NDhjMGFhMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1678, "upvote_ratio": 0.86, "comment_count": 417, "over_18": false}, "19": {"id": "1ejj63j", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Kale_The_Vegetable", "link_flair_text": "Image 📷", "time": 1723258024.9090834, "created_utc": 1722733923.0, "url": "https://i.redd.it/fsuj1sffsjgd1.jpeg", "title": "Friend of mines coworker inherited “Ancient Mayan alien ruins”", "permalink": "/r/aliens/comments/1ejj63j/friend_of_mines_coworker_inherited_ancient_mayan/", "selftext": "Context: his dad spent $10,000 on a briefcase at a auction. My friend claims he got cursed after he put on the ring. The day they put it on they got robbed at gun point and got rear ended. The week after they got rear ended again. The month after they got their house broken into. ", "media": null, "score": 1403, "upvote_ratio": 0.89, "comment_count": 295, "over_18": false}, "20": {"id": "1ej9v4d", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "smurphylee420", "link_flair_text": "Discussion", "time": 1723258025.1355257, "created_utc": 1722708399.0, "url": "https://www.reddit.com/r/UAP/comments/1ej9v4d/december_should_be_interesting/", "title": "December should be interesting..", "permalink": "/r/UAP/comments/1ej9v4d/december_should_be_interesting/", "selftext": "UAPTF set to make another disclosure statement in December \nhttps://open.spotify.com/episode/6K65klgd5jh9V5u8f6tTmZ?si=ZZ6-LgN6R7q25z5Yxxc32Q", "media": null, "score": 15, "upvote_ratio": 0.66, "comment_count": 7, "over_18": false}, "21": {"id": "1eisvck", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Sig_tits_bulletballs", "link_flair_text": null, "time": 1723258026.3477046, "created_utc": 1722654064.0, "url": "https://www.reddit.com/r/conspiracy/comments/1eisvck/fuck_israel/", "title": "Fuck Israel", "permalink": "/r/conspiracy/comments/1eisvck/fuck_israel/", "selftext": "I’m not dying for Israel. WTF have they ever done for us? How the fuck is this war with Iran beneficial for an everyday American? \nIt isn’t. It’s simple as that. \nDon’t be a NPC. I’m conservative leaning so I hear the propaganda loud and clear and it’s all fucking bullshit. This is another banker’s war, don’t be naive and don’t support this shit", "media": null, "score": 3563, "upvote_ratio": 0.77, "comment_count": 1221, "over_18": false}, "22": {"id": "1ekw81f", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "tito333", "link_flair_text": null, "time": 1723258026.6920583, "created_utc": 1722884906.0, "url": "https://www.abreureport.com/2024/08/pinto-police-officer-allegedly-raped.html", "title": "Pinto Police Officer Allegedly Raped Muslim Woman and Forced Her at Gunpoint to Undergo Abortion", "permalink": "/r/conspiracyfact/comments/1ekw81f/pinto_police_officer_allegedly_raped_muslim_woman/", "selftext": "", "media": null, "score": 8, "upvote_ratio": 0.85, "comment_count": 0, "over_18": true}, "23": {"id": "1eiyblo", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "SamWell_SR71", "link_flair_text": "encounter story", "time": 1723258027.8065963, "created_utc": 1722673709.0, "url": "https://www.reddit.com/r/bigfoot/comments/1eiyblo/yes_bigfoot_does_exist/", "title": "Yes, Bigfoot does exist. ", "permalink": "/r/bigfoot/comments/1eiyblo/yes_bigfoot_does_exist/", "selftext": "I've seen two. First one in Cordova, AK in 99. Second time near Foxton, CO in 2020. Had always been a skeptical believer. Once you've seen a bigfoot in person. All the doubt goes out the window. There is a moment of \"Am I really truly observing what I am observing?' There are so many credible witnesses who've observed large bipedal primates (not Homo Sapiens) in remote environments. In my opine it is good to have cryptids and aliens in our lives. Keeps the brain engaged.", "media": null, "score": 819, "upvote_ratio": 0.77, "comment_count": 516, "over_18": false}, "24": {"id": "1ej9hkk", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Evidence", "time": 1723258028.428084, "created_utc": 1722707459.0, "url": "https://www.reddit.com/gallery/1ej9hkk", "title": "15 of the Japanese Wolf Photos- Analysis in the Comments", "permalink": "/r/Cryptozoology/comments/1ej9hkk/15_of_the_japanese_wolf_photos_analysis_in_the/", "selftext": "", "media": null, "score": 857, "upvote_ratio": 0.99, "comment_count": 111, "over_18": false}, "25": {"id": "1emj174", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Johanharry74", "link_flair_text": "Unsolved", "time": 1723258028.5898752, "created_utc": 1723054399.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1emj174/two_scary_close_encounters_at_the_remote_relay/", "title": "Two scary close encounters at the remote relay station at Hemliden in Sweden", "permalink": "/r/Humanoidencounters/comments/1emj174/two_scary_close_encounters_at_the_remote_relay/", "selftext": "In some places, the UFO-phenomena seem to have a tendency to be reported more often than in others. Paranormal researchers call them \"hot-spots\". One such place is mount Hemliden north of Örnsköldsvik in the middle of Sweden, where many interesting observations have been made.\nThis time I will tell you about two intresting separate close encounters cases that happened in this area. These two stories were reported in the Nordic UFO Newsletter issue 1, 1981, page 8-11.\nKurt Nilsson and the three mysterious humanoids on the road.\nOctober 18, 1977\nKurt Nilsson is the owner of a short wave radio transmitter which he has installed in his car, and in order to achieve a better communication than he was experiencing in the small village of Trehörningsjö, he drove up to the TV and Radio transmitting station that lies about 10 Km to the north and is situated on a mountain known as Hemliden (which is a lonely, isolated area). 400 metres (approx 440 yards) from the top of the mountain he noticed heavy radio interference, and a distant colleague with whom he was in contact could hardly hear him, although Kurt, could hear his colleague clearly enuugh.\nAt 8.00 pm Kurt reached the transmission station's mast, but found communications there so bad that he had to break off the radio conversation with his friend. Kurt's attention was then caught by a pale blue object outlined against a hillock down in a hollow. He realised after a few moments that it was a machine with a dome, and although it was difficult to estimate, it was about a couple of metres (6-7 feet) in diameter. In front of the object there were three figures dressed in \"spacesuits\", each about one metre (4 feet) tall and of a greyish colour - all at a distance of a little over 100 m (110 yards). They could clearly be seen in the light emitted by the machine, and Kurt was so surprised that he switched on the car's headlights to see them more clearly. Everything then went \"black\" and the figures and the machine could no longer be seen. (Kurt explained that although the car's lights worked allright, the figures and the machine were no longer visible). Kurt sat rooted to the spot looking at the emptyness for about one minute, after which everything again returned to as it was with the machine shining again!\nOne of the small humanoids was rotating a spade-like thing towards Kurt. The other two beings were looking at it.\nKurt was really frightened now and he began to drive away, but only after 50 m (55 yards) the car stopped and there in the middle of the road were the three figures - either the same ones as before, or a different team. Kurt thought they were crossing the road, but didn't know if it was he or they who stopped the car. The figure in the middle had a spade-shaped thing in his hands, which was then turned completely around causing the figure to cross its arms, the convex side of the \"spade\" now facing Kurt. At the same instant the car's lights and engine died. (Just before the figure rotated the \"spade\" the other two figures had focused their gaze on it). It was now pitch black, and Kurt thought: \"This is the end\". However, he switched off the light switch and attempted to start the engine - which fired at once! Feeling greatly relieved, Kurt reversed 10 m (11 yards) into the darkness and then waited two minutes before turning on the headlights, which also worked. However, the little figures were nowhere to be seen, so Kurt rushed back home. When he got home, Kurt told his wife, Eva, all that had happened.\nhttps://preview.redd.it/uhnbaz06hahd1.jpg?width=103&format=pjpg&auto=webp&s=f79d52fdfdb620905cb1ee2c6ae69944e7f68ca9\nThey then noticed that Kurt's watch was loosing time: The house clock indicated 8.50 pm, while his watch said 8.30 pm. Kurt is acquainted with a man named Kjell Näslund, who had also experienced something similar to Kurt in 1969, and so he called him up at once. Kjell said that he had been having some bad interference on his TV that same evening. It was also noticed that Kurt's dog was acting strangely, for he was barking madly. Usually the dog greets him with a welcoming leap, but this evening was different. The dog finally laid down huddled up in a corner of the kitchen. He also reacted in a strange way two days later when they all went up to Hemliden mountain. The dog kept behind Kurt all the time when usually he runs and jumps all over the place. Kurt, though, was still deeply affected by the UFO experience and was stopped by a police-car on his way home from the mountain for not dipping his car's headlights when they passed him. Kurt told them he was so upset that he'd forgotten to dip them.\nAn on-the-spot investigation of the area by UFO-researcher Reinhold Carleby revealed that something had happened. A birch tree had the bark removed from a part of it where the object was seen. This damage is situated about 2.8 m (8-9 feet) above the ground, and it seems that the craft never landed and that the three (or six ) figures descended to the ground in an unknown way. Some moss was missing from the area, but very puzzling was the finding of some moss that does not even grow in the immediate surroundings where the craft was seen, but was eventually located where the figures were seen crossing the road, i.e. they were collecting (?) some plant specimens. Also, an important finding was the footprints that the little figures made, these being short, relatively wide and with a heel measuring 4 cm x 4 cm (1.6x1.6 inches) that had a cross pattern on it. Together with Kurt at the sighting point, the machine's diameter was estimated more accurately as 5 meters (16.5 feet). The bluish light emitted by this object only illuminated out to about 5 m, the little figures which were first seen being lit up by this light. There was no noise at any time. Kurt described the \"spacesuits\" as being grey and resembling plastic. The figures were wearing short white boots that fitted them as tight as gloves, and seemed to be part of their suits, which were one-piece. Their helmets were like those of astronauts with an opening at the front for their eyes.\nMap of Kurt's encounter at the Hemliden relay station on the mountain.\nThe strange close-encounter a lonely night at mount Hemliden relay station.\nKjell Näslund (mentioned above) had a strange experience on March 12th, 1969, some years before Kurt's sighting. Kjell is the Director of the transmitting station on Hemliden, and on this evening he was working alone at the station at 6 o'clock. For some reason the alarms sounded, indicating a fault in the transmitter somewhere. This went on until about 6.30 pm when Kjell felt that he had to go outside for some strange reason.\nThe large, dark craft Kjell saw outside the relay station. (artistic impression)\nOnce outside he saw a massive object - about 150 m across (450 feet), 5 to 6 m high (17-20 feet) and with a fuzzy outline to it - only 15 m (45 feet) from the building. A greyish-blue light was emanating from a tunnel leading inside the object, and beside it and inside the tunnel Kjell could see about 10 box-like things (or could they be robots) that resembled clouds without solid edges, all of them floating just above the ground. He estimated them as 135 cm (4.5 feet) tall. Kjell wanted to phone to the police, but for some reason he was unable to do so. In fact, he couldn't even move. Seven or six box-beings floated into the station, and although they passed right next to Kjell, he couldn't touch them since he was immobilised. He had the feeling that inside these \"boxes\" there were creatures and that they were protecting themselves - possibly from the enviroment. He also felt that he could stay calm, for his visitors were not dangerous. The box-beings didn't move quickly and floated along at the same speed as a walking person. Five to ten minutes later the creatures completed their inspection and were sucked into the tunnel which closed behind the last one. The craft then disappeared to the north.\nThe strange squared beings entering the door of the relay station next to a paralyzed Kjell. (artistic impression)\nAfter the craft's disappearance, Kjell was free to move again. The first thing he did was to call his wife. She heard that he was very upset and agitated and she told him to calm down, \"You must have seen wrong.\" she said. \"Wrong? I have not seen wrong!\" he shouted to her on the telephone. He then called a policeman he knew - Hans Häggblad in Trehörningsjö - who took the report seriously. However, his managers at the Sundsvall Main Transmitting Station did not believe him and only laughed at Kjell's report to them.\nThe next day Kjell went up to the mountain again and could see that the tops of some tall pine trees close to the relay station was broken. Also, later when UFO researchers spoke to personnel at the Sundsvall Transmitting Station, they could confirm that there had been heavy disturbances from the Hemliden relay station that night, and the technicians could not find any explanations as to why.\nLink to the story: https://norskufosenter.no/wp-content/uploads/2020/05/1981-1-Nordic-UFO-Newsletter.pdf\nA youtube channel also made a video of the stories: https://youtu.be/Altq6C2Pq4I?si=j7uX2fKiEZB_eQub", "media": null, "score": 14, "upvote_ratio": 0.85, "comment_count": 0, "over_18": false}, "26": {"id": "1ejia1a", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Former_Adeptness_630", "link_flair_text": null, "time": 1723258029.2258577, "created_utc": 1722731213.0, "url": "https://i.redd.it/zz22yljdkjgd1.jpeg", "title": "If this was a heavy metal album what would you call it. Art made by Corbett316 ", "permalink": "/r/cryptids/comments/1ejia1a/if_this_was_a_heavy_metal_album_what_would_you/", "selftext": "Ok actually made this masterpiece ", "media": null, "score": 378, "upvote_ratio": 0.97, "comment_count": 192, "over_18": false}, "27": {"id": "1emnsjc", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Hensbear", "link_flair_text": "Legend/Folklore", "time": 1723258029.4188864, "created_utc": 1723065771.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1emnsjc/mississippi_faceless_man/", "title": "Mississippi Faceless Man", "permalink": "/r/Thetruthishere/comments/1emnsjc/mississippi_faceless_man/", "selftext": "So, I write this, not for advice, or for any real reason to be honest. Though, I just wondered if anyone else has seen/heard from someone else of the man.\n   So, I was maybe 9 or 10 years old in Mississippi visiting my grandma with my sister. It was the middle of the night, and I had been watching tv. Wanting a drink, I got out of my grans living room to go to the kitchen. Now, my gran had a deck, and a huge window that would show outside. My grandma lived right by the woods, rarely saw anyone at night that weren’t hunters lookin’ for deer. \n    I look out the big window, feeling scared all of a sudden. And outside, is a man in a black suit with no face. At least, that’s what it looked like. Seeing a man with no face is horrifying, especially right next to the woods and you know no one else is awake at the time. I went to the kitchen to get my drink, then looked out the bay window in my grandma’s dining room which was attached to the kitchen. The faceless man was closer to the window now, and he just stood there, unmoving, but seemingly staring right at me. My chest was pounding with fear, after all, the man was closer than before. \n    Going back to the living room, knowing I’d be safe due to the locked doors, but also still kind of freaking out, I just watch the tv. I finish drinking my drink and stand up, looking out the window in the living room, the man was closer once again. Still staring me down, his hands by his sides. Feeling even more panicked, I go to throw away the can of soda I had to drink in the kitchen. I look out the bay window once more, and he hadn’t moved closer. I walked back to the living room and turned the tv off, feeling eyes stare me down. \n     My grandma was asleep, her husband was asleep with his sleep apnea machine going on in the background in their room. I left the living room to go to my room shared with my sister, I never looked back. I walked in my room to find my sister passed out, soft snores leaving her lips. I laid down on the ground and fell asleep. \n Maybe a year later, we were back in Mississippi. Except this time in my grandma’s cabin literally in the middle of the woods. My sister and one of my cousins were already there, setting the house up to sleep there for the night. I was in the car with my second cousin, he was driving and we were talking. I told him about the faceless man who had scared me a year or so ago outside our grandma’s house. He joked and said it was him. And yes, while that is possible, after all, they were roughly the same height and body type, it couldn’t have been him. \nYou see, later that night, my cousin who had said it was him and my sister were asleep on the couch. I had fallen asleep but woke up in the middle of the night, feeling eyes on me once again. I follow where I felt the stare, and low and behold, there he was again, the faceless man. Still in his suit. Except, he seemed taller this time. I turn back to the couch my sister and cousin were on, and my cousin was still there. It couldn’t have been my other cousin who had left previously, because my cousin and the faceless man had completely different statures. The cousin who had left was a bigger man in the mid section, and was shorter than the cousin on the couch with my sister. \n  After that night, I never saw that man again. And I often wondered if it was my imagination, or perhaps a dream. Though I know the first time wasn’t a dream, as I was physically up and moving and watching tv. I had a friend a few years ago who said she had seen the man too, except in her house in the basement. Has anyone else seen this man? Or was my friend lying and making stuff up so I didn’t feel bad/scared? If so, I’d love to hear your story, as I’m genuinely curious.\n", "media": null, "score": 25, "upvote_ratio": 0.88, "comment_count": 4, "over_18": false}, "28": {"id": "1emvsf3", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "souliieee", "link_flair_text": null, "time": 1723258029.6277754, "created_utc": 1723087665.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1emvsf3/that_time_i_accidentally_stole_from_a_michaels/", "title": "That time I accidentally stole from a Michael's (Craft Store) to avoid a serial violent predator..", "permalink": "/r/LetsNotMeet/comments/1emvsf3/that_time_i_accidentally_stole_from_a_michaels/", "selftext": "Okay, so, I want to preface this by saying this is my first time visiting this sub and my writing skills are mid at best. I learned about this subreddit from a youtuber who made a video on best reddit subreddits, and my first thought was to make this post because I genuinely still can't believe this happened to me.\nThis happened in 2013, when I was around 12. My mom moved me and my siblings in with my grandparents because we did not have enough money for rent at the time and she needed to save. It wasn't a big deal, though. They had plenty of room, and I got to spend a lot of time jewelry making with my grandma which in my little eyes was such a win that I didn't even realize we were that poor.\nIt was our little passtime after school, and one of my favorite parts was the trips we would take to Michaels to get beads and materials occasionally. Michaels, for those who are unfamiliar, is a craft store similar to Hobby Lobby and walking around in it is a little girl's dream when it comes to DIY stuff.\nOne day in the late fall, we realized we had run out of wire for a bracelet I was making for my mom, so we headed out to our local Michaels to get more. This particular day was in winter, so it had already begun to get dark by 5PM. My grandma, having vision problems and a bad hip, entrusted little me to run in and grab the wire and pay for it as we had done so many times together before. I was stubbornly independent, so she wasn't very worried about me. She parked right in the handicap spot in front of the store, the sun setting and the light from the big storefront windows illuminated her car behind me as I walked inside.\nAs I was standing by the display at the front, entranced by some christmas decor or something, a man walked in through the sliding doors.\nI noticed him immediately. It was hard not to, he was tall (i think, I may have just been short), maybe in his mid 30s with dark hair and wearing all black from head to toe. His clothes were a bit dirty, and I distinctly remember a big red D1 logo on his hoodie. He had his hands shoved in his pockets and walked briskly into the store, almost frantically. I just watched him. He made eye contact with me for a bit too long, and then continued deeper into the store. I was immediately weirded out, but thought nothing else of it and went off to find the wire.\nI found my spool of wire, but getting distracted in the toy section was where I fucked up.\nThat's when I noticed him start to follow me around. Aisle to aisle, I would be browsing and he would just appear at the other end fake-looking at stuff. He was muttering to himself constantly, you know when someone says something out loud expecting a response but they aren't really directly looking at you, like that. As a kid, you don't really realize what's happening immediately, so I just awkwardly walked away from him each time pretending to not notice him. In my little brain, I reasoned that he wasn't following me, and walked all the way across the store to the wedding aisle to look at some stuff I had seen when I first walked in.\nI figured there'd be no way he'd follow me there, but sure enough, while looking at the invitation cards I get a spine-chilling feeling. I turn around and there he is, right behind me, back to me, doing something. Messing with something in his pants. Doing something really vile to himself.\nI had never seen anything like that, and the sunken eyes he looked at me with still haunt me to this day. It took me a minute to process what I had just seen, but once I did, I immediately booked it out of the store as fast as I could.\nJumping into my grandma's car, she seemed startled by my sudden appearance and asked what I got. I tried to explain what had just happened when I saw him appear in the sliding door in front of us, and the dread I felt in that moment was indescribable. He approached our car, obviously recognizing I was with my grandma, and knocked on her window. I hadn't been able to explain myself in time before she cracked the window and asked him if everything was okay.\nThe man gestured to me with that same crazy stare and said something along the lines of, \"Shes a thief, she stole from there.\" I was mortified he was trying to make her suspect of me, on top of everything else he had just put me through. Thankfully, my grandma got the same vibes I did because she politely told him to back away and rolled the window up while locking the door. He suddenly yanked at her door handle, then swung both his arms up and started banging down hard on the car's roof, causing us both to jump and me to start crying. My grandma slammed on the reverse and peeled out of there. I've never seen her drive so fast.\nI don't remember much after that. Just the crying, and holding a 17$ spool of wire in my hands that I hadn't paid for.\nWe called the police as soon as we got home, and luckily they immediately took it very seriously and requested the video tapes from the Michaels. A few weeks later, my grandma told me that they had found him. They mostly left me out of the investigation besides taking my statement as to not traumatize me further I guess. She got the dent in her car fixed and that was that.\nIt wasn't until a few years later that my mom finally told me what had happened to him. It turns out, he already had one battery charge and two sexual assaults on his record, one even being from a minor relative of his, like his niece or something. He had just gotten off work from the gas station across the street when he must've seen me walk into Michaels alone.\nI don't know what would have happened if my grandma hadn't locked her door. Or if she had been in there with me, vulnerable to that man as well.\nSo, scary freak from Michael's, lets please not ever meet again.", "media": null, "score": 534, "upvote_ratio": 0.99, "comment_count": 21, "over_18": true}, "29": {"id": "1ekq7u4", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "littlequeef99", "link_flair_text": null, "time": 1723258029.7958097, "created_utc": 1722870539.0, "url": "https://v.redd.it/dg3vzufg2vgd1", "title": "Ghost Car Disappears During Police Chase", "permalink": "/r/truecreepy/comments/1ekq7u4/ghost_car_disappears_during_police_chase/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/dg3vzufg2vgd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 592, "width": 1280, "scrubber_media_url": "https://v.redd.it/dg3vzufg2vgd1/DASH_96.mp4", "dash_url": "https://v.redd.it/dg3vzufg2vgd1/DASHPlaylist.mpd?a=1725850029%2CZGI3MTgyNmJhNDY3NTU5ZTgxYmJhMTdkNWE1NGZhZWI4YjdiZTUwMDAxYjRmMGQ0MWJkMWRhYTUyZTMxNjQzNg%3D%3D&v=1&f=sd", "duration": 42, "hls_url": "https://v.redd.it/dg3vzufg2vgd1/HLSPlaylist.m3u8?a=1725850029%2CMjgzZGVkMTRlODAzZDFmZTkyNzc5Nzc3NzYyMjA2MjZlOTRhZWNkMWQwMzkyODY5ODdiMGZhZmQ3YTk5MDllNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 79, "upvote_ratio": 0.88, "comment_count": 16, "over_18": false}, "30": {"id": "1ej000i", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Derfier", "link_flair_text": null, "time": 1723258029.9359636, "created_utc": 1722680459.0, "url": "https://www.reddit.com/r/threekings/comments/1ej000i/rituals_that_dont_require_much/", "title": "Rituals that don't require much?", "permalink": "/r/threekings/comments/1ej000i/rituals_that_dont_require_much/", "selftext": "I'm invested in this kind of stuff and obviously there are loads of rituals but what are some rituals that don't require a full list of things? Like something you can easily do on the spot without searching out dozens of different objects.\nThanks in advance:)", "media": null, "score": 6, "upvote_ratio": 0.88, "comment_count": 3, "over_18": false}, "31": {"id": "1eix629", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "StaffordshirePE", "link_flair_text": "Paranormal Tourism", "time": 1723258030.6907058, "created_utc": 1722668992.0, "url": "https://www.reddit.com/gallery/1eix629", "title": "Grey Lady of the Deanwater Hotel - Behind the scenes photos ", "permalink": "/r/Ghosts/comments/1eix629/grey_lady_of_the_deanwater_hotel_behind_the/", "selftext": "Deserted former Wedding Venue built originally as a Mill Owners House in 1837. The  spirit known as the Grey Lady is said to haunt one of the master bedrooms and her apparition has appeared to guests on many occasions.", "media": null, "score": 806, "upvote_ratio": 0.97, "comment_count": 65, "over_18": false}, "32": {"id": "1em243h", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ucklibzandspezfay", "link_flair_text": "Glitch Pic", "time": 1723258031.5077205, "created_utc": 1723002680.0, "url": "https://i.redd.it/0lnthkvxt3hd1.png", "title": "This terrifying phenomenon in the sky was captured by a passerby on the morning of August 6, 2024, in Rochester, New York.", "permalink": "/r/GlitchInTheMatrix/comments/1em243h/this_terrifying_phenomenon_in_the_sky_was/", "selftext": "", "media": null, "score": 36, "upvote_ratio": 0.75, "comment_count": 22, "over_18": false}, "33": {"id": "1ejf172", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "slv2xhrist", "link_flair_text": null, "time": 1723258032.742854, "created_utc": 1722722092.0, "url": "https://www.reddit.com/r/ufo/comments/1ejf172/i_still_believe_the_kid_in_the_las_vegas_crash/", "title": "I still believe the kid in the Las Vegas crash incident. I’m just saying…thoughts? ", "permalink": "/r/ufo/comments/1ejf172/i_still_believe_the_kid_in_the_las_vegas_crash/", "selftext": "I listen to politicians, military, investigators, journalist, and scientists…\nWhy not this kid too…", "media": null, "score": 127, "upvote_ratio": 0.75, "comment_count": 100, "over_18": false}, "34": {"id": "1elq554", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "AdGroundbreaking1870", "link_flair_text": "Video", "time": 1723258033.9872897, "created_utc": 1722970951.0, "url": "https://v.redd.it/8mjb5cl7d3hd1", "title": "Possible fast moving UFO’s in conflict zone (required analysis)", "permalink": "/r/UFOs/comments/1elq554/possible_fast_moving_ufos_in_conflict_zone/", "selftext": "Good day everyone. I know - conflict zones are contradictory places for UFO spotting, because of all other flying objects in the sky, but i just stumbled across this video from Kurskaya Oblast from today’s event, Russia. In this video at the moment when a fighter jet fly by - in a split second you can see two round dark objects, they appear in a single frame, and then - in the second frame - you can see, possibly, the third object on top right corner, or maybe it is one of those two objects that was spotted in the first frame. As a photographer - i know it couldn’t be out of focus dirt on the windshield of the car, for example, cuz jets and sky then would be blurry. It also can’t be any rockets of anything regular, i suppose. It reminds me of the videos when you see something cross the sky superfast on the aviation shows, i remember couple of videos like that, if you’re longtime UFO lurker you probably know what i’m talking about. Not saying it is something extraordinary for sure, but saying it is worth attention, especially with the second frame where you can see, possibly, the same object. Once again, it’s in top right corner, also appears for a single frame. Lmk what you think, any discussion is appreciated.", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/8mjb5cl7d3hd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 916, "width": 720, "scrubber_media_url": "https://v.redd.it/8mjb5cl7d3hd1/DASH_96.mp4", "dash_url": "https://v.redd.it/8mjb5cl7d3hd1/DASHPlaylist.mpd?a=1725850033%2CMjBmZGI5N2QxY2NkYjMzZDUwYmJmYmE3NjdlMTQ5NzU4YWI1Njk1OWRmZjNjMzhkMTg2MzNlODUzMTQ1NjExZA%3D%3D&v=1&f=sd", "duration": 28, "hls_url": "https://v.redd.it/8mjb5cl7d3hd1/HLSPlaylist.m3u8?a=1725850033%2CODMwMTI5YjQ2YTlkZTFjOGU4YmY1NTc1YmM4MDc1OTgzYmFiZDAyZmI5ZmZjYmM4ZjI0MWFhY2M2NzkyMzNhYQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1635, "upvote_ratio": 0.85, "comment_count": 432, "over_18": false}, "35": {"id": "1emfnpr", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "DragonfruitOdd1989", "link_flair_text": "Evidence :upvote:", "time": 1723258035.5332196, "created_utc": 1723046551.0, "url": "https://v.redd.it/ivgw66tvl9hd1", "title": "Meet Santiago, a non-human mummy aged to be between 5 or 6 years old. ", "permalink": "/r/aliens/comments/1emfnpr/meet_santiago_a_nonhuman_mummy_aged_to_be_between/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/ivgw66tvl9hd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/ivgw66tvl9hd1/DASH_96.mp4", "dash_url": "https://v.redd.it/ivgw66tvl9hd1/DASHPlaylist.mpd?a=1725850034%2CNjBhMWM2NDc5NWYzYTJmNTVkMjIxY2E2MDExNmQ4MTZlOGQ1MWZlNTk3ODlmNDE4NWM5YmU1MTY1ZGI4MzJjNA%3D%3D&v=1&f=sd", "duration": 323, "hls_url": "https://v.redd.it/ivgw66tvl9hd1/HLSPlaylist.m3u8?a=1725850034%2CZDM0YTY5M2FhZTAzMDRmOTc2MWQxM2Y1YTYxMmIxNDhhYTg1ZTdmNmUzMjY3Yjk2ZmFiOTgwNjg2MzAwZjQxMg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1342, "upvote_ratio": 0.82, "comment_count": 623, "over_18": false}, "36": {"id": "1elm6ij", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "Discussion", "time": 1723258035.7485137, "created_utc": 1722961535.0, "url": "https://i.redd.it/l8iiv6aqk2hd1.jpeg", "title": "Join us today at 3pm PST | 6pm EST for our live X space with Daniel Sheehan, founder of the New Paradigm Institute! Hosted by the Unidentified Anomalous Podcast. ", "permalink": "/r/UAP/comments/1elm6ij/join_us_today_at_3pm_pst_6pm_est_for_our_live_x/", "selftext": "", "media": null, "score": 12, "upvote_ratio": 0.78, "comment_count": 4, "over_18": false}, "37": {"id": "1ej7mba", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "hakimbekir", "link_flair_text": null, "time": 1723258036.9415364, "created_utc": 1722702908.0, "url": "https://i.redd.it/t9a99v168hgd1.jpeg", "title": "So nobody knows what happened here still ?", "permalink": "/r/conspiracy/comments/1ej7mba/so_nobody_knows_what_happened_here_still/", "selftext": "", "media": null, "score": 3025, "upvote_ratio": 0.93, "comment_count": 604, "over_18": false}, "38": {"id": "1eo1773", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1723258037.2792907, "created_utc": 1723213872.0, "url": "/r/BrowardCountyFLTruth/comments/1eo140d/even_maga_getting_into_local_florida/", "title": "Why are MAGA trolls now defending self-proclaimed \"proud Zionist\" and disgraced, 2016 DNC Chairperson Debbie Wasserman Schultz?", "permalink": "/r/conspiracyfact/comments/1eo1773/why_are_maga_trolls_now_defending_selfproclaimed/", "selftext": "", "media": null, "score": 3, "upvote_ratio": 0.64, "comment_count": 0, "over_18": false}, "39": {"id": "1ek0pyi", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Mellowfye", "link_flair_text": "A.I. generated image.", "time": 1723258038.5755477, "created_utc": 1722792523.0, "url": "https://i.redd.it/lw6z2smomogd1.jpeg", "title": "Bigfoot encounter in the moonlight ", "permalink": "/r/bigfoot/comments/1ek0pyi/bigfoot_encounter_in_the_moonlight/", "selftext": "Created with Openart a.i. using a private model.", "media": null, "score": 541, "upvote_ratio": 0.73, "comment_count": 73, "over_18": false}, "40": {"id": "1em4jky", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Lost_Republic_1524", "link_flair_text": null, "time": 1723258039.2185063, "created_utc": 1723011305.0, "url": "https://i.redd.it/a2xjcc98p6hd1.jpeg", "title": "Let’s talk about the frogman", "permalink": "/r/Cryptozoology/comments/1em4jky/lets_talk_about_the_frogman/", "selftext": "I just wanted to start a talk about this cute little guy.  They sure would be cool if they were real(I really doubt they are)and I just wanted to start a conversation about them.  I’ve seen an iguana with a missing tail be mentioned as one of the animals people mistake for frogman.  The only problem with that theory is that these things are apparently spotted in Ohio.  I guess it’s possible someone’s pet escaped but I don’t think they would be 3 feet tall, iguanas also look much different than a frog.\nWhat other animals do you guys think people could mistake for one of these? I think it could be a fun discussion. ", "media": null, "score": 362, "upvote_ratio": 0.97, "comment_count": 68, "over_18": false}, "41": {"id": "1ejccnw", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "touchwinxoxo", "link_flair_text": null, "time": 1723258040.1188226, "created_utc": 1722714876.0, "url": "https://i.redd.it/4aatq0bhbm091.jpg", "title": "I recently visited a cryptid holy place", "permalink": "/r/cryptids/comments/1ejccnw/i_recently_visited_a_cryptid_holy_place/", "selftext": "", "media": null, "score": 290, "upvote_ratio": 0.99, "comment_count": 12, "over_18": false}, "42": {"id": "1envjir", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Wrong_Run_6821", "link_flair_text": null, "time": 1723258040.2648876, "created_utc": 1723196409.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1envjir/encountered_a_real_fallen_angel_or_a_serial_killer/", "title": "Encountered a real fallen angel or a serial killer", "permalink": "/r/Thetruthishere/comments/1envjir/encountered_a_real_fallen_angel_or_a_serial_killer/", "selftext": "Well this is absolutely true and not fictional so please believe me. \nThis happened to me 5 days ago when I was returning home from my friend's birthday party. At that time I had a little drink, so I thought why not ask someone for a lift and go, anyway my house is on that road. I was standing on the road waiting for a car or a motorcycle. 2 or 3 cars came but nobody gave me a lift. I thought I would have to go by foot today.\nI had Just 3 or 4 steps came forward then suddenly I saw lights coming from my back I thought maybe this time I'll get a chance And then I saw a boy wearing a baseball cap coming on a motorbike, I waved at him and finally he stopped and now I could see him clearly, I don't think I would be able to say the right thing or not, but this boy was very beautiful I mean It seemed as if a painting had come alive, I mean he had very soft features. He told me hey you want a lift, I smiled and said finally someone has come. He laughed and said come on then I sat on his motorbike and we started leaving from there.\nI was not able to understand what should I talk to him about, then he said what were you doing there. I said nothing special, I was just waiting for the lift to go back home from my friend's birthday party. He said it is very dangerous to stand here like this at night. I said ya thieves and druggies roam around here. But after what he said, I suddenly got scared. He said that I do not mean thieves and druggies but serial killers. I was terrified and said what. Then suddenly he started talking about his childhood.\nHe said how his mother always blames him that he was born on the day of new moon and since then I am the only problem with his family. He said that his mother used to call him devil child. He said that earlier I used to hate these things but now these are like compliments for me.Now I started feeling very scared, I said to him, please will you finish this topic here. Then he asked which is your favorite music but I did not give any answer. Then he said, well my Antonio, this is a song, maybe you might have seen the movie The Guest, this song was at the end of it, I really like it. But still I did not say anything, within a few minutes my neighborhood came and I got off the bike.I did not want him to see my house. I thanked him and he smiled and left but there was something in his smile as if he liked my fear.\nI can never forget this guy, such a beautiful guy and such a scary thought, I do not know who he was, but he was no less than a fallen angel. By the way sorry for my stupid english ", "media": null, "score": 17, "upvote_ratio": 0.7, "comment_count": 17, "over_18": false}, "43": {"id": "1ekfo08", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Marandajo93", "link_flair_text": null, "time": 1723258040.4939897, "created_utc": 1722834469.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ekfo08/there_was_a_homeless_crackhead_sleeping_in_my_shed/", "title": "There was a homeless crackhead sleeping in my shed…", "permalink": "/r/LetsNotMeet/comments/1ekfo08/there_was_a_homeless_crackhead_sleeping_in_my_shed/", "selftext": "My fiancé and I just left a sober living house about a month ago. We’ve been clean for almost a year now and are doing really good. We graduated from the sober living and found a cute little three bedroom house. We gave the landlord the money and went over to the house to start loading our stuff inside.\nThere was a little shed outback, so we walked back there and opened it up to put some of the boxes inside. beneath a piece of plywood, my fiancé saw something moving. He thought it was an animal so he walked over and picked up the piece of plywood. There was a homeless crackhead sleeping under there with his crack pipe and syringe still in hand. We tried to be nice to him and explain that we were moving in and that he would have to find somewhere else to sleep. We even told him about the program we had just left and that it was a really good place. And offered to give him the phone number.\nthis dude narrows his eyes at us angrily and says, “I don’t need shit from nobody. I don’t trust nobody either. And neither should y’all.\n“The way he said it was absolutely creepy as fuck. He strode off down the road and kept glaring back at us. That should have been our clue not to move in… But we had already given the landlord the money and felt we were without any other option at this point. So we moved our things in and tried to get comfortable over the next couple days.\nA few days later, my fiancé was at work and this same guy was standing in the road just staring at my house like a maniac. It was just me and a girlfriend home alone, so I was terrified. I called my fiancé and told him what was going on, but by the time he was getting ready to leave work, dude had already vanished. I don’t know what he was planning on doing, and I swear I am not one to judge people. I am a recovering addict myself and I have been homeless more than once. but The whole thing was just really ominous and threatening.\nAbout a week later, there was a shooting death about three houses down from us. That was it. We packed our shit and left and said fuck that house. I don’t know who was involved in the shooting, but after we packed our shit and left, a friend of mine was telling me that the guy we found in our shed was also a convicted rapist that had just been released from prison and that’s why he was homeless.\nNeedless to say, I don’t want to ever meet that guy again. Nor will I ever go back to that neighborhood. we moved two hours away and are staying with my mom.  \nEdit:  I apologize if I offended anyone by calling the guy a crackhead. I didn’t mean anything by it. I’ve been clean for almost a year and I still call myself a junkie. Some of my friends still use. I call them crackheads, meth heads, and heroin junkies lol. They don’t mind. We all know we are addicts so we don’t take any offense to those terms. But I should have considered the fact that other people might. So I am truly sorry about that!", "media": null, "score": 134, "upvote_ratio": 0.91, "comment_count": 9, "over_18": true}, "44": {"id": "1eo3u9v", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "verystrangeshit", "link_flair_text": null, "time": 1723258040.651495, "created_utc": 1723220066.0, "url": "https://i.redd.it/efui3kvbxnhd1.jpeg", "title": "Edward H. Rulloff “The Genius Killer\"- serial killer with a genius-level intellect, his brain is on display at Cornell University. He was executed in 1871, and his last words were claimed to have been “Hurry it up! I want to be in hell in time for dinner.” ", "permalink": "/r/truecreepy/comments/1eo3u9v/edward_h_rulloff_the_genius_killer_serial_killer/", "selftext": "", "media": null, "score": 21, "upvote_ratio": 0.97, "comment_count": 6, "over_18": false}, "45": {"id": "1ejxr8q", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "According_Pangolin84", "link_flair_text": "Personal Encounter ", "time": 1723258041.3480341, "created_utc": 1722784977.0, "url": "https://i.redd.it/4om3ndt80ogd1.jpeg", "title": "Sharing my one and only possible ghost encounter?", "permalink": "/r/Ghosts/comments/1ejxr8q/sharing_my_one_and_only_possible_ghost_encounter/", "selftext": "I’m not familiar with ghosts and paranormal things so I don’t know the logic behind anything but I came across this old photo I have from a “haunted” mansion in Utah. This place was a hot spot to break into during high school and my friends did it and wanted a photo while I stayed back in the car. The only photo I have is a picture of my laptop screen but you can definitely still see the figure in the back clearly. ", "media": null, "score": 581, "upvote_ratio": 0.9, "comment_count": 80, "over_18": false}, "46": {"id": "1em59zo", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Arman75557", "link_flair_text": "Glitch Vid", "time": 1723258041.5730903, "created_utc": 1723014167.0, "url": "https://www.youtube.com/watch?v=IeqVF8Wt8yk", "title": "off1.2 — ''glitch''", "permalink": "/r/GlitchInTheMatrix/comments/1em59zo/off12_glitch/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "off1.2 — ''glitch''", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/IeqVF8Wt8yk?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"off1.2 — &#39;&#39;glitch&#39;&#39;\"></iframe>", "author_name": "off1.2", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/IeqVF8Wt8yk/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@off1.2"}}, "score": 0, "upvote_ratio": 0.33, "comment_count": 1, "over_18": false}, "47": {"id": "1enirg0", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "lastofthefinest", "link_flair_text": null, "time": 1723258042.7950196, "created_utc": 1723154716.0, "url": "https://www.reddit.com/r/ufo/comments/1enirg0/update_on_my_interview_with_ross_coulthart/", "title": "Update on my interview with Ross Coulthart.", "permalink": "/r/ufo/comments/1enirg0/update_on_my_interview_with_ross_coulthart/", "selftext": "In early July, I was interviewed by Ross Coulthart for his show on News Nation titled Reality Check. We talked about my experience on Eglin Air Force Base when I was a military policeman and the UAP landing I witnessed along with my mother and sister in 1977. At this point, the producer of the show at News Nation said he would send me a link when the show airs. It’s been a month and I don’t know if the interview will ever see the light of day. I’m really disappointed with the way the interview went because Ross grilled me like a prosecuting attorney. If the interview never airs it’s all the same to me because I did what I thought I needed to do.\nI saw things before the military and during my military service that solidified my belief of not only is the phenomenon real, but the military also monitors them with crystal clear footage from Eglin. I realize a lot of people want nuts and bolts craft when you are coming forward as a whistle blower, but I wasn’t about to lie about what I saw on the base. I can say this with certainty, I saw a landed craft about 80 yards away from me when we lived in Georgia and I still couldn’t tell you much about it’s description, other than, it was an oval shape that looked like a glowing fire on the ground. I did have a feeling of being frozen seeing it, but I don’t think it was because of the craft making me feel that way. It was just the curiosity of not believing what I was seeing.\nI believe at this point I’ve climbed up the tallest mountain I could to tell people what I know firsthand and now the chips can fall wherever they lay. I’m not going to stress myself anymore about it. It’s not worth the headache anymore to me and my family. When I believe I’ve done any endeavor wholeheartedly and it’s not something that directly affects my family’s well-being, there comes a time to simply move on. I dedicated 10 years of my life to serving in the military 4 years in the Marine Corps and 6 in the Army and National Guard and I’m also an Operation Enduring Freedom veteran. I served until I couldn’t serve anymore due to several operations. I told the producer at News Nation if they don’t air the interview, I hope one day Ross and everyone wanting answers will understand the significance of the radar facility at Site C6 on Eglin. ", "media": null, "score": 113, "upvote_ratio": 0.84, "comment_count": 67, "over_18": false}, "48": {"id": "1el1vf0", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "True-Kaleidoscope550", "link_flair_text": "Photo", "time": 1723258044.4305139, "created_utc": 1722898632.0, "url": "https://www.reddit.com/gallery/1el1vf0", "title": "My First UAP Encounter- Photos+Story Below.(If anyone knows what this is please respond…)", "permalink": "/r/UFOs/comments/1el1vf0/my_first_uap_encounter_photosstory_belowif_anyone/", "selftext": "Location: Fanal Forest, Madeira 🇵🇹 \nTime: Apprx 11:30pm (GMT+1) August 2nd\n2024\nDistance: 9-14m away.\nSize: Around a basketball to size of wheel.\nStory:\nI am a 18 year old American Landscape\nPhotographer. I went to the Fanal forest by myself on Friday the 2nd of August to watch sunset and stargaze on the Portuguese island of Madeira. At night a while after sunset I started taking long exposure photos of the Milky Way. There was no other people present in the area besides for a few individuals having a fire near the main dirt parking lot (approx 3-4km away from distance of photo) which was visible from a far distance due to the lack of light pollution in area. Around a half hour into my long exposure photos | noticed a very bright light hovering and moving slowly before vanishing. I am very familiar with aircraft and drones and this was way to close, small, and silent to be an aircraft and as someone who flys a multitude of drones it did not move, act or sound like any drone that is currently available to be purchased on civilian market.\nAdditionally there was an aspect of this light that had an unexplainable feeling and glow.\nDuring the time this light was present in the sky I felt what I can only describe as a calming and warming glow that I could feel inside of me. For the photo I had my camera set up already in the direction of the tree taking timed long exposure photos of the tree well before the object appeared and was able to capture the first three clear photos attached on this post before it began to move in the last photo before eventually disappearing. This has been one of the most bizzare things that I have experinced in my travels of the world.", "media": null, "score": 1184, "upvote_ratio": 0.91, "comment_count": 311, "over_18": false}, "49": {"id": "1ekddo7", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Sunshinelulz", "link_flair_text": "Video", "time": 1723258046.0635161, "created_utc": 1722826833.0, "url": "https://v.redd.it/lgi4te7pgrgd1", "title": "Ottawa Ontario", "permalink": "/r/aliens/comments/1ekddo7/ottawa_ontario/", "selftext": "Idk what it is but it floated up into the sky and disappeared ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/lgi4te7pgrgd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/lgi4te7pgrgd1/DASH_96.mp4", "dash_url": "https://v.redd.it/lgi4te7pgrgd1/DASHPlaylist.mpd?a=1725850044%2CYTdmNGQ0ZGJmNGVhMmMzMjUxMjQyM2Y2YjZlYjA1YWJhOGYwNTI3M2U5MDhiZWQ5NWRmNGQ4YTQyYTMyMzI1ZA%3D%3D&v=1&f=sd", "duration": 8, "hls_url": "https://v.redd.it/lgi4te7pgrgd1/HLSPlaylist.m3u8?a=1725850044%2CN2E3NTQ3ZDgyZGYyNGFiZWU2MmVhYzdkMmMzNTRjYWVkNThjMWNmOGJhNTQ4NGFjMWJjODIyNWFhNWQzMGE3MQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1107, "upvote_ratio": 0.82, "comment_count": 343, "over_18": false}, "50": {"id": "1ek87m7", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Toulouse_Moose", "link_flair_text": "Article", "time": 1723258046.3862484, "created_utc": 1722811603.0, "url": "https://www.nature.com/articles/s41599-024-03351-4", "title": "Nature Portfolio article: Academic freedom, professors,  & UAP", "permalink": "/r/UAP/comments/1ek87m7/nature_portfolio_article_academic_freedom/", "selftext": "The ending section about current government developments was really rich. This has some great charts about stigma and curiosity with faculty. ", "media": null, "score": 7, "upvote_ratio": 0.9, "comment_count": 0, "over_18": false}, "51": {"id": "1en1rn1", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "AnyCharacter816", "link_flair_text": null, "time": 1723258047.770882, "created_utc": 1723110213.0, "url": "https://www.reddit.com/gallery/1en1rn1", "title": "Looks like Kanye is getting drugged again", "permalink": "/r/conspiracy/comments/1en1rn1/looks_like_kanye_is_getting_drugged_again/", "selftext": "", "media": null, "score": 2957, "upvote_ratio": 0.91, "comment_count": 462, "over_18": false}, "52": {"id": "1embct0", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "FinTerran", "link_flair_text": null, "time": 1723258048.101039, "created_utc": 1723036163.0, "url": "https://www.discoveryuk.com/mysteries/what-is-the-true-story-of-the-philadelphia-experiment/", "title": "The Mystique of the Rainbow Project and Tesla’s Alleged Electromagnetic Invisibility Experiment", "permalink": "/r/conspiracyfact/comments/1embct0/the_mystique_of_the_rainbow_project_and_teslas/", "selftext": "", "media": null, "score": 3, "upvote_ratio": 0.71, "comment_count": 0, "over_18": false}, "53": {"id": "1emeczd", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Infelix-Ego", "link_flair_text": "PGF", "time": 1723258049.1898148, "created_utc": 1723043583.0, "url": "https://v.redd.it/eq2mkoywc9hd1", "title": "Rarely-seen 'second reel' footage of the Patterson-Gimlin trackway filmed in 1967", "permalink": "/r/bigfoot/comments/1emeczd/rarelyseen_second_reel_footage_of_the/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/eq2mkoywc9hd1/DASH_360.mp4?source=fallback", "has_audio": false, "height": 360, "width": 474, "scrubber_media_url": "https://v.redd.it/eq2mkoywc9hd1/DASH_96.mp4", "dash_url": "https://v.redd.it/eq2mkoywc9hd1/DASHPlaylist.mpd?a=1725850048%2CZjRjMGY0ZDY1NjU5NTE3YzFhZGVlZjgzNTNhNDI3YmRmMDBkNTk0OTY0ZWUyMjI5ZmMxZjU1ZTg0NTkwY2YyNw%3D%3D&v=1&f=sd", "duration": 35, "hls_url": "https://v.redd.it/eq2mkoywc9hd1/HLSPlaylist.m3u8?a=1725850048%2CNjUxMTI4YTRiYzk3YzEzYThjMTIzYmNjNjFmODNlMDM1MzM0Zjg2ZjZkYWVkZmRkOTQ2YjRkZTRhZjVhNmFkNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 476, "upvote_ratio": 0.97, "comment_count": 54, "over_18": false}, "54": {"id": "1en8ca4", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Sensitive-Date8158", "link_flair_text": "Discussion ", "time": 1723258049.945758, "created_utc": 1723129490.0, "url": "https://i.redd.it/94tuzbqngghd1.png", "title": "Bigfoot butt ", "permalink": "/r/Cryptozoology/comments/1en8ca4/bigfoot_butt/", "selftext": "DrJeff Meldrum presenting about Bigfoot evidence in the Patterson Gimlin film and going over various casts in his collection. Couldn't believe this one of a Bigfoot butt, anus, and genitals 🤣", "media": null, "score": 335, "upvote_ratio": 0.97, "comment_count": 51, "over_18": true}, "55": {"id": "1eku90n", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Kissandcontrol22", "link_flair_text": null, "time": 1723258050.682014, "created_utc": 1722880229.0, "url": "https://i.redd.it/qru7iisevvgd1.jpeg", "title": "A tiny painting of Mothman I made! He's my favorite cryptid! ", "permalink": "/r/cryptids/comments/1eku90n/a_tiny_painting_of_mothman_i_made_hes_my_favorite/", "selftext": "", "media": null, "score": 228, "upvote_ratio": 0.98, "comment_count": 24, "over_18": false}, "56": {"id": "1ensko4", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "SpikesAndSpook", "link_flair_text": "Haunted Building", "time": 1723258050.8557103, "created_utc": 1723184320.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1ensko4/a_ghost_or_creepy_person_still_not_sure/", "title": "A ghost or creepy person. Still not sure.", "permalink": "/r/Thetruthishere/comments/1ensko4/a_ghost_or_creepy_person_still_not_sure/", "selftext": "This story has rattled around in my brain for years and years. I'm not a believer in much but my SO and I were recently watching some of those corny top 5's and I brought up this whole thing from my childhood and still have no explanation so here it goes I guess. \nWhen I was young I lived in a very rural town in N. Michigan. Like so rural the population is easily 50% Amish. \nOur house at the time was pretty out of town, we lived on something like 20 acres of land. Pure fields and forest behind my house. No streetlights on this road or anything because it was dirt and that's just pretty common there (my folks and grands still live in the same town so I'm out there often) \nI was 14 at the time and it was a few days after my birthday so mid  winter   I had gotten a new PC and my mother and I were both playing Everquest. We kept the computers in the same room, it was kind of the way we spent time together. The computer room was right off the front door. Like you'd walk into the house and be right facing that room, and house was pretty small. \nBut we were doing a raid that night, it was like really late that night, between 11 and midnight, maybe later, and out of nowhere these loud knocks just bang on the front door. Like 3-4 knocks. Super loud. We looked over at the door and bang, like 3 more knocks. My mom and I just kind of look at each other, and she goes \"So you heard that too?\" Dudes my stomach flipped because like, ick right? \nI go to the door, I stand there for a few and I open it, and nothing. Not a soul. And for a second my brain was like \"Ah prank, whatever.\" Then I look down and there's snow all over the porch and it's perfect, untouched snow. No footprints, no marks at all. There was this like wheelchair ramp, one of the really long, gentle slope ones all the way to the driveway and nothing. Not a single mark. \nMy mom and I still talk about it occasionally and it weirds her out big time. \nNow here's some weirdness my brain didn't connect to until I was talking to my SO about it. Outside of this house is this massive tree, like huge. And one of the big sections of the tree had been cut off, like a whole 3rd of the tree where it branches off from the trunk. I wish I had pictures because it's weird. \nBut my friend and I had been just sitting under tree later in the year, spring or summer, I'm not sure but it was nice enough to sit in the grass. \nWe had this old dude who rode up and down the road on a mobility scooter, lived maybe a quarter mile up the road. \nHe pulled over on the side of the road and called me over there and he asked me if I lived there. I said yes, and then without missing a beat, this dude asks me if I knew the tree we were sitting under is where someone died. I just kinda stood there and he pointed to where the tree had been cut and said that the old owners kid hung himself there. Then he rode away just kinda talking to himself. My friend left because she was freaked out. \nNow I don't know if what he said actually happened, never dug into it, but dude was always up and down the road yelling, singing, talking to himself. \nSorry this was a long one, but I never know what to leave out or whatever. And to be honest, never connected the 2 stories in my brain to each other. \nTLDR: Someone or something knocked on my door a bunch at Midnight and left no tracks in the snow. Then a few months later, a creepy weird dude came to my yard to tell me someone died in my favorite tree.", "media": null, "score": 10, "upvote_ratio": 0.86, "comment_count": 8, "over_18": false}, "57": {"id": "1eljluj", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "DieMrCupCake2", "link_flair_text": null, "time": 1723258051.0535922, "created_utc": 1722955431.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1eljluj/we_were_followed/", "title": "We were followed", "permalink": "/r/LetsNotMeet/comments/1eljluj/we_were_followed/", "selftext": "Me and a friend I will call Robert had just spent the day in a city a few hours from our own. We had just spent the day at an event in which we had both participated in and we had a blast. After the event we decided to go out and get dinner with a group of our friends and ended up staying in this city until almost midnight before we decided we should probably get going.\nThe drive home was very uneventful for most of the way home. The roads in-between the two cities are very rural with only a few small towns between the two. Since it was dark we spent most of the drive looking for animals that may run out in the road while chatting with each other. As we got fairly close to Robert's house we saw a car parked on the opposite side of the road facing the wrong way and a man walking around on and next to the road. The car in front of us just so happened to be an ambulance which stopped to try to help the man. As we drove past I made eye contact with him and we continued on our way thinking nothing of what just happened. \nWe drove for another 20-30 minutes before turning onto the access road to get to Robert's house. As we got farther up the road we noticed another car had turned on the road farther behind us. Robert lives in a \"gated\" community so we had to turn onto the driveway so we could go through the gate. This is then when we noticed that the car that had turned before had turned again and was right behind us. As we pulled up to the gate Robert opened it and we drove through. The car behind us had also managed to make it in before the gate closed. \nNeither of us had really thought we were being followed until this point but even then we joked about it. We then drove for a while inside of this neighborhood which is fairly large and noticed this car was still behind us. The route we took was a large curve so we figured he should have turned off by now. As we got close to his house we decided to keep going as the road would loop around and confirm we were being followed. At this point we called my friends dad who had just watched us drive by with this car behind us. As we came around the loop we had come to the realization we were actually being followed.\nRobert then started driving much quicker through the neighborhood and the car behind has also sped up. We were going about 50-60mph on these fairly small roads but the other car kept up. We drove for a while before we decided to head to the front gate which had a 24 hour security guard and we still were not sure if the person following us had a key fob to open the gate or not. We left the neighborhood and pulled a uturn back to thr front gate. We were still driving very fast at this point and to anyone it should have been apparent we were being chased. As we came back to the front gate my friend was able to open it in a way we couldn't be followed but as we turned the corner we saw the gate opening and the car that was following us drove in.\nThis is were we made a huge mistake. We turned down a road without realizing it was a cul-de-sac. As soon as we noticed our mistake Robert was able to flip the car around so we could get out of there, but as we drove by the car I made eye contact with the driver but could barely see his face. When we turned out of the cul-de-sac we turned off the lights and booked it. We finally had managed to shake him and get to Robert's house.\nWe waited at Robert's house for the police to arrive and shortly after the officer had arrived he got a call on the radio and he booked it to his car. A few minutes later 2 more police cars showed up and we were informed they had found the car. The man was the same guy we had passed on the side of the road around an hour earlier. When police first made contact with him he refused to speak and did not look like he was in a right state of mind. As the traffic stop proceeded he began threatening officers. We later found out he was a mentally ill and unstable veteran from a couple states over and had no reason to be anywhere close to where we were.\nThe man had broken the back gate when he followed us in. The worst of all is the guy at the front gate who's only job was to not let people in if they didn't have a fob without stopping at his both let this guy in after we had just sped past him. He was quickly fired by the security company.\nLooking back on this there is only 1 thing I would have changed. I would have called the police sooner but the adrenaline in the moment clouded our judgment.", "media": null, "score": 126, "upvote_ratio": 0.97, "comment_count": 3, "over_18": true}, "58": {"id": "1ek79vd", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "DonMcMani", "link_flair_text": "Captured Apparition ", "time": 1723258051.7242768, "created_utc": 1722809089.0, "url": "https://v.redd.it/rvibpuvxzpgd1", "title": "Paranormal footage: soda can moves by itself", "permalink": "/r/Ghosts/comments/1ek79vd/paranormal_footage_soda_can_moves_by_itself/", "selftext": "This happened in Thailand. Posted by a Thai-fb-user.\nShe claimed that her soda was only a little bit colder than room temperature.\nAny idea what causes it move?", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/rvibpuvxzpgd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/rvibpuvxzpgd1/DASH_96.mp4", "dash_url": "https://v.redd.it/rvibpuvxzpgd1/DASHPlaylist.mpd?a=1725850051%2CYWQ5ZGNiZWYyYWU0NmIxZmMxMTcyNGU3MzIxZTk1NGVhMGViZmJhMTkwMjk1ZGVjYjdlZDA3OTZjNWY4ZTZkOQ%3D%3D&v=1&f=sd", "duration": 22, "hls_url": "https://v.redd.it/rvibpuvxzpgd1/HLSPlaylist.m3u8?a=1725850051%2CZDk5M2I3OWM5ZmEwZTVhYmIxMDIzMTAxYzQ1ZmZkM2I3ZGZlYmM2NWI2ZDE2MjA3OWRjNTc5ZjA3OTg0NmNjYQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 451, "upvote_ratio": 0.81, "comment_count": 125, "over_18": false}, "59": {"id": "1emxo66", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "shanezen", "link_flair_text": "Glitch Vid", "time": 1723258052.0085764, "created_utc": 1723093972.0, "url": "https://v.redd.it/pakxflpeebhd1", "title": "The Word of The Day is “Weird”", "permalink": "/r/GlitchInTheMatrix/comments/1emxo66/the_word_of_the_day_is_weird/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.34, "comment_count": 3, "over_18": false}, "60": {"id": "1eksxa3", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "pickingupchange", "link_flair_text": "Discussion", "time": 1723258053.166284, "created_utc": 1722877045.0, "url": "https://www.reddit.com/r/ufo/comments/1eksxa3/i_built_a_website_that_tracks_google_searches_for/", "title": "I built a website that tracks Google searches for \"I saw a UAP/UFO\" in real-time", "permalink": "/r/ufo/comments/1eksxa3/i_built_a_website_that_tracks_google_searches_for/", "selftext": "I recently launched a website that tracks Google searches for “I saw a UAP / UFO,” “report a UAP / UFO sighting,” and plots those searches to a heat-map of the US in real-time.\nhttps://www.uapsightingtracker.com/\n(*the reason this is US only, is I pay for every ad click that drives the data. Each expanded territory beyond US costs \\~$500 per month)\n(I want to clarify:...whether someone clicks an ad or not, the data still populates. It populates upon the impression (search being conducted, NOT the ad click))\nIt also compiles the searchers’ age, gender, and word-for-word searches (while washing them of all personal identifiers). All data is downloadable for free, and can be segmented by date range. \nI ran this site for five weeks last summer, but ran out of funding (I pay Google for every ad click that drives the data) and had to pause the campaigns.\nThe project is now resumed (Data begins again Aug 2 - current) and I plan to keep it running for 12 months.\nI get this data by running Google Ads for the searches \"I saw a UAP/UFO / report a UAP/UFO”. I pay for each ad click.\nI have two goals this time around: \n1 gain funding to be able to keep the campaigns running but also (ideally) expand this worldwide (costs to run this in the US run about $1000 per month. Worldwide would likely run $5000-10000 per month). \n2 incorporate some of the great feedback you guys provided last summer. The top suggestions were:\nA Normalize data to population\nB Make more mobile friendly\nC Incorporate a slider function with date (so map sightings change as the slider is moved)\n(Feel free to DM me if you are interested in helping with any of the three items above! While I'm a Google Ads expert, I don't know how to do any of the above.)\nSame as last summer, this site is meant for those interested in tracking the movements of UAPs, but I hope anyone can get something out of it!\nAbout me: I’ve been a Google search engine marketer for 15 years. My experiments with Google Ads have been featured in New York Times, Wired, NPR, Reuters, Mashable, and BBC. ", "media": null, "score": 102, "upvote_ratio": 0.92, "comment_count": 21, "over_18": false}, "61": {"id": "1ejhi8a", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Smart_Atmosphere_430", "link_flair_text": "Discussion", "time": 1723258054.7572396, "created_utc": 1722728951.0, "url": "https://v.redd.it/ft707zekdjgd1", "title": "Hi I seen a ufo and I didnt write enough context when I posted this before so it got deleted. I’m repost it now. This was in Tampa, FL I don’t remember how long. I thing 1.5 year ago ", "permalink": "/r/UFOs/comments/1ejhi8a/hi_i_seen_a_ufo_and_i_didnt_write_enough_context/", "selftext": "This is definitely not a balloon. Scary stuff to be honest it was not moving at all like made no sense. It was pretty small that’s why I thought it was a balloon, but it just didn’t move. Even after the recording I stood up and was looking behind the rear mirror of the car that motherfucker did not move for shit. I wish my dear, which was driving the time pulled over and gave us the chance to just stare at it for a while to see if anything would happen like to see if go away, but she was just like now. It’s just a balloon honey so yeah sadly I couldn’t catch that motherfucker super sonic speed away. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/ft707zekdjgd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/ft707zekdjgd1/DASH_96.mp4", "dash_url": "https://v.redd.it/ft707zekdjgd1/DASHPlaylist.mpd?a=1725850053%2CZWFhZTUxYTYyYzA5YjZhMjMzODJmMWMwMjFjMzUyMzBmZTdiMDcyZmEwNTU0NGQ1YWI4YjJhNzE5MDQ3NzQwOQ%3D%3D&v=1&f=sd", "duration": 11, "hls_url": "https://v.redd.it/ft707zekdjgd1/HLSPlaylist.m3u8?a=1725850053%2CNWIyNzYxYzU2OTQxYzhkZDJkODYwZTY4ODQ5N2I5ZTQ3ZTBiOGQzODg2YTA0YWY4MzExNWE1NThlZTgxY2ZhZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 914, "upvote_ratio": 0.81, "comment_count": 328, "over_18": false}, "62": {"id": "1elyflp", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "DragonfruitOdd1989", "link_flair_text": "Evidence :upvote:", "time": 1723258056.8225257, "created_utc": 1722991834.0, "url": "https://v.redd.it/4dao1shw25hd1", "title": "Tridactyl being known as Maria.", "permalink": "/r/aliens/comments/1elyflp/tridactyl_being_known_as_maria/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/4dao1shw25hd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 848, "scrubber_media_url": "https://v.redd.it/4dao1shw25hd1/DASH_96.mp4", "dash_url": "https://v.redd.it/4dao1shw25hd1/DASHPlaylist.mpd?a=1725850055%2CZWU4NDExMzcyNTcyYTk0NTk1Yzc0ODBhZGJkNTQzM2IxMjc3MTM0ZDRiZmNkMzE0NzEwNmYyOTBlZGJlM2I3MA%3D%3D&v=1&f=sd", "duration": 354, "hls_url": "https://v.redd.it/4dao1shw25hd1/HLSPlaylist.m3u8?a=1725850055%2CNzU0NGNkZDNkNmY1M2JhZWRlNjdmZWVjNjRlYTZlZjg0YTNiNDgxZDg5MWQzNWVjODY5OGRiMjYyODAzMmJmMw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 999, "upvote_ratio": 0.89, "comment_count": 371, "over_18": false}, "63": {"id": "1enroif", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "theawesomer80", "link_flair_text": null, "time": 1723258057.0366797, "created_utc": 1723180991.0, "url": "https://www.reddit.com/r/UAP/comments/1enroif/uap_travel_direction_pattern_mapping/", "title": "UAP Travel Direction Pattern Mapping", "permalink": "/r/UAP/comments/1enroif/uap_travel_direction_pattern_mapping/", "selftext": "There was a recent article that came out that they had tracked UAP travel direction from sightings and that they seem to travel along similar routes. I can find that article by searching here or through search engines. Does anyone know where I can find that article? ", "media": null, "score": 3, "upvote_ratio": 0.62, "comment_count": 2, "over_18": false}, "64": {"id": "1ejjlav", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "xxdaimon", "link_flair_text": null, "time": 1723258058.2286975, "created_utc": 1722735230.0, "url": "https://i.redd.it/bvl2hmibwjgd1.png", "title": "The cornucopia theory", "permalink": "/r/conspiracy/comments/1ejjlav/the_cornucopia_theory/", "selftext": "", "media": null, "score": 2556, "upvote_ratio": 0.95, "comment_count": 658, "over_18": false}, "65": {"id": "1eiwbqo", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1723258058.5816293, "created_utc": 1722665778.0, "url": "https://youtube.com/live/ehLhq6QR7hA", "title": "I AM A SCAMMER - The Anthony Esemplare Story!", "permalink": "/r/conspiracyfact/comments/1eiwbqo/i_am_a_scammer_the_anthony_esemplare_story/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "66": {"id": "1ejpja3", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "ZigarettenFranzl211", "link_flair_text": "PGF", "time": 1723258059.7110229, "created_utc": 1722756304.0, "url": "https://i.redd.it/cui43cczmlgd1.jpeg", "title": "Muscle definition", "permalink": "/r/bigfoot/comments/1ejpja3/muscle_definition/", "selftext": "I know this is talked about very often.\nBut this either the best costume ever made, or it is a real creature, and i go with the second choice.\nThe maker of such a costume must be an anatomical genius.\nThe split in the calf muscle which is two headed\nThe tricep muscle\nThe rear and side delt muscle\nThe trapecious\nThe spine erector muscles", "media": null, "score": 446, "upvote_ratio": 0.9, "comment_count": 180, "over_18": false}, "67": {"id": "1empeo2", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Evidence", "time": 1723258060.3787827, "created_utc": 1723069765.0, "url": "https://i.redd.it/qbucl0f0jbhd1.jpeg", "title": "While walking one day, Rick Woods of Oregon felt as if something was watching him. He snapped this photo of the creature (believed to be bigfoot) before it walked out of sight.", "permalink": "/r/Cryptozoology/comments/1empeo2/while_walking_one_day_rick_woods_of_oregon_felt/", "selftext": "", "media": null, "score": 215, "upvote_ratio": 0.9, "comment_count": 33, "over_18": false}, "68": {"id": "1elu0qs", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Garoga23", "link_flair_text": null, "time": 1723258061.3103797, "created_utc": 1722980276.0, "url": "https://i.redd.it/5vwqt3hx44hd1.png", "title": "Mothman art I did", "permalink": "/r/cryptids/comments/1elu0qs/mothman_art_i_did/", "selftext": "", "media": null, "score": 157, "upvote_ratio": 0.97, "comment_count": 13, "over_18": false}, "69": {"id": "1ent0s6", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Ingridchh", "link_flair_text": "Lights/Glows", "time": 1723258061.4875126, "created_utc": 1723186038.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1ent0s6/the_light_just_turned_on_when_i_got_home/", "title": "The light just turned on when I got home... ", "permalink": "/r/Thetruthishere/comments/1ent0s6/the_light_just_turned_on_when_i_got_home/", "selftext": "This is one of my first \"real\" paranormal encounters.\nI had just got home from a late night 2 AM joyride and when I entered the kitched of my house, I chose to just use my phone light to grab something from the fridge because I didn't want to draw attention to myself looking like a creep if my neighbors were up. \nI was actually debating turning on a light switch, but chose to just use my phone flashlight to get to the fridge instead. As I walked past one of the 5 light switch outlets in the kitchen, the portion where I was standing switched on suddenly. \nWe don't have any automatic lights, so it would have been impossible for that to happen. As I looked at the outlet, the switch was switched to the ON position. \nPretty weird because I literally just had a thought like \"what if this house is paranormal\", then I rebutted it confidently. After I walked past the switch, it turned on. ", "media": null, "score": 2, "upvote_ratio": 0.56, "comment_count": 4, "over_18": false}, "70": {"id": "1emot48", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "PumpkinMan35", "link_flair_text": null, "time": 1723258061.7115817, "created_utc": 1723068262.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1emot48/the_kit_kaboodle_lady/", "title": "The Kit & Kaboodle Lady ", "permalink": "/r/LetsNotMeet/comments/1emot48/the_kit_kaboodle_lady/", "selftext": "When I graduated high school in 2008, I was kinda at a loss on what to do with my life. I got a job at a local convenience store working night shift, and for about eight months I really enjoyed it. My parents and friends were always concerned about me getting robbed or murdered, and rightfully so, but I never had an issue with anyone. \nAbout a year in, I finally experienced the encounter that made me change my life. It was a pleasantly cool late September evening, and at about 0235 (2:35am in civilian time) the door opens and this skinny frail figure of a young woman comes in. I’ll never be able to forget her. \nIf it wasn’t for the way she was acting, she honestly would have been kinda cute. She had a collarbone waterfall of brown hair, tan skin, an attractive figure, and was wearing a tight fitting dark gray tank top. I’d say she was in her late 20s or early 30s, but it was her eyes that really captivated me…and not in a good way. \nThe woman had this blank and distant stare. It was like she was an expressionless shell, moving purely on a robotic instinct. She didn’t say hi, howdy, what’s up Doc, or anything even after I greeted her from just like 4’ away. Honestly, I just assumed she was high or something. \nShe moved past the front counter towards a little household supply aisle we had. She picked up a little bag of cat food and turned back towards me, staring me straight in the eyes so intently that I thought she was about to pull a gun and shoot me. What she did was honestly much worse though. \nShe got to the front counter, never breaking her silence or gaze even after I tried talking with her. She reached into her pocket and pulled out a $5 bill and like three quarters. With tax it was still a little short of the price, but I’d take a dollar out of my wallet and stick it in the cash register later. She was starting to creep me out! \nAfter I took the money and rang her up, she didn’t move. Just stood there, staring at me without even blinking. I tried speaking to her again, but this time she brought the cat food up, and opened it with the littlest ease I’ve seen a package of pet food get opened ever. \nBy this time I’m just standing in silence trying to figure out what the heck she’s doing. Her gaze is unflinching, and she reached into the bag and pulled out a big handful of cat food. Staring at me, as blank and expressionless as the very second she had entered the store, she shoved the whole handful of pet food into her mouth and started crunching away. \nBits and pieces of the cat food dropped from her lips and onto the floor. I wanted to say something, but I was just too flabbergasted to even get my voice out of my throat. Finally, after a couple of minutes of chewing on her cat food, the woman just turned and walked out of the store holding onto the bag of pet food. \nMy boss pulled up camera footage of the incident the following morning before I clocked out. He said he had seen the woman before, but only once in his five years of employment there. He told me, and I kinda think this was a lie, that she was a crazy woman who lived in an old mausoleum in the city cemetery. He said the cops knew about her, and as a part of their initial nightly patrols would go and check on her to make sure she wasn’t dead. \nThat was the night that made me decide to go to a trade school. I never want to work at a gas station again! Every so often, she still appears in my nightmares…just standing there, staring at me with deep blank eyes, crunching on a handful of cat food. Nope, never want to meet her again. ", "media": null, "score": 82, "upvote_ratio": 0.96, "comment_count": 5, "over_18": true}, "71": {"id": "1ejy29q", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "MisscellaneousDebris", "link_flair_text": null, "time": 1723258062.4447162, "created_utc": 1722785777.0, "url": "https://www.reddit.com/r/Ghosts/comments/1ejy29q/my_dad_is_haunting_my_mom_advice_help/", "title": "My Dad is Haunting my Mom.  Advice? Help?", "permalink": "/r/Ghosts/comments/1ejy29q/my_dad_is_haunting_my_mom_advice_help/", "selftext": "ETA update:  my mom has had 2 nights (Sunday night into Monday and Monday night into Tuesday) of peace and quiet and full nights’ rest.  This was after a mini cleansing, calling to his guardians to come help him and for him to cross into the light.\nMy dad (84) passed in the hospital in March, this year (2024). \nSince he’s passed, progressively, my mom (82) has been contacted more and more frequently.   The first time, she felt him get into bed.  Then her hip was touched.  She’d hear knocking at scratching at the bathroom door when she’d go into shower. Then our dog would stare into the corner where he used to get ready for bed.  Now, she’s getting shoved (hard) when she goes to bed at night, he’s grabbing her leg or her arm.  My (13 yo) son slept with her in her bed the other night to make her feel safe.  That night, she woke up and he was sitting at the foot of the bed, naked, and said his hands and arms were moving in a weird jerky fashion.  She thinks he appeared because someone was sleeping on his side of the bed.  Last night, he grabbed her ankle and leg repeatedly.   Needless to say, she’s not getting sleep/rest.  \nAll activity is centered around my mom, their bedroom and bathroom.\nToday, we’re been walking around the house saying “(dad’s name) we love and miss you but you need to move into the light.  Your parents (and other named loved ones) are waiting for you in the light.  You died in the hosptial which is why we can’t hear you.  We love you and miss you, but move into the light”.  \nI don’t know is this will help or not?  Is burning sage something that could help?  My dad was Catholic, should we call a priest?\nAny advice or help is appreciated.\nETA:  thing started happening after the ashes came home a few weeks after he passed\nETA:  she will get a psych eval for dementia/grief \nETA:  it was my father, her husband, she saw naked at the foot of the bed, not my son\nETA:  while I appreciate humor and levity, maybe refrain from jokes right now.  ", "media": null, "score": 274, "upvote_ratio": 0.91, "comment_count": 129, "over_18": false}}}