{"_default": {"1": {"id": "1gd4xl7", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "uapinvestigations1", "link_flair_text": null, "time": 1730516384.2203584, "created_utc": 1730011110.0, "url": "https://i.redd.it/or0wz5u8v8xd1.jpeg", "title": "Never forget UFOs history! ", "permalink": "/r/ufo/comments/1gd4xl7/never_forget_ufos_history/", "selftext": "", "media": null, "score": 885, "upvote_ratio": 0.97, "comment_count": 87, "over_18": false}, "2": {"id": "1gfqjcc", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "CreditCardOnly", "link_flair_text": "Photo", "time": 1730516385.8848424, "created_utc": 1730305309.0, "url": "https://i.redd.it/h95qmas16xxd1.jpeg", "title": "Lue Elizondo’s response to the debunked UAP image he presented", "permalink": "/r/UFOs/comments/1gfqjcc/lue_elizondos_response_to_the_debunked_uap_image/", "selftext": "", "media": null, "score": 3117, "upvote_ratio": 0.88, "comment_count": 1404, "over_18": false}, "3": {"id": "1gco7na", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Ok_Peace4040", "link_flair_text": "Video", "time": 1730516387.8854601, "created_utc": 1729958191.0, "url": "https://v.redd.it/vyfza52uh4xd1", "title": "Pyramid UFO over Hebei Luannan Power Plant, China Serious", "permalink": "/r/aliens/comments/1gco7na/pyramid_ufo_over_hebei_luannan_power_plant_china/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/vyfza52uh4xd1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 640, "scrubber_media_url": "https://v.redd.it/vyfza52uh4xd1/DASH_96.mp4", "dash_url": "https://v.redd.it/vyfza52uh4xd1/DASHPlaylist.mpd?a=1733108386%2CNDFiMTY3MWNiNzc5M2I5OTFjMjU3NTViMTBkMGZlMmUyZGY3YmU4N2UxOWMzM2VhNzViYjFlMDA3Yzc0M2Y2Ng%3D%3D&v=1&f=sd", "duration": 37, "hls_url": "https://v.redd.it/vyfza52uh4xd1/HLSPlaylist.m3u8?a=1733108386%2CMjVhYzViMDM5MjhjOTg2NjQ4YzAxNDYyNjI1OGQ3NWMwOTg5MzkyOWZlNWNkYWFhYTdjMjdlYmU4YzY5YzhhMg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3232, "upvote_ratio": 0.73, "comment_count": 1189, "over_18": false}, "4": {"id": "1ggg24j", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "skorupak", "link_flair_text": null, "time": 1730516388.5360937, "created_utc": 1730385443.0, "url": "https://anomalien.com/luis-elizondo-apologizes-for-presenting-fake-ufo-mothership-image-at-private-event/", "title": "Luis Elizondo Apologizes for Presenting Fake ‘UFO Mothership’ Image at Private Event", "permalink": "/r/UAP/comments/1ggg24j/luis_elizondo_apologizes_for_presenting_fake_ufo/", "selftext": "", "media": null, "score": 261, "upvote_ratio": 0.82, "comment_count": 187, "over_18": false}, "5": {"id": "1gft1pl", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Infinite_Delay_2710", "link_flair_text": null, "time": 1730516389.9902976, "created_utc": 1730311558.0, "url": "https://i.redd.it/16duk2jmoxxd1.jpeg", "title": "ABC “mistakenly” aired election results for Pennsylvania ", "permalink": "/r/conspiracy/comments/1gft1pl/abc_mistakenly_aired_election_results_for/", "selftext": "The results appeared on the ticker along the bottom of the screen during a broadcast of the Formula 1 Mexico Grand Prix by ABC local affiliate WNEP-TV on Sunday.", "media": null, "score": 4277, "upvote_ratio": 0.82, "comment_count": 931, "over_18": false}, "6": {"id": "1gf492k", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1730516390.2795627, "created_utc": 1730232804.0, "url": "https://x.com/JordanHarmon/status/1850170415869505625", "title": "Boycott YouTube\nHow does a video get 10m views in 11 hours and not only not end up as the number 1 on Trending, but not on Trending at all?", "permalink": "/r/conspiracyfact/comments/1gf492k/boycott_youtube_how_does_a_video_get_10m_views_in/", "selftext": "", "media": null, "score": 8, "upvote_ratio": 0.66, "comment_count": 2, "over_18": false}, "7": {"id": "1gfbnes", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "fishdumpling", "link_flair_text": "humor", "time": 1730516391.029263, "created_utc": 1730253034.0, "url": "https://i.redd.it/mwr7g91musxd1.jpeg", "title": "Guys, I'm done with humans", "permalink": "/r/bigfoot/comments/1gfbnes/guys_im_done_with_humans/", "selftext": "", "media": null, "score": 600, "upvote_ratio": 0.96, "comment_count": 47, "over_18": false}, "8": {"id": "1gcjcde", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "BrickAntique5284", "link_flair_text": "Question", "time": 1730516391.868872, "created_utc": 1729943608.0, "url": "https://i.redd.it/lrg6962ja3xd1.jpeg", "title": "Isn’t this strange about neodinosaurs?", "permalink": "/r/Cryptozoology/comments/1gcjcde/isnt_this_strange_about_neodinosaurs/", "selftext": "Doesn’t anybody other than me find it strange that all of these neodinosaur Cryptids seem be resemble famous dinosaur species every living human knows?\nLike, have anybody seen anything resembling a Therizinosaurus; not as far as I remember. Any hadrosaurs, nope. Any pachycephalosaurs? Nope.", "media": null, "score": 1614, "upvote_ratio": 0.98, "comment_count": 167, "over_18": false}, "9": {"id": "1ggkoah", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Johanharry74", "link_flair_text": "U.F.O. Humanoid", "time": 1730516392.226587, "created_utc": 1730397362.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1ggkoah/humanoid_close_encounter_cases_from_the_nordic/", "title": "Humanoid close encounter cases from the Nordic countries - Part 9", "permalink": "/r/Humanoidencounters/comments/1ggkoah/humanoid_close_encounter_cases_from_the_nordic/", "selftext": "Welcome to another episode in this series. This time we have five different reports. The last case is closer to my heart, because it happened near where I live. While this was not a true CE3 encounter, the humanoids inside the ship were still close enough, so the observer could almost touch them. Also we have a very early intresting case from the beginning of the 1900´s. As ususal stories from Norway, Denmark, Finland and Sweden.\nBoy meeting strange people on the road.\nSulitjelma/ Jakobsbakken, northen Norway, Summer 1915.\nAt the beginning of the 20th century, there was still full mining in the facility at Jakobsbakken, which was a small mountain community at the tree line near the slightly larger village of Sulitjelma. At that time, many families lived in their houses next to the mining area. Today, there are no permanent residents left in Jakobsbakken.\nThe bell shaped craft in the sky above Sulitjelma. (source: Wikipedia\\/ modified by author)\nBjarne Westvand was 6 years old in 1915. On this summer afternoon, he walked alone to his home in Jakobsbakken, after he had been playing with other children in the village. As he walked along the gravel road, he saw a dark church bell/jingle bell like object slowly descend from the sky to the west, and it appeared to land behind a hill to the left of the road, roughly where the mining village dump was. Bjarne was surprised when he suddenly saw two people coming over the hill and down towards the gravel road. They walked a bit on the road towards the old wooden bridge over the river, then turned around and headed towards Bjarne. One person stopped while the other walked smilingly closer to the boy, who stood as if petrified. These strange people were almost as short as the 6-year-old himself. They had long dark, wavy hair, with large heads in relation to their bodies, and they had gray skin. The eyes were large, but still quite human like. The people were dressed in brown or dark overalls. Before the people went in different directions on the road, Bjarne had heard them talking to each other and it was in a strange \"rumbling\" way. After this brief meeting with the boy, they went back over the hill and disappeared. Soon after, Bjarne saw the bell-like craft appear above the hill and quickly lift off into the sky until it disappeared out of sight.\nSketch of the humanoid, although the being had black hair, not white as in picture. Also map showing the encounter. (Source: Rapportnytt 4\\/1981)\nWas this a very early encounter with the so called Grey aliens? However, they did not match the usual archetype of them, as these had black hair. Or were they perhaps hybrids? It should be added that this story was only told by Bjarne when he was an old man and perhaps it can then be colored by the popular culture's image of aliens during the 80s. If this history had been recorded in the early 20th century, might the beings have looked completely different in sketches? You can be influenced by later stories, when it comes to old experiences... Or did the boy simply imagine it all, that time in the summer of 1915?\nSources: Rapportnytt 4/1981, UFO Temahefte 2 - Norske nærkontakter av 3. Grad\nArtistic rendering of what the beings on the road might have looked like.\nNazis or Aliens...or both?\nKongens Tisted, northen Denmark, July or August 1940.\nThis strange event took place in the summer of 1940 during a raging World War II and Nazi Germany's occupation of Denmark. This afternoon it was sunny and clear weather and a 15-year-old boy was on his way from Kongens Tisted in a south-easterly direction to an area by Tisbjerg, which is a small hill located between grass meadows and heather moorland. Here he would fill the troughs with water for the cows grazing in the area. As he came walking on the path north of the hill, he saw three men walking side by side towards him through the heather from the northeast. The boy could see that the people were dressed alike in dark green, shiny and almost silky-like suits, which closed tightly around the body up to the neck. On their heads were tight-fitting helmets in the same color as the suit. In front of their faces they had a large visor made of a transparent material that resembled glass. At the front of the suits they had two protruding things that looked like hoses or tubes. These started at the feet and went on the outside of the suit all the way up to the shoulders. The boy couldn't see that they had anything resembling shoes. The suit also included the feet. They also had no buttons, zippers or pockets on the suit. The people had normal build and height like ordinary persons in general. The gait was also normal and he could see that they swung their arms slightly as they walked.\nThe \\\"people\\\" the boy encountered looked like strange pilots. (Source: UFO-Nyt)\nThe 15-year-old wondered what kind of mysterious people were out walking on this heath, as it was quite deserted around here. His first impression was that it was some mechanics of some sort. But about 30 meters (90 feet) from the boy, the three men suddenly turned off to the south and disappeared behind the hill, as if they did not want to meet and pass him. The boy now became a little afraid of these strange people, but curiosity made him run up the hill to look for them. He now saw that the person who was walking closest to the hill on the right side had slipped a little and then caught up with the others and was now on the left flank. Then side by side they went back down through the heather towards a lower area. The boy now looked at the backs of the three and saw that their suits were shiny on the back. Now he also caught sight of a metallic and round, dome-shaped object, parked in the heather about 200 meters (219 yards) from the hill, and he saw the sun reflected in the glossy surface. He understood that it was a type of craft, but he could not see any windows or doors, nor could he see any landing legs or wheels. The boy had no idea of ​​the size in meters, but he thought it was the same size as a German fighter plane. Since the Nazis had occupied Denmark, he thought that perhaps this was some sort of German secret craft and that the people were German military pilots.\nWhen the three men reached the craft, they stopped for a moment and stood still in front of it. Then suddenly they were gone. The boy was very surprised, for he had expected them to enter through some hatch in the ship, not disappear into thin air. After a short while the craft began to move and ascended silently and slowly, but then after 6-7 seconds it changed direction to the southeast and the speed increased enormously quickly, only to disappear as a dot in the sky after a few seconds. During the rapid acceleration, the boy heard a sound, similar to the sound of swinging a long fishing rod quickly through the air...a \"Swooooosh!\". After the craft was gone, the 15-year-old ran down to the landing site. There he saw that the heather, which was high here, was slowly rising again after being pressed down. He did not notice any pressure marks in the ground or that the vegetation had any burn marks.\nThe strange \\\"men\\\" walked side by side towards a shiny, metallic object parked in the heather. (source: UFO-Nyt)\nOn the way home, the boy speculated on what kind of strange craft it could have been. He had several times seen German military aircraft take off and land at Aalborg airfield. But he had never seen any aircraft like this wingless and engineless craft, and which flew at such a high speed. When he got home, he told his mother about the weird craft, but she assured him that it was probably the Germans he had seen. And that he was never allowed to talk about this again, for his own sake, because otherwise the Germans might come and take him away. And after that the boy never talked about it again. Long after, many, many years after the Second World War ended, he read about UFOs and then thought that maybe it was beings from space that he had seen when he was a boy. Only in 1974 did he tell UFO investigators about his experience during the war.\nUnfortunately, this story was told more than 30 years after it happened, so it may well be that memories have faded and things are being remembered incorrectly. But as many know who have been part of something very unusual, that memory is etched in the brain and many decades later you can still see the event playing like a movie in your head plain and clearly, as if it was yesterday.\nWere the boy seeing visitors from another planet? Or was there a more earthly explanation? There are many legends that the Nazis and the secret Thule Society had already mastered anti-gravity technology before World War II began, and that the Germans operated several top-secret flying saucers during the war. Was this what he saw? We will probably never get an answer to that...\nSource: UFO-Nyt no 6 1974, https://hiddenmark.dk/ufos/kgs-thisted-ce3/\nThere is a legend in UFO-circles that the Nazis had flying saucer technology. (Source: Jim Nichols)\nCurious about the clock.\nJärvenpää, southern Finland, Summer 1956.\nThis is also an older CE3 case from Finland. This took place in the farmlands outside of the town of Järvenpää near Helsinki. Unfortunately the story is short and there is not much details of what the beings looked like. But from the little description we have, we can assume that the Greys were at it again.\nA 15-year-old girl was sleeping in the main farm house. Her brother was sleeping in one of the nearby storage houses. In the middle of the night, she woke up to find two humanoids with big eyes and gray jumpsuits standing in her bedroom. She was very shocked, and for fear that they would take her, she pretended to sleep. But secretly she watched the beings out of the corner of her eye. For some strange reason, they seemed very interested in her alarm clock that she kept on the bedside table. They picked it up and looked at it curiously. Then they set the clock down and went on into the living room. The girl could still see the creatures through the doorway, and there they stood around the large ticking Grandpa floor clock. They studied this one too and she could see how they tampered with it.\nThe short aliens were very curious about all the clocks in the house (artisitic impression)\nAfter a while, the humanoids left the main building. The girl now sneaked out of bed and over to the window and cautiously looked out into the courtyard. Outside, she saw how one of the beings was standing in front of the open door of the storage house and it had an alarm clock in its hand. Soon after, the other humanoid came out of the door of the storage house where her brother was sleeping. Then something odd happened, as both creatures began to bounce up and down while moving forward. It was almost similar to how rabbits move. One after another they jumped away towards the field in the corner of the courtyard, where a strange object with many lights and a dome in the middle was waiting. The humanoids jumped into the ship, which then took off straight up into the night sky.\nThe next morning all the clocks in the house were showing the wrong time. Anything between 0:00 AM to 4:30 AM. Also, in the years that followed, nothing grew in the corner of the field where the strange craft had landed.\nSource: Mervi Virtanen\nA strange metallic craft with many lights and a cupola was seen in the field close to the farm. (artistic impression)\nThe alien chocolate cake party.\nVästervik, Sweden, December 4, 1979.\nA young woman named Lilli-Ann Karlsson was out walking at around 1 pm the night between December 3 and 4 1979. This was in the quiet town of Västervik in south east Sweden. She was planning to walk around the so called Breviks ”alps”, which is a recreational park and green area in the outskirts of the town, and in the center of this is a hill/ small mountain with an artificial ski slope, but it is still quite high and large and grassy without trees or bushes. This night the sky was clear and there was bright moonlight.\nLilli-Ann walked forward slowly with her hands in her jacket pockets. She looked at the ground and her mind wandered and she thought of everything and nothing. Suddenly she stopped as if paralyzed. Just next to the path and a little way up the ski slope, she saw a bright, faintly glowing object hovering still and silent 1 meter (3 feet) above the ground. She moved closer to the object and got the feeling of being watched. She understood that this was some kind of ship and that someone might be driving it. At the same moment, two beings came around the object.\nThe beings were tall and slender with big ears and they had a skin that looked like velvet. (source: UFO-Information)\nThey were quite tall, about 180 cm (5 feet 11) and slim. Lilli-Ann experienced them as completely white and with skin almost like velvet. They had no direct marked facial features, but they had large ears. And they hovered a little above the ground. Lilli-Ann later made a sketch of the humanoids. The young woman heard the beings talking, but she did not see the mouths move. It was like she could hear their discussions inside her head, and she could hear them talking about her. And at the same time she heard a voice telling her not to be afraid. But she wasn't scared at all, instead she just felt ridiculous and silly, when she heard what she thought sounded like laughter, and that someone said she looked strange.\nThe humanoids now approached Lilli-Ann and one of them extended his hand to her. She saw that there was something in it and it looked like chocolate cake. She just stood there and couldn't move out of the spot, nor could she move her arms. The creatures continued to hold out the cake and \"talked\" to each other. After a while they turned and walked/hovered back to the ship. They went around it and just disappeared the same way they just appeared. After they disappeared, Lilli-Ann saw a plume of smoke coming out of the bottom of the craft. In the next moment the ship just disappeared, and she didn't understand how it happened.\nLilli-Ann is showing UFO-Information magazine the grass slope where she met the humanoids and their craft.\nWhen the ship was gone, the paralysis went away and Lilli-Ann was able to move again. She ran home as fast as she could. Crying and upset, she entered the home. Her friend also lived there for a while, and she later told the investigator that Lilli-Ann was completely hysterical, which was unusual according to the friend. Later that night, her brother came home, as he is also a resident of the house. She told him what happened and they discussed it together. Lilli-Ann thought she had gone mad and talked about going to a psychiatric clinic. The brother calmed her and instead convinced her to contact a locally known UFO researcher in town. And the next day she called him.\nTwo days later, Lilli-Ann and Ufologist and Journalist Tor Wiklund visited the place where she met the humanoids and their craft. Neither she nor Tor could see any tracks in the grass after the events. There were neither burn marks nor bent grass at the scene. So, unfortunately, there was no evidence of the woman's experiences, as is often the case when lonely witnesses encounter Aliens and supernatural creatures. But what is interesting in this case is that the beings wanted to offer cake. It is quite unusual and only a few times where this has been reported before. One case was in France in Origny en Thierache on February 28, 1974, when two tall humanoids in square helmets stopped a cyclist on the road and forced him to eat something similar to milk chocolate. After that they went back to their ship and flew away. Why do they do this? What's the point of going many light years into space to force chocolate on some random person on Earth and then leaving again? Feels like very strange, illogical behavior. But something that is illogical for us humans, might be totally logical for some other life form... Or did they just meet intergalactic bakers that wanted to reach out to new customers? :-D\nSource: Västervikstidningen, URECAT, UFO-Information #4 1980\nA similar case were aliens gave someone something to eat was in France 1974. (source: Jean Marie Bigorne, Lumieres dans la nuit no 139)\nEDIT: There is another intresting case from the US where the aliens gave someone food. This takes place one morning at 11 AM April 18 1961 in Eagle River, Wisconsin. A chicken farmer saw an alien craft land in the outskirts of his yard. And he got a telepathic message that the occupants needed water. So he went out to the ship with a glass and gave it to the aliens, who he described as 3 feet tall (some sources say 5 feet tall) and humanoid looking, with dark skin and white overalls (\"Italian looking\" was his words). As a thanks they brought out a cooking device on the ground and cooked something that looked like pancakes. The aliens offered it to the farmer who ate and thought it tasted almost like ordinary, though very dry pancakes. He got a total of four pancakes. Then the humanoids and the craft took to the sky and left. Later, one of the pancakes was sent for analysis at the Air Force Technical Intelligence Center. They found it to be made from flour, sugar, and grease. / Source: Urban legend wikia\nJoe Simonton saved one of the pankcakes the alien gave him.\nA scary backyard encounter.\nMölndal, near Gothenburg, Swedish west coast, December 1998.\nWhile this was not a boots on the ground close encounter, it was still close enough for them to clearly see the silhouettes of the occupants of the craft. And this is a very special encounter for me, since it is near my own hometown.\nIt was around 9 pm on an evening in December 1998, when a man was watching TV, and he suddenly saw a strange light outside of his livingroom window. He got curious and went to take a look. Outside he saw something that he could hardly believe. A large, red, tube-shaped craft was hovering in the sky around 20 meters (60 feet) from his house. While he was watching from the window, the object descended to around 3 meters (9 feet) above his garden. It appeared to be a metallic craft encased in a dull, red glow and he could not hear any sound from it. His entire garden was encased in the spooky red light. The man estimated the craft to be around 5 – 6 meters in length (15-18 feet) and around 1,5 - 2 meters in width (4.5-6 feet). In a large window-like opening on the craft, he reported seeing the silhouettes of several man-like figures moving around. Very soon, the craft moved away silently and disappeared as fast as it showed up. The man stood there in the living room window baffled and thought if he had been dreaming…\nSource: UFO-Sweden.\nA long, tube shaped craft that was glowing in red, was hovering in the man's backyard. Inside a lit window he could see beings moving around. (artistic impression)", "media": null, "score": 36, "upvote_ratio": 0.91, "comment_count": 14, "over_18": false}, "10": {"id": "1ggv7c9", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "spidersRcute", "link_flair_text": null, "time": 1730516393.1060855, "created_utc": 1730427075.0, "url": "https://i.redd.it/4d9rjt8487yd1.jpeg", "title": "My 10 year old daughter was mothman for Halloween. She really committed herself to the role. ", "permalink": "/r/cryptids/comments/1ggv7c9/my_10_year_old_daughter_was_mothman_for_halloween/", "selftext": "", "media": null, "score": 1474, "upvote_ratio": 1.0, "comment_count": 29, "over_18": false}, "11": {"id": "1gf91rf", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Goth_Ophelia", "link_flair_text": "Discussion/Advice", "time": 1730516393.3737144, "created_utc": 1730245428.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gf91rf/in_the_spirit_of_halloween_whats_the_most/", "title": "In the spirit of Halloween, what’s the most creepiest/unexplainable thing that has ever happened to you?", "permalink": "/r/Thetruthishere/comments/1gf91rf/in_the_spirit_of_halloween_whats_the_most/", "selftext": "Happy Halloween everyone! \nEdit: Thank you for sharing your experiences! ", "media": null, "score": 298, "upvote_ratio": 0.97, "comment_count": 175, "over_18": false}, "12": {"id": "1gcchfy", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "bellasthirdeye", "link_flair_text": null, "time": 1730516393.9355707, "created_utc": 1729914632.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1gcchfy/i_escaped_being_kidnapped_by_someone_i_met_online/", "title": "I escaped being kidnapped by someone I met online. ", "permalink": "/r/LetsNotMeet/comments/1gcchfy/i_escaped_being_kidnapped_by_someone_i_met_online/", "selftext": "This isn't something I would normally post, and I hope I don't regret it somehow. I saw someone briefly mention this subreddit in a Youtube video and thought it would be the perfect place to share the story of a horrific thing that happened to me-a story I've never told anyone. I'm not sure if anyone will see this but I'm sharing in hopes that it will inspire someone to stay safe-safer than I was. \nI'm not sure if \"trigger warnings\" are needed or suggested here but just out of consideration of others, I'd like to warn everyone that I will be briefly mentioning sexual assault (with as little details as possible). \nOne year ago, around this time, I was bored and scrolling the web (nothing unusual for me), when I decided to go on Omegle. Omegle was a (now shut down) website that allowed you to talk to strangers, via video or text chat. It was around for a long time, and I used it frequently when I was younger as a time waster. There were plenty of creeps on there, sure, but I've had an equal amount of pleasant interactions and conversations on the site. \nOn Omegle, you could type in \"tags\" (basically, keywords that describe the type of conversation or person you're looking for) and you would match someone with the same ones. I always used \"alt\" (for alternative). I feel like it weeded out a lot of rude people and connected me to more people my age. For reference, I was 19 at the time. \nI connected with someone, who called himself Kane, and we started chatting via text. He said he was 23, and I said my age back. We exchanged some small talk and before I knew it, we were talking all night. I mean, all night. We lived in the same time zone, and I had stayed up until 6 am chatting about philosophy and life and our interests just because he was entertaining and I was having fun. \nWhen we were talking about our general areas that we live in, he said abruptly, \"We should meet up some time!\". I laughed but it turns out he was serious, and it turns out we only lived 3-4 hours away from each other so he was really considering this. I am an anxiety ridden person, but for whatever reason, I thought that he might be \"normal\" due to the fact that I just spent hours and hours talking to him, and I didn't pick up on any red flags. So I said sure, why the hell not. I know, I know. This is an incredibly stupid mistake. I have a big heart, though, and frequently make the mistake of giving others the benefit of the doubt. \nSo, just like that, we started planning a camping trip. He was set on doing it just days after that morning because that was when he was off work next. I agreed, because I didn't have anything to do at the time. I asked for his number so we could talk somewhere else other than Omegle, about the trip. He gave it to me. I texted it, and noticed the messages showed green on my iphone. This indicated that he was using a samsung or an android. Teasingly, I said something along the lines of \"What's up with the samsung?\" After a few minutes, he texted back, saying that he had two phones and that one was for work. That was the first red flag that went off in my head. Why would he need two phones for work at his age? I mean, of course there's possible reasons, but it just set off that intuitive feeling. One that I regret not listening to. I asked what his job was, and he said that he worked for the state. He added that he isn't allowed to share details about his job because he signed papers saying he wouldn't, and that he could get fired if he were to violate this agreement. I was still weary of this, but I just figured he worked for a police station or the town council or something to do with law enforcement, and that I was probably overthinking. \nDays passed, and the date for our camping trip approached quickly. He wanted to take me someplace close to where he lives, Nimham Mountain in New York. (Don't worry, this isn't near my house at all and I don't give a fuck about violating his fake privacy after what he took from me). Obviously I wanted to do at least a little research about where I was going, so I popped the name into google. A bunch of results popped up about the soil on Nimham Mountain being contaminated with arsenic, due to the old mines in the area. All of the government and state articles I read said that it was still safe to hike there, and that you should wash your skin and shoes after hiking. I still had a feeling of unease about the whole thing. I texted Kane, and asked him why we were going to someplace that could potentially be dangerous. He assured me that nothing would happen, and said he chose the spot because it's somewhere him and his friends frequently camp. This slightly reassured me. He does know the area better than me, after all. \nMy parents are definitely over suspicious of everyone. Strict is also a safe word. For good reason though, they are just protective. I told them that I was meeting up with a friend I met over a video game, and that I already known him for a month. I knew this would be less likely to freak them out than the truth. They were adamant that this was a horrible idea, but finally let me go off when Kane pulled into my driveway. \nHe didn't come inside, and waited outside of his car for me. After a brief introduction, my mom rushed out to meet him and asked a few questions about the area we were headed too, and then we were off. We pulled into the Starbucks by my house so he could get a coffee, since he was tired from the drive up. We sat in his car for about an hour and a half afterwards. During that time he asked me to rate the playlist he put on, and showed me how he writes down every single song he likes in a little notebook he kept in his car. I thought it was weird, but kind of sweet. Like what guy these days writes down songs? \nAfter an hour or so passed, I told him we should get going so we can get to the campsite before dark. He kept saying, just five more minutes. After about 30 minutes of insisting we need to leave to make it on time, he finally let us start onto the road. \nWhile we drove the four hours up to our destination, Kane mostly talked about himself. He told me long stories about his friends, and a girl that he used to date that he doesn't like. I thought this was strange. Who talks about another woman to a girl like this? After telling stories for about two hours I tried to deviate to a brighter topic and asked what kind of things he's into, hobby wise. I already knew the stuff he told me online but I was trying not to suffer from awkward silence-or any more of his weird ramblings. He said that he thinks that eating healthy is important, and that people who eat junk food are stupid. He also says he only wears sustainable clothing that's made from cotton or wool. I don't have a problem with being sustainable, but he was saying it in a really obnoxious way. \nThen he turned to me and asked the first question about me since we got in the car-\"What brought you to Omegle?\". I told him that I was bored and that I like meeting new and interesting people, and that was about it. He nodded slowly in thought and grinned, showing the most expression I've seen on his face so far. He said he likes to go on Omegle and tell people that he's a soldier in Russia, and that he was torturing people as he spoke to them. I sat there in silence and kind of just stared at him, waiting for him to say that he was just kidding and that he was some fucked up sense of humor. But he didn't. He just laughed and said, \"What?\" \nAs we neared the campsite, I mentioned that i was getting kind of hungry. He said that we can stop at Whole Foods before going to camp for the night. In my head I sighed about this, knowing he was probably going to judge me for whatever I picked out there. But it wasn't a problem for me, and I was hungry, so I agreed. \nIn Whole Foods, he made me pay for both of our meals because \"his card wouldn't work there\". He didn't even try. This annoyed me, but I was just eager to get to camp so I payed and we sat down outside to eat. \nAfter about an hour, we were finally ready to get to camp. We drive up the mountain, and he pulls into a small parking area with about 3 spots. Cars were parked there, and older men were surrounding the cars smoking weed. Nothing they were doing was wrong (at least morally, to me), but it just made me uncomfortable that they were there so late at night.\nBefore I could even mention it, Kane says that it's too cold for him to carry our supplies to the campsite (which was about a 10 minute walk) and set up camp. I was taken aback by this. I said, \"What do you mean? I'll help you, we didn't come up here for nothing.\" He insisted and told me to get out of the car, to feel how cold it was. He said it would take a while to pitch our tent, and that it was too much for us. There was no way that I was getting out of the car and facing the men in the parking spot next to us, so I rolled down the window halfway and stuck my hand out. It was freeing, he was right about that. That night it was in the 30's, and the wind chill felt worse being higher up. I was annoyed, but I agreed to sleeping in his car for the night. I was sad that our trip was basically wasted. \nHe sat in silence for a while, seemingly uncomfortable that I was annoyed and unsure how to comfort me. I slinked back into the passenger seat and started to scroll on social media, trying to pass the time. He grabbed my phone out of my hand and said, \"Come here.\" He patted his lap. I was already annoyed at the situation and confused on what he thought he was doing. I said, \"You're funny.\" and reached for my phone, that he had tossed onto the floor of the car. Before I could get to it, he reached over and scooped me up out of the seat, and tossed me onto the backseats. \nHe then proceeded to rape me. I don't remember most of it, my eyes were squeezed shut and I was praying for it to end. \nAfter he was \"done\", he pushed me back into the seats and got dressed. He smiled at me and said, \"How was it?\". I just stared back at him with tears in my eyes. He climbed back into the front seat, propped his feet up on the wheel and went to sleep. \nI didn't know what to do. I sat there motionless in the backseat for about two hours trying to process what just happened to me. I considered calling my mom, calling 911. I thought about it for what felt like forever. I already had been assaulted once in my life, and it broke my parents' hearts. I knew that learning of this would absolutely destroy them, and I was also afraid of what would happen if I told them. I didn't want my dad or brother to go to jail for life because they were angry and got revenge against this guy. So I just sat there all night, watching the men outside stare into the car and smoke on their joints. \nI don't remember falling asleep, but eventually I woke up to wind hitting the car. I was in a fetal position sitting upright, holding my legs with my arms. Kane noticed that I was awake and said that it is time to go. I was so scared of him, it felt like my heart was leaping out of my throat. Adrenaline was pumping through my body and I started scanning the backseat and our overnight bags for something I could use as a weapon in case he were to pursue me again. I ended up holding onto my full metal water bottle. It wasn't deadly by any means, but it could knock someone out and holding it made me feel safer. \nI stayed in the back and Kane started driving. I asked where  we were going and he said \"To get breakfast\", almost as if that was obvious and it was silly of me to ask. After driving down the mountain back into the city, we pull into a parking garage and he tells me to get out, that we're here. I get out of the car and cling close to it, not wanting to let him get behind me. I was thinking about making a run for it, but didn't want to risk getting chased and overpowered by him. \nI followed him to a little Mexican spot on the corner and he told me to order pancakes \"so he could have some\". This obviously made me more pissed than I already was but I didn't say anything because I was afraid there would be consequences if I showed negative emotions at this point. I ate a few bites of my food and he happily ate the rest off my plate. He payed quickly with cash and took me back to the car, where he lay down in the backseat. He said he was going to take a nap because he didn't sleep well last night. I didn't want to argue with him so I let him sleep. How could he sleep so soundly after what he did to me? \nHe slept for about 3 hours. The whole time I was watching Youtube videos, trying to calm myself down and keep a clear head. It was about 9 am, and around this time my mom was waking up and texted me saying she wants me to be home. I told her that Kane was taking a nap and that I would be home soon. She didn't like the sound of that and insisted I come home. I was happy to have a reason to get the fuck out of there, one that might be convincing to Kane. \nI woke him up and he became angry with me, saying \"Don't wake me up next time. Play on your phone, watch Tiktok or something.\" I was shaking but I managed to say that my mom wanted me home and that we needed to go. He said to let him sleep for 30 more minutes, and told me to set a timer on my phone. I did. \n30 minutes felt like 30 hours, and once it went off I woke him once again. This time, I filmed myself waking him up because I was afraid of what was going to happen. He was angry once again, and I told him that 30 minutes was up. I asked to leave, begged him to leave, and he said no. Over and over, he said we aren't leaving yet. \nI was shaking uncontrollably, but put on a brave face and pretended like I was being playful. I said, \"Okay, I'll just get an uber then.\" I turned around and started to open the car door when I felt his hand grab my shoulder and dig into it, yanking me back into place. I honestly think I blacked out from fear for a few seconds. \nHe said, \"What the fuck are you doing??\" His hand was still on my shoulder, his fingers squeezing into my skin. My mind was racing, and I was on the verge of tears. This caught his eye, and I quickly played it off by saying my mom would call the police to come get me if I wasn't home soon. I had mentioned earlier that my dad works in law enforcement, so this was a little bit more believable of a lie. At the mention of police something changed in his face, he looked frantic. He let go of me and unhappily agreed to drive me home. I felt a deep relief, the deepest relief I've ever felt, and swallowed the lump in my throat as he climbed into the front seat and started our 5 hour drive back to my house. \nThe drive back was much quieter than the drive up. I didn't say anything unless he initiated. I just gripped my phone in my hand and tried not to make eye contact with him. I wondered if he had any remorse for what he did in those moments. \nWhen we reached the town where I live, it was 11:30 at night. Kane pulled onto the main strip to get to my house, and I saw flashing lights behind me. My first instinct was to be scared shitless because my dad is a cop, so I've always made extra sure not to break any traffic laws. \nThe police pulled us over, and two men stepped out of the cop car. I frantically rolled down my window so they could see my familiar face, the daughter of their boss. One of them greeted me and looked both concerned and disappointed that I was the in the car with someone getting pulled over. The other cop told Kane to get out of the car while I explained what we were doing out so late. I spared the illegal and horrific details. I was tired, scared, and I needed to be safe in my own home. I also didn't want them waking up my sleeping dad with such bad news. \nI overheard the second officer ask Kane about his info, when he said, \"What's your name, son?\" Kane mumbled, and he said to speak up. The name he gave was not Kane. And he told the officer he was 22, not 23. \nMy heart sunk into my feet and I sat motionless while they explained to Kane that he missed a stop sign and that they're letting him off with a warning. They told me to get home and I nodded my head. When we pulled off, I let my emotions take over and started screaming at the stranger I was sitting next to. \"Why did you lie to me?\" \"What the fuck is wrong with you?\" \nHe looked distressed from the volume of my yelling and told me to calm down, that he was sorry he lied. He said that he only lied about his identity for \"his own safety.\" That honestly baffled me, considering he had just assaulted me. I screamed at him all the way to my house and as we pulled in I threw the car doors open and started throwing my stuff out onto the lawn, desperate to just get far away from him. He tried to talk to me, to offer more pitiful excuses for his disgusting actions, but I screamed at him to get the fuck away from me and that I never wanted to see him again. \nI gathered my stuff off the lawn and hauled it into my room while my parents slept soundly, unaware of the terrible secret I had. I woke my mom up told her that I was home, as she requested. \nOnce I got to my room I broke down. What happened to me was starting to sink in. As I was sobbing silently into my blanket my phone lit up from with a text from \"Kane\". It read: \n\"I'm sorry about what happened, I really am. If it makes you feel any better, I just got pulled over so that is my karma I guess. Let me know if you want to talk.\" \nI felt a wave of nausea hit me like a train. I screenshotted the message, blocked his number and deleted his contact. I haven't heard from him since, and I haven't hung out with anyone since, besides my boyfriend. (Who, thank god, is normal!!!) \nI still think about what happened almost every day, and I still feel sick when someone I don't know gets close to me, even if it's just a stranger passing by in the grocery store. \nI know that what happened was the product of my own irrational teenage actions. I know I shouldn't have met up with someone I didn't know. But I had faith that he would be a normal person, somewhat at least. I wish I would have listened to my instinct, and to my parents' warnings. I don't know what would have happened if I didn't make up that police story, and I don't even want to think about it. I will never meet up with someone I don't know again. \nWhile trying to cope with what happened to me, I googled Nimham Mountain again. I found a link that said, \"Kane Mountain North Trail Loop, New York\". \n-If you made it this far, or you take anything away from this story, please let it be this: \n-Trust your instinct. Trust your gut. If something feels wrong, it probably is. \n-Don't meet up with strangers, no matter how good they look or how normal they seem. \nThis was a lengthy story and I apologize for that. It was hard for me to share after all this time, after carrying the secret for this long. I am doing this in hope that it inspires someone out there to follow my advice and help keep themselves safe. What happened to me was disgusting and horrible and I never want it to happen to anyone else again. That being said,\n\"Kane\", let's not meet again. Fuck you, and I hope you're rotting in jail or hell right now.  \nEDIT : \nThank you so much for all the kind words and support!! I really do appreciate the love. \nI'd like to assure everyone that yes, I am getting help to cope with what happened. I go to EMDR therapy weekly, and my doctors/therapist/psychiatrist all know about the event. \nI am not interested in sharing my story with my parents or friends, as it would just cause me more pain. I'm doing well now and will continue to get support. I never heard from \"Kane\" after the night I got home, thankfully. He has been pulled over multiple times that I know of so his name is already in the police database. \nI pushed myself to share my story in hopes of spreading awareness about online safety and trusting your instinct. I give everyone permission to share my story. Share it with your little sisters, cousins, nieces, every young woman in your life who might make the same mistakes I did. \nPlease message me first if you plan on posting my story elsewhere, like on Youtube. \nLove you guys!! ", "media": null, "score": 285, "upvote_ratio": 0.94, "comment_count": 36, "over_18": true}, "13": {"id": "1gft7xa", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "HamletX95", "link_flair_text": null, "time": 1730516394.1925743, "created_utc": 1730311989.0, "url": "https://i.redd.it/645knr8tpxxd1.jpeg", "title": "Sacha Baron Cohen uncovered a pedophile ring in Las Vegas while shooting “Who Is America”. Evidence turned over to the FBI and declined to investigate.", "permalink": "/r/truecreepy/comments/1gft7xa/sacha_baron_cohen_uncovered_a_pedophile_ring_in/", "selftext": "", "media": null, "score": 408, "upvote_ratio": 0.96, "comment_count": 10, "over_18": false}, "14": {"id": "1gdnhap", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Far-Percentage191", "link_flair_text": null, "time": 1730516394.4392784, "created_utc": 1730069310.0, "url": "https://www.reddit.com/r/threekings/comments/1gdnhap/one_man_hide_and_seek_hide_and_seek_alone/", "title": "One Man Hide and Seek/ Hide and Seek Alone experience(?)", "permalink": "/r/threekings/comments/1gdnhap/one_man_hide_and_seek_hide_and_seek_alone/", "selftext": "This was a rather minor experience and I still think about whether or not the ritual actually worked.\nAround 7 years ago me and my cousin decided to try this game out because we wanted a little thrill and to see if it was actually real or not. It was around 10AM in the morning when we started this game.\nThe 2 other people in the house were 2 of my siblings, one of them was sleeping and the other one was in their room ( close to the bathroom which the game took place ) glued to their computer screen.\nAnyway, we put our hair in a stuffed bear's pocket, put it in the sink, did the chant, closed the door, and went to our hiding spot.\nWe hid in the closet of a room very close to the bathroom which the bear was in. We waited for like a minute or so before checking back and we saw the bear standing right outside of the bathroom door in the hallway.\nWe ran back to our hiding spot and waited like another minute or 2 . After we checked again the bear was closer to the room which we're hiding in.\nWe came back to our hiding spot, with the door closed ( this will be important ). A minute or 2 later we hear the door open. After we peeked out of the closet we saw the bear standing in the room in front of the entrance.\nAfter that we decided to call it quits and splashed the saltwater on the bear.\nWe just went on with our day after that and nothing has ever happened to us since. The reason why I still wonder if the game actually worked or not was because we broke a lot of rules. The ritual took place late in the morning, we didn't sew the bear at all let alone with red string, there were lights on in the house, and the ritual didn't even end properly ( I didn't put the saltwater in my mouth before ending the game ).\nThe main thing that makes be believe this was legit, though, was the low likelihood of someone else tampering with it. The sibling who was awake at the time didn't know anything about these types of games and they were very addicted to video games at the time so I doubt they'd go out of their way to fuck with us over what looks to be a silly little game. They also didn't know our hiding spot.\nI also didn't hear ANY footsteps before or after the door opened.\nI still look back at this experience and think whether or not it was actually real and while I'm leaning more towards yes there's still a lot of uncertainty.\nEdit: Fixing typos", "media": null, "score": 18, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "15": {"id": "1gfel3l", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Individual-Insect722", "link_flair_text": "Captured Apparition ", "time": 1730516395.3570387, "created_utc": 1730262810.0, "url": "https://v.redd.it/upc5gognntxd1", "title": "I was notified this morning that my Ring camera recorded this in the middle of the night", "permalink": "/r/Ghosts/comments/1gfel3l/i_was_notified_this_morning_that_my_ring_camera/", "selftext": "Just moved out to the middle of nowhere. I’ve gotten a creepy vibe at times but this is unsettling. There are no neighbors around and my house is on a fenced in hill that makes it impossible to get up to, and is surrounded by forest. Any insight would be appreciated. ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/upc5gognntxd1/DASH_1080.mp4?source=fallback", "has_audio": false, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/upc5gognntxd1/DASH_96.mp4", "dash_url": "https://v.redd.it/upc5gognntxd1/DASHPlaylist.mpd?a=1733108394%2CODNhNDUyZjg3MGUyZTg1NDQ3NTJlMzExY2QwYzgxM2U3NTMxMWNhNjU1ODE1NjFiODYxYTI1MDFmNmIxZjJkZg%3D%3D&v=1&f=sd", "duration": 33, "hls_url": "https://v.redd.it/upc5gognntxd1/HLSPlaylist.m3u8?a=1733108394%2CYjk4Y2E0ZWY0YjIzNWViMjZlNTYwM2FlYWQ2Mzc5NDIyZjgwNzcxNmU4NTNiZTczNDhkMmY0NjgxMGFlMzMzOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2463, "upvote_ratio": 0.88, "comment_count": 868, "over_18": false}, "16": {"id": "1gcs7zl", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ProfessorTau", "link_flair_text": "Glitch Pic", "time": 1730516395.6613972, "created_utc": 1729969142.0, "url": "https://i.redd.it/f984rucbe5xd1.jpeg", "title": "A dime from 1902 fell from the sky and hit me in the head while I was taking out the trash", "permalink": "/r/GlitchInTheMatrix/comments/1gcs7zl/a_dime_from_1902_fell_from_the_sky_and_hit_me_in/", "selftext": "", "media": null, "score": 8630, "upvote_ratio": 0.98, "comment_count": 230, "over_18": false}, "17": {"id": "1gd0lkv", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "kalawa1929", "link_flair_text": null, "time": 1730516397.09785, "created_utc": 1729994356.0, "url": "https://i.redd.it/lvky375fh7xd1.jpeg", "title": "Any ideas what this cryptic Mars/Bezos comment means?", "permalink": "/r/ufo/comments/1gd0lkv/any_ideas_what_this_cryptic_marsbezos_comment/", "selftext": "Seriously WTF 😂", "media": null, "score": 862, "upvote_ratio": 0.94, "comment_count": 335, "over_18": false}, "18": {"id": "1gd5yek", "locked": true, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "frankievalentino", "link_flair_text": "Cross-post", "time": 1730516399.0344865, "created_utc": 1730015750.0, "url": "https://v.redd.it/1ddyumj189xd1", "title": "Posted by Charlie Kirk 1 Hour Ago on X - UFOs spotted by Pilots", "permalink": "/r/UFOs/comments/1gd5yek/posted_by_charlie_kirk_1_hour_ago_on_x_ufos/", "selftext": "Crosspost from r/InterdimensionalNHI\nVideo description on X:\n“I was flying back from Wisconsin on a friend’s plane tonight and got called up to the cockpit. The pilots were very confused at what they were seeing. Something was above them and not showing on radar. I’m sure there is a logical explanation here. Watch this video and tell me what I am missing”\nVideo Source:\nhttps://x.com/charliekirk11/status/1850402352509182254?s=46", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/1ddyumj189xd1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 706, "scrubber_media_url": "https://v.redd.it/1ddyumj189xd1/DASH_96.mp4", "dash_url": "https://v.redd.it/1ddyumj189xd1/DASHPlaylist.mpd?a=1733108397%2COTQ5NTRmZDliNjFiZGYzNTUzYjRiMTg3OTdlMTFmYmI1ODhmNTRmZDc5YjI1ZTI1MWVjMjZmODJmMDJhZWQ2Yg%3D%3D&v=1&f=sd", "duration": 351, "hls_url": "https://v.redd.it/1ddyumj189xd1/HLSPlaylist.m3u8?a=1733108397%2CYzRjYjAyNDI1MjhkZDljNTVlN2M4ODA2NzYyZDYyNWExOWY1YjUzOTc4ZDZhMzNiNWI5OTM3YTE5M2YyZDJjMA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3058, "upvote_ratio": 0.84, "comment_count": 166, "over_18": false}, "19": {"id": "1geqxlo", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "dailystar_news", "link_flair_text": "News :illuminati:", "time": 1730516400.9182925, "created_utc": 1730196131.0, "url": "https://www.dailystar.co.uk/news/us-news/aliens-on-brink-launching-intervention-33990615", "title": "Aliens 'on brink of intervention to save Earth from total collapse,' says lawyer", "permalink": "/r/aliens/comments/1geqxlo/aliens_on_brink_of_intervention_to_save_earth/", "selftext": "", "media": null, "score": 2907, "upvote_ratio": 0.87, "comment_count": 1171, "over_18": false}, "20": {"id": "1ge9u9r", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "IAMONEIAMALL", "link_flair_text": null, "time": 1730516401.6727111, "created_utc": 1730141281.0, "url": "https://v.redd.it/uu047rqoscyb1", "title": "Jesse Marcel - Roswell witness in the classic photo reveals the truth!", "permalink": "/r/UAP/comments/1ge9u9r/jesse_marcel_roswell_witness_in_the_classic_photo/", "selftext": "", "media": null, "score": 155, "upvote_ratio": 0.98, "comment_count": 0, "over_18": false}, "21": {"id": "1gexew9", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "transcendtime", "link_flair_text": null, "time": 1730516403.047759, "created_utc": 1730215848.0, "url": "https://i.redd.it/xhwwk880spxd1.jpeg", "title": "We know it; they know it.", "permalink": "/r/conspiracy/comments/1gexew9/we_know_it_they_know_it/", "selftext": "", "media": null, "score": 3946, "upvote_ratio": 0.8, "comment_count": 248, "over_18": false}, "22": {"id": "1gdi3sp", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "sherrymacc", "link_flair_text": "bigfoot sign/cutout/statue/etc", "time": 1730516404.051347, "created_utc": 1730054794.0, "url": "https://i.redd.it/l1pvmr3tfcxd1.jpeg", "title": "I made a 6 1/2 tall Bigfoot silhouette for Halloween and found the perfect place for it.", "permalink": "/r/bigfoot/comments/1gdi3sp/i_made_a_6_12_tall_bigfoot_silhouette_for/", "selftext": "", "media": null, "score": 599, "upvote_ratio": 0.98, "comment_count": 23, "over_18": false}, "23": {"id": "1gdyfm0", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Freak_Among_Men_II", "link_flair_text": "Discussion ", "time": 1730516404.8513842, "created_utc": 1730110073.0, "url": "https://www.reddit.com/gallery/1gdyfm0", "title": "We can do better (a discussion)", "permalink": "/r/Cryptozoology/comments/1gdyfm0/we_can_do_better_a_discussion/", "selftext": "Is this really what we’ve come to? \nAlmost five hundred upvotes for a photo of an emu?\nWe need to put the “zoology” back into “cryptozoology”. \nIf we can’t identify animals which have been formally described, what hope do we have of identifying animals which aren’t yet recognised by science?", "media": null, "score": 1476, "upvote_ratio": 0.97, "comment_count": 146, "over_18": false}, "24": {"id": "1gdfg0h", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "happyrooster33", "link_flair_text": "Unidentified", "time": 1730516405.1644042, "created_utc": 1730047965.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1gdfg0h/sighting_near_noccalula_falls_al_2023/", "title": "Sighting near noccalula falls, Al 2023", "permalink": "/r/Humanoidencounters/comments/1gdfg0h/sighting_near_noccalula_falls_al_2023/", "selftext": "One day I was having a sleepover at a friend's house having a  bbq/pool party, and we were admiring the scenery of the surrounding area because it was particularly beautiful that day. And me and my buddy (she said that she doesn't want me to use her real name so I'll call her \"addi\") were getting out of the pool and we saw a tall skinny dark green creature that looked like it had moss and flowers on it, run by, scaring us shitless. That was all we saw of it that night but for the next few days we heard clicking and a weird screech every few hours, but it stopped at night, and it rained for the next few days.", "media": null, "score": 14, "upvote_ratio": 0.85, "comment_count": 5, "over_18": false}, "25": {"id": "1gdobwk", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Debas3r11", "link_flair_text": null, "time": 1730516405.8871055, "created_utc": 1730071768.0, "url": "https://i.redd.it/w2ov1cjkvdxd1.jpeg", "title": "My mothman costume ", "permalink": "/r/cryptids/comments/1gdobwk/my_mothman_costume/", "selftext": "", "media": null, "score": 751, "upvote_ratio": 1.0, "comment_count": 30, "over_18": false}, "26": {"id": "1gcpnli", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "NoCommunication7", "link_flair_text": "Strange Sounds", "time": 1730516406.1876493, "created_utc": 1729962105.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gcpnli/dragging_noise_on_my_window_last_night/", "title": "Dragging noise on my window last night", "permalink": "/r/Thetruthishere/comments/1gcpnli/dragging_noise_on_my_window_last_night/", "selftext": "around 3:20 AM last night, i hear this strange noise and think nothing of it because it's probably wind, but it keeps happening and i realize it's a lot like something rubbing on the window, not squeaky but like someone dragging something across it, at one point it became repetitive and i thought it might be machinery being used in the distance, but it seemed like sporadic squeegee noises, by about 3:30 it had stopped.\n​\nI saw nothing odd in the morning, luckily i have these heavy curtains so i couldn't see anything.\n​\nThere is a tree outside but it's not near enough to touch, my bedroom is on the 2nd floor and there's literally no way you can get up there apart from a ladder.\n​\nI have some voice recorders so i'm probably going to charge one up tonight and use it if i hear any more noises, i would leave it recording on/near the window in sound activated recording mode, but last time i tried that to record another strange noise my snoring ruined the audio.", "media": null, "score": 29, "upvote_ratio": 0.94, "comment_count": 18, "over_18": false}, "27": {"id": "1gggob9", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "MimsyWereTheBorogove", "link_flair_text": null, "time": 1730516406.6582599, "created_utc": 1730387027.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1gggob9/robbed_violently_they_murdered_the_next_guy/", "title": "Robbed violently, they murdered the next guy.", "permalink": "/r/LetsNotMeet/comments/1gggob9/robbed_violently_they_murdered_the_next_guy/", "selftext": "I was 16 and I had met this kid down the street from my house.\nHe said he saw me around and we should hang out.\nI figured why not.\nSo I gave him my number and told him to hit me up.\nThe next week comes around and I get a text from him asking if I wanted to play Basketball. Of course I did.\nHe asked if I smoked (Weed) I did, and asked me to bring some. Which isn't out of the ordinary for teenagers.\nI brought a couple friends, since we were going to play sports.\nTo be honest I was really f*cking stoned by the time I got there.\nIt was a little out of our neighborhood, but it wasn't a bad hood, so I wasn't bothered.\nI was an idiot.  \nIt was a gang. Who ambushed us as soon as we got outta the car.\nThey violently beat me and my 2 friends, and I got it the worst.\nThere were 3 of them on each of us.\nThey stabbed my best friend (not very bad)\nThey choked me unconscious, held a gun to my head and pistolwhipped me.\nThey ran my pockets and got my cell phone and wallet.\nI swear at one point I actually died, because I literally shit myself when I went unconscious\nI was DRENCHED in my own blood.\nMy nose was broken. both eyes swelled shut later.\nThey had to wake me up because I drove a stick shift and nobody could drive my car.\nMy attacker literally had to resuscitate me in order for me to leave.  \nI stopped at a gas station because I had shit in my pants and I couldn't see with blood in my eyes.\nAs soon as I got in, the clerks jaw dropped... \"Where's the bathroom?\" I said. He pointed the way.\nI cleaned up the best I could, then drove home.\nI got home called the cops and showered.\nThe cops obviously thought it was my fault for being an idiot.\nNonetheless, an undercover showed up and knew exactly who robbed me because we lived on the same street 2 blocks apart.\nTurns out they had turned him informant and he reneged on the deal and robbed the buyers in the controlled buy.\nI told them how violent they were and swore they would kill someone.\nI did a photo line up but they all looked the same to me. So no case.\n2 months later, the cops knock on the door.\nMy mom was super pro-cop and told them I was asleep in my room and turned them loose on me.\nThey woke me up and held up a photo and said, \n\"Who's this?\"\nME: \"How would I know? I've never seen that person before.\"\n\"You called this person from your cell phone.\"\nMe: \"The cell phone that I reported stolen in a violent robbery to the police?\"\nThey looked stunned (and STUPID)\nMe: \"They beat me almost to death, you should probably go read that police report.\"\nThey apologized and explained that my cell phone had been used to set up a robbery and the person in the photo had been shot to death.\nMe: \"I told you guys they would kill the next guy.\"\nThey came in blazing glory and left in shame.\nI have PTSD now and have kept tabs on my assailant for 17 years.\nI have no ability to trust anybody, not even those closest to me.\nLet's not meet again.", "media": null, "score": 267, "upvote_ratio": 0.97, "comment_count": 30, "over_18": true}, "28": {"id": "1gckdlm", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "littlequeef99", "link_flair_text": null, "time": 1730516406.903716, "created_utc": 1729947062.0, "url": "https://i.redd.it/wgunmhrsk3xd1.jpeg", "title": "Todd Sees went missing in Northumberland, Pennsylvania. The night he vanished a farmer witnessed a UFO abducting someone. Todd was later found dead where the farmer had seen a body flying into an unknown craft. The FBI was brought in and restricted the area. ", "permalink": "/r/truecreepy/comments/1gckdlm/todd_sees_went_missing_in_northumberland/", "selftext": "", "media": null, "score": 102, "upvote_ratio": 0.9, "comment_count": 20, "over_18": false}, "29": {"id": "1gd01xo", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "New-Raisin-5425", "link_flair_text": null, "time": 1730516408.1699429, "created_utc": 1729992420.0, "url": "https://v.redd.it/uy0kzpmnb7xd1", "title": "Old building I work at in Downtown phoenix ", "permalink": "/r/Ghosts/comments/1gd01xo/old_building_i_work_at_in_downtown_phoenix/", "selftext": "I work at an old building in downtown phx Arizona and one night I was working at the corner of my eye I seen something I thought it was just my mind wanting to see something but I decided to record and just as I put my phone down it appeared ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/uy0kzpmnb7xd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/uy0kzpmnb7xd1/DASH_96.mp4", "dash_url": "https://v.redd.it/uy0kzpmnb7xd1/DASHPlaylist.mpd?a=1733108407%2CMzRhZmY1YWZjMWQzODEwMDQwN2RlZGVlNzYwZmE3Y2QzZjNlNjA4ODgzNTMwODg5ZGNjNzk3NGU1ZDY5NTk1MA%3D%3D&v=1&f=sd", "duration": 27, "hls_url": "https://v.redd.it/uy0kzpmnb7xd1/HLSPlaylist.m3u8?a=1733108407%2CYmQyMDRiZDcxMTBjYTkyNTY5NGNmNzRiODAxZTVjZjdhOWM1OTY2YWViOWJkMzIzMDA1Y2QzYWI4N2VmODZkMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 566, "upvote_ratio": 0.69, "comment_count": 225, "over_18": false}, "30": {"id": "1gebozu", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Pale_Subject_7036", "link_flair_text": "Glitch Vid", "time": 1730516408.4748452, "created_utc": 1730145834.0, "url": "https://v.redd.it/jcfqsv9mzjxd1", "title": "Ok but can someone explain what's happening here? Or is it actually a glitch lol", "permalink": "/r/GlitchInTheMatrix/comments/1gebozu/ok_but_can_someone_explain_whats_happening_here/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/jcfqsv9mzjxd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/jcfqsv9mzjxd1/DASH_96.mp4", "dash_url": "https://v.redd.it/jcfqsv9mzjxd1/DASHPlaylist.mpd?a=1733108408%2CYTliYjk4ZDNmOTgwZTA4MmViOGFiZDI2NGIwMTAzZWI1MmU0OGQ2NDRhMWQyMjAyOWQ3YWE2ZWM3MDVkYWZhYg%3D%3D&v=1&f=sd", "duration": 15, "hls_url": "https://v.redd.it/jcfqsv9mzjxd1/HLSPlaylist.m3u8?a=1733108408%2CYTg0ZjlkODcyZTdjMjVjYWE4YTVjMWI1OGZkOWZkYmQ3MzEzNjA2ZmFjZGJhYWFiZWU2NTE2ZmM1MmM1ZDI4Yw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1811, "upvote_ratio": 0.96, "comment_count": 116, "over_18": false}, "31": {"id": "1ge47jn", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "awcomix", "link_flair_text": null, "time": 1730516409.93341, "created_utc": 1730127690.0, "url": "https://www.reddit.com/gallery/1ge47jn", "title": "Langenberg Saskatchewan UFO landing 1974!", "permalink": "/r/ufo/comments/1ge47jn/langenberg_saskatchewan_ufo_landing_1974/", "selftext": "", "media": null, "score": 683, "upvote_ratio": 0.97, "comment_count": 127, "over_18": false}, "32": {"id": "1gco6h9", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "_stranger357", "link_flair_text": "Clipping", "time": 1730516411.6385207, "created_utc": 1729958102.0, "url": "https://v.redd.it/aa2xxi1gh4xd1", "title": "Supercut of High Ranking Military and Government Officials Acknowledging the Reality of the UFO Phenomenon ", "permalink": "/r/UFOs/comments/1gco6h9/supercut_of_high_ranking_military_and_government/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/aa2xxi1gh4xd1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 640, "scrubber_media_url": "https://v.redd.it/aa2xxi1gh4xd1/DASH_96.mp4", "dash_url": "https://v.redd.it/aa2xxi1gh4xd1/DASHPlaylist.mpd?a=1733108410%2CYWVkNDZlODFlMzNiNTk4NGQzMTA2MzZlNTQwOTlkZGY4NTNlNzcyNGE5NTk5OTk5ZDAxMWQ0NzQwYWU5OTZlZQ%3D%3D&v=1&f=sd", "duration": 378, "hls_url": "https://v.redd.it/aa2xxi1gh4xd1/HLSPlaylist.m3u8?a=1733108410%2COTI4N2IzMjIxM2M5MDA1NTg4MDJhZWU3MTczZjZhOTAxMzgwYjdlYTE4YWQ0MTkxMjAwNjczYmI3MDZiMzIyMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2797, "upvote_ratio": 0.97, "comment_count": 151, "over_18": false}, "33": {"id": "1gdzqwe", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "dailystar_news", "link_flair_text": "News :illuminati:", "time": 1730516413.8558223, "created_utc": 1730115118.0, "url": "https://www.dailystar.co.uk/news/weird-news/location-alien-base-earth-revealed-33984141", "title": "Location of alien base on Earth disclosed as ETs are now in 'secret mountains'", "permalink": "/r/aliens/comments/1gdzqwe/location_of_alien_base_on_earth_disclosed_as_ets/", "selftext": "", "media": null, "score": 1674, "upvote_ratio": 0.92, "comment_count": 493, "over_18": false}, "34": {"id": "1ggmh75", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": null, "time": 1730516414.549151, "created_utc": 1730401979.0, "url": "https://v.redd.it/nky7bn2k15yd1", "title": "Danny Sheehan asserts the existence of extraterrestrial/non-human intelligence (ET/NHI) bases located off the coast of Baja, California, and within Secret Mountain near Sedona, Arizona.", "permalink": "/r/UAP/comments/1ggmh75/danny_sheehan_asserts_the_existence_of/", "selftext": "", "media": null, "score": 100, "upvote_ratio": 0.89, "comment_count": 34, "over_18": false}, "35": {"id": "1ggufrx", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Hadley_333", "link_flair_text": null, "time": 1730516416.2873592, "created_utc": 1730424540.0, "url": "https://i.redd.it/z8igxv2l07yd1.jpeg", "title": "Rigged election 2024 ", "permalink": "/r/conspiracy/comments/1ggufrx/rigged_election_2024/", "selftext": "", "media": null, "score": 3025, "upvote_ratio": 0.74, "comment_count": 655, "over_18": false}, "36": {"id": "1gfxo6m", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "somethinglikethat3", "link_flair_text": "holiday cheer", "time": 1730516417.4756474, "created_utc": 1730323263.0, "url": "https://i.redd.it/78zlnlsfnyxd1.jpeg", "title": "Another year another jack-o’-lantern 🎃 ", "permalink": "/r/bigfoot/comments/1gfxo6m/another_year_another_jackolantern/", "selftext": "Happy Halloween 👻 ", "media": null, "score": 406, "upvote_ratio": 0.98, "comment_count": 17, "over_18": false}, "37": {"id": "1ggxfrx", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Maj_LeeAwesome", "link_flair_text": "Art", "time": 1730516418.158326, "created_utc": 1730434937.0, "url": "https://www.reddit.com/gallery/1ggxfrx", "title": "My Halloween homage to the Goatman of Bowie Maryland ", "permalink": "/r/Cryptozoology/comments/1ggxfrx/my_halloween_homage_to_the_goatman_of_bowie/", "selftext": "I've loved the notion of this creature for years. Finally decided to put it together.", "media": null, "score": 1249, "upvote_ratio": 0.99, "comment_count": 33, "over_18": false}, "38": {"id": "1ggr37j", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "heyarnoldspig", "link_flair_text": "U.F.O. Humanoid", "time": 1730516418.5369906, "created_utc": 1730414380.0, "url": "https://v.redd.it/ycfvjl6t56yd1", "title": "Last month was 30 years since one of the craziest Humanoid encounters of all time - the \"Ariel School Encounter\" in Ruwa, Zimbabwe. Here's an original edit of some of my favorite clips from various videos and documentaries on the event.", "permalink": "/r/Humanoidencounters/comments/1ggr37j/last_month_was_30_years_since_one_of_the_craziest/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/ycfvjl6t56yd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/ycfvjl6t56yd1/DASH_96.mp4", "dash_url": "https://v.redd.it/ycfvjl6t56yd1/DASHPlaylist.mpd?a=1733108418%2CMDZlOWY2MWE0NDA1NTZmNDAwYWYzNmRlMGE4YmM1OTg3NWJiNGNiYjM3MzEyMTA3MTE2YTI4ZjkwODJiZDBhNw%3D%3D&v=1&f=sd", "duration": 65, "hls_url": "https://v.redd.it/ycfvjl6t56yd1/HLSPlaylist.m3u8?a=1733108418%2CYjI5MDc5NzQ2YjNhZjlmZjRhYWQ0MDk2NjQ4NTdkYjY4MTFhNTBmZTg3ZDIxMzM1MDA0ZDE0NDkyMjZhY2MyZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 12, "upvote_ratio": 0.93, "comment_count": 3, "over_18": false}, "39": {"id": "1gfphm8", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "dead_thing13", "link_flair_text": null, "time": 1730516419.3481526, "created_utc": 1730302692.0, "url": "https://i.redd.it/338uv7q9ywxd1.jpeg", "title": "Thought y’all would appreciate my Mothman tattoo ", "permalink": "/r/cryptids/comments/1gfphm8/thought_yall_would_appreciate_my_mothman_tattoo/", "selftext": "", "media": null, "score": 663, "upvote_ratio": 0.98, "comment_count": 27, "over_18": false}, "40": {"id": "1gg7qb9", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "One_Perception8804", "link_flair_text": "Discussion/Advice", "time": 1730516419.6131544, "created_utc": 1730354124.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gg7qb9/one_of_many_strange_childhood_experience_that_i/", "title": "One of many strange childhood experience that I would love insight on. Am I just making this a bigger deal than it is?", "permalink": "/r/Thetruthishere/comments/1gg7qb9/one_of_many_strange_childhood_experience_that_i/", "selftext": "Let me start off by saying this is not the only strange or unexplained event I’ve experienced. I am currently 26, and have had bizarre encounters my whole life. This particular experience happened when I was around 7 years old. Me, my mom, dad, brother (1 y/o baby at the time), and grandparents all rented a room at a Colorado ski resort. It was a pretty sweet resort, and my family’s unit consisted of a living area, kitchen, and three bedrooms that were connected by a hallway. My parents and grandparents had their room, and my brother and I were sharing a room. This was the first (and last) time I went to CO or skiing (not bc of this experience, but bc it wasn’t in the cards again for us). We were booked to stay for a week (flying out on the 7th day in the afternoon), and I couldn’t have been more exited. I remember having an absolute blast trying to learn how to maneuver the slopes (even though I kinda sucked at it and had 2 speeds: too fast or laying in the snow bc I lost control and crashed lol). \nIt wasn’t until the 3rd day of our trip that I started seeing a shadow figure out of the corner of my eye. I remember the first time I saw it I was coloring on the coffee table in the living area, and all my hair stood on end. I wasn’t sure why… but then I noticed the figure out of my peripheral. It was tall (seemed to be the shape of a man), all black, and appeared to be wearing a cowboy hat… but with less of a rim. Almost like a fedora or bowlers cap I guess? I saw it walking down the same hall leading to the rooms often, or peaking out from behind a wall… the weird thing is every time I looked directly at the area it was in it disappeared. I began to feel a sense of dread… something that wasn’t foreign to me as I’ve dealt with a slew of issues and challenges (at this time my OCD was terrible, and I was later professionally diagnosed as being on the Autism spectrum). The reason I bring this up is because anxiety, panic, and overstimulation were not a foreign experience for me, so it wasn’t like “a child’s first experience with anxiety” situation. The feeling I got when I saw this figure was different. I remember I actually was so scared at one point I brought it up to my mom, who said that she too sees figures in her peripheral vision, and that it was much worse when she was a kid but that all people experience this phenomenon. She said it was my imagination or my mind playing tricks on me and it wasn’t real. I trusted her… but still had a horrible feeling in my gut. \nFast forward to day 5 of our 7 day trip, I became violently ill. Vomiting, fever, fatigue, the whole shebang. I distinctly remember the throwing up and sweating from fever being particularly bad. I rested the last full day (day 6) while my family members took turns monitoring me…and honestly don’t remember any of it. From what they told me I was either asleep, vomiting, or in a strange, semi-lucid state that they said was a result of fever. Then came day 7. We were leaving in the afternoon, and I have memories of that day (one that stands out is me running to the bathroom and vomiting in the tub lmao). I did my best to rest and get ready for the flight home… but I truly felt like I was dying. I even said maybe we could stay until I felt better bc the thought of flying was so aversive, but that wasn’t an option. We flew home (and shockingly I never once threw up on the flight), got back in the early morning hours, I went to sleep, and woke up in our home the next morning feeling SIGNIFICANTLY better. \nMy family said it was altitude sickness or a 48 hour bug. If it was altitude sickness, why did it only hit me on the 5th day? I could see it being a bug or maybe the flu… but I still have that gut feeling something more was at play. None of it really made sense to me (even as a child)… but I brushed it off and moved on. It wasn’t until I began learning about the unexplained that I started to question if maybe these events were connected. What if the figure I kept seeing, that made me feel scared enough to tell my mom (which wasn’t something I normally did) had something to do with it? I don’t have the answer but I figured maybe some people on this sub might have a unique insight or perspective I haven’t thought of before. \nTLDR: At age 7 I started seeing a tall shadow figure with a hat on vacation with my family out of my peripheral. When I looked in the direction of the figure it wasn’t there. I got violently ill on the 5th day of our 7 day trip. My family insisted my mind was playing tricks on me, but I felt as though more was at play\nEdit: added paragraph breaks so it’s not such a pain in the ass to read and to add TLDR", "media": null, "score": 26, "upvote_ratio": 0.93, "comment_count": 19, "over_18": false}, "41": {"id": "1gce650", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Iwannatakeanap94", "link_flair_text": null, "time": 1730516420.1132052, "created_utc": 1729920994.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1gce650/my_coworker_had_a_plan_for_me/", "title": "My coworker had a plan for me.", "permalink": "/r/LetsNotMeet/comments/1gce650/my_coworker_had_a_plan_for_me/", "selftext": "I worked with this man for a little over three years. We worked pretty closely on some projects over the last two years and even sat near one another at work. In September I showed up and saw about 10 detectives at my place of work. I was a bit startled as this was quite unusual for my area. I looked around and saw that my coworker was in handcuffs and looked quite disheveled (which wasn’t out of the norm to be honest). I walked up to the detectives, introduced myself and let them know who I was in relation to him. I asked what was going on and they filled me in on why he was currently being arrested. For the sake of the case I won’t share more than he was a disgusting person. \nOver the course of the next 3 hours I watched as they dismantled his work station, went through his belongings, took evidence pictures and so on. I was pulled in an out of rooms answering questions about his character, what I knew of him and my feelings about him as a person. I told them he gave me a weird feeling in my gut. That I’ve always told my husband I wouldn’t be surprised if the cops ever did come looking for him. That my husband even thought he was weird, and if I ever went missing that he’d be the first person to be suspected (didn’t realize how real this almost was). \nThe detective on site told me that they served a search warrant at his home and were looking there for any evidence. It sounds like they found more than they anticipated and were looking to see if there was anything else, unrelated to what they were currently investigating. I was asked my name and my husbands name for confirmation for something they found- which I did think was odd but I let it go and called my husband to update him on the happenings of the day thus far. However, the last hour I was pulled in for the final time and advised by one of the lead detectives, who couldn’t even look at me, that I needed to ensure I was safe and protected in the event they didn’t book him that day. Come to find out, he had been journaling about me over the course of at least a year. Saying he wanted to be with me but the “problem” was that I was married. \nHis journal then lined out a plan to set my husband up for “cheating” on me. And the end resulted in my death- caused by him (my coworker). The officer said that everything in between was more vile than he’s ever heard- to the point he was crying when he was telling me to make sure I was safe… crying- A DETECTIVE- and didn’t want to “scare” me. Thankfully, he was charged and it looking at a long long time in prison. But I still think about it. It keeps me up at night. It just shows you never really know someone- even your coworkers.", "media": null, "score": 179, "upvote_ratio": 0.95, "comment_count": 17, "over_18": true}, "42": {"id": "1ghdxkb", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "sasbergers", "link_flair_text": null, "time": 1730516420.3639238, "created_utc": 1730489913.0, "url": "https://i.redd.it/wylhoc9vecyd1.jpeg", "title": "This Obsidian mirror was used by Queen Elizabeth I’s adviser and occultist John Dee to 'speak' with spirits of the dead and angels. The researchers estimate that Dee’s mirror is over 500 years old, most likely made in the final decades before the Spanish conquest of Mexico in 1521.", "permalink": "/r/truecreepy/comments/1ghdxkb/this_obsidian_mirror_was_used_by_queen_elizabeth/", "selftext": "", "media": null, "score": 20, "upvote_ratio": 0.89, "comment_count": 1, "over_18": false}, "43": {"id": "1gf3dhb", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "AllPakex", "link_flair_text": "Personal Encounter ", "time": 1730516421.638402, "created_utc": 1730230614.0, "url": "https://www.reddit.com/gallery/1gf3dhb", "title": "I moved into a satanic apartment (BLOOD TW)", "permalink": "/r/Ghosts/comments/1gf3dhb/i_moved_into_a_satanic_apartment_blood_tw/", "selftext": "It's been almost 2 weeks since I moved into an apartment in the middle of France, it was renovated less than a month ago by the new owners who are none other than the agency that made me take this property. \nWhile the apartment is almost new with furniture and especially well located because it is right in the city center, it was sold to me at an unreasonably low price.\nToday I had one of the construction workers come to fix a joint in the bathroom, over a coffee he explained to me that the apartment was sold after the death of its former owner, he showed me photos explaining to me that \"this monster\" was killing pets in the kitchen, setting fire to the parquet floor and writing satanic phrases on the walls.\n(the walls were covered in traces of blood visible in the photos and drawings, the ceilings were filled with fly droppings)\nI've had night terrors for three days in a row and I'm struggling to feel alone in rooms.\nI will update this post if I have more pictures or problems.", "media": null, "score": 400, "upvote_ratio": 0.8, "comment_count": 163, "over_18": false}, "44": {"id": "1ge6p3f", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Few_Consequence_4954", "link_flair_text": "Glitch Vid", "time": 1730516421.957762, "created_utc": 1730133640.0, "url": "https://v.redd.it/mfa2yfxseexd1", "title": "Beacon ", "permalink": "/r/GlitchInTheMatrix/comments/1ge6p3f/beacon/", "selftext": "", "media": null, "score": 278, "upvote_ratio": 0.98, "comment_count": 11, "over_18": false}, "45": {"id": "1ggfwwf", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "anomalien_com", "link_flair_text": "Article", "time": 1730516423.359335, "created_utc": 1730385069.0, "url": "https://anomalien.com/luis-elizondo-apologizes-for-presenting-fake-ufo-mothership-image-at-private-event/", "title": "Luis Elizondo Apologizes for Presenting Fake 'UFO Mothership' Image at Private Event", "permalink": "/r/ufo/comments/1ggfwwf/luis_elizondo_apologizes_for_presenting_fake_ufo/", "selftext": "", "media": null, "score": 435, "upvote_ratio": 0.85, "comment_count": 356, "over_18": false}, "46": {"id": "1ge0cfq", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "Video", "time": 1730516425.0474553, "created_utc": 1730117150.0, "url": "https://v.redd.it/mgb7vsphmhxd1", "title": "Admiral Tim Gallaudet confirms that he's testifying on November 13th! Tim has previously said \"I'm totally convinced that we are experiencing a Non-Human Higher Intelligence, because I know people who were in the legacy programs that oversaw both the crash retrieval and the analysis of the UAP data\"", "permalink": "/r/UFOs/comments/1ge0cfq/admiral_tim_gallaudet_confirms_that_hes/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/mgb7vsphmhxd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/mgb7vsphmhxd1/DASH_96.mp4", "dash_url": "https://v.redd.it/mgb7vsphmhxd1/DASHPlaylist.mpd?a=1733108423%2CNGIwOTdiZDdjODIwOGY5NDU4ZDRmOTMxMmMyYzc2NDg2OGMyMDQ3Y2M2YjU5NDQ5ZDg4ODA2Y2E2NzA5ZjgxOQ%3D%3D&v=1&f=sd", "duration": 28, "hls_url": "https://v.redd.it/mgb7vsphmhxd1/HLSPlaylist.m3u8?a=1733108423%2CZTc3NTFjODRiNDExODNmN2NlMzFlZjAzMDg4MTU5ZGM5Mzc4Zjk4MjEwNzFiZDRmMWZlNmUyMmU2OGY4ZDBkYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2622, "upvote_ratio": 0.91, "comment_count": 372, "over_18": false}, "47": {"id": "1gfvvj8", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "autumnlover1515", "link_flair_text": "Question :snoo_thoughtful:", "time": 1730516427.0837922, "created_utc": 1730318698.0, "url": "https://i.redd.it/by4d8c2v9yxd1.jpeg", "title": "Has anyone watched The Manhattan Alien Abduction doc that premiered recently?", "permalink": "/r/aliens/comments/1gfvvj8/has_anyone_watched_the_manhattan_alien_abduction/", "selftext": "My stance on this topic has always been more or less the same. I cannot claim that any of this is true with 100% certainty, and I cannot say it isn’t either. But it would be arrogant to pressume that in a universe so vast, we are the only living and breathing intelligent beings. \nI found this Netflix doc interesting. Cool dark atmosphere, nice use of old footage, special effects and interview style. \nIt focuses on a famous abduction from 1989. Now, whether you believe Linda or Carol, that is up to you.\nBut I’d say that at best, it presented an interesting case. \nIf you have watched it, let me know your thoughts.", "media": null, "score": 949, "upvote_ratio": 0.96, "comment_count": 388, "over_18": false}, "48": {"id": "1ggqbrt", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": null, "time": 1730516427.71125, "created_utc": 1730412171.0, "url": "https://www.dailymail.co.uk/sciencetech/article-14026121/pentagon-ufo-chief-military-alien-crash-retrieval-program.html", "title": "[Dailymail.UK] Revealed in FOIA: Sean Kirkpatrick of AARO worked to organize UAP/UFO crash retrieval program in 2023.", "permalink": "/r/UAP/comments/1ggqbrt/dailymailuk_revealed_in_foia_sean_kirkpatrick_of/", "selftext": "", "media": null, "score": 72, "upvote_ratio": 0.95, "comment_count": 5, "over_18": false}, "49": {"id": "1ger7sp", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "BigBootyKim", "link_flair_text": null, "time": 1730516429.1205158, "created_utc": 1730197244.0, "url": "https://i.redd.it/8ont7qrp8oxd1.jpeg", "title": "Reminder that Google removed the dislike counter after 10+ years because they didn’t appreciate the people’s real opinion. ", "permalink": "/r/conspiracy/comments/1ger7sp/reminder_that_google_removed_the_dislike_counter/", "selftext": "", "media": null, "score": 2880, "upvote_ratio": 0.82, "comment_count": 217, "over_18": false}, "50": {"id": "1gdkbnt", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "abd1tus", "link_flair_text": "check this out", "time": 1730516430.1334538, "created_utc": 1730060615.0, "url": "https://i.redd.it/gl9v761gycxd1.jpeg", "title": "Well, I found out these are a thing", "permalink": "/r/bigfoot/comments/1gdkbnt/well_i_found_out_these_are_a_thing/", "selftext": "So I instantly had to get a set.  They look really nice in low light and everyone that has seen them has commented on them so far. I’m not sure what I’ll get for the rear doors. ", "media": null, "score": 390, "upvote_ratio": 0.97, "comment_count": 12, "over_18": false}, "51": {"id": "1gdeg6b", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Hayden371", "link_flair_text": null, "time": 1730516431.009127, "created_utc": 1730045393.0, "url": "https://www.reddit.com/gallery/1gdeg6b", "title": "Cryptid photos of unknown origin", "permalink": "/r/Cryptozoology/comments/1gdeg6b/cryptid_photos_of_unknown_origin/", "selftext": "", "media": null, "score": 802, "upvote_ratio": 0.84, "comment_count": 211, "over_18": false}, "52": {"id": "1ge6ub3", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "koolkorki123", "link_flair_text": null, "time": 1730516432.1479034, "created_utc": 1730133999.0, "url": "https://i.redd.it/s2ahshln0jxd1.jpeg", "title": "Mothman costume that I made 🖤😅", "permalink": "/r/cryptids/comments/1ge6ub3/mothman_costume_that_i_made/", "selftext": "", "media": null, "score": 391, "upvote_ratio": 0.99, "comment_count": 13, "over_18": false}, "53": {"id": "1gf04at", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "HaifishJager18", "link_flair_text": null, "time": 1730516432.415058, "created_utc": 1730222587.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gf04at/possible_encounter_with_cryptid/", "title": "Possible encounter with cryptid?", "permalink": "/r/Thetruthishere/comments/1gf04at/possible_encounter_with_cryptid/", "selftext": "This event took place around last November in 2023. Usually on the weekends I like to wake up a little early and go for a quick run/hike sometimes to take a break and relax from the stressful week. As I was getting ready to start after my warm up, I heard like a scream from out in the distance, mind you this is on a cross country course so I assumed maybe someone needed help. But the scream seemed a little off, like it just didn't seem like an animal or a human could have made it. I started to run over there and see if anyone was hurt, when I got to the general area of where the scream was I couldn't find anyone but it just felt strange like I was being watched. Where I live there are no big predators like Bears, Wolves, Mountain Lions, or Bobcats so I couldn't tell why I was so worried. So I just completed my morning run like normal but one thing I noticed after the run was that there was no one on the cross country course the entire time I was there. So if no human was there...what could have possibly made that scream? Any thoughts?", "media": null, "score": 11, "upvote_ratio": 0.87, "comment_count": 13, "over_18": false}, "54": {"id": "1ggywqj", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Michele_Rose23", "link_flair_text": null, "time": 1730516432.8951905, "created_utc": 1730441087.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ggywqj/i_once_went_hiking_with_this_guy_he_showed_me_a/", "title": "I once went hiking with this guy. He showed me a dead body.", "permalink": "/r/LetsNotMeet/comments/1ggywqj/i_once_went_hiking_with_this_guy_he_showed_me_a/", "selftext": "This started when I was at my childhood friend’s apartment for what was supposed to be a fun little movie night.\nWe hadn't hung out in a while and we were catching up. Her place was cozy, a little disorganized, and full of girly decor. We were in our comfiest sweatpants about to watch princess movies. Her apartment isn’t the most tidy. Things are a bit scattered around, but it’s clean and so authentic, which always made me feel at home. We decided on ordering pizza for dinner.\nShe mentioned that Sherwood, someone I hadn’t met yet, would bring the pizza over. At first, I was not happy to hear that. I thought that meant she had invited other friends (a boy) over to join us, which wasn’t what I had in mind. But I was in for a surprise.\nSherwood turned out to just be our delivery guy for the night. He wasn't joining us. When he got to the apartment, there was this awkward air about him. He was obviously nervous, fumbling a bit with the pizza boxes, and not quite making eye contact. My friend introduced us quickly, and it was clear from her overly thankful demeanor that Sherwood did a lot more for her than just fetch dinner.\nAfter handing us the pizza, there was this brief moment of forced small talk. My friend was super nice to him despite his awkwardness; he wasn’t the best conversationalist and seemed really out of place. Then Sherwood asked for my number. I was in a tough spot because our mutual friend was sitting right there, so I just gave it to him. Yeah, we chatted for maybe five minutes before my friend gave him a cue to leave with something like, “thanks so much for dropping this off.” He seemed to get the hint. We both gave him a hug before my friend said something like \"drive safe,\" giving him another kind of cue to leave.\nWhen I asked my friend what that was all about, she basically explained that Sherwood was her unpaid personal assistant. He did her grocery shopping, he dropped off pizza, and he did all this other stuff. I think Sherwood was just a really lonely guy desperate for interaction, especially female interaction. My friend and I were both young and immature back then, we were about 23, but I think we both knew something was seriously wrong with Sherwood. It was a little hard to articulate because we couldn't point out exactly what his problem was.\nSherwood started a group chat with my friend and me. He just sent a meme or two every week. It felt like he was trying to stay relevant without being intrusive. Maybe he was used to being sidelined or even blocked by other girls in the past. It felt like he was trying to make me remember him but also carefully trying not to give me a reason to block him too. I can't speak on his behalf. That’s just what it felt like.\nSherwood also offered help with errands. The first time, I said \"thanks for asking but no.\" He asked every weekend after that. One day, I made the mistake of accepting his help. I knew better.\nI had recently found a great deal for a new washing machine on Craigslist but I had no idea how to pick it up and install it. When I mentioned it in the chat, Sherwood excitedly volunteered to take care of the whole thing. He handled the whole pickup and installation like a total champ, which saved me so much hassle.\nI tried to pay him for his efforts because I wanted to show appreciation. But he wouldn’t accept any money. I insisted. Eventually, he suggested that I could repay him by joining him for a hike—like what? I was uneasy about this—it felt a bit too personal and almost like it could be mistaken for a date. But Sherwood framed it as nothing more than a friendly outing, like a transaction to balance out the favor. I agreed to the hike. I rationalized it by telling myself it was fair trade for installing the washing machine and that it was genuinely a form of payment—especially since I didn't think he had too many friends. This hike felt like maybe a way for him to have some companionship. I thought it might be nice helping him. Part of me was still uneasy about spending time with him in such an isolated setting.\nThe day of the hike, Sherwood picked this trail that was nearby. I had been there before. It's gorgeous. As we walked along together, he chatted about ordinary things like work, the weather, and his hobbies. Everything seemed normal until he suggested we go off the main path to see something \"special\" he wanted to share—like what could that even mean?\nWe reached this secluded spot and there—oh my gosh—was a dead body. My heart pounded so violently as Sherwood stood there, so eerily calm and nonchalant. The casualness in his demeanor made me feel even more uneasy. It felt like he wasn’t just showing me a dead body but also revealing this darker side of himself. It smelled bad, but not like in the movies. I didn't know how long it had been there. I am not a biologist, but my guess is that it had smelled a lot worse before, but now it had gone down.\nAt that moment, I mumbled some excuse about needing to get back quickly and started walking briskly towards the main path. I was urging Sherwood to follow me. I thought maybe this was some twisted mind game, like a way to intimidate me or show that he wasn’t just some \"harmless little boy.\" Maybe he was trying to send a message that said \"you should know I'm familiar with things like this.\" Oh there's another possibility. Maybe he just wanted me to think about him more. Sometimes when I talk to people, I feel like they only notice me for the time that we're together, and then they won't think of me again until the next time we meet. It's possible Sherwood felt that way with me, and maybe he thought showing me a dead body would make him less forgettable. I have no idea.\nBut on the surface, he seemed oblivious to how inappropriate this was. As we walked back together, I was in full fight-or-flight mode—instinctively looking around to see if there were other hikers or rangers—anyone who could make me feel like I wasn't alone. The moment I spotted someone else on the trail—I called out! Not to expose Sherwood but just asking for directions back to the parking area. I wanted to make sure Sherwood and I wouldn’t be left alone together. I asked this gentleman to walk us back to the parking lot. I wasn't going to take no for an answer. I kept pretending like I was confused about his directions and eventually he agreed to just walk us there.\nGetting help from that guy was my way of re-anchoring myself to safety and normality while I was still under the shock of what Sherwood had shown me. We got to the parking area. There, I called my friend and told her I was with Sherwood. I suggested he could drop me off with her and that we'd be there in 20 minutes. Sherwood agreed. That was my way of making sure that if anything happened, it was on the record that Sherwood was the last person to have been with me. Also, I immediately texted my friend what had happened to get that on the record too.\nWhen I got to her apartment, we said thanks to Sherwood and kindly told him to go away. I had already told her through text but then I started going into all the detail. The fact that the body had insects, the fact that the face was decomposing but still recognizable, etc. Her reaction was pure horror—not just about the dead body but also how nonchalantly Sherwood had treated the whole situation! She confessed she always sensed something was off about him even though she’d never imagined anything this disturbing!\nWe both agreed that we needed to remove Sherwood from our lives. She admitted she felt stuck and she had become too reliant on Sherwood to just fire him cold turkey.\nWe planned out how we would do it. It was this gradual phasing out plan. We would limit our interactions to times when others were present. We would slowly reduce our responses to his texts. I would never ask for his help again, and my friend would ask for less and less help.\nSherwood kept texting during weekends offering to run errands or asking if we needed anything—to which my friend would reply “I'm trying to work on being more independent but you've really been such a help.”\nEventually—as my friend started dating someone new—she introduced Sherwood to her boyfriend. Sherwood never contacted her after that.\nI had called the cops the same night of the incident, but it was a while before we heard more news about it. At least a full month later, a news report confirmed discovering a dead body in that area where Sherwood had taken me hiking. They made an arrest, not of Sherwood, but of this other guy that Sherwood followed on Instagram. I have no idea if Sherwood was connected to the murder.\nReflecting on everything, I think there's one clear moral of the story. Trust your instincts.", "media": null, "score": 175, "upvote_ratio": 0.97, "comment_count": 14, "over_18": true}, "55": {"id": "1ggt21j", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "mozes74", "link_flair_text": null, "time": 1730516434.3954852, "created_utc": 1730420233.0, "url": "https://v.redd.it/2tjl33hqn6yd1", "title": "Ghost showing in 'James May in Italy' (Amazon prime, episode 3 - 37 min)", "permalink": "/r/Ghosts/comments/1ggt21j/ghost_showing_in_james_may_in_italy_amazon_prime/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/2tjl33hqn6yd1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/2tjl33hqn6yd1/DASH_96.mp4", "dash_url": "https://v.redd.it/2tjl33hqn6yd1/DASHPlaylist.mpd?a=1733108433%2CMzQ2NWIzMTlmMmIwNDgzNjk3ZTI3ZjM1M2E4OGNlN2E3ZWU4YjM4M2ZkY2UyYTE4NjQyNDNlNTFjOTY4Nzk0Mg%3D%3D&v=1&f=sd", "duration": 18, "hls_url": "https://v.redd.it/2tjl33hqn6yd1/HLSPlaylist.m3u8?a=1733108433%2CZTIwZDdhZDM1MmI5ZjY4ODc4YjY2MjU0ODZjNTM5MGUzNDI1ZmFlY2VmYmY3NjdiNzk5ODFlNzE2YTE3YjRmYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 363, "upvote_ratio": 0.85, "comment_count": 34, "over_18": false}, "56": {"id": "1gha00b", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "XxBCMxX21", "link_flair_text": "Glitch Pic", "time": 1730516434.7128706, "created_utc": 1730479761.0, "url": "https://www.reddit.com/gallery/1gha00b", "title": "Cloud Texture File Corrupted", "permalink": "/r/GlitchInTheMatrix/comments/1gha00b/cloud_texture_file_corrupted/", "selftext": "", "media": null, "score": 205, "upvote_ratio": 0.97, "comment_count": 9, "over_18": false}, "57": {"id": "1ggmjq5", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Ad1714", "link_flair_text": null, "time": 1730516436.0559962, "created_utc": 1730402164.0, "url": "https://allthatsinteresting.com/linda-napolitano", "title": "'The Greatest Abduction Case In The World': When 23 Witnesses Allegedly Saw Aliens Beam Linda Napolitano Into Their Ship", "permalink": "/r/ufo/comments/1ggmjq5/the_greatest_abduction_case_in_the_world_when_23/", "selftext": "", "media": null, "score": 319, "upvote_ratio": 0.91, "comment_count": 51, "over_18": false}, "58": {"id": "1gcl9cb", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "b345tbr34th", "link_flair_text": "Photo", "time": 1730516437.764529, "created_utc": 1729949824.0, "url": "https://www.reddit.com/gallery/1gcl9cb", "title": "Currently on a Disney Cruise. 5yr old daughter on balcony with me, goes \"Dad, what's that?\" I was taking pictures of the night sky.", "permalink": "/r/UFOs/comments/1gcl9cb/currently_on_a_disney_cruise_5yr_old_daughter_on/", "selftext": "I saw it with my own two eyes as she spoke. Camera already taking a shot (not bursts, just manually pressing the button). Kept on doing it. Attached are images. Based on my own two eyes, it was bluish/white, holographic and zig-zagged erratically into the ocean (although I did not hear a splash). The last image most closely represents the colors as I described them.\nGrateful for the images, regret not having a video.", "media": null, "score": 2369, "upvote_ratio": 0.91, "comment_count": 319, "over_18": false}, "59": {"id": "1ggfq2h", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "anomalien_com", "link_flair_text": "News :illuminati:", "time": 1730516439.9992478, "created_utc": 1730384569.0, "url": "https://anomalien.com/luis-elizondo-apologizes-for-presenting-fake-ufo-mothership-image-at-private-event/", "title": "Luis Elizondo Apologizes for Presenting Fake 'UFO Mothership' Image at Private Event", "permalink": "/r/aliens/comments/1ggfq2h/luis_elizondo_apologizes_for_presenting_fake_ufo/", "selftext": "", "media": null, "score": 892, "upvote_ratio": 0.9, "comment_count": 683, "over_18": false}, "60": {"id": "1gfqp75", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": null, "time": 1730516440.6880796, "created_utc": 1730305724.0, "url": "https://v.redd.it/m5at3f2n5xxd1", "title": "Aerospace and Defense Executive, Col. Karl Nell's Insights from the Global Disclosure Day Livestream (Full Segment)", "permalink": "/r/UAP/comments/1gfqp75/aerospace_and_defense_executive_col_karl_nells/", "selftext": "", "media": null, "score": 59, "upvote_ratio": 0.93, "comment_count": 2, "over_18": false}, "61": {"id": "1gcnxvh", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Wookie9991", "link_flair_text": null, "time": 1730516442.226075, "created_utc": 1729957458.0, "url": "https://i.redd.it/bm1vwuwnf4xd1.png", "title": "RFK Jr. is coming.", "permalink": "/r/conspiracy/comments/1gcnxvh/rfk_jr_is_coming/", "selftext": "", "media": null, "score": 2653, "upvote_ratio": 0.86, "comment_count": 578, "over_18": false}, "62": {"id": "1ghbrv4", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "tom2091", "link_flair_text": "wants your opinion", "time": 1730516443.2469382, "created_utc": 1730484295.0, "url": "https://i.redd.it/s6c5sln9ybyd1.jpeg", "title": "Have you seen Bigfoot while you were driving or riding in a vehicle?", "permalink": "/r/bigfoot/comments/1ghbrv4/have_you_seen_bigfoot_while_you_were_driving_or/", "selftext": "", "media": null, "score": 228, "upvote_ratio": 0.98, "comment_count": 49, "over_18": false}, "63": {"id": "1gg84xl", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Question", "time": 1730516444.1351414, "created_utc": 1730355927.0, "url": "https://i.redd.it/8afltwckc1yd1.jpeg", "title": "Why are there so many Steller's sea cow sightings?", "permalink": "/r/Cryptozoology/comments/1gg84xl/why_are_there_so_many_stellers_sea_cow_sightings/", "selftext": "", "media": null, "score": 472, "upvote_ratio": 0.98, "comment_count": 71, "over_18": false}, "64": {"id": "1ggruf6", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "GeneMachine16", "link_flair_text": null, "time": 1730516445.2238567, "created_utc": 1730416616.0, "url": "https://i.redd.it/w1wu5ss0d6yd1.jpeg", "title": "Reppin' the boys for Halloween ", "permalink": "/r/cryptids/comments/1ggruf6/reppin_the_boys_for_halloween/", "selftext": "", "media": null, "score": 352, "upvote_ratio": 0.99, "comment_count": 4, "over_18": false}, "65": {"id": "1gezjm4", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "HaifishJager18", "link_flair_text": null, "time": 1730516445.5047307, "created_utc": 1730221160.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1gezjm4/family_member_seeing_banshees/", "title": "Family member seeing Banshees", "permalink": "/r/Thetruthishere/comments/1gezjm4/family_member_seeing_banshees/", "selftext": "So my Aunt on my dad's side of the family claimed to see a Banshee through one of the windows of her house the night before someone in our family was about to pass away. My aunt is now long gone but I was wondering if anyone else has had an encounter like this because even though my aunt would claim to see it  but her husband would never see the banshee even though she claimed it would cry, wail, and sometimes scream.", "media": null, "score": 4, "upvote_ratio": 0.67, "comment_count": 5, "over_18": false}, "66": {"id": "1gft7df", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "fortunesoulx", "link_flair_text": "Mod Post", "time": 1730516446.0374892, "created_utc": 1730311950.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1gft7df/please_stop_posting_before_reading_the_rules/", "title": "Please stop posting before reading the rules.", "permalink": "/r/LetsNotMeet/comments/1gft7df/please_stop_posting_before_reading_the_rules/", "selftext": "Hi, it's me again, the only (tired ass) mod around here.\nI don't know what's going on lately but I have had to remove more stories than usual for violating the fictional names rule. I don't want to remove stories but rule violations = auto removal because if you didn't read the rules then you probably didn't read the guidelines and that often means the story doesn't belong here. Even if I don't catch it, the post ends up receiving multiple reports from users, so you're annoyed your story gets removed, I'm annoyed, the users are annoyed, no one wins.\nI have seen a lot of comments from users frustrated with the state of this sub lately, so I know it's not just me. I feel you guys and wish I could fix it, but I can only deal with the content we have. As a reminder: posts here must have been life threatening in some way, extremely unusual, or you found something extremely disturbing. Because of that, it's expected that this would be a slow subreddit. Please read this post for the type of stories that should be posted here with examples given.\nIf your story has been removed because of it being a wall of text or the fictional names rule, you can message modmail for re-approval.\nTHE RULES:\n\n\nNO FICTION, NO PARANORMAL - self explanatory\n\n\nNO PROMOTION - if I see any posts or comments asking for permission to narrate a story for your YouTube channel, the offending material will be removed and you get a temp ban. No exceptions. People do not post on this sub just to be content fodder for others. Do not provide permission in the body of your post, either, whether it's pre-emptively or edited in.\n\n\nNo stories focusing primarily on rape or sexual assault/harassment (including flashing, catcalling, or other lewed behavior) - however, I've noticed stories that even just mention it get reported. Please stop doing that. Stories mentioning assault or rape as a part of an experience is not grounds for removal. If a story would still fit in this subreddit without that element, especially if it's just a sentence or two saying \"this happened\" and giving a trigger warning, the story does not \"focus\" on rape or sexual assault. \n\n\nNo series - do not break up a story that has already concluded prior to you writing it (if you go over reddit's character limit, you can continue in the comments). If you write about an encounter and something else happens after that, an update post is fine.\n\n\nNo stories that happened to others - you must be able to recall a story from your own memory - no stories that happened to mom, dad, aunt, uncle etc. Stories that technically happened to you but you can't remember on your own (ex: you were a baby when it happened) are kind of a gray area*\n\n\nNo \"missed close call\" posts - if you worked with or knew someone who did horrible things but not to you personally,  the post does not belong here.\n\n\nFICTIONAL NAMES ARE REQUIRED - BUT DO NOT USE PHRASES LIKE \"LET'S CALL THEM X\" BECAUSE WE ALREADY KNOW THEYRE FICTIONAL BECAUSE OF THIS RULE AND REDDIT'S POLICY ON DOXXING. Additionally, don't use initials - it makes it harder to follow along in a story.\n\n\nspeaking of doxxing - none of that. If it's not freely available information (as in anyone with enough info could Google it and find a news article), don't post it. Doxxing could get this subreddit banned.\n\n\nNo walls of text - use paragraph breaks by double pressing enter after each paragraph\n\n\nDon't be an asshole - this is more for comments than anything, but don't be a jerk. We have a zero tolerance policy on victim blaming. Do not start or engage in slapfights. If someone is being a dick, report their comment and I'll take care of it.\n\n\nKeep personal appearance or house/street layouts to a minimum - it is hard to visualize two paragraphs about the specific layout of a street or house. Additionally, in the past when I have seen personal appearance descriptions in stories they just contribute to harmful stereotypes about who gets creeped on or why. Being targeted by a predator is about vulnerability and the predator, not how attractive you are. I've been catcalled in sweatpants and zero makeup. It's not about how you look. \n\n\nNo stories focusing on road rage or being briefly followed on the road - This subreddit is for life threatening encounters (an argument can be made that being in a car at all is life threatening...but that doesn't mean it fits here.) If you have a road rage incident and get the shit beat out of you or a gun pulled on you, that fits for sure. But getting flipped off or followed on a highway because you flipped someone off but eventually they give up is unhinged as hell and frightening, but not on the same level as stories like \"no good deed goes unpunished.\"\n\n\nNo stories taking place entirely online - stories must have some real life component to them to fulfill the \"life threatening\" part of the requirements for this subreddit. Stories taking place entirely online belong on r/onlinehorrorstories\n\n\n*Given the lack of suitable stories lately and the fact this is a gray area, I'd like to hear from the community on whether to let stories like this through. They're not super common, but I have seen a few here and there. I'm also considering loosening up on the no family member's stories, as at least one of my favorite stories from this subreddit is from someone's uncle and I can think of another classic story that happened to the OP's stepmother. Maybe we could loosen it up to if it's not your story, it must be an encounter from someone related to you by blood or marriage? A different subreddit I mod has a rule like that and it works pretty well. Let me know what you think. No other rules are up for debate at this time. \nPlease continue to report stories that break the rules. If a post doesn't belong here, it may be suitable for r/creepyencounters, which was created to take the overflow from here for stories that aren't life threatening, but still creepy/disturbing in a milder way.", "media": null, "score": 151, "upvote_ratio": 0.95, "comment_count": 20, "over_18": true}, "67": {"id": "1geksim", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "OriginalFuckGirl", "link_flair_text": null, "time": 1730516447.5970137, "created_utc": 1730170580.0, "url": "https://i.redd.it/6b81f4mf1mxd1.jpeg", "title": "Took this at an abandoned asylum a few years ago.  ", "permalink": "/r/Ghosts/comments/1geksim/took_this_at_an_abandoned_asylum_a_few_years_ago/", "selftext": "", "media": null, "score": 233, "upvote_ratio": 0.88, "comment_count": 53, "over_18": false}}}