{"_default": {"1": {"id": "1hz2qkm", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "robbberry", "link_flair_text": null, "time": 1737168690.5130606, "created_utc": 1736621230.0, "url": "https://www.cbsnews.com/news/lockheed-martin-donates-1-million-inaugural-committee/", "title": "“Lockheed Martin donates $1 million to Trump inaugural committee” - I guess we aren’t finding out about the drones now?", "permalink": "/r/ufo/comments/1hz2qkm/lockheed_martin_donates_1_million_to_trump/", "selftext": "", "media": null, "score": 1650, "upvote_ratio": 0.96, "comment_count": 138, "over_18": false}, "2": {"id": "1hzkr7d", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "YoungMidoriya123", "link_flair_text": "NHI", "time": 1737168692.3560882, "created_utc": 1736681272.0, "url": "https://i.redd.it/pxq1q8b2tjce1.jpeg", "title": "The photo that was buried ", "permalink": "/r/UFOs/comments/1hzkr7d/the_photo_that_was_buried/", "selftext": "I don’t think we realise how insane this picture is…and no it isn’t a reflection in the water.  This photo was buried for over 20 years never to see the light of day, shortly after the 2 people who seen this in broad daylight, Scotland,  they were visited at their workplace by men in dark suits as corroborated by their close friend who they worked with them at the time, to where they have been missing ever since.\nI feel like the fact proofs like these photos exist yet no one pays attention is indirect proof to how well and calculated the cover up has been.  The public has been programmed to think a certain way and when something doesn’t fit into the paradigm we are provided by the government, we reject it ", "media": null, "score": 6208, "upvote_ratio": 0.82, "comment_count": 1526, "over_18": false}, "3": {"id": "1i378by", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "SexDrugsAndPopcorn", "link_flair_text": "Video", "time": 1737168693.9140494, "created_utc": 1737084261.0, "url": "https://v.redd.it/g6vg67yb3hde1", "title": "serious - Holy shit ", "permalink": "/r/aliens/comments/1i378by/serious_holy_shit/", "selftext": "thoughts? aligns with the orb theory posted earlier about there always being three", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/g6vg67yb3hde1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 960, "scrubber_media_url": "https://v.redd.it/g6vg67yb3hde1/DASH_96.mp4", "dash_url": "https://v.redd.it/g6vg67yb3hde1/DASHPlaylist.mpd?a=1739760692%2CMjAxYWUyMjYzMDk5OTFhYzkyMzExY2I5NjcxOWFlZjRiMzQxYmU4NDQ3MTZkMzFiNzc3Y2QxYjFhYWIwMmNkMQ%3D%3D&v=1&f=sd", "duration": 227, "hls_url": "https://v.redd.it/g6vg67yb3hde1/HLSPlaylist.m3u8?a=1739760692%2CZGM2ZGZmYTY0N2VlOGE2Nzg1NGE2MDhmMGY5NGE5NjY1NWNjNDUwMTg5NzEzY2QwNzU2NGQ2OWE4NzQxZmZmZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 5456, "upvote_ratio": 0.9, "comment_count": 680, "over_18": false}, "4": {"id": "1i29nnk", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Whatthehecitshec", "link_flair_text": null, "time": 1737168694.5314765, "created_utc": 1736980012.0, "url": "https://i.redd.it/33hrv3cdh8de1.jpeg", "title": "New Whistleblower - Newsnation", "permalink": "/r/UAP/comments/1i29nnk/new_whistleblower_newsnation/", "selftext": "", "media": null, "score": 960, "upvote_ratio": 0.95, "comment_count": 213, "over_18": false}, "5": {"id": "1hzt0cm", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Hartram", "link_flair_text": null, "time": 1737168695.684545, "created_utc": 1736705929.0, "url": "https://i.redd.it/zlt5vmuxtlce1.jpeg", "title": "Don't let headlines distract you from the class war", "permalink": "/r/conspiracy/comments/1hzt0cm/dont_let_headlines_distract_you_from_the_class_war/", "selftext": "", "media": null, "score": 5555, "upvote_ratio": 0.94, "comment_count": 506, "over_18": false}, "6": {"id": "1hzfjxf", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GlitteringSun7069", "link_flair_text": null, "time": 1737168695.8924022, "created_utc": 1736658971.0, "url": "https://youtube.com/live/5VceK20zmQI?si=FD9c97UO7S0wCYQX", "title": "VIRTUAL MARCH for the MISSING & EXPLOITED CHILDREN | GLOBAL LIVE EVENT", "permalink": "/r/conspiracyfact/comments/1hzfjxf/virtual_march_for_the_missing_exploited_children/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.75, "comment_count": 0, "over_18": false}, "7": {"id": "1i2qil1", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "aikisean", "link_flair_text": "museum", "time": 1737168696.402266, "created_utc": 1737038876.0, "url": "https://www.reddit.com/gallery/1i2qil1", "title": "Taxidermy", "permalink": "/r/bigfoot/comments/1i2qil1/taxidermy/", "selftext": "Stumbled onto this on a \"Bad Taxidermy\" FB group. This is...pretty amazing, I think.", "media": null, "score": 940, "upvote_ratio": 0.96, "comment_count": 169, "over_18": false}, "8": {"id": "1i0dnlx", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "the_crepuscular_one", "link_flair_text": "Meme", "time": 1737168697.1559508, "created_utc": 1736774055.0, "url": "https://i.redd.it/7omrr1hwgrce1.png", "title": "\"Why are you gatekeeping cryptozoology?\"", "permalink": "/r/Cryptozoology/comments/1i0dnlx/why_are_you_gatekeeping_cryptozoology/", "selftext": "", "media": null, "score": 2223, "upvote_ratio": 0.98, "comment_count": 148, "over_18": false}, "9": {"id": "1i24c87", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "IcE_cHiLlEd_WaTeR", "link_flair_text": "Skinwalker?", "time": 1737168697.3793721, "created_utc": 1736966294.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1i24c87/horrifying_encounter_with_entity_in_russia/", "title": "Horrifying encounter with entity in Russia ", "permalink": "/r/Humanoidencounters/comments/1i24c87/horrifying_encounter_with_entity_in_russia/", "selftext": "Me And 4 of my friends were in the Russian countryside this winter, we stayed at one of my friend's houses from mid-December to the beginning of January, about 20km east of Moscow. On the night before New Year's, we had a terrifying encounter with something horrible. It was 1.30 AM, and we had stayed at the house all day, ate pizza, watched movies and played Mortal Kombat. We had also been to the sauna and had all been in good spirits as later that day it would be New Year's. We were outside my friend's house, which overlooks a very small valley, about 10m in depth and 60m in length and we were blowing up some firecrackers that we had prepared ( his house is quite isolated with the nearest neighbours about 100m away. We blew them up one by one by throwing them into the valley that was next to the house. As we were doing this, I was the first to notice a black silhouette with a glowing cigarette in the distance moving towards us extremely fast. I immediately notified everyone with me and told them to get inside the house's courtyard. My friends saw the figure, were confused as to who it may be and what they were doing but weren't worried, as the figure was a very long way away, and we had at least 2 minutes before he came close enough to properly see our faces or do anything. I looked back at the figure and immediately noticed that his eyes had a faint glow, nothing crazy or bright, just a very faint, yellow/goldish glow, similar to the way a cat's eyes reflect light in the darkness. I also noticed that the figure had travelled a very large distance in the 5 seconds I took to turn around and inform my friends, this was especially worrying as he was walking, not running. I immediately knew that it was time to leave, I ran towards the gate to the house and yelled for my friends to follow me, which after witnessing what I had witnessed, they obliged, except one of them. One of our friends looked frozen in fear, his eyes were wide open, his mouth slightly open too and he was not blinking. This entire time he was looking at the figure. I ran and pushed him in order to get him to move, which made him snap out of some sort of light trance, as he was slightly lost.  By this point the figure was about 100m away, and nearly at the same time, all of us were filled by a visceral feeling of dread, not fear, but more like: 'Whatever is happening right now is very, very wrong', we later realised that this probably emanated from the man. As we were entering the garden and ducking behind the fence, we noticed that the man was moving a minimum of 5 times as fast as a regular person running, while making absolutely no noise, even though he was walking. We hid behind the fence for ages and managed to get a picture of him from underneath the fence. He then walked into the nearby woods, leaving behind absolutely no footprints and making no noise at all. I have no clue what this was but we are 100% that whatever this was was not human.\nUPDATE!!!: I forgot to add but one of my friends said that the man apparently turned into smoke at one point?? Like white smoke and then materialized again, not sure if I believe him as nobody else saw it.", "media": null, "score": 133, "upvote_ratio": 0.91, "comment_count": 68, "over_18": false}, "10": {"id": "1i1hapa", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "crumbbelly", "link_flair_text": "Art", "time": 1737168697.7932608, "created_utc": 1736890951.0, "url": "https://i.redd.it/3edpnpoh41de1.jpeg", "title": "I painted the mothman with a sawzall and wanted to share", "permalink": "/r/cryptids/comments/1i1hapa/i_painted_the_mothman_with_a_sawzall_and_wanted/", "selftext": "", "media": null, "score": 1527, "upvote_ratio": 0.99, "comment_count": 61, "over_18": false}, "11": {"id": "1i0qgm8", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "USSCerritos", "link_flair_text": null, "time": 1737168697.985559, "created_utc": 1736806987.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1i0qgm8/secret_us_cities/", "title": "Secret US cities?", "permalink": "/r/Thetruthishere/comments/1i0qgm8/secret_us_cities/", "selftext": "Hey all, I hope I am posting in the right place. Please point me to a more appropriate sub if this one ain't it.\nI've been wondering if there are any towns or cities rumored to exist that don't allow the average citizen to approach or drive through, for whatever reason. I've been driving through some extremely remote mountains in the southwest over the last month, places the average person doesn't think about or know exists. Particularly eastern Nevada/northern Arizona. Also the areas in the far north corners of CA, where there are so many mountains. It would be so easy to hide away in these mountains, and I have to think there are \"unofficial\" communities somewhere- if not the southwest, then *somewhere* in the remote reaches of the country, of which there are still plenty.", "media": null, "score": 492, "upvote_ratio": 0.97, "comment_count": 207, "over_18": false}, "12": {"id": "1hzgejm", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "beesandpowder", "link_flair_text": null, "time": 1737168698.1862104, "created_utc": 1736662247.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hzgejm/i_was_almost_the_victim_of_a_craigslist_ad/", "title": "I was almost the victim of a Craigslist Ad", "permalink": "/r/LetsNotMeet/comments/1hzgejm/i_was_almost_the_victim_of_a_craigslist_ad/", "selftext": "I’m 19f living in the PMW. A couple of months ago, I was looking for extra work because my hours at my regular job were shit. I’m quiet, anxious, and don’t have any friends so I turned to Craigslist. I knew the site could be sketchy, but I was desperate for side gigs and I hadn’t had any luck as someone with no skills and not whilling to do sex work.\nOne ad caught my attention. It offered $50 for someone to take photos of a property using either a camera or something above an iPhone 12 (I have an iPhone 14), promising it would only take an hour or two. I emailed the poster and soon got a text back. The man said I seemed like the perfect fit and invited me over that same day. What’s funny is I actually made a post on r/toafraidtoask about if it was a dumb idea, which everyone told me to take a person with me. I didn’t and deleted the post shorty after.\nThe house was about 20 minutes outside of town, surrounded by dense forest. It was small and run-down, but nothing that raised alarms. The man who greeted me looked like he was in his 50s, unremarkable. He invited me inside. The house was completely empty—no furniture, just dust and dirt.\nI asked where to start taking photos, but was dodging the question, making small talk and asking personal questions about me instead. My anxiety was building so I kept the small talk going, but then he began staring at me intensely. I dropped my phone at one point when we eventually started taking photos though the house, and when he picked it up, he held onto it a little too long before giving it back.\nUnprompted when taking photos of the master bedroom he brushed my face with his hand, complimented my skin. I knew it was stupid coming here but at that point my blood truly ran cold and I was done making excuses in my head. I made a quick excuse to leave, something about my mom, but when I turned toward the door, he grabbed my arm. I still have the picture I took after the ordeal of the bruises on my forearm. It felt like it was gonna get snapped in half. I had brought a small knife for self-defense, a gift from my paranoid mom who would have never let me come here if she had known. Without thinking, I pulled it out and stabbed him in the arm (it was released with the push of a small button. He let go, swinging at my arm with the knife  but I was already running out of the house. I got into my car and drove until I was at a gas station and my heart was calm. \nI called the police and explained everything. They took it seriously, I came in to make a report and answer questions. They searched the property and the surrounding forest but didn’t find him. The house turned out to be abandoned, and in the basement, they found a pack of zip ties. A report was made, but he’s still out there. I call sometimes for updates but it’s never anything of substance. I’ve never told anyone about this other than the police, not even my mom. I know typing this I sound pretty unbothered but that’s the first time anything like that has ever happened to me and I have trouble leaving my house most days. I decided to type this out on here as maybe a way of getting it off my chest as it plagues my thoughts constantly. \nTo the man who lured me to that house: let’s never meet again.", "media": null, "score": 666, "upvote_ratio": 0.98, "comment_count": 26, "over_18": true}, "13": {"id": "1hz7s5n", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "verystrangeshit", "link_flair_text": null, "time": 1737168698.3588674, "created_utc": 1736634724.0, "url": "https://i.redd.it/8kcrg2iayfce1.png", "title": "In the winter of 2015-16, the obscure pathogen Elizabethkingia anophelis killed 26 people in an outbreak in Wisconsin and Illinois. The problem? This bacteria was thought to be largely harmless, and investigators could not determine how any of the victims were infected.", "permalink": "/r/truecreepy/comments/1hz7s5n/in_the_winter_of_201516_the_obscure_pathogen/", "selftext": "", "media": null, "score": 53, "upvote_ratio": 0.94, "comment_count": 3, "over_18": false}, "14": {"id": "1hz2l1e", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "None", "link_flair_text": null, "time": 1737168698.5421896, "created_utc": 1736620816.0, "url": "https://www.reddit.com/r/threekings/comments/1hz2l1e/my_girlfriend_made_me_a_love_ritual_and_now_im/", "title": "My Girlfriend made me a love ritual, and now im obssesed with her", "permalink": "/r/threekings/comments/1hz2l1e/my_girlfriend_made_me_a_love_ritual_and_now_im/", "selftext": "Me M(23) and my girlfriend F(22) tried, after my agreement, a love ritual to make eachother fall in love.\nShe was always into ritual and witchcraft but i was always skeptical about, i honestly thought this was all crap and i agreed just to make her realise this wasn't real.\nThe ritual consisted from what i remember, first off she made me lay down on a bed with pictures of us around and candles. She had a love potion with sweet ingreedients like cinnamon and sugar, and she sprayed it with her perfume.\nFirst off she made my write a love letter to her that she then burned and put the dust in the potion.\nI was hesitant but she made my spit in the potion to \"get the dna\", i was laughing my ass off.\nThen while i was laying down she made me close my eyes, she made me eat sugar and poured some cinnamon on my chest. Then we started citing love chants, then she kissed me sprayed her perfume on me and this was over.\nI didn't think much of it, and for the rest of the night i teased her about it telling her it wasn't working.\nBut in the morning after i woke up and i could only think about her, literally couldn't get the idea of her touch out of me. I thought it was just a coincidence but it kept going, trough the day i kept thinking of scenarios with her and my heart was beating so hard, even now as i text i still am thinking about her.\nIt became a problem, now it has been a week and i feel anxiety and paranoia when she is not around me, i feel like i need her touch just the thought of her smile makes me blush.\nI am embarassed to say this and didn't want to but i am also uncontrollably touching myself to her.\nI can't spend good social time with other people and my braind is really foggy.\nI informed myself little bit about rituals and spells and i figured out that my girl gave me so much stuff: Love spell, love letter, manifesting and love energy, Maybe even too much stuff, reading on reddit i got the feeling that you should only do one of theese at a time and can still be risky. But idk i am not that informed.\nI read about that the effect of a love spell/ritual can last soo long and i really cannot afford this, i am obbsessed by her, by her eyes by her smile and her personality.\nAs i was saying i need some tips to remove this effect or even weaken it, i love being this addicted to my girlfriend but i feel like if it keeps going like this it will become unhealthy\nHelp me please", "media": null, "score": 1, "upvote_ratio": 0.52, "comment_count": 9, "over_18": false}, "15": {"id": "1i2mpqk", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Bulky_Ride6364", "link_flair_text": "Paranormal Community [Discussion]", "time": 1737168698.8945987, "created_utc": 1737026313.0, "url": "https://i.redd.it/pj87nwk1bcde1.png", "title": "What is the scariest ghost? For me it's Pocong", "permalink": "/r/Ghosts/comments/1i2mpqk/what_is_the_scariest_ghost_for_me_its_pocong/", "selftext": "What is the scariest or the most creepy ghost in your opinion? For me it's pocong. The pocong is a ghostly figure deeply rooted in Indonesian and Malaysian folklore. It is believed to represent the soul of a deceased person whose burial rites were improperly completed. According to Islamic tradition, the deceased is wrapped in a white shroud (kain kafan) for burial, and the cloth is tied at the head, feet, and around the body. The pocong emerges when the ties at the head or feet are not untied after burial, preventing the soul from resting peacefully.\nIn folklore, the pocong is said to rise from its grave, seeking help to have its burial ties undone or wandering as a restless spirit due to unresolved issues in life.\nCharacteristics of Pocong\n\nAppearance:\n\nThe pocong is wrapped entirely in a white burial shroud, with only its face exposed.\nIts face is pale, often decayed, resembling a corpse. Some depictions include hollow eyes or darkened, sunken features.\n\nMovement:\n\nDue to its tightly wrapped state, the pocong is often portrayed as hopping rather than walking.\nIn some stories, it floats instead of hopping, adding to its eerie presence.\n\nBehavior:\n\nThe pocong is not always malevolent. In many tales, it appears to seek closure or assistance.\nHowever, its sudden appearance and unsettling form are enough to instill fear in those who encounter it.\n\nSymbolism:\n\nThe pocong serves as a reminder of death and the importance of properly following burial rituals.\nIt also reflects cultural beliefs about the afterlife and the consequences of unfinished business or neglected spiritual duties.\nThe pocong has become a popular figure in Southeast Asian horror films, literature, and urban legends, symbolizing a blend of fear, tradition, and spiritual mystery.", "media": null, "score": 439, "upvote_ratio": 0.93, "comment_count": 131, "over_18": false}, "16": {"id": "1i01n3b", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "coachlife", "link_flair_text": "Glitch Vid", "time": 1737168699.1352012, "created_utc": 1736728676.0, "url": "https://v.redd.it/lg9wyua0qnce1", "title": "What is this?", "permalink": "/r/GlitchInTheMatrix/comments/1i01n3b/what_is_this/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/lg9wyua0qnce1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 358, "width": 640, "scrubber_media_url": "https://v.redd.it/lg9wyua0qnce1/DASH_96.mp4", "dash_url": "https://v.redd.it/lg9wyua0qnce1/DASHPlaylist.mpd?a=1739760699%2CYjMzY2ZjMWFhNTBlNzM4NTJkMmJlYTg1M2IwNGQxYTE3YTFhZDk4NTUyZDY0NmM4MDBkZjY5NTU5MDMwMzQ0ZA%3D%3D&v=1&f=sd", "duration": 15, "hls_url": "https://v.redd.it/lg9wyua0qnce1/HLSPlaylist.m3u8?a=1739760699%2CZDE3MGIyZjI3NmE3ZTc0ZDM5OWJhNWIxYmFhZjZjM2VlN2FjMDc1NDFhNWZkY2EyMTRiOWYyODQ0Mzg3OGViYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1791, "upvote_ratio": 0.93, "comment_count": 366, "over_18": false}, "17": {"id": "1hyzwj9", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "2_Large_Regulahs", "link_flair_text": "Post Disclosure World", "time": 1737168700.8192918, "created_utc": 1736613812.0, "url": "https://i.redd.it/8zy4i7vg8ece1.jpeg", "title": "Jimmy Carter promised to disclose \"every piece of information\" regarding UFOs if elected president. Then he didn't. ", "permalink": "/r/ufo/comments/1hyzwj9/jimmy_carter_promised_to_disclose_every_piece_of/", "selftext": "Don't fall for it. We have been promised disclosure in the past only to be left at the alter. \nThis hamster wheel is just going to keep on spinning for the rest of eternity. ", "media": null, "score": 1155, "upvote_ratio": 0.95, "comment_count": 264, "over_18": false}, "18": {"id": "1i2dp22", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "NoDegree7332", "link_flair_text": "Disclosure", "time": 1737168702.3940303, "created_utc": 1736991550.0, "url": "https://i.redd.it/2ln4a6dof9de1.jpeg", "title": "Ross Coulthart's NewsNation piece will include retrieval footage ", "permalink": "/r/UFOs/comments/1i2dp22/ross_coultharts_newsnation_piece_will_include/", "selftext": "", "media": null, "score": 6129, "upvote_ratio": 0.89, "comment_count": 1314, "over_18": false}, "19": {"id": "1hz9g08", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "coachlife", "link_flair_text": "Video", "time": 1737168704.1363645, "created_utc": 1736639356.0, "url": "https://v.redd.it/0o7jt60fcgce1", "title": "Multiple UAPs sighted in New Jersey", "permalink": "/r/aliens/comments/1hz9g08/multiple_uaps_sighted_in_new_jersey/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/0o7jt60fcgce1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 734, "width": 480, "scrubber_media_url": "https://v.redd.it/0o7jt60fcgce1/DASH_96.mp4", "dash_url": "https://v.redd.it/0o7jt60fcgce1/DASHPlaylist.mpd?a=1739760702%2CYThlMDg2MTk1NzAxNjViNDc2NmE0ZjgzZWZlY2FkYjE4ZDQzMmU0NzdmN2IxNzM1NmEzZjFiZTlkMzQzOWYxZg%3D%3D&v=1&f=sd", "duration": 61, "hls_url": "https://v.redd.it/0o7jt60fcgce1/HLSPlaylist.m3u8?a=1739760702%2CZGVmZmNiZTc2MWMzNjNjZTExNTRhMmRhMjNjYzIzNGRiYWQ3YmU1ZjdkMzNkZjY0OWMxYTc2OTU5M2Q1OTQzZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4207, "upvote_ratio": 0.86, "comment_count": 500, "over_18": false}, "20": {"id": "1i2a1d7", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Whatthehecitshec", "link_flair_text": null, "time": 1737168704.8406634, "created_utc": 1736981037.0, "url": "https://i.redd.it/noql8j3fk8de1.jpeg", "title": "NEWSNATION EXCLUSIVE", "permalink": "/r/UAP/comments/1i2a1d7/newsnation_exclusive/", "selftext": "Posted by Christopher Sharp..should we strap ourselves in?", "media": null, "score": 899, "upvote_ratio": 0.98, "comment_count": 156, "over_18": false}, "21": {"id": "1i0qawk", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "stasi_a", "link_flair_text": "Rule 6", "time": 1737168706.4122434, "created_utc": 1736806583.0, "url": "https://i.redd.it/veqqch4m5uce1.png", "title": "It all makes sense now", "permalink": "/r/conspiracy/comments/1i0qawk/it_all_makes_sense_now/", "selftext": "", "media": null, "score": 5297, "upvote_ratio": 0.97, "comment_count": 111, "over_18": false}, "22": {"id": "1i11ljy", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnthonyofBoston", "link_flair_text": null, "time": 1737168706.6412363, "created_utc": 1736843409.0, "url": "/r/holofractal/comments/1i0ui7z/reminder_i_am_the_only_person_that_predicted/", "title": "Reminder: I am the only person that predicted October 7th and also remotely viewed Hamas's massive rocket arsenal days in advance in exact detail.  I have undeniable proof", "permalink": "/r/conspiracyfact/comments/1i11ljy/reminder_i_am_the_only_person_that_predicted/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.38, "comment_count": 4, "over_18": false}, "23": {"id": "1hz9up7", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Virtual_Davey", "link_flair_text": "discussion", "time": 1737168707.1400435, "created_utc": 1736640537.0, "url": "https://i.redd.it/8ka2ystifgce1.jpeg", "title": "What if Bigfoot(s) are caught in a burning forest in California? You think he might seek help from humans? ", "permalink": "/r/bigfoot/comments/1hz9up7/what_if_bigfoots_are_caught_in_a_burning_forest/", "selftext": "", "media": null, "score": 876, "upvote_ratio": 0.95, "comment_count": 210, "over_18": false}, "24": {"id": "1i260o8", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "manofpheasent", "link_flair_text": "Discussion ", "time": 1737168708.075237, "created_utc": 1736970529.0, "url": "https://i.redd.it/oekby746p7de1.jpeg", "title": "Thoughts on the giant moa?", "permalink": "/r/Cryptozoology/comments/1i260o8/thoughts_on_the_giant_moa/", "selftext": "I think it's one of the most plausible cryptids given how a large part of new Zealand is unexplored and uninhabited. It also went extinct 600 years ago which isn't much compared to other cryptids. Would love to hear your guys thoughts on this.", "media": null, "score": 504, "upvote_ratio": 0.97, "comment_count": 120, "over_18": false}, "25": {"id": "1i0gl78", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Solidis262", "link_flair_text": "Unidentified", "time": 1737168708.300183, "created_utc": 1736782419.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1i0gl78/my_fathers_encounter_with_a_10_foot_tall_man/", "title": "My fathers encounter with a 10 foot tall “man”", "permalink": "/r/Humanoidencounters/comments/1i0gl78/my_fathers_encounter_with_a_10_foot_tall_man/", "selftext": "For some background since it matters a lot, my father grew up in costa rica. He grew up in the country where it’s mostly farms and and agriculture, houses are very far apart except for a few villages. this event would’ve taken place sometime in the mid to late 80s, and as has been explained to me by both my parents, around this time there wasn’t any phone lines, just streetlights and that’s abt it. \nMy father started working around the age of 9, he would go down to villages or centers in order to sell or deliver vegetables as my grandparents grew vegetables like lettuce, tomato’s, and more. He would very often stay out late as he would be required to deliver vegetables to several restaurants. One night as he was heading back, a herd of goats was obstructing the road, to put into perspective he uses a little carriage like the ones ice cream vendors tend to use in hispanic countries, so he couldn’t just scoot by as his carriage was being blocked as well. Then from behind him, he heard a voice state “Cuanto para una lechuga, muchacho” which translates to “How much for a lettuce young man”. When my father turnt around, he says he saw a 10 foot tall man, who looked very skinny bordering on malnourished with pale skin, he couldn’t completely see his face however he stated that from the little he could see his face was very sunken. The man was wearing overalls with a flannel shirt, a bandana on his neck and a straw hat, I know the description sounds very stereotypical however again, this does take place in the deep county, like an hour away from any city or town. According to my father the straw hat casted a shadow thus he couldn’t see the man’s eyes, however he could see his sunken cheeks and crooked teeth when he talked. My father was weirded out but due to how young he was(in his early teens, around 10-13), he just assumed it was a very tall man, instead of something paranormal or something he should be afraid of, thus my father said the price, the man paid and my father handed him a piece of lettuce which according to him, the man was able to hold with one hand comfortably. As the man walked away with the lettuce, according to my father, the man whistled and the goats followed the man. My father then just headed home. If he told my grandma, or anything like that I’m not sure he didn’t specify. \nAs said before this took place decades ago, and the area this took place was very isolated with no houses nearby. To explain the area better, a lot of Oil Palm trees are grown there thus there are areas where you won’t see a house for a few miles and all you’ll see are just huge banks of Oil Palm trees. As for how he knew he was 10 foot, it was just a guess however he state he was as tall as the ceiling of the house we were in when he told the story, and the ceiling was pretty high, at least 10 feet is my guess. I heard this story a few months ago however I just found out about this sub so decided to post it here since it intrigued me a lot. If you have any questions please don’t be shy to ask, I have plenty of stories like these due to my family all growing up in the deep country, and plenty of relatives stating they’ve seen weird things. How true are they? I’m not sure however I’ve been told them as if theyre fact so if you all wanna hear more i’ll be happy to share. ", "media": null, "score": 62, "upvote_ratio": 0.91, "comment_count": 13, "over_18": false}, "26": {"id": "1i1wu7e", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "crumbbelly", "link_flair_text": "Art", "time": 1737168708.7383378, "created_utc": 1736946009.0, "url": "https://i.redd.it/wwqrj0d9o5de1.jpeg", "title": "I painted Bigfoot and wanted to share ", "permalink": "/r/cryptids/comments/1i1wu7e/i_painted_bigfoot_and_wanted_to_share/", "selftext": "", "media": null, "score": 666, "upvote_ratio": 0.99, "comment_count": 36, "over_18": false}, "27": {"id": "1i1uca7", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Visual-Push-1295", "link_flair_text": null, "time": 1737168708.9213607, "created_utc": 1736935893.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1i1uca7/disappearing_house_in_the_woods/", "title": "Disappearing house in the woods ", "permalink": "/r/Thetruthishere/comments/1i1uca7/disappearing_house_in_the_woods/", "selftext": "If any of you have any experiences or knowledge pertaining to this please reach out because I need to figure this out, when I was maybe 12 years old or younger me and my buddy went into the woods, for context we knew these woods like the back of our hand every detail there was to know about it we knew, so one day we go in and we're exploring as usual until we have a cupboard door like any regular kitchen cupboard door but it was on the ground, we flipped it up and we're almost surprised there was nothing under it but we kept going, all the sudden we started seeing plants we'd never seen before flowers that to this day I've never seen and the terrain was unrecognizable, these woods were not very big to go to the other side it would only take maybe 5 minutes but for some reason we had been walking for longer then that, my internal clock told me something was off why hadn't we reached the end yet until all the sudden as if we had blinked there was a white house with prestine grass in a perfect lawn shaped square around it, me and my buddy were shocked but for some reason decided to turn around and go back as to not disturb whoever lived there and it's a decision I've regretted all these years, we went back to try and find it and we never could, we couldn't find the door either which I think relates to this for some reason, if anyone has any theories or experiences please respond to this, I want to find it again I want to know what I'd seen.", "media": null, "score": 51, "upvote_ratio": 0.93, "comment_count": 26, "over_18": false}, "28": {"id": "1i1dek3", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "mjames1993", "link_flair_text": null, "time": 1737168709.1199498, "created_utc": 1736880886.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1i1dek3/snowplowing_tractor_follows_me_around_town_causes/", "title": "Snowplowing tractor follows me around town, causes me to pull calf muscle", "permalink": "/r/LetsNotMeet/comments/1i1dek3/snowplowing_tractor_follows_me_around_town_causes/", "selftext": "Writing this down on my phone from inside my town's mall as this happened about 10 minutes ago. I (31M) was on my way to the grocery store to buy some stuff I needed for apple cake. At one point as I'm walking I see a tractor up ahead that's removing snow. It has been warm for the past few days and most of the snow around had melted to the point where the roads and sidewalks were visible now. Oh well, maybe there's some big pile of snow elsewhere or something.\nThe tractor was blocking the sidewalk so I decided to wait for it to move out of the way. I stand there for about 2 or 3 minutes waiting and notice something odd: the tractor isn't picking up any snow. In fact, there is no snow for it to pick up. I get annoyed and walk around it to continue walking.\nAs soon as I cross the street at an intersection the tractor starts slowly following me. As in driving onto the sidewalk where, once again, there was absolutely no snow and following me. It moves slightly faster, not so fast that I have to run but enough that I need to pick up the pace a little bit. Due to the bright front lights on the tractor I can't see the driver, so I just keep walking. I assume the tractor is going to continue moving forward so, not wanting to inconvenience the driver, I crods the street again, walking past a closed café. The layout is such that it would be a bit difficult for any large vehicle to maneuver through it so I think I can continue my walk in peace.\nNope! The tractor continues to follow me, the driver giving zero Fs about the difficulty maneuvering. Getting slightly alarmed I quickly walk around the closed café and into some backstreets, thinking I've lost them now. I keep walking and hear the tractor on the other side of the building I was passing. Somehow it had gotten there before me.\n\"You've got to be kidding me!\"\nThinking this person is stalking me, I try to run from one building behind another and just as I get to the building I pull my left calf muscle. In a bit of pain I limp through a gap between buildings too small for anything bigger than a grown person to get through, get behind the wall and take a moment to rest my leg and catch my breath. I can clearly hear the tractor and see the light of the moving from the gap I just came from. I sit there for 5 minutes listening to the tractor's engine run before it finally drives away. I wait a bit longer just in case before continuing on to the mall, still limping a bit but not as bad as before.\nI've been sitting here for about 20 minutes now typing this down and from inside the mall I can still see the tractor driving around. Idk if I'm imagining things, if this person is just some idiot who was bored and thought following me around would be funny or if they were up to something bad. All I know is I have a pulled calf muscle because of it.\nSo to the tractor driver, let's not meet again.", "media": null, "score": 76, "upvote_ratio": 0.91, "comment_count": 11, "over_18": true}, "29": {"id": "1i33jyu", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "OhGodOhNo-", "link_flair_text": "Captured Apparition ", "time": 1737168709.7890387, "created_utc": 1737072989.0, "url": "https://www.reddit.com/gallery/1i33jyu", "title": "Picture I took back in 2020 inside my local church. April 17th, took it randomly because I figured it would be creepy, since it was nearly midnight. Pretty sure we were there for some final preparations for the following day.", "permalink": "/r/Ghosts/comments/1i33jyu/picture_i_took_back_in_2020_inside_my_local/", "selftext": "On the left side of the iconostasis. Not gonna go out of my way that's definitely something, but it does look odd.", "media": null, "score": 271, "upvote_ratio": 0.82, "comment_count": 63, "over_18": false}, "30": {"id": "1hyxkiq", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ouseph_pk_2000", "link_flair_text": "Glitch Vid", "time": 1737168710.0075011, "created_utc": 1736607369.0, "url": "https://v.redd.it/y0syjasapdce1", "title": "There was no wind", "permalink": "/r/GlitchInTheMatrix/comments/1hyxkiq/there_was_no_wind/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/y0syjasapdce1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/y0syjasapdce1/DASH_96.mp4", "dash_url": "https://v.redd.it/y0syjasapdce1/DASHPlaylist.mpd?a=1739760709%2CNjY5YmY3ZTUzMjg2Y2FlYzYwNWE5NDk0M2ZlMGFlMTk2MWRkMDc3Y2JiNWU3ZDZjYTYzMTM2NDQ0MjgyMzRmZg%3D%3D&v=1&f=sd", "duration": 17, "hls_url": "https://v.redd.it/y0syjasapdce1/HLSPlaylist.m3u8?a=1739760709%2CYzZmN2UyN2U5YTBjNDZlMmU4NDZhMTEzZDQzZDJlNGE0ODQwZmU3M2E5MDczMDg4MmI3MjY1NGY5ZWE1ODMwMg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 539, "upvote_ratio": 0.79, "comment_count": 130, "over_18": false}, "31": {"id": "1i24x4e", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "UncleSugarShitposter", "link_flair_text": null, "time": 1737168711.4940941, "created_utc": 1736967759.0, "url": "https://www.reddit.com/r/ufo/comments/1i24x4e/if_greer_comes_through_on_this_we_should_support/", "title": "If Greer comes through on this we should support him. If he doesn't, he should never be posted here again. ", "permalink": "/r/ufo/comments/1i24x4e/if_greer_comes_through_on_this_we_should_support/", "selftext": "", "media": null, "score": 808, "upvote_ratio": 0.97, "comment_count": 216, "over_18": false}, "32": {"id": "1i29ysm", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "Whistleblower", "time": 1737168713.0661466, "created_utc": 1736980838.0, "url": "https://v.redd.it/pjuplholj8de1", "title": "New UAP Whistleblower Describes ‘Egg-Shaped' Object | Reality Check with Ross Coulthart", "permalink": "/r/UFOs/comments/1i29ysm/new_uap_whistleblower_describes_eggshaped_object/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/pjuplholj8de1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/pjuplholj8de1/DASH_96.mp4", "dash_url": "https://v.redd.it/pjuplholj8de1/DASHPlaylist.mpd?a=1739760711%2CZWJjYTMwYTlhNjhlMjQ4NWQzMzg4YzRmYzM5N2UxNTdhMGI5MDQ5OTdiNWRjMWZhMWI5OTU0MWU5MmQ2ZjZkOA%3D%3D&v=1&f=sd", "duration": 110, "hls_url": "https://v.redd.it/pjuplholj8de1/HLSPlaylist.m3u8?a=1739760711%2CZjhhODA4ZTkzYmNkOWIyN2ZiZTVkY2RiNTEwMzJmNTJkYjZkZTNiNmJjNzg1NWMxYzcxMzQzMzlkYjhhMzM3Nw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4400, "upvote_ratio": 0.89, "comment_count": 958, "over_18": false}, "33": {"id": "1i0s2jv", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Ill-Speed-7402", "link_flair_text": "Image 📷", "time": 1737168714.6693714, "created_utc": 1736811231.0, "url": "https://www.reddit.com/gallery/1i0s2jv", "title": "In 2018, a girl sitting on her couch in her bedroom, using her phone, snaps a photo at the exact moment an orb unexpectedly appears, marking the beginning of her \"experience.\" (The image has been enhanced)", "permalink": "/r/aliens/comments/1i0s2jv/in_2018_a_girl_sitting_on_her_couch_in_her/", "selftext": "", "media": null, "score": 4124, "upvote_ratio": 0.75, "comment_count": 1579, "over_18": false}, "34": {"id": "1i33c1k", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Modi_Elnadi", "link_flair_text": null, "time": 1737168715.2749355, "created_utc": 1737072352.0, "url": "https://v.redd.it/t4mxwy3j3gde1", "title": "Air Force Whistleblower Pilot Claims Involvement in UAP Retrieval Program with Video Footage", "permalink": "/r/UAP/comments/1i33c1k/air_force_whistleblower_pilot_claims_involvement/", "selftext": "Jake Barber has come forward with claims about a top-secret government UFO retrieval program. In an interview with NewsNation's Ross Coulthart, Barber described seeing an egg-shaped, white object during his service. 'We knew we were dealing with something extraordinary,' Barber said, emphasizing the incident's unprecedented nature.\nSeveral military veterans support Barber's claims, making his testimony more credible. The revelations raise more questions about government knowledge about UAPs and crash retrieval programs.\nSee the full interview on NewsNation's special, Hunting UFOs: The Crash Retrieval Whistleblower, airing Saturday, January 18, at 8 ET.\nHow do you feel about this latest whistleblower revelation? Is it finally time to uncover the truth about UFOs?", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/t4mxwy3j3gde1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/t4mxwy3j3gde1/DASH_96.mp4", "dash_url": "https://v.redd.it/t4mxwy3j3gde1/DASHPlaylist.mpd?a=1739760714%2CODZkNWVhNGY2YmUzNmNhNzAyNDZmOTgwMzQ3MTcwYjgyM2MzYTIzMTM3YzY2NGU5ZGMzODY3MmIxY2Y3MGVhNA%3D%3D&v=1&f=sd", "duration": 103, "hls_url": "https://v.redd.it/t4mxwy3j3gde1/HLSPlaylist.m3u8?a=1739760714%2CODllOGViZDU2ZGZlNGY1YzY4NmNkNWI5MDQ3ZWYxOGZkMWNjNTFhZTlmMjQ5NGFlMmYzN2YxMmY5NjBjYmExZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 460, "upvote_ratio": 0.94, "comment_count": 109, "over_18": false}, "35": {"id": "1hzmig1", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Leo_NoCaprio", "link_flair_text": null, "time": 1737168716.5696728, "created_utc": 1736688027.0, "url": "https://i.redd.it/4atszb4j1kce1.png", "title": "Biden just authorized $17.9 billion in aid to Californians who lost everything in the fires. Just joking. That was for military aid to Israel. ", "permalink": "/r/conspiracy/comments/1hzmig1/biden_just_authorized_179_billion_in_aid_to/", "selftext": "", "media": null, "score": 4528, "upvote_ratio": 0.89, "comment_count": 302, "over_18": false}, "36": {"id": "1i1gfto", "locked": true, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "silent9mm", "link_flair_text": "footprints", "time": 1737168717.3558624, "created_utc": 1736888736.0, "url": "https://i.redd.it/kgcbj6hdvuce1.jpeg", "title": "My Mom found this on her roof this morning.", "permalink": "/r/bigfoot/comments/1i1gfto/my_mom_found_this_on_her_roof_this_morning/", "selftext": "", "media": null, "score": 690, "upvote_ratio": 0.78, "comment_count": 242, "over_18": false}, "37": {"id": "1hz9j5b", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "ApprehensiveRead2408", "link_flair_text": "Discussion ", "time": 1737168718.2547505, "created_utc": 1736639614.0, "url": "https://i.redd.it/i4znlcb2dgce1.jpeg", "title": "Which cryptozoological discovery do you think would shocked the entire world the most if it happening?", "permalink": "/r/Cryptozoology/comments/1hz9j5b/which_cryptozoological_discovery_do_you_think/", "selftext": "", "media": null, "score": 377, "upvote_ratio": 0.89, "comment_count": 171, "over_18": false}, "38": {"id": "1i0qyva", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "HalfDolphin1976", "link_flair_text": "U.F.O. Humanoid", "time": 1737168718.4653215, "created_utc": 1736808300.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1i0qyva/my_desert_encounter/", "title": "My Desert Encounter", "permalink": "/r/Humanoidencounters/comments/1i0qyva/my_desert_encounter/", "selftext": "The Time was December 23rd 1978 at 1 am I remember the date clearly as I was 10 years old and Christmas was just 2 days away. I always tell the story the same as it's burnt in my mind like it was yesterday. I lived on a Mesa in Safford Arizona ( a mesa is a raised plane of earth above the surrounding resembling a Table ) there were 4 other family's  that lived on the mesa our farm was a 40 acre piece of land with our nearest neighbors being 1/4 mile away. I was awoke and for lack of better term pulled to my bedroom window which faced the Graham mountains,which during the day I could see the road that went to the top of the mountain.\nthere where no home or building anywhere in that direction atleast not in 1978 . What I saw about 200 yards away was a classic silver ufo with the two halves that separated the craft a bar of puling light that went clockwise in direction and a ramp coming from a opening and at the bottom of the ramp were 3 aliens whom I could see clearly unclothed gray with very large eyes and very spindly arms short but upon seeing them at this distance I heard them inside my head and upon hearing them talking to eachother in incomprehensible language I realized I wasn't able to move any part of my body and this caused my heart to race and I guessed one of them noticed and to calm me down informed me I was being given a gift and to not worry I would be thankful for it . It was like my brain was a filing cabinet and they were rifling through it and I've always had the feeling   that they either left something or modified something as after going to sleep which I don't remember how that took place the following days had amazing things take place but I'll get to that later I awoke that morning and went to my friends house 1/4 mile away and told him about this experience and he said let's go to where you saw the ship we got there and where it had been was a brand new green plants on the otherwise lifeless or occasional creosote bush randomly strewn around, this was a solid bright green circle the size of the craft I'd seen.\nThe next night was the night before Christmas and after falling asleep I awoke floating out of my body in the lotus position the kind the yogis do and looked down at my sleeping body I was on auto pilot just along for the ride and this included going through my closed bedroom door didn't feel anything as you might expect saw everything that was under the tree but unwrapped still the stretch Armstrong the rock em sock em robots etc. went back floating about 3 feet above the ground again through the closed door and back into my sleeping body. Since that happened I know that it occurred but still believe the gift I was supposedly given isn't really a gift,  on occasion for no particular reason words will come out of my mouth about something in the very near future that will occur, on many occasions I've just said something to my wife like once while driving I said two of those 4 guys on the gold wings will be dead only an hour later  before going on the bridge to the first key in Florida we'd witness 2 of the 4 bikers weeping over the 2 dead bodies on the side of the highway and once out of many such similar occurrence I was benefited by hearing a  warning in my head and then physicaly pulled  backwards before a 6 zone 1 1/2 \" rotary valve that I was directly over particularly my head exploded and went 80 feet into the air and onto the next street , that would have killed me,  and many other similar things usually regarding people about to die in a motor vehicle accident .Some gift huh?  I do attribute them  to my experience that night I've never wrote in any of these groups but thought I'd share this one not sure why hope I made since I don't have much of a gift for writing. ", "media": null, "score": 40, "upvote_ratio": 0.91, "comment_count": 6, "over_18": false}, "39": {"id": "1i0nme2", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "commieconservativ", "link_flair_text": "Gear / Merch / Collectible", "time": 1737168718.8487191, "created_utc": 1736799848.0, "url": "https://i.redd.it/04k12oslltce1.jpeg", "title": "Etsy come up…", "permalink": "/r/cryptids/comments/1i0nme2/etsy_come_up/", "selftext": "", "media": null, "score": 407, "upvote_ratio": 1.0, "comment_count": 10, "over_18": false}, "40": {"id": "1i3k0ij", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Rare_Sympathy4080", "link_flair_text": null, "time": 1737168719.0853672, "created_utc": 1737130717.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1i3k0ij/strange_childhood_memory/", "title": "STRANGE CHILDHOOD MEMORY", "permalink": "/r/Thetruthishere/comments/1i3k0ij/strange_childhood_memory/", "selftext": "When i was a toddler, just a couple of years old, i had a recurring thing happen, which i can't explain. When i was lying in bed i would see, above me, a silver liquid cylindrical column appear, coming out of the ceiling of my bedroom and going straight into my body. The liquid was smooth and flawless, but every so often would turn chaotic and swirling in all directions before going perfect again. This would happen a few times over til i went to sleep, where i would experience vividly, walking through a glass tunnel in space, my hands being held by 2 friendly alien type beings. They never hurt me as far as i remember, but this went on at least twice a week for years. While the column was visible i felt extremely sick and dizzy. I am now in my 50s and this was happening in the early 1970s. Anyone else had similar?", "media": null, "score": 46, "upvote_ratio": 0.94, "comment_count": 16, "over_18": false}, "41": {"id": "1i1uf2g", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Different-Yam-736", "link_flair_text": null, "time": 1737168719.2927182, "created_utc": 1736936233.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1i1uf2g/big_bad_leroy_brown/", "title": "Big Bad Leroy Brown", "permalink": "/r/LetsNotMeet/comments/1i1uf2g/big_bad_leroy_brown/", "selftext": "Around 15 years ago, I lived in Chicago and worked at a restaurant in the Loop where I sometimes worked split shifts, I.e., work the lunch rush then come back a few hours later for dinner. I didn’t usually like to go back home in between as naturally once I got settled in, the last thing I wanted to do was go back to work. So if it was nice, I’d walk around downtown, sit and listen to music in the park, etc. If it wasn’t, I would literally just get on the El to ride around and read or listen to music for a while.\nOne day, it’s the latter scenario and I’m riding what’s a sparsely populated train as it was afternoon on a weekday. I’m on the inside seat of two facing forward, and a guy who just boarded the train plops himself down next to me even though there are plenty of empty seats.\nThere was nothing particularly objectionable about him, just seemed like an average guy probably in his mid to late 20s. I was annoyed he chose to sit down next to me when there were other places to sit comfortably obviously, but before i have barely registered my annoyance he lets out one of those giant dad sneezes. Everyone in the car turned to look at him, which is probably good for what followed.\nHe had covered his mega sneeze with his hand and, to my disgust, he extended it to shake my hand and introduce himself! I did not accept the handshake but said hi and maybe gave him an awkward elbow bump. He seemed affronted by this, but continued to try and make conversation with me, loudly.\nHe quickly started asking personal questions like what I did for work, where I lived, where I grew up, how long I had been in the city, etc. Clearly he was trying to gauge both my naïveté and my income, so I was vague at first and eventually just stopped answering altogether. He then gave me a sob story about how he was on hard times, and maybe I could spare him some money. I didn’t really believe this as, despite the sneeze, he had nice clothes and was well-groomed.\nWhen I told him I had no cash on me, he said, “well I bet you got a 30 day transit pass, so you could give me that.” Maybe I should’ve just given it to him, but the 30 days had just started and I made next to nothing for living in Chicago. Like hell was I going to fork it over! So I decline, and he says “listen, I wasn’t going to tell you this, but I have a way of getting what I want.”\nObviously I’m getting scared now, but as I mentioned, he was talking loudly so the other people on the car were subtly paying attention without getting involved to this point. At the next stop, a bigger crowd was on the platform and I used the opportunity to get off and cross over to head back the other direction. The guy got up and made to follow me off, but some of the people who knew what was happening strategically got in his way and soon the crowd was boarding and he wasn’t able to get off before the doors closed. Phew, that was close!\nBut wait, there’s more! Fast forward several months later. I can’t recall the scenario exactly, but I was eating dinner quickly by myself at a Qdoba nearby where I worked. I was either in between shifts again or done for the day and I needed a break from our food. I was facing out the windows to the sidewalk; back a bit, not at the ones directly against the window. I see a guy outside hassling someone he doesn’t appear to know as I’m sitting there eating my burrito. There’s something familiar about him, but can’t put my finger on it. Soon, he leaves the other person alone and he turns his head to look directly at me, and then I remembered it was the bully from the El all those months ago! He creepily smiles at me and, to my horror, walks into the restaurant.\nI’m like, there’s no way this guy remembers me when very clearly I’m not his only target. I think, maybe that’s not who it was or he saw someone else, but nope, he comes and stands right next to me. He says something along the lines of “well, well, well, that looks good. Remember me? I told you I have a way of getting what I want. Let me have that burrito.” If I were a brat I would’ve said, doesn’t seem you’re very good at it seeing as you didn’t get anything off me or that guy outside, but I’m more of a freeze response type. So I just ignore him, keep eating, and since there are other people in the restaurant, I gamble he won’t make a scene. I started to get worried as he seemed to be trying to wait me out, but I am extremely stubborn when I put my mind to something and I was not going to leave that restaurant before him. I ate very slowly, got refills, got more napkins. He tried to pretend like we were friendly, trying to make casual conversation but I kept ignoring him. Finally, he got distracted by another mark outside but before he left, he said to me “ill see you again sometime”. Once I was certain he was not lurking around, I waited for a crowd and fell in to make my way towards the El and home.\nThankfully, I never saw him again. I am certain his story about being homeless was not true. Even though months of cold weather had passed and we were well into winter when I saw him the second time, he was still nicely dressed and well-groomed. It kind of seemed like he had ditched that story anyway and was taking a more aggressive tact. It honestly didn’t scare me as much as it flummoxed me. He reminded me not only of the song I titled my post after, but also Deebo from the movie Friday. Just an old school bully with no real motivation other than to intimidate people. And of course, what were the odds of running into him again in a different part of the city, and that he’d remember me after all that time?\nIn retrospect though, I should’ve been more scared. He wasn’t just a run-of-the-mill common criminal on the streets of Chicago. Something was off. At the time though, my mental health was in a bad place and I was making minimum wage in an expensive city. It didn’t seem unreasonable to me to risk life and limb for my transit pass or dinner. I got lucky. Yes, I made some calculated risks, but still. It wasn’t worth it and I hope my kids wouldn’t make the same call, or be in a position where they would. But at any rate, let’s not meet again you cowardly, pathetic excuse for a man.", "media": null, "score": 42, "upvote_ratio": 0.92, "comment_count": 9, "over_18": true}, "42": {"id": "1i2aaql", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Plus-Efficiency-1257", "link_flair_text": "ISO (In Search Of)", "time": 1737168720.1956177, "created_utc": 1736981744.0, "url": "https://www.reddit.com/r/Ghosts/comments/1i2aaql/what_is_your_familyghoststory_i_think_every/", "title": "What is your family-ghost-story? I think every family has at least one.", "permalink": "/r/Ghosts/comments/1i2aaql/what_is_your_familyghoststory_i_think_every/", "selftext": "", "media": null, "score": 64, "upvote_ratio": 0.93, "comment_count": 41, "over_18": false}, "43": {"id": "1hzem45", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "dreamweaver1313", "link_flair_text": "Glitch Vid", "time": 1737168720.4076242, "created_utc": 1736655608.0, "url": "https://v.redd.it/39cnqk3oohce1", "title": "4 years later, still don't know", "permalink": "/r/GlitchInTheMatrix/comments/1hzem45/4_years_later_still_dont_know/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/39cnqk3oohce1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/39cnqk3oohce1/DASH_96.mp4", "dash_url": "https://v.redd.it/39cnqk3oohce1/DASHPlaylist.mpd?a=1739760720%2CNjg1NTRmYjZhZGQwNGJkODEwNGU5NzAzYzZlMTM2M2IyZjM1MzE1MDkzYjJkNDE3MjQwMzY4MjhjNWVhMWUzMA%3D%3D&v=1&f=sd", "duration": 119, "hls_url": "https://v.redd.it/39cnqk3oohce1/HLSPlaylist.m3u8?a=1739760720%2CMzI5YmM2MjJkMDdlMGVkODdhNDFhZDdiMmMzZjc3ZjRhOWQyMmZmZWFhMDAzYzJmYmNmYjViNjY3N2RjYzJkOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 489, "upvote_ratio": 0.86, "comment_count": 89, "over_18": false}, "44": {"id": "1i16xnl", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": null, "time": 1737168722.1003277, "created_utc": 1736863995.0, "url": "https://ovniologia.com.br/2025/01/randy-anderson-off-world-technology-bracelet-hieroglyphics-and-ufos.html", "title": "A new UFO whistleblower emerges. Randy Anderson claims to have been taken to an underground military facility, where he witnessed an orb levitating and a bracelet emitting holograms with hieroglyphs. In a way, don't we already know something about this?!", "permalink": "/r/ufo/comments/1i16xnl/a_new_ufo_whistleblower_emerges_randy_anderson/", "selftext": "", "media": null, "score": 695, "upvote_ratio": 0.88, "comment_count": 228, "over_18": false}, "45": {"id": "1i0tjku", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Suitable-Elephant189", "link_flair_text": "Whistleblower", "time": 1737168723.4303608, "created_utc": 1736815291.0, "url": "https://www.reddit.com/r/UFOs/comments/1i0tjku/firsthand_uap_whistleblower_randy_anderson_comes/", "title": "Firsthand UAP whistleblower Randy Anderson comes forward", "permalink": "/r/UFOs/comments/1i0tjku/firsthand_uap_whistleblower_randy_anderson_comes/", "selftext": "From Jesse Michels’s Twitter - Randy Anderson is a Green Beret and an American Hero. In March of 2014, he was taken to an underground facility at Naval Surface Warfare Center Crane in Indiana to a secure secret compartmentalized facility titled “Off World Technology”. He was shown an orb levitating above a podium and a \"gauntlet\" emitting holographic, hieroglyphic-looking text. This second object reportedly killed the person retrieving it. I have back-channeled with Navy contacts who say that while Wright Patterson reverse engineers the Air Force’s most exotic retrieved technology, Crane does this for the Navy.\nRandy also STILL occasionally works contract jobs at Area51 and has seen “electrogravitic” antigravity triangle-shaped craft flying around the test site.\nRandy’s credentials are beyond reproach: we have his DD214 as evidence of his service and his weapons training certificate from Crane proving he was stationed there. The implications of this interview cannot be overstated. Although in many ways (as he’ll admit), it begets more questions than answers. If anyone has had similar experiences or can add ANY insight on what Randy saw, please reach out to me or @UAPGERB (who introduced me to Randy) and is the best up and coming UFO researcher in the world right now. Go follow him. He’s going to be releasing some mind-blowing information in the coming months and years.\nSource: https://x.com/alchemyamerican/status/1878951513110052929?s=46&t=L9_oxykwCU9yehP1sCYQbA", "media": null, "score": 4111, "upvote_ratio": 0.87, "comment_count": 1073, "over_18": false}, "46": {"id": "1i06ov3", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "ssigea", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1737168725.3797147, "created_utc": 1736744965.0, "url": "https://i.redd.it/7x5qrsbg2pce1.jpeg", "title": "Ayyy LMAO", "permalink": "/r/aliens/comments/1i06ov3/ayyy_lmao/", "selftext": "", "media": null, "score": 3571, "upvote_ratio": 0.98, "comment_count": 79, "over_18": false}, "47": {"id": "1hzuql6", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "skorupak", "link_flair_text": null, "time": 1737168726.4367194, "created_utc": 1736710307.0, "url": "https://anomalien.com/former-lockheed-martin-director-we-have-the-technology-now-to-take-et-home/", "title": "Former Lockheed Martin Director: “We Have The Technology Now To Take ET Home”", "permalink": "/r/UAP/comments/1hzuql6/former_lockheed_martin_director_we_have_the/", "selftext": "", "media": null, "score": 378, "upvote_ratio": 0.91, "comment_count": 49, "over_18": false}, "48": {"id": "1i3hvk9", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "BitsNBites777", "link_flair_text": null, "time": 1737168727.8914962, "created_utc": 1737125062.0, "url": "https://i.redd.it/svpjme8ogkde1.jpeg", "title": "Not all heroes wear capes", "permalink": "/r/conspiracy/comments/1i3hvk9/not_all_heroes_wear_capes/", "selftext": "", "media": null, "score": 3149, "upvote_ratio": 0.98, "comment_count": 82, "over_18": false}, "49": {"id": "1i1j7zq", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "dankness8", "link_flair_text": "theory", "time": 1737168728.966889, "created_utc": 1736895955.0, "url": "https://i.redd.it/4l8s7lafj1de1.jpeg", "title": "I’m just going to put this here. Something to think on ", "permalink": "/r/bigfoot/comments/1i1j7zq/im_just_going_to_put_this_here_something_to_think/", "selftext": "There were more hominid species than just Neanderthal. ", "media": null, "score": 284, "upvote_ratio": 0.87, "comment_count": 216, "over_18": false}, "50": {"id": "1i0c71y", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "ApprehensiveRead2408", "link_flair_text": "Discussion ", "time": 1737168729.831538, "created_utc": 1736768866.0, "url": "https://i.redd.it/ng0zmi5e1rce1.jpeg", "title": "Which prehistoric cryptid do you think have highest chance to be real?", "permalink": "/r/Cryptozoology/comments/1i0c71y/which_prehistoric_cryptid_do_you_think_have/", "selftext": "", "media": null, "score": 352, "upvote_ratio": 0.92, "comment_count": 177, "over_18": false}, "51": {"id": "1i328qe", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "KookyOrganization112", "link_flair_text": "U.F.O. Humanoid", "time": 1737168730.1000469, "created_utc": 1737069277.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1i328qe/ufo_and_cloaked_figures/", "title": "UFO and Cloaked Figures", "permalink": "/r/Humanoidencounters/comments/1i328qe/ufo_and_cloaked_figures/", "selftext": "This takes place on Cocoa Beach in FL in May of 2021. \nBefore I begin I must admit that I was under the influence of 3.5 grams of mushrooms when this occurred. I believe this encounter only happened because of this fact, not as an effect of. I will explain as the story progresses. \nAfter an hour or two of gazing towards the sunset, watching the waves come and go, and pondering about my life, it is now dark. I had become fixed on the stars and as you might know, they sort of “connect the dots” in a way after eating the magic fungi. But at this point those visuals have passed and I began noticing a light, the kind you see off of a distant plane, moving too fast for how high in altitude it seemed to be. It also had the common characteristic of a UFO where it buzzed around like a bee rather than smoothly glide through the air. At first I assumed it just might be a high-tech drone as I knew there was a launch station very close by, but very quickly that assumption was fading as it just seemed to buzz around in no clear direction directly above me. \nI can’t fully describe this feeling but somehow I knew “it” knew I was watching it. Once I gave it my full attention it flew towards the ocean where I had to sit up and stare above the water to continue watching. I remember the moon being at least half full and it was bright enough that I could clearly see the clouds, and see anyone on the beach that passed by, even though I was alone at this time. I watched what I can only describe as a distant star-like light, only slightly bigger than the brightest star in the sky, again buzz around quickly in a seemingly directionless way. But now it seemed to be showing off more and flying erratically. It would go in one direction super fast and then make a dead stop. I also noticed the clouds reacting to its flight and shifting and twisting with its movements in a DNA sort of shape ( this could have been the mushrooms but I’m not sure, this was +2 hrs since the peak )\nNow this is where things got weird. This is the point of the story where my reality started to crack. The light was in the left side of the sky and out of nowhere it shoots across the sky, horizontally to the right at about 10x the speed it was moving before. As it reaches this small patch of clouds I watch it teleport 100 yards directly to its left, then the same distance to its right about 8-10 times as it’s moving in the same direction. It does it in succession in a way that it looked like it was “jumping” from point to point and not flying. Again, it makes a dead stop directly after this. \nAt this point my jaw has dropped for the first time in my life. I was thinking \n“did I really just fucking see that”\nAnd guess what, for good measure it does the same thing again. As if it heard me. It flies back to the left side of the sky shoots across and teleports again.  Now I’m on my feet as my reality is breaking before my eyes and I’m trying to make sense of what is happening. A man leaving the beach starts coming near me and I think perfect, maybe someone else is seeing what I’m seeing. I get his attention which he seems extremely annoyed by and I immediately say \n“Are you seeing that shit flying around up there?”\nHis response\n“Ya cool huh”\nAnd walks off the beach not even looking up from the ground as he says this. Okay great, so I’m crazy and now I look crazy to this random dad is what I think to myself. I’m not certain what happened to the light after this as I was pretty dumbfounded and my mind was just in wtf mode. I think it just took off up into space shortly after the interaction with the man. \nNow begins my humanoid encounter. Sorry for the long UFO recount but I believe the details to be important incase someone else can relate. I don’t see anyone else nearby that could have seen the light so I start walking towards the water. On this beach there is a ridge about about 20 ft from the shoreline and there is a gradual decent to the water at about 5 ft. I’m standing at the top of the ridge when I notice two figures coming from the left. They are directly in front of the shoreline and at first I thought it was just two people jogging next to each other. But as I’m focusing my eyes on them I cannot seem to make out any body parts moving or definitive features. I don’t see arms or legs moving. I don’t see hair bouncing, I don’t see sand being kicked up, nothing. I can make out the outlines of a torso and maybe legs but I’m seeing right through them into the ocean as if they have that predator camo people have mentioned. They were the same size, shorter than average humans, moving in synchronicity with each other and seemed more like they were floating rather than walking or running, though they were moving at a jogging pace. I still thought that maybe it was just my eyes messing with me in the dark, but it really wasn’t that dark, you know how it is on the beach. I start to walk closer as they pass in front of me, slowly incase they were just joggers as I didn’t wanna freak people out just approaching them in the dark. But when I take a few steps forward they both pick up speed and go past me and out of sight within a few seconds. Again no perceivable movements or sounds. They just zoom away down the shoreline. \nLooking back it is interesting that I saw these entities immediately after seeing the light. I still even consider the possibility that it was military tech and the figures walking by were just cloaked people seeing who saw the test flight. But the fact that I was on mushrooms and felt a mental connection between us makes me think it was a spiritual or alien encounter. I swear it felt like it communicated a “hey watch this” before blowing my mind with the teleportation. I also felt a “presence” or just pure fear after seeing the figures. Enough to immediately leave in my car. \nPlease let me know if anyone has experienced or heard anything like this. I know the UFO sighting is common but I have never heard of anything like what proceeded afterwards. ", "media": null, "score": 12, "upvote_ratio": 0.87, "comment_count": 6, "over_18": false}, "52": {"id": "1i3ky9k", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Emeraldsinger", "link_flair_text": "Meme / Humor", "time": 1737168730.6049325, "created_utc": 1737133076.0, "url": "https://i.redd.it/5dfghvlg4lde1.jpeg", "title": "A simple explanation  ", "permalink": "/r/cryptids/comments/1i3ky9k/a_simple_explanation/", "selftext": "", "media": null, "score": 364, "upvote_ratio": 0.99, "comment_count": 1, "over_18": false}, "53": {"id": "1i3vk4k", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "tarishart", "link_flair_text": null, "time": 1737168731.0043306, "created_utc": 1737161280.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1i3vk4k/fake_policemans/", "title": "Fake policeman’s.", "permalink": "/r/LetsNotMeet/comments/1i3vk4k/fake_policemans/", "selftext": "This happened in my family when I was about 5 years old, around 1997. At that time, we lived with my mom, grandmother, and grandfather in a three-room apartment on the 6th floor in Ukraine, in Kherson city , in a large neighborhood called Shumensky. Those were criminal times in all post-soviet countries(not much changed since though( , and I was raised very strictly from a young age not to trust strangers and never to open the door to anyone unfamiliar.\nOne day, someone knocked on our door during the day. At home, it was just my mom and me. My mom approached the door and asked, “Who’s there?” A male voice replied, “Open up, this is the police. We need to ask you some questions.” My mom first looked through the peephole and indeed saw two men in police uniforms standing at the door. Only after that did she open the door.\nMy mom asked them what the matter was and what had happened. In response, they started asking her who was currently at home and how many people were in the apartment. I came closer and saw them. They looked at me, and I got scared and ran into another room. At that moment, my mom sensed something was wrong and tried to close the door, but one of the men put his foot in the way and held the door with his hand, preventing her from closing it. My mom, now frightened, asked again what they wanted, but they just silently stared at her without answering. An eerie silence hung in the air.\nSuddenly, our neighbor opened her door. She lived on the same floor as us and was about to leave her apartment on an errand. The two “policemen” immediately changed their expressions, looked towards the neighbor, and she noticed them too. With a questioning look, she glanced at my mom. Then, suddenly, the two men ran down the stairs and out of the building.\nIt was terrifying, and we had no idea what they wanted, but one thing was clear—they had likely bought the police uniforms somewhere, or stole it, and were certainly not real police officers. \nSo, fake policemen’s, let’s never ever meet again!!!", "media": null, "score": 4, "upvote_ratio": 0.75, "comment_count": 1, "over_18": true}, "54": {"id": "1i34mqo", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "GoodiesNGanja", "link_flair_text": null, "time": 1737168731.7363298, "created_utc": 1737076155.0, "url": "https://www.reddit.com/r/Ghosts/comments/1i34mqo/my_fiance_and_i_have_both_seen_a_gray_cat_in_our/", "title": "My fiance and I have both seen a gray cat in our new condo? ", "permalink": "/r/Ghosts/comments/1i34mqo/my_fiance_and_i_have_both_seen_a_gray_cat_in_our/", "selftext": "So my fiance and I just moved into a new condo. It is older, not sure how old to be exact. This is not the first time I’ve seen spirits/apparitions, but I’ve been seeing a gray cat out of the corner of my eye ever since I’ve moved in. I have two dogs who haven’t seen to notice a cat (they would definitely react) but fiance did say he saw what looked like a cat on the stairs just earlier today. I’ve seen it so many times now that I even texted my mom who is many states away to see if her cat, who happens to be a gray tabby, is okay. Definitely not upset with these experiences but just curious to see others thoughts. As I get to know my new neighbors I plan to ask them if they’ve ever had a gray cat by chance. Anyone else have experiences similar? ", "media": null, "score": 55, "upvote_ratio": 0.91, "comment_count": 25, "over_18": false}, "55": {"id": "1i00438", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Mental_Bit_6399", "link_flair_text": "Glitch Pic", "time": 1737168731.9570146, "created_utc": 1736724242.0, "url": "https://i.redd.it/9cl2bzvscnce1.jpeg", "title": "Viewed from a flight over norway", "permalink": "/r/GlitchInTheMatrix/comments/1i00438/viewed_from_a_flight_over_norway/", "selftext": "", "media": null, "score": 185, "upvote_ratio": 0.96, "comment_count": 21, "over_18": false}, "56": {"id": "1i13djl", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "zenona_motyl", "link_flair_text": "Article", "time": 1737168733.3801162, "created_utc": 1736851400.0, "url": "https://anomalien.com/former-lockheed-martin-director-we-have-the-technology-now-to-take-et-home/", "title": "“We already have the means to travel among the stars, but these technologies are locked up in black projects, and it would take an act of God to ever get them out to benefit humanity,” Former Lockheed Martin Director Ben Rich Said In 1993", "permalink": "/r/ufo/comments/1i13djl/we_already_have_the_means_to_travel_among_the/", "selftext": "", "media": null, "score": 546, "upvote_ratio": 0.97, "comment_count": 80, "over_18": false}, "57": {"id": "1i02bsy", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "aspecro", "link_flair_text": "Sighting", "time": 1737168734.959473, "created_utc": 1736730707.0, "url": "https://v.redd.it/q3h8orxyvnce1", "title": "Seen in central PA", "permalink": "/r/UFOs/comments/1i02bsy/seen_in_central_pa/", "selftext": "Time: 7PM EST\nLocation: Central PA (Schuylkill County area)\nMy sister sent me this video she took. What is this? It has a loud booming propellor sound like a human made drone but it is insane looking and massive. ", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/q3h8orxyvnce1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 590, "scrubber_media_url": "https://v.redd.it/q3h8orxyvnce1/DASH_96.mp4", "dash_url": "https://v.redd.it/q3h8orxyvnce1/DASHPlaylist.mpd?a=1739760733%2COWNhMmIwZjUwN2RjNjQzYWRjYmE2M2RhMWJmNjUyMzgxYTI0ZDg0YjAyNTBlZjNiMGMwMDMyN2Q4MThhMmIwZA%3D%3D&v=1&f=sd", "duration": 35, "hls_url": "https://v.redd.it/q3h8orxyvnce1/HLSPlaylist.m3u8?a=1739760733%2CZmI4NzQyZTdiYzVmYWY2YTk2NzljMDJlOWNhNzdhZWFkNzA3Nzk1MDdkMGFlODc3N2JhNTI5ZWMzMTY1ZTAyOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3766, "upvote_ratio": 0.94, "comment_count": 449, "over_18": false}, "58": {"id": "1hzixgp", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Exitium_Maximus", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1737168736.8715484, "created_utc": 1736673153.0, "url": "https://v.redd.it/1yrr2k9q4jce1", "title": "UAP dramatization based on eyewitness accounts", "permalink": "/r/aliens/comments/1hzixgp/uap_dramatization_based_on_eyewitness_accounts/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/1yrr2k9q4jce1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1416, "scrubber_media_url": "https://v.redd.it/1yrr2k9q4jce1/DASH_96.mp4", "dash_url": "https://v.redd.it/1yrr2k9q4jce1/DASHPlaylist.mpd?a=1739760735%2CNDI3NDUxNjM4ZDNjNjVjYzFlMjk3NGM4YzdmNjNjYTllNGQ5NmZlN2JlYjI4YTUwNjYwMGY0YjI3NzdlMjU2MA%3D%3D&v=1&f=sd", "duration": 41, "hls_url": "https://v.redd.it/1yrr2k9q4jce1/HLSPlaylist.m3u8?a=1739760735%2CMmNlMGYyNzBhY2NiNGJhN2JlMzAwMzU3MDNmZmYxYTliY2ZmZWUxN2NmZGZiOTE4NjUwZmJkYThkMTA3ODRjMA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2691, "upvote_ratio": 0.96, "comment_count": 117, "over_18": false}, "59": {"id": "1i2rs6e", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Missmorian", "link_flair_text": null, "time": 1737168737.6095831, "created_utc": 1737042281.0, "url": "https://www.yahoo.com/lifestyle/dad-famous-alien-abductee-thought-230618187.html", "title": "My Dad Was A Famous Alien Abductee. I Thought He Was A Joke — Here's Why I'm Not So Sure Anymore.", "permalink": "/r/UAP/comments/1i2rs6e/my_dad_was_a_famous_alien_abductee_i_thought_he/", "selftext": "", "media": null, "score": 221, "upvote_ratio": 0.94, "comment_count": 43, "over_18": false}, "60": {"id": "1i1ca69", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Shoesandhose", "link_flair_text": null, "time": 1737168738.8368802, "created_utc": 1736878046.0, "url": "https://i.redd.it/k5esl94620de1.jpeg", "title": "Are we still simping for them?", "permalink": "/r/conspiracy/comments/1i1ca69/are_we_still_simping_for_them/", "selftext": "", "media": null, "score": 2126, "upvote_ratio": 0.93, "comment_count": 186, "over_18": false}, "61": {"id": "1hz4gze", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Pactolus", "link_flair_text": "art", "time": 1737168739.42924, "created_utc": 1736625810.0, "url": "https://i.redd.it/5g7ul2f48fce1.jpeg", "title": "What is your favorite witness sketch?", "permalink": "/r/bigfoot/comments/1hz4gze/what_is_your_favorite_witness_sketch/", "selftext": "", "media": null, "score": 255, "upvote_ratio": 0.98, "comment_count": 54, "over_18": false}, "62": {"id": "1i2s3n4", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "PokerMenYTP", "link_flair_text": "Question", "time": 1737168740.626865, "created_utc": 1737043135.0, "url": "https://www.reddit.com/gallery/1i2s3n4", "title": "Megalania Today", "permalink": "/r/Cryptozoology/comments/1i2s3n4/megalania_today/", "selftext": "I would like to know more about reports and evidence for the existence of Megalania in Australia, and hoaxes too to get an idea", "media": null, "score": 234, "upvote_ratio": 0.99, "comment_count": 18, "over_18": false}, "63": {"id": "1i10hkq", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "disleksik-magikarp", "link_flair_text": "Story", "time": 1737168741.2769613, "created_utc": 1736838427.0, "url": "https://www.reddit.com/r/cryptids/comments/1i10hkq/my_mom_saw_a_flying_dinosaur_in_the_70sheres_her/", "title": "My Mom Saw a Flying Dinosaur in the 70s—Here’s Her Story", "permalink": "/r/cryptids/comments/1i10hkq/my_mom_saw_a_flying_dinosaur_in_the_70sheres_her/", "selftext": "Before you pass judgment, let me preface this by saying that this is my mother’s story. I’d also like to add that my mom was (and still is remembered as) a good, sensible person.\nThis took place in the early to mid-70s, back when my mom was a young girl living on a remote ranch in Baja California, Mexico. She was the oldest of six sisters, and life on the ranch often meant waking up early to help out with chores. One of her tasks was occasionally waiting for the water delivery person to arrive.\nThe ranch was pretty isolated—I’ve visited it myself, and even today, it’s still in the middle of nowhere. There’s a highway that curves along the entrance to the property, but other than that, it’s very desolate.\nOne early morning, while my mom and most (if not all) of her sisters were outside waiting for the water delivery, something strange happened. From a distance, my mom noticed a spot in the sky. At first, she didn’t pay much attention to it, but it kept getting closer and closer. Eventually, it flew directly over them, and what they saw left them in shock.\nIt was a flying dinosaur.\nMy mom and her sisters could hardly believe what they were seeing. My mom recalls learning about dinosaurs in school around this time. She distinctly remembered her teachers explaining that dinosaurs had gone extinct millions of years ago, and in that moment, she thought to herself, They must’ve lied, because I’m looking at one right now.\nShe described it as a large creature with wings that flapped loudly as it flew over them. It made strange noises and had no teeth, which my mom found interesting because she’d learned in school that carnivorous dinosaurs had sharp teeth for hunting.\nOnce the creature flew over them, my mom ran inside to get her nana (grandmother). Her nana was a kind, playful woman, but when my mom told her, “Nana, there’s a dinosaur outside! Come look, fast!” her grandmother thought she was joking. Still, she followed her outside and managed to catch a glimpse of it before it disappeared.\nA few weeks later, my mom’s uncles were headed into town to buy groceries, and my mom asked one of them to bring her back a copy of her favorite magazine, Duda. For those who don’t know, Duda: Lo Increíble es la Verdad was a popular Mexican magazine that covered supernatural phenomena, conspiracies, and cryptozoology.\nWhen her uncle came back with the magazine, my mom couldn’t believe what she saw on the cover. It mentioned a flying dinosaur that had supposedly escaped from a secret facility in San Diego and had been spotted in Mexico. She showed the article to her mother, and it was enough to convince her that my mom wasn’t making the story up.\nAccording to my mom, sightings of the creature were even reported in the local newspaper at the time.\nAbout 10 years ago, I decided to ask my mom and all of her sisters about this story to see if they still stood by it. By then, they were all successful, level-headed women living in the U.S. I expected at least one of them to brush it off or say it was just a childhood fantasy, but to my surprise, every single one of them said the same thing: Yes, it really happened. They even acknowledged that people might think they’re crazy, but they all swear it’s true.", "media": null, "score": 266, "upvote_ratio": 0.95, "comment_count": 54, "over_18": false}, "64": {"id": "1hytbb5", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "bogmired", "link_flair_text": null, "time": 1737168742.444872, "created_utc": 1736591912.0, "url": "https://youtube.com/shorts/4A1ePxj9cOQ?si=72wAACwd3_wtpBEe", "title": "Its so wild I finally got it on camera. Ive lived at this place for about 3 years. (East LA) I've always hear footsteps when no one was home.", "permalink": "/r/Ghosts/comments/1hytbb5/its_so_wild_i_finally_got_it_on_camera_ive_lived/", "selftext": "My bedroom coming from the kitchen after I hear my door squeek a couple times knowing it does that.", "media": null, "score": 44, "upvote_ratio": 0.85, "comment_count": 31, "over_18": false}, "65": {"id": "1i0hrbs", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Inevitable-Sky3770", "link_flair_text": "Glitch Pic", "time": 1737168742.6529145, "created_utc": 1736785474.0, "url": "https://i.redd.it/482dbl7wesce1.jpeg", "title": "Literally gifted this exact snowman for Christmas to a family member, bought it on marketplace, she said it was in storage for years. My fiancé brings home the exact same snowman from work and was told he won it in a raffle, and he never entered any raffle. Kinda funny even if it’s not a glitch! ", "permalink": "/r/GlitchInTheMatrix/comments/1i0hrbs/literally_gifted_this_exact_snowman_for_christmas/", "selftext": "", "media": null, "score": 61, "upvote_ratio": 0.92, "comment_count": 3, "over_18": false}}}