{"_default": {"1": {"id": "1hr3y13", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "daily_mirror", "link_flair_text": null, "time": 1735959483.4006433, "created_utc": 1735741723.0, "url": "https://www.mirror.co.uk/news/world-news/drone-crisis-just-beginning-expert-34403108", "title": "Drone crisis is 'just the beginning' as expert warns 'big announcement due in 30 days'", "permalink": "/r/ufo/comments/1hr3y13/drone_crisis_is_just_the_beginning_as_expert/", "selftext": "", "media": null, "score": 1307, "upvote_ratio": 0.78, "comment_count": 995, "over_18": false}, "2": {"id": "1hoa59r", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "AlphazeroOnetwo", "link_flair_text": "Discussion", "time": 1735959484.748694, "created_utc": 1735405943.0, "url": "https://v.redd.it/nucqqfe1gm9e1", "title": "Lockheed Martin had these \"drones\" back in the 1990s, 30 years ago. Imagine what they have now behind closed doors. Posting this because of the recent drone sightings.", "permalink": "/r/UFOs/comments/1hoa59r/lockheed_martin_had_these_drones_back_in_the/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/nucqqfe1gm9e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/nucqqfe1gm9e1/DASH_96.mp4", "dash_url": "https://v.redd.it/nucqqfe1gm9e1/DASHPlaylist.mpd?a=1738551483%2CYzE0NzA0MWQwZmZmMjgwY2NlNzUwNWE1ZDEzMTZiMmU1NDFlN2IwYTQyNWJhZmUzZjc5NDBjZDEwYTQ0Y2MwYQ%3D%3D&v=1&f=sd", "duration": 320, "hls_url": "https://v.redd.it/nucqqfe1gm9e1/HLSPlaylist.m3u8?a=1738551483%2CN2RlZTkyYjllYmIyY2Q2MDkwZDE2ZjU4MzJjOTgzYjVhY2JjZDk3Njk0YzhlN2QzM2ZkZjIyMjA0NjhlNmUyYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 16395, "upvote_ratio": 0.9, "comment_count": 1183, "over_18": false}, "3": {"id": "1hoohbl", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "jetzxbro", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1735959486.2165105, "created_utc": 1735447909.0, "url": "https://v.redd.it/hg3kmyvmxp9e1", "title": "They’re finally here.", "permalink": "/r/aliens/comments/1hoohbl/theyre_finally_here/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/hg3kmyvmxp9e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/hg3kmyvmxp9e1/DASH_96.mp4", "dash_url": "https://v.redd.it/hg3kmyvmxp9e1/DASHPlaylist.mpd?a=1738551485%2CM2IzMDA1ZTY2MDY0Y2Q1NjFlMjM5YTNiNzZiMjM2MmIyMzQ3NjlmMTZjOTVhMGQ5NDdiODRkYWRmNTZkMjA1ZQ%3D%3D&v=1&f=sd", "duration": 19, "hls_url": "https://v.redd.it/hg3kmyvmxp9e1/HLSPlaylist.m3u8?a=1738551485%2COWY2NThlMDAxZDhhZGI3ODhhZDk1ZGQ3OWI2MzNhZjUyODVhYjY4OGY3YmU5ZDgzNDQyZWNlNDEzZGVkYjVlMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 17780, "upvote_ratio": 0.93, "comment_count": 860, "over_18": false}, "4": {"id": "1hslor0", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "light24bulbs", "link_flair_text": null, "time": 1735959486.765793, "created_utc": 1735908340.0, "url": "https://i.redd.it/mz765dhqyrae1.png", "title": "There they are folks", "permalink": "/r/UAP/comments/1hslor0/there_they_are_folks/", "selftext": "", "media": null, "score": 621, "upvote_ratio": 0.92, "comment_count": 228, "over_18": false}, "5": {"id": "1hrss22", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Battle09", "link_flair_text": null, "time": 1735959487.923501, "created_utc": 1735821509.0, "url": "https://i.redd.it/x9481amjskae1.jpeg", "title": "Just read this it’s very interesting ", "permalink": "/r/conspiracy/comments/1hrss22/just_read_this_its_very_interesting/", "selftext": "", "media": null, "score": 6572, "upvote_ratio": 0.94, "comment_count": 804, "over_18": false}, "6": {"id": "1hoop39", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "NewWorm", "link_flair_text": null, "time": 1735959488.1530998, "created_utc": 1735448646.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1hoop39/top_secret/", "title": "[TOP SECRET]", "permalink": "/r/conspiracyfact/comments/1hoop39/top_secret/", "selftext": "In 2003 I was the Command Sergeant Major's driver. Normally when the CSM needs a driver usually the motor pool will have to give up a soldier, so they always provide the least productive soldier, and it is always a female. The CSM had just fired his driver when I first arrived at the unit, 1/227 1st AVN BN 1 CD, the unit was gone, out of state, so I had to sit in this empty office for over a week answering a phone. People were calling for people in the unit, asking where they were, when they would get back, I had no clue. The CSM was the first one back in the building, seen someone walk past my office door, I was like \"Hey! You can't go back there, who are you!?\". As soon as he turned around, I seen all the stuff on his collar, started speed walking back towards me, had a look in his eye like he was going to kill me. I knew I was sooooo f*cked, I didn't panic though, before he could say anything I got at Parade Rest and sheepishly/apologetically/jokingly said \"I'm guessing you're the guy in charge around here\". Then looked down at the ground, waiting for it. The first person that sees him enter the building is supposed to stand at attention and yell \"BATTALION ATTENTION!\" (which I still hadn't done, I'm lucky there wasn't anyone around to see it otherwise he would've had to make an example out of me) everybody stands up. I still didn't even know who the f*ck he was, unfair situation. He stops, give me the old side eye and asks \"You in the motor pool?\", I said \"Yes?\", he said \"You're my driver!\" then storms off. I was so happy, I hated the Motor pool, I was an A/C technician. The job was mostly clerical, basically anything he wants, he'll give you more and more stuff to do to the point he starts putting his work load of you, like answering his emails, making powerpoint command and staff slide shows for meetings I'm not even allowed to attend. It's pretty easy, as in he is the only person you have to answer to, everyone is afraid to tell you what to do because it may conflict with something he already has me doing, he hates when people do it, which is also kind of bad because nobody tells me anything. I was there in the commands office when we first got our orders. It was the CO, XO, CSM some female, and me. Everyone was like \"Oh f*ck\", the Commander was sitting at his desk and said \"What do we do?\", the CSM was standing up, leaning on his desk, turned to the XO, pointed at him and said \"Take all the officers, form an advance team, get everything ready for us\", the XO said \"We'll need someone to do the...soldier work\", the CSM pointed at me \"Take my driver\", the XO smiled and said \"Okay\". So once all of our stuff was ready to ship over by boat, the advance team flew to Kuwait, it would take about 30 days for the boat to get there. That advance team of officers were all spies, there were all S-2, military intelligence. They hated having me around, but I had to be there, I had to sit through all of their classes and training when they got to Kuwait, a bunch of anti-espionage training, like the only reason someone would ever talk to you is because they want information from you, no one fids you interesting, nobody finds you attractive, nobody cares about you, only what you know. If anyone ever asks you about what you do, report them. Don't ever take them same way home, don't park in the same spot, don't use the same bathroom stall, don't cross at crosswalks, everyone is trying to get you, if you see female motorist on the side of the road, her car is in flames, she is in distress... she's actually an assassin. They are VERY serious about the TOP SERECT information they deal with. Back in the states they have their own soldiers with TOP SECRET clearances to take out their secret trash. In Kuwait it was just me, I'm not supposed to touch their trash, but they are too lazy to take it, so they treat me like trash. Take these bags to the fire pits, carful of the assassins, wait around until it all burns and spread the ashes. I wasn't even supposed to be allowed to walk inside the tent, everyone would stop talking, stop whatever they were doing, annoyed with me being there dusting, when they're the ones constantly asking me to dust. Then late one night, they were supposed to cut me loose at 2100hrs it was already like 2130, I was tired, it was super cold and there was a dust storm. I was getting mad, they had been walking all over me, but I cannot complain, or they will make things ten times worse for me, they made sure I knew that the maximum punishment for refusing to obey an order during times of war is death. Then all of a suddend one of them told me to get out, but I'm not allowed to leave. I was confused, I couldn't even hear what they were talking about, and there was a dust storm outside. I was like \"but there's a dust storm\", then they said \"Really? Walk six paces from the tent and patrol around the tent. That was so mean, it's a really big long tent, it was freezing didn't bring anything warm because I didn't know they'd have me working this late. Did that for about an hour, I was so mad. The second time they did that I resolved that next time any of them asked me to dust or take out the trash I would say \"I'm sorry, but according to Army Reglation bla bla bla, I'm not allowed to step inside the tent because you might have some TOP SECRET stuff laying out on a desk and I might see it. Sorry, I can't break a lawful order\". That's exactly what I told the XO when he finally had to get up from his desk and go look for me to tell me to come sweep the dust. At first he laughed like I was joking \"Ha, ha, yeah funny. Seriously, come sweep the dust\", again I told him \"Sorry sir, I can't\". My heart was beating all crazy, I wasn't sure if was going to flip out, I'd never seen him upset, everyone had warned me \"careful... he's crazy\", but he just looked at me funny and said \"Ooooookay\" then went back inside the tent. The next day around noon, I was standing in front of the PX smoking cigarettes because I heard them complaining about people smoking cigarettes in front of the PX, the XO walks up to me with a broom, dustpan and a piece of paper, hands them to me, I look at the piece of paper and ask \"what's this, the XO said \"That's your [TOP SECRET] clearance, I walked it up to General so-and-so and had him sign it. I read it over closely, it said \"interim [TOP SECRET] clearance\". Normally you have to apply, answer a ton of questions, the FBI gets sent to your friends and family. I didn't want or ask of a TOP SERCET CLEARANCE though, I never signed any kind of non-disclosure agreements, they never actually told me what is secret and exactly what I'm not supposed to talk about. Once I had the clearance they would keep talking and working. There were like 10 of them flying drones that were in Iraq, I asked what they were doing, they said \"Picking targets\", I asked if I could help, they said \"No,... wait, yes\" then set down a stack of maps in front of me, maps of every settlement in Iraq and said \"Highlight all the powerlines\", I said, \"What if I miss one?\" they said, \"Then one of our pilots will fly into them and die\", I said \"What?! No way, I can't do that\", slid the stack of maps away from me, they slid them back \"Do it\". They wouldn't have asked me to do it if they thought I was going to fail, I wouldn't be where I was if I had ever failed. Every few days someone would say \"Oh no, the 35th whatever brigade disbanded\" \"the bla bla bla disbanded\" more and more of the Iraqi Army was disbanding the closer we got to the ultimatum date Bush had given Saddam to surrender. Then one day the XO says really loud \"Iraqi Republican Guard disbanded, the Medina Division\" he sounded really sad, disappointed. I thought they would be happy, that would mean there would be no fight, we wouldn't have to blow anything up, no one would have to die. I asked, \"Isn't that good?\" he said \"The Medina Division was going to be our fight, we were going to be the ones to take them out\". These people had already typed up their awards for defeating the Medina Armored Division, Saddam's most loyal highly trained troops. They were there for glory, not to liberate. So... at the start of the war, there was no standing Iraqi army, no soldiers, it was all civilians. After the rest of the unit arriveed I didn't have to deal with those people anymore, just the CSM. A few days into the war, while we were in Iraq, they were doing something important in one of the tents, they had guards posted around it so nobody could get within 6 feet of it. I knew the Commander, XO, CSM and this really mean SM, same paygrade as the CSM but he outranked her, only he could tell her what to do, she acted like she was in charge when he wasn't around, she was the same one who had kicked me out of the tent those two times during the sandstorms. She knew I knew I wasn't supposed to be in there, she didn't like me at all, she was just looking for an excuse to hem me up. I walk past the guards and into the tent, she looks at me, her eyes go wide in shock, her face contorts in rage, takes a half step towards me, I'm grinning and glance over at the CSM, she freezes, she knows he would flip the f*ck out if she told me to leave. I was like yeah b*tch what now. What I seen in that tent though was... a man in civilian clothes, just sitting there, eyes wide open, blank dead look on his face, I thought he was staring at me when I walked in, but he was staring through me, I thought he needed help, he looked in distress, something was wrong with him, he was awake but didn't seem conscious, like in a trance. The CSM was standing behind him leaned down, kind of close to his ear so he could clearly hear him, he was reading a press release about our activities, but it was all stuff we weren't doing, going places we weren't. When he finished reading the paper, the guy in the civilian clothes started slowly mumbling back what had been read to him, I thought he was mocking the CSM because the way he was talking he kind of sounded... simple in the head, but his voice started getting faster clearer, started developing an English accent, light started returning to his eyes, it was like slowly waking up after being hypnotized. Took less then 10 seconds and he's acting totally normal, full of energy, smiling. It was our CNN embedded reporter, he left the tent, set up his camera and broadcasted live to the world of bunch of non-sense that did not happen. If you've ever seen a reporter, or celebrity freeze up in front of the camera, looks like they're having a stroke? That's a thing that you can do to them, you can shut them off, have them say or do whatever you want, by command. It is something they read, see that triggers the programing, and you touch them somewhere on their back to bring them out of it. I'm pretty sure it was human, but not 100% sure. I took got pictures", "media": null, "score": 5, "upvote_ratio": 0.67, "comment_count": 9, "over_18": false}, "7": {"id": "1hp0txe", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Consistent_Peak9550", "link_flair_text": "bigfoot sign/cutout/statue/etc", "time": 1735959489.004375, "created_utc": 1735493134.0, "url": "https://www.reddit.com/gallery/1hp0txe", "title": "Strange “squatter” ", "permalink": "/r/bigfoot/comments/1hp0txe/strange_squatter/", "selftext": "Saw this slideshow on TikTok with zero context and about 19k likes, it was just these two pics and nothing else. The sign mentions a squatter 1/2 way up a trail that is violent and throws branches, rocks, and throws debris onto the trail to block it. Squatters live in the woods all the time so that’s not too strange of a concept in my eyes, however the “halfway up the trail” part strikes me as odd. Granted, I have no idea how far the trail actually goes or how close to civilization it is, but the background visible on the second photo is what throws me for a loop. It just looks like dry, scrubland mountains as far as the eye can see, I’ve been all over the western U.S. my whole life and to me it looks similar to some of the California/Nevada environment, as I can see coniferous trees as well as yuccas growing next to them. What lunatic is camping out in an environment like this???? How are they enough water or food to last them multiple days out there? They have to have been there and causing issues for a while if there’s a sign posted claiming the authorities are already aware, so how is this dude possibly surviving? (Assuming it’s a person) I know to never question the indomitable human spirit, but jeez this really makes me wonder. \nHere’s the OP of the slideshow on TikTok:\n@imwyanate", "media": null, "score": 1395, "upvote_ratio": 0.95, "comment_count": 167, "over_18": false}, "8": {"id": "1hqd3kk", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "CrankyKongDK64", "link_flair_text": null, "time": 1735959489.7353249, "created_utc": 1735645553.0, "url": "https://www.reddit.com/gallery/1hqd3kk", "title": "locch m,ess monster found", "permalink": "/r/Cryptozoology/comments/1hqd3kk/locch_mess_monster_found/", "selftext": "", "media": null, "score": 550, "upvote_ratio": 0.86, "comment_count": 162, "over_18": false}, "9": {"id": "1hqm24m", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "TheKingoftheBlind", "link_flair_text": "Alien", "time": 1735959489.8497362, "created_utc": 1735673248.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1hqm24m/a_unique_humanoid_case_from_ufological_lore/", "title": "A unique humanoid case from ufological lore", "permalink": "/r/Humanoidencounters/comments/1hqm24m/a_unique_humanoid_case_from_ufological_lore/", "selftext": "Hi! I run a very unserious Substack where I write about weird encounters from history and decide if I believe in them or not. I wanted to share this little weirdo with you all for New Years Eve. Enjoy! \nhttps://open.substack.com/pub/garyreddin/p/the-night-visitor?utm_source=app-post-stats-page&r=2xommj&utm_medium=ios", "media": null, "score": 41, "upvote_ratio": 0.91, "comment_count": 10, "over_18": false}, "10": {"id": "1hquraa", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Blame_my_Boneitis", "link_flair_text": null, "time": 1735959490.3738189, "created_utc": 1735702313.0, "url": "https://i.redd.it/puftpy14yaae1.jpeg", "title": "Shirt I got for Christmas lol", "permalink": "/r/cryptids/comments/1hquraa/shirt_i_got_for_christmas_lol/", "selftext": "", "media": null, "score": 1265, "upvote_ratio": 1.0, "comment_count": 30, "over_18": false}, "11": {"id": "1hsn8bm", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "AdorableDonkey3596", "link_flair_text": null, "time": 1735959490.564907, "created_utc": 1735913264.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1hsn8bm/my_cat_isnt_a_cat_and_i_dont_think_she_ever_was/", "title": "my cat isn’t a cat and I don’t think she ever was", "permalink": "/r/Thetruthishere/comments/1hsn8bm/my_cat_isnt_a_cat_and_i_dont_think_she_ever_was/", "selftext": "I do not know what she is. I don’t know how to explain this knowing I am probably out of it right now.My cat is smart, she understands words and phrases and can do certain things I didn’t assume were possible for cats like open doors or get items from high shelves(this second thing only happening once so it could be just a one-off occasion) she likes to listen to music and other cats seem to hate her. Not even in an unsociable way she just seems to scare the shit out of them just by existing. She doesn’t have harmful intentions from what I can tell as she has lived with me for a year and she stayed in the shelter where I found her for a few months. I do not expect you guys to believe me, as I’ll probably forget about this in the morning and realize how stupid I sound. I am not against the idea that I’m making random delusions up or the idea that there is something wrong here that I am completely unaware of however like I said before I am fairly certain she wouldn’t have kept up this act for so long if she was trying to deceive people into something.", "media": null, "score": 260, "upvote_ratio": 0.75, "comment_count": 215, "over_18": false}, "12": {"id": "1ho849h", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Xntrik_shaman", "link_flair_text": null, "time": 1735959490.7552602, "created_utc": 1735400318.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ho849h/i_was_planning_to_rob_you/", "title": "I was planning to rob you", "permalink": "/r/LetsNotMeet/comments/1ho849h/i_was_planning_to_rob_you/", "selftext": "I'm not sure if this story belongs here because I can't decide if I would have an issue meeting this person again...but I reckon any normal sane person wouldn't...\nThis happened to me in Tempe, AZ not far from Mill Ave where all the bars are at. I was out bar hopping with a group of friends one weekend having a good time and had gotten pretty wasted.\nI have this terrible habit of wandering off and getting lost when I drink and this particular night I had managed to get myself into a very dumb situation. After wandering down streets for almost an hour I started to realize I was very lost and to make things worse my phone was out of battery. \nAt some point I decided I would just walk back to my friend's house which I knew was somewhere north of area we were bar hopping...I should mention I am severly incompetent when it comes to directions and navigating in a city so I didn't realize I was a solid 7 to 8 miles away from my friends place. \nAs I was stumbling confidently along the empty roads at 2am a sedan suddenly pulls off the road in front of me aggressively, almost blocking my path. Somewhat startled I look towards the driver's side and see a rather large and mean looking black man staring me down. In situations like this most people have one of two reactions...they either become scared and defensive or angry and aggressive...I on the other hand am an insane person and was just drunk enough to have no sense of the danger I was in. I should mention I am your typical privileged suburban white boy, not particularly threatening or big. \nI proceeded to wave at the guy saying \"Hey man what's good?\", I not completely sure but I think I was probably smiling too. I specifically remember the face he made, it was a sort of confused and conflicted look, as if I were asking him what year it was. He paused for a second and asked me something but I couldn't understand what he said, I said something like \"huh?\". He then asked me \"Where you going?\" I told him I was trying to walk to my friend's place but I have no idea where I am. After another pause he told me to get in. \nWithout thinking I walked over to the passenger side and hopped in. Pretty dumb right? Well at the time it seemed like a good idea. Once I got in I was able to get a better look at the guy, he was covered in tats and was wearing your typical thug attire. I also noticed his arm was all bandaged, oh and he had a pistol tucked into his shorts. And again for some reason none of this phased me at the time. He asked me where my friends place was and I gave him directions.\nI'm pretty sociable and talkative when I drink so I immediately started chatting with the guy casually...I don't remember exactly what we talked about but eventually he started telling me that he had just gotten out of the hospital after being treated for a gunshot wound on his arm and his girl just broke up with him because of it. Apparently she didn't like that he was in a gang and getting into gunfights...go figure. He then told me that he was real pissed off about her and about getting shot and he was driving around looking for someone to rob when he found me...and that he has served time for robbery in the past. \nAt that point my drunken brain started to connect the dots and I thought about the roughly $200 I had in my wallet at that very moment. But instead of freaking out I just said something like \"damn man thats rough\"... He also told me that he really wanted to be a rapper and was trying to get his music career started. I tried to be supportive telling him to go for it. \nAbout 10-15 mins later we pulled up at my friend's place. Now this is when I should have gotten out of the car and told the armed man thanks for the ride, but again I'm an insane person and felt like I owed him one for taking me all the way there so I asked if he wanted to come in and smoke (weed). He said he was down. \nAt this point my friends had already been back for awhile and were all wondering what happened to me, as you might expect they were awfully surprised when I showed up with a strange black dude who I now knew was a gang member who had debated robbing me at gunpoint. What the dude did next sort of sketched everyone out though...\nMy buddy lives in a house with a few other people, his room is at the end of a hallway and thats where they all were listening to music, he also has a huge safe in his closet that is visible as soon as you walk in the room. I didn't realize it but my new \"friend\" had brought his gun inside with him, and shortly after entering the room after everyone said what's up he took his gun out of his waistband...and put it down right on top of the safe in front of everyone. It seemed like a really odd thing to do but it was a lot better than what he could have done... I feel like it was a sort of show of respect, like he wanted to show that he wasn't going to use it. \nLuckily, I have super chill friends so they acted cool and were about to roll up a blunt so a few minutes later we all went out back to smoke leaving the gun in his room. \nThe dude chilled with us for awhile longer and actually seemed to get along with some of my friends who had a similar interest in music. He then picked up his gun off the safe and left without incident. \nLooking back I realize that could have gone much much worse, especially since my buddy had a lot of cash in that safe and he could have easily robbed us at gunpoint at any time. I like to think that although he was a criminal and a gang member he was also just a guy going through a hard time and a little kindness and marijuana prevented that night from going very bad...\nAm I crazy?", "media": null, "score": 312, "upvote_ratio": 0.95, "comment_count": 32, "over_18": true}, "13": {"id": "1hoa7yx", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "3nips4me", "link_flair_text": null, "time": 1735959490.9325776, "created_utc": 1735406142.0, "url": "https://i.redd.it/np4s3nx6hm9e1.jpeg", "title": "In 1828 two men from Edinburgh made a business out of killing people and selling their bodies to Robert Knox, an anatomist seeking bodies for dissection. They killed about 16 people and sold them for £7-£10 each. The suppliers were convicted, but despite public pressure, Knox wasn't charged", "permalink": "/r/truecreepy/comments/1hoa7yx/in_1828_two_men_from_edinburgh_made_a_business/", "selftext": "", "media": null, "score": 34, "upvote_ratio": 0.91, "comment_count": 3, "over_18": false}, "14": {"id": "1hq2658", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Technical-Horse-5989", "link_flair_text": null, "time": 1735959491.1241941, "created_utc": 1735605218.0, "url": "https://www.reddit.com/r/threekings/comments/1hq2658/how_to_go_to_another_world_questions/", "title": "How To Go To Another World (Questions)", "permalink": "/r/threekings/comments/1hq2658/how_to_go_to_another_world_questions/", "selftext": "Recently, I saw posts about Japanese rituals of going to another world and not being able to return, but what if the world you went to had a way to return?https://www.reddit.com/r/threekings/comments/vjtatz/how_to_go_to_another_world_saychat_methods/ And about this post, has anyone tried any method and it worked? Because some people say they are fake, others say they are true, but which ones are really true?", "media": null, "score": 3, "upvote_ratio": 0.72, "comment_count": 8, "over_18": false}, "15": {"id": "1hq7tne", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "HoneyGlazedPeaches", "link_flair_text": null, "time": 1735959491.6368186, "created_utc": 1735622950.0, "url": "https://v.redd.it/jgwozjf4e4ae1", "title": "Man’s voice recorded on my sleepcycle app", "permalink": "/r/Ghosts/comments/1hq7tne/mans_voice_recorded_on_my_sleepcycle_app/", "selftext": "I record myself at night and I was horrified when I woke up to this recording. I live alone in a second-floor apartment in a city. I have deadbolt locks on my door and there’s no other way to get into my apartment. The Voice is incredibly clear and seems to be talking to me and I’m responding. I don’t recognize the man’s voice and I think I detect a bit of some kind of accent. I put what he said into translator apps, but I couldn’t figure anything out. I don’t know if this is paranormal or ghost, to me it sounds like there was someone in my apartment, but I don’t know how that would be possible. The only thing I can think of is that some kind of technology in my apartment got hacked. I have an Alexa in my living room, but that wouldn’t be close enough to my phone to record the voice so clearly. Does anybody have an explanation for what this could be? I am really freaked out", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/jgwozjf4e4ae1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 306, "width": 640, "scrubber_media_url": "https://v.redd.it/jgwozjf4e4ae1/DASH_96.mp4", "dash_url": "https://v.redd.it/jgwozjf4e4ae1/DASHPlaylist.mpd?a=1738551491%2CN2FjMzFkZWVkNzUxYzQxOTFhY2VlNzhmZmExZGE4M2EwMjBhZmMwNWVmZDg2NWYwOGY0MzE2ODQ5MGJmM2I4ZQ%3D%3D&v=1&f=sd", "duration": 10, "hls_url": "https://v.redd.it/jgwozjf4e4ae1/HLSPlaylist.m3u8?a=1738551491%2CMzYyODY1ZDVmZGY3ZDI1NjEzMDg2OGU4ZWU1OTJkMzI4MDE3ODZmMGIzZmFjNTQwOTZhNmZjMGZjMTI0NTdmMw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 5117, "upvote_ratio": 0.93, "comment_count": 2315, "over_18": false}, "16": {"id": "1hqjdsv", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "DulyaSheesh", "link_flair_text": "Glitch Vid", "time": 1735959491.800792, "created_utc": 1735665681.0, "url": "https://v.redd.it/0ixhq556x7ae1", "title": "The Paradoxical Pedaler", "permalink": "/r/GlitchInTheMatrix/comments/1hqjdsv/the_paradoxical_pedaler/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/0ixhq556x7ae1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 480, "scrubber_media_url": "https://v.redd.it/0ixhq556x7ae1/DASH_96.mp4", "dash_url": "https://v.redd.it/0ixhq556x7ae1/DASHPlaylist.mpd?a=1738551491%2CNjI0MTVjYWVkZjBmYTkxNDFjZDZjZmRkNjM4YTYyMmVmODJlYWY0ZjA3ZGM5YWYxN2QwM2YzNDMyYzBmMzNiZQ%3D%3D&v=1&f=sd", "duration": 58, "hls_url": "https://v.redd.it/0ixhq556x7ae1/HLSPlaylist.m3u8?a=1738551491%2CNmFmZGRkZTdiMDEwOGQ1ODAwZmM0MTU0YjIwMzZmMzc2YzllZTI1MTAxMzYxMWYyMmRjYWU4M2YyNGVhNGY0OQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1232, "upvote_ratio": 0.97, "comment_count": 70, "over_18": false}, "17": {"id": "1hq6gcg", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "vysuo", "link_flair_text": null, "time": 1735959493.1719286, "created_utc": 1735618355.0, "url": "https://i.redd.it/pvo278sg04ae1.jpeg", "title": "It makes sense", "permalink": "/r/ufo/comments/1hq6gcg/it_makes_sense/", "selftext": "There is a lot of talk about UAPs but little talk about abduction in hearings", "media": null, "score": 812, "upvote_ratio": 0.89, "comment_count": 386, "over_18": false}, "18": {"id": "1hq6o9w", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "mynameisgoatsbeard", "link_flair_text": "Photo", "time": 1735959494.5823598, "created_utc": 1735619075.0, "url": "https://www.reddit.com/gallery/1hq6o9w", "title": "A large circular object fell from the sky in a village in Kenya. Need help identifying it", "permalink": "/r/UFOs/comments/1hq6o9w/a_large_circular_object_fell_from_the_sky_in_a/", "selftext": "The villagers head a deafening bang before it crashed. Luckily no one was hurt. ", "media": null, "score": 12736, "upvote_ratio": 0.85, "comment_count": 2229, "over_18": false}, "19": {"id": "1hpeq2o", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Parodeer", "link_flair_text": "Image 📷", "time": 1735959495.9787126, "created_utc": 1735532031.0, "url": "https://i.redd.it/oi6y730svw9e1.jpeg", "title": "This is it! (Serious)", "permalink": "/r/aliens/comments/1hpeq2o/this_is_it_serious/", "selftext": "Dude!!! This is it!!  This is the reason that they are here!   The first communication that they could read from Jimmy and they knew his time was coming and wanted to be here to see his life force move into the galaxy.  As I have said before, they share only one emotion with us.  Fear, guilt, suffering, anger, hatred are completely foreign to them.  They only understand Gratitude.  Jimmy was full of gratitude.\nIn my opinion, they either explore this planet and give it a chance (it’s like looking at your dog and the excitement he has in his face when he sees you and you want to give him every opportunity to feel that feeling.) Or, they walk away and allow us to destroy ourselves because we’re not worth it.\nI hope it’s the first.", "media": null, "score": 15887, "upvote_ratio": 0.91, "comment_count": 962, "over_18": false}, "20": {"id": "1hqv84a", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "jdillacornandflake", "link_flair_text": "Discussion", "time": 1735959496.4421132, "created_utc": 1735704188.0, "url": "https://www.reddit.com/r/UAP/comments/1hqv84a/anyone_else_feel_super_isolated_due_to_interest/", "title": "Anyone else feel super isolated due to interest in the UAP phenomena ", "permalink": "/r/UAP/comments/1hqv84a/anyone_else_feel_super_isolated_due_to_interest/", "selftext": "I don't have one friend I can talk to about this stuff. I tried and got weird looks. it didn't matter how respectably I framed it.", "media": null, "score": 609, "upvote_ratio": 0.96, "comment_count": 216, "over_18": false}, "21": {"id": "1hq3njw", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "stasi_a", "link_flair_text": "Rule 6 Reminder", "time": 1735959497.5053227, "created_utc": 1735609575.0, "url": "https://i.redd.it/at53bf7ba3ae1.jpeg", "title": "What Happened?", "permalink": "/r/conspiracy/comments/1hq3njw/what_happened/", "selftext": "", "media": null, "score": 5257, "upvote_ratio": 0.95, "comment_count": 699, "over_18": false}, "22": {"id": "1hpthj8", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "cryptid", "link_flair_text": null, "time": 1735959497.6746643, "created_utc": 1735582492.0, "url": "/r/ForteanResearch/comments/1hptguy/did_firefighting_crew_observe_top_secret_aircraft/", "title": "Did Firefighting Crew Observe TOP SECRET AIRCRAFT at Dugway Proving Grounds?", "permalink": "/r/conspiracyfact/comments/1hpthj8/did_firefighting_crew_observe_top_secret_aircraft/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.75, "comment_count": 0, "over_18": false}, "23": {"id": "1hro0x8", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Working-Cheetah-6057", "link_flair_text": "footprints", "time": 1735959498.470164, "created_utc": 1735801252.0, "url": "https://www.reddit.com/gallery/1hro0x8", "title": "Found this foot print at Silver Falls State Park Oregon", "permalink": "/r/bigfoot/comments/1hro0x8/found_this_foot_print_at_silver_falls_state_park/", "selftext": "Let me know what you guys think, it was at a dead end. ", "media": null, "score": 897, "upvote_ratio": 0.94, "comment_count": 80, "over_18": false}, "24": {"id": "1hra13u", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "redhood84", "link_flair_text": "Hoax", "time": 1735959499.0569813, "created_utc": 1735758881.0, "url": "https://i.redd.it/9p1yc09bmfae1.jpeg", "title": "Went to Harvard, saw the Feegee Mermaid!", "permalink": "/r/Cryptozoology/comments/1hra13u/went_to_harvard_saw_the_feegee_mermaid/", "selftext": "", "media": null, "score": 280, "upvote_ratio": 0.99, "comment_count": 9, "over_18": false}, "25": {"id": "1hodohs", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "elliegem", "link_flair_text": null, "time": 1735959499.656007, "created_utc": 1735415485.0, "url": "https://i.redd.it/72yjbg889n9e1.jpeg", "title": "Do It!", "permalink": "/r/cryptids/comments/1hodohs/do_it/", "selftext": "", "media": null, "score": 536, "upvote_ratio": 0.99, "comment_count": 12, "over_18": false}, "26": {"id": "1hs9d89", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "AdorablePotential118", "link_flair_text": "Discussion/Advice", "time": 1735959499.8548527, "created_utc": 1735864533.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1hs9d89/whowhat_did_i_talk_to/", "title": "Who/what did I talk to?", "permalink": "/r/Thetruthishere/comments/1hs9d89/whowhat_did_i_talk_to/", "selftext": "This memory recently resurfaced while I was in the shower for reasons I don’t know. I already went through the thoughts of “nah I was young and it was probably this”, but after further analysis I don’t have an explanation. When I was about 8 or 9, me and a decent group of family went to a giant park for somebodies birthday, there was a couple sections with regular type parks with jungle gyms n shi, a water park section, a section where people where riding down hills with cardboard, so it was a lot going on n it was a a lot of people around. My mama, auntie and I think another adult was taking me and a couple other kids (cousins) around the whole thing seeing what it is to see. We come up on this one ordinary looking section with a wood chip box with a swing set and castle jungle gym on the right side of the trail, and swings, slides n merry go rounds n shi on the left. The adults go by a bench on the left of the trail and let us kids run around, mind you it’s still other kids and adults everywhere. I decide to play at the castle jungle gym, I’m running around outside of the thing, playing with the other kids. I then go inside and 3 other kids that weren’t playing with everyone else. 1 kid just looked like a kid but the other 2 looked fucking weird. They all turned around when I came up, the 1 normal kid I don’t remember much, he was just there and he left soon after I started talking to the other 2. They 2 kids where both pale, pale enough for a kid to notice, both had bright red lips and straight black hair. The boy had this crazy smile on his face, Like Cheshire Cat type smile that I at first thought was face paint. Getting closer to them though I could see that it was not face paint, it was so clearly not face paint that 8 year old me deadass asked “how are you doing that?”. The boy stopped smiling and looked normal and asked “what do you mean?” Like I was the weird one. I said “how were you making that face?”, he goes “oh this?” And smiles again, and the little girl starts giggling like somethings funny, And in my little kid mind I’m not alarmed at all, I thought it was some cool trick like when kids would flip their eyelids inside out. So he’s smiling and he does it right in front of me now, Cheshire Cat smiling, lips and sides of his mouth curling like I had never seen, but again I was just a kid so I was over here thinking that he just practiced the grinch smile a lot or something. But he’s smiling again and by this point a couple of kids came and went through the play place, it seemed the other kids were scared of them but I just thought they were rlly cool. So he’s kinda crouching there smiling and I’m like “yeah that!”, the little girl starts laughing again and the boy does too, I’m just sitting here tryna learn how to smile like that so I started to get kinda irritated, I finally asked “what’s funny?” And the boy try’s to answer while he’s laughing but he can’t stop laughing, so keep on like “what is it?” He finally gets serious like when when you’re laughing in class or something and goes “we’re vampires”, then I start laughing, but they stop and are both just looking at me with the crazy ass smiles, I’m now thinking that they’re thinking a couple of weirdos but I’m still intrigued bc of the smiles , so I’m like I’m just like “seriously?”, the boy says something about not believing them and tells me to look at girls teeth, I do and they look weird and sharper than a normal kids, his do too, by this point things start getting fuzzy almost like a dream, and even though I was starting to think they were weird, I still felt drawn to them bc they still seemed “cool” in a way. I start asking them things but that’s all I remember, I remember talking to them more and by this point there eyes were dark, they had dark circles around they eyes the whole time like them kids from that goosebumps episode, but I remember they’re eyes starting to look like a sharks with their pupils, but I remember thinking this was cool too.  The rest of the conversation was probably a 5-10 min blur of talking I don’t remember, they’re faces looking inhuman, and other kids walking by us, sometimes the girl or boy would try to include one of the other kids but none of them stayed to talk. Finally they were trying to get me to go somewhere with them, I only remember this because after I agreed to go, I heard my mamas voice calling for me which kinda snapped me out of it (my mama did NOT play). I told them to hold on and that I would be right back, I slid down the slide we had been by in the jungle gym and ran to my mom. Apparently they had been looking for me, they already had my other cousins with them (they hadn’t seen me the entire time) I told her I had just been in the jungle gym talking to these kids the whole time, I turn around to show her and there they are standing in the jungle gym, by the slide, waving with those smiles on their faces, I asked my mom if I could go with them and I remember her still looking at them with this serious face and she just said “no”, turned me around and we enjoyed the rest of the at the park, I thought about them a couple more times throughout the day, hoping they would find me or I would find them but neither happened. Again I don’t know what sparked me remembering this memory, but the things that kinda made me brush this off was that 1:it was a fun ass day and I was a kid, 2: there was face painting going on that day. Me now as an adult can confidently say that these kids had no face paint.\nEdit:The boy introduced the girl as his sister, and at one point i remember them kissing. It weirded me out but again I was a kid and it wasn’t my business, plus I still thought they were “cool” for some reason. I don’t remember either of their names", "media": null, "score": 19, "upvote_ratio": 0.89, "comment_count": 24, "over_18": false}, "27": {"id": "1hqzc8n", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Fritzo_Wolf09", "link_flair_text": null, "time": 1735959500.0082138, "created_utc": 1735722086.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hqzc8n/hows_your_dad_i_saw_him_yesterday_my_dad_was_out/", "title": "\"How's your dad? I saw him yesterday.\" My dad was out of town for months.", "permalink": "/r/LetsNotMeet/comments/1hqzc8n/hows_your_dad_i_saw_him_yesterday_my_dad_was_out/", "selftext": "Back when I was 12, I went to a private school, so I needed to take a long walk to my apartment, since the school was a bit far from the city center. This was in Zagreb, Croatia, so I had a lot of public transport options to get home. My usual routine was to get on the bus at the station in front of my school all the way down to the main street, then take a tram to a public park and walk home the rest of the way. \nOur school had a double timetable where one week we went to school in the morning and the other week we had classes in the afternoon. This happened during one of my afternoon weeks. \nI was walking out with a few classmates since we all got on the same bus to the main street, the rest of my classmates were picked up by their parents. When we got in the bus, there were a few empty seats, so I took a seat in front of a balding middle-aged man who was wearing slightly dirty clothes; that was my mistake. As soon as I sat down, he started staring at me, like, staring with a cold look in his eyes. Feeling uncomfortable, I took a book out of my bag and started reading. I would have used my phone if I could, but it was dead since I forgot to charge it before I left the house that day. \nThe guy did not stop staring at me the whole bus ride, to the point where I couldn't even concentrate on my book, but I refused to put it down because I was scared. I would have mentioned something to my classmates, but we were all spread out on the bus, and I was too scared to move, I don't know why, but I didn't want him to see that I was scared, thinking that maybe that would deter him. Or maybe I thought he was just staring at me for some stupid reason.\nWhen we finally got to our stop, my classmates and I all got off and some of us headed to the tram station while the others walked away to their houses. The guy who was staring at me also got off with us, and he started tailing us while keeping a fair distance. I told one of my friends about this, but urged him not to look back, thinking ignoring him would be the best option. When we got to the station, different people got on different trams, since each of them had a different route. I needed to take the tram number 2, and so did my friend. We waited for it to arrive, and the guy was somewhere to our right, but we refused to look at him. When our tram arrived, my friend and I got on but so did the creepy guy. When I arrived at my stop, I tried to quietly discuss with my friend if getting off with me just in case was a good idea, but then we saw the guy get off himself first and start heading into the park, opposite of where I needed to go. He probably overheard us talking, since there were barely any people in the tram at that time (it was around 9 pm), but I didn't think of that, so I thought it had all been a misunderstanding. When I got off, and the tram had sped away to the next station, I started walking home. It was a short distance and would have taken be about five minutes, but then I noticed someone following me. I immediately knew it was the same guy again, so I picked up my pace and walked to my apartment. \nAs I turned a corner into the alley that housed my apartment, the guy was getting closer. I got to the building and buzzed my mom on the intercom. I wished she would hurry up but, in the end, the guy managed to catch up with me. I could smell the stench coming off from him as he started talking.\n\"Heyyy, how've ya been buddy? I saw your dad yesterday and he told me all about how you were getting on in that new school of yours.\" he said. And then I immediately knew that he was lying, since my dad had been away on work related business for months and hadn't returned home in that time once. I didn't know what to do so I just stood there quietly staring at him. Just then, the door buzzed and unlocked so I bolted for it. I managed to rush in and start running up the stairs, but he was following behind me, running himself. Never in my life have I felt such an adrenaline rush as I ran up the stairs to the third floor, and I had a backpack with books weighing me down, so I had a disadvantage. But in the end, I managed to arrive at our door, where my mom was happily waiting for me. With no warning, I shoved her away from the door as I entered before slamming it shut. Fortunately, the guy had enough common sense not to continue chasing after me. I told my mom what happened and she called the police and they arrived some time later, questioning me on how the guy looked and what exactly happened. In the end, they looked at the camera footage but since it was so dark out and I didn't turn on the indoor building lights as I entered, they weren't able to get a clear view of his face. \nFor two weeks I was too scared to go home alone so my mom picked me up every time until two weeks later, when on the news it was said how a man was arrested for attempted kidnapping and raping of children, and the face they showed was the exact one I saw that night, so I finally breathed a sigh of relief, knowing I was safe for now, but that didn't excuse the fact that I was careless with not charging my phone, and there were still many bad people out there. Everyone, please stay safe out there.\nTo the person who I met, if you ever get released for some ungodly reason, I hope I never see your face again.", "media": null, "score": 188, "upvote_ratio": 0.98, "comment_count": 6, "over_18": true}, "28": {"id": "1ho7syu", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Unable-Glass2441", "link_flair_text": null, "time": 1735959500.1700168, "created_utc": 1735399414.0, "url": "https://fearflicks.blogspot.com/2024/12/bathshebas-curse-real-story-behind.html", "title": "Bathsheba’s Curse: The Real Story Behind “The Conjuring”", "permalink": "/r/truecreepy/comments/1ho7syu/bathshebas_curse_the_real_story_behind_the/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "29": {"id": "1hob6fz", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "FlamingRose12", "link_flair_text": "Captured Apparition ", "time": 1735959500.7973928, "created_utc": 1735408759.0, "url": "https://www.reddit.com/gallery/1hob6fz", "title": "Possible ghost capture near my childhood home? (Circa 2015-2016)", "permalink": "/r/Ghosts/comments/1hob6fz/possible_ghost_capture_near_my_childhood_home/", "selftext": "Hi all! I wanted to share a photo I came across on Facebook years ago. I didn’t know the individual who shared this initially, but it immediately caught my attention as it is very close to my childhood home, and there is a relevant story of tragedy that has always led me to believe this picture is pretty legit.\nBACKSTORY: A young man (~25 if I’m remembering correctly?) had taken his own life in May 2015 from a bridge that is across the street from where this photo was taken.The young man was found early in the morning by a group of joggers. This bridge and trail path are also adjacent to an elementary school and a natural creek area. The young man worked at a nearby movie theater, and a small memorial with flowers, stuffed animals, and some candles at the bridge where the poor soul met his demise. ", "media": null, "score": 3517, "upvote_ratio": 0.94, "comment_count": 545, "over_18": false}, "30": {"id": "1hsoq4c", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "CosmicPotatoChips", "link_flair_text": "Glitch Pic", "time": 1735959500.9274156, "created_utc": 1735917425.0, "url": "https://i.redd.it/0yjeg9eglsae1.jpeg", "title": "Illinois looks... different.", "permalink": "/r/GlitchInTheMatrix/comments/1hsoq4c/illinois_looks_different/", "selftext": "", "media": null, "score": 109, "upvote_ratio": 0.98, "comment_count": 6, "over_18": false}, "31": {"id": "1holp68", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "lastofthefinest", "link_flair_text": null, "time": 1735959502.0807126, "created_utc": 1735438554.0, "url": "https://www.reddit.com/r/ufo/comments/1holp68/why_is_my_post_being_muted_for_upvotes_because_im/", "title": "Why is my post being muted for upvotes because I’m telling people where the U.S. monitors UAPs? It got stopped at 207 upvotes and will not allow anyone else to upvote the post. It’s very odd and mods will not answer my questions. The post is in the description. ", "permalink": "/r/ufo/comments/1holp68/why_is_my_post_being_muted_for_upvotes_because_im/", "selftext": "Here’s the actual post https://www.reddit.com/r/ufo/s/Hlg5MheibY", "media": null, "score": 702, "upvote_ratio": 0.85, "comment_count": 114, "over_18": false}, "32": {"id": "1hp70xf", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Solarscars", "link_flair_text": "News", "time": 1735959503.290563, "created_utc": 1735509469.0, "url": "https://i.redd.it/pmf1vbvo0v9e1.png", "title": "RIP 39th US President James Carter ", "permalink": "/r/UFOs/comments/1hp70xf/rip_39th_us_president_james_carter/", "selftext": "From my heart, I am sorry you didn't live to see full disclosure. Thank you for your service. ", "media": null, "score": 6442, "upvote_ratio": 0.91, "comment_count": 250, "over_18": false}, "33": {"id": "1hqnp1r", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "MowingDevil7", "link_flair_text": "Image 📷", "time": 1735959504.7514262, "created_utc": 1735678149.0, "url": "https://i.redd.it/4hke6ni9y8ae1.jpeg", "title": "Happy New Year!", "permalink": "/r/aliens/comments/1hqnp1r/happy_new_year/", "selftext": "", "media": null, "score": 6741, "upvote_ratio": 0.96, "comment_count": 98, "over_18": false}, "34": {"id": "1hqinzy", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "RedmanWVU", "link_flair_text": null, "time": 1735959505.1671689, "created_utc": 1735663700.0, "url": "https://i.redd.it/qudar9qar7ae1.jpeg", "title": "The Program", "permalink": "/r/UAP/comments/1hqinzy/the_program/", "selftext": "I finally watched this last night and was really impressed. Very well done by James Fox. I thought I knew about everything from the government perspective that was known, but I found out there was a LOT I didn’t know. I’m not sure how anyone could watch this and not know for certain there is other life beyond us, and they’ve been hanging around here a long time. Do yourself a favor and check it out. ", "media": null, "score": 443, "upvote_ratio": 0.94, "comment_count": 120, "over_18": false}, "35": {"id": "1hoalz6", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "smokin_aconite", "link_flair_text": null, "time": 1735959506.3898802, "created_utc": 1735407202.0, "url": "https://i.redd.it/342ejbklkm9e1.jpeg", "title": "Diddy & Luigi being in the same prison & their Lawyers being married to each other is a great addition to the plot.", "permalink": "/r/conspiracy/comments/1hoalz6/diddy_luigi_being_in_the_same_prison_their/", "selftext": "", "media": null, "score": 5182, "upvote_ratio": 0.95, "comment_count": 145, "over_18": false}, "36": {"id": "1ht2qnv", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "BeingSpecialist3644", "link_flair_text": null, "time": 1735959506.5888095, "created_utc": 1735953524.0, "url": "https://newsrated.com/article/677884a17260d12e2bdfc348", "title": "U.S Special Forces Member behind Cybertruck bombing says China is behind US drone activity in manifesto", "permalink": "/r/conspiracyfact/comments/1ht2qnv/us_special_forces_member_behind_cybertruck/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.67, "comment_count": 1, "over_18": false}, "37": {"id": "1hnvut4", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Go_use_Alice", "link_flair_text": "squatchy environments ", "time": 1735959507.5043015, "created_utc": 1735353532.0, "url": "https://i.redd.it/o38oq0a05i9e1.jpeg", "title": "Spent the day exploring in a known hot spot", "permalink": "/r/bigfoot/comments/1hnvut4/spent_the_day_exploring_in_a_known_hot_spot/", "selftext": "Saw nuttin' bah humbug", "media": null, "score": 764, "upvote_ratio": 0.99, "comment_count": 69, "over_18": false}, "38": {"id": "1hse8qv", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Discussion ", "time": 1735959508.3794093, "created_utc": 1735878963.0, "url": "https://i.redd.it/uiq56hwdjpae1.jpeg", "title": "This is how it feels trying to edit cryptozoology pages on Wikipedia ", "permalink": "/r/Cryptozoology/comments/1hse8qv/this_is_how_it_feels_trying_to_edit_cryptozoology/", "selftext": "", "media": null, "score": 275, "upvote_ratio": 0.87, "comment_count": 39, "over_18": false}, "39": {"id": "1hqqbwl", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Embarrassed-Bell-604", "link_flair_text": null, "time": 1735959508.9962192, "created_utc": 1735686454.0, "url": "https://i.redd.it/wn61x2iym9ae1.jpeg", "title": "Could anyone tell me what the creature in the bottom right is supposed to be?", "permalink": "/r/cryptids/comments/1hqqbwl/could_anyone_tell_me_what_the_creature_in_the/", "selftext": "", "media": null, "score": 479, "upvote_ratio": 0.99, "comment_count": 49, "over_18": false}, "40": {"id": "1horse1", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "myroomshaunted", "link_flair_text": null, "time": 1735959509.1719067, "created_utc": 1735461011.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1horse1/help_me_kick_this_spirits_ass/", "title": "Help me kick this spirits ass", "permalink": "/r/Thetruthishere/comments/1horse1/help_me_kick_this_spirits_ass/", "selftext": "To keep it short this spirit or ghost threatened my gf and i want to kick its ass lol. Recently I woke up to a tall dark human shaped figure standing beside our bed at 4am. My gf and I sleep together but it disappeared before I could wake her. But now she's experienced it too only it was on her chest and more threatening. She also had very specific nightmares about the house and I'll spare the details but it seems very clear the spirit or whatever is threatening her. At this point I'm pissed and want to kick this spirits ass. I'm sick of it threatening my gf and her sense of safety. She cant sleep now and keeps all the lights on all night. Honestly I'm ready for it to show itself again so I can give it a piece of my mind.\nBut seriously any suggestions on how to deal with this thing spiritually and get it to leave? This is actually much more scary irl I'm just trying to keep this post lighthearted with the ass kicking stuff", "media": null, "score": 7, "upvote_ratio": 0.61, "comment_count": 34, "over_18": false}, "41": {"id": "1hpihmm", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "winnked", "link_flair_text": null, "time": 1735959509.3102329, "created_utc": 1735546079.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hpihmm/no_wonder_your_still_single/", "title": "\"No wonder your still single\"", "permalink": "/r/LetsNotMeet/comments/1hpihmm/no_wonder_your_still_single/", "selftext": "So I started texting someone i met on a dating app. they made the convo super 18+ as soon as we moved to text. I wasn't playing into it as i was currently at a family Christmas party (2pm). He would get upset and ask if his 'magic wand' wasn't good enough? He would send more and more photos trying to get me to reply, but since i was at a family event (that he also knew i was at), i didnt find it the best time or place to look at any texts from him. Before i stopped opening his messages he felt the need to ask me if his photos made me, 'wet'. When i told him that i wasn't even thinking or looking at them cause i was with family and currently HOLDING my 5 month old nephew, he replied with \"so? you can still be wet\".. IM SORRY WHAT??. When I got home i decided to take a bath cause the day i had was rough. Hes now blowing up my phone wondering where i went and if i was \"Finally home yet\". Mind you i told him i was busy and may not reply till later in the night. Ive known this man for 5 hours at this point.\nHe asked me what i was thinking about after i got home ( 9pm) and i told him 'sleep tbh'. He didnt like the reply i gave him and asked me why i wasnt thinking about the photos he sent me and how i couldnt go back and look at them? This dude was nothing but provocative with me and i turned it down many times. telling him i was upset due to a recent breakup and not looking for hookups. He wouldn't take no for an answer. He kept spamming my phone and calling me even when i told him i was heading to bed. I was drinking the same night to unwind from the long day i spent with family. He woke me up questioning me as to why i wasnt talking to him, cause he wanted to talk to me, so i should be there to talk to him? I told him i was sleeping and didnt wanna talk.. this 'man' asked me \"well arent you drunk? shouldnt you be in the mood?\" like.. really?\nI ended up hanging up on him and ignoring any messages from him until the morning.\nI didn't reply until later in the afternoon and by this time another gentlemen i had met a few weeks before asked me on a date. I of course said yes and had a great time. Said date and i drank at his place and played some LOL. It got late and we were pretty tipsy from the shots, so i just stayed at his place for the night as i didn't wanna drive.\nThis dude ended up calling me at 3am while im laying next to my date.. i pick up the phone in a half asleep daze and say hello. He called to tell me that he was at my apartment complex and wanted me to let him in so we can, 'congregate'. Being confused as to how he knew where i lived, i woke up very quickly. I asked him how he knew where my place was and he proceeded to tell me Facebook and some of my families' pages that i was tagged in (I assume he saw my moms post when i moved in 2 years ago with the apartment sign in the background of the photo). I never told this man my last name. Freaking out, i woke up my date and let him know what was going on. He takes me back to my house but we dont go to my door. we look around and i end up asking him what he was driving. We find the car hes in and drive by slow and i take down the plates.\nI call the local sheriffs office and let them know what is going on so they can send an officer out here to ask this person to leave the property. Once as he is gone my date waited inside with me for an hour to be sure he wasn't coming back. We then head back to my dates house and proceed to sleep for the remainder of the night.\nSadly it didn't end there. I woke up to a few more texts from a new number i didnt have saved, as his was blocked.\nit was him asking me why i didnt give him a chance. telling me that i was perfect but i let my 'emotions' get in the way of what we could have had. Telling me how i better not lose my chance at being with someone 'like him'. He thought his 9inch magic wand was gods gift to the earth and if i dont take this opportunity now, ill live the rest of my life wondering what real 'magic' feels like. I had no words for this person. I was stunned. How did someone i didnt even know 24 hours before this, turn into what it did? I was really creeped out. I told him more than once to leave me alone and that i was with someone. He asked me why i picked a stranger over him? as if he wasnt also a stranger just the day before, not even a full day. This dude would say sorry after i snapped on him (around 10:30pm) a bit before he showed up at my apartment building. He would say sorry and tell me that it was wrong of him to act that way.. but then proceeded to act the way he did?\nHis last text to me was \"No wonder your still single\"\nyeah man, no wonder IM still single.", "media": null, "score": 99, "upvote_ratio": 0.95, "comment_count": 29, "over_18": true}, "42": {"id": "1hruhbg", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Unable-Glass2441", "link_flair_text": null, "time": 1735959509.4828615, "created_utc": 1735826910.0, "url": "https://www.reddit.com/r/truecreepy/comments/1hruhbg/in_2018_11_members_of_delhis_chundawat_family/", "title": "In 2018, 11 members of Delhi's Chundawat family were found dead in their home, a case linked to shared psychosis and ritualistic practices.", "permalink": "/r/truecreepy/comments/1hruhbg/in_2018_11_members_of_delhis_chundawat_family/", "selftext": "https://fearflicks.blogspot.com/2025/01/the-burari-deaths-haunting-case-of.html", "media": null, "score": 0, "upvote_ratio": 0.36, "comment_count": 2, "over_18": false}, "43": {"id": "1hs9bv3", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "NoPreparation6079", "link_flair_text": null, "time": 1735959510.2091181, "created_utc": 1735864432.0, "url": "https://i.redd.it/ma6vjnd6coae1.jpeg", "title": "One of my best friends and his Dad. Photo taken first Christmas after his passing.", "permalink": "/r/Ghosts/comments/1hs9bv3/one_of_my_best_friends_and_his_dad_photo_taken/", "selftext": "He would always lean on the chair to talk to us. Photo taken in 2007 on a flip phone.\nYou can see his head leaning on his fist, eyes and nose. The blanket on the rack on the back is two colors from the mist.", "media": null, "score": 1445, "upvote_ratio": 0.94, "comment_count": 51, "over_18": false}, "44": {"id": "1hospwc", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "HandSubstantial8849", "link_flair_text": null, "time": 1735959511.8000388, "created_utc": 1735465284.0, "url": "https://www.reddit.com/r/ufo/comments/1hospwc/morphing_uap_was_clearly_filmed_with_a_canon/", "title": "Morphing UAP was clearly filmed with a Canon camcorder!!!!!", "permalink": "/r/ufo/comments/1hospwc/morphing_uap_was_clearly_filmed_with_a_canon/", "selftext": "https://youtu.be/nH7SswppuY8\nTime: Dec. 17, 2024\nLocation: Atlanta\nThis was recorded by a guy in Atlanta. Normal guy... With a Cannon XA11 camcorder and a tripod.\nWe can see clearly this UAP's shape is keep changing.\nThis UAP is green and pink.\nActually, similar to this one, UAP transforming to airplane was filmed in Florida on Dec. 10, 2024.\nhttps://youtu.be/FFlYHxzYC1Y\nIt is obvious that their technology is far superior to ours.", "media": null, "score": 661, "upvote_ratio": 0.86, "comment_count": 283, "over_18": false}, "45": {"id": "1hr7li0", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "paranormalnapolska", "link_flair_text": "Video", "time": 1735959512.8267336, "created_utc": 1735752505.0, "url": "https://v.redd.it/l4axc1o33fae1", "title": "Black Object Recorded Today (01.01.2025, 11 AM) in the Canary Islands, Specifically Lanzarote, Playa Blanca", "permalink": "/r/UFOs/comments/1hr7li0/black_object_recorded_today_01012025_11_am_in_the/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/l4axc1o33fae1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/l4axc1o33fae1/DASH_96.mp4", "dash_url": "https://v.redd.it/l4axc1o33fae1/DASHPlaylist.mpd?a=1738551512%2CMjA4YzFjOGY3OGEwMWVkMTliN2ZkYjAxYzY3NDU4NzFkNjA4NzU5M2RmMDM1Y2E1ODQ2N2EyYjQ0MWE5MTUzNw%3D%3D&v=1&f=sd", "duration": 180, "hls_url": "https://v.redd.it/l4axc1o33fae1/HLSPlaylist.m3u8?a=1738551512%2CMGRhN2JmYTU5YzU1YzdlZGJmZDBiZWEwMjRkMjU4ZWM3ODEwYjBhODkxYmZhNDBlMWY2Y2I0YWQ1OTRiYTcyNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 5813, "upvote_ratio": 0.84, "comment_count": 741, "over_18": false}, "46": {"id": "1hpbe4y", "locked": true, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "FarComplaint740", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1735959514.2908022, "created_utc": 1735521684.0, "url": "https://i.redd.it/x5wml6h01w9e1.jpeg", "title": "Jan 20, 2025", "permalink": "/r/aliens/comments/1hpbe4y/jan_20_2025/", "selftext": "", "media": null, "score": 4260, "upvote_ratio": 0.87, "comment_count": 208, "over_18": false}, "47": {"id": "1hprjjs", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "TRUTHNOWOFFICIAL", "link_flair_text": null, "time": 1735959514.7120428, "created_utc": 1735577527.0, "url": "https://www.youtube.com/watch?v=xiKBgBiyHOo", "title": "We Need The Truth, Now.", "permalink": "/r/UAP/comments/1hprjjs/we_need_the_truth_now/", "selftext": "", "media": {"oembed": {"provider_url": "https://www.youtube.com/", "title": "WE NEED THE TRUTH NOW", "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/xiKBgBiyHOo?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"WE NEED THE TRUTH NOW\"></iframe>", "thumbnail_width": 480, "height": 200, "width": 356, "version": "1.0", "author_name": "TruthNow", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/xiKBgBiyHOo/hqdefault.jpg", "type": "video", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@TruthNowOfficial"}, "type": "youtube.com"}, "score": 335, "upvote_ratio": 0.95, "comment_count": 64, "over_18": false}, "48": {"id": "1hokkh2", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Comfortable_Corner80", "link_flair_text": null, "time": 1735959515.8096561, "created_utc": 1735435063.0, "url": "https://i.redd.it/r0hn6d0gvo9e1.jpeg", "title": "Anyone have an answer to this?", "permalink": "/r/conspiracy/comments/1hokkh2/anyone_have_an_answer_to_this/", "selftext": "", "media": null, "score": 5146, "upvote_ratio": 0.95, "comment_count": 1284, "over_18": false}, "49": {"id": "1ht2ksh", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "AnthonyofBoston", "link_flair_text": null, "time": 1735959516.0113528, "created_utc": 1735953044.0, "url": "https://anthonymoore56.academia.edu/research#papers:~:text=A%202025%20Memorandum%20to%20the%20US%20State%20department%20concerning%20the%20imminent%20catastrophic%20implosion%20of%20the%20United%20States%20and%20collapse%20of%20its%20allies%20between%20June%20and%20September%20of%202025", "title": "A 2025 Memorandum to the US State department concerning the imminent catastrophic implosion of the United States and collapse of its allies between June and September of 2025.", "permalink": "/r/conspiracyfact/comments/1ht2ksh/a_2025_memorandum_to_the_us_state_department/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "50": {"id": "1hop18b", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "hippy2zippy", "link_flair_text": "news", "time": 1735959516.7658699, "created_utc": 1735449840.0, "url": "https://v.redd.it/ybe1obw43q9e1", "title": "Two People Die From Exposure While Looking for Bigfoot", "permalink": "/r/bigfoot/comments/1hop18b/two_people_die_from_exposure_while_looking_for/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/ybe1obw43q9e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/ybe1obw43q9e1/DASH_96.mp4", "dash_url": "https://v.redd.it/ybe1obw43q9e1/DASHPlaylist.mpd?a=1738551516%2CZWZmZTkyZGI0ZDQyZjk3MjVlYTM5ZDgyYTdhNGVmNDA0MTgzNWZjN2U0OGE5ZTcyOGMxYTMyNjVmMjUwYzkzMg%3D%3D&v=1&f=sd", "duration": 137, "hls_url": "https://v.redd.it/ybe1obw43q9e1/HLSPlaylist.m3u8?a=1738551516%2CZWNmOTJmZGFiMjIwZGM3ZGUzMmQ0MDBjODg3NmNkZWQ0OTJmNmIyNTcyZDhiNWU1YjFlNmQ0OWY3YjM4MGU4OA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 761, "upvote_ratio": 0.98, "comment_count": 120, "over_18": false}, "51": {"id": "1hpc01d", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "voidicguardian", "link_flair_text": null, "time": 1735959517.3865936, "created_utc": 1735523476.0, "url": "https://www.reddit.com/gallery/1hpc01d", "title": "day trip to maine!!", "permalink": "/r/Cryptozoology/comments/1hpc01d/day_trip_to_maine/", "selftext": "my boyfriend and i took a trip up to maine to see the international cryptozoology museum!!! i got my hands on loren coleman's cryptozoology a to z + a cassie the lake monster patch :D\nit was... overwhelmingly bigfoot filled, which was a bit of a disappointment. i liked the pop culture discussion in some of the displays, and they had a replica of the feejee mermaid and plenty of coelecanth info, but about 75% of the displays were bigfoot/yeti/hominid related and i really wish thered been more of a spotlight on smaller or lesser known cryptids (like... the oklahoma octopus, or the loveland frogman, or a proper display on wendigos/fleshcrawlers and native american folklore instead of lumping them in with bigfoot)\nstill!!! VERY cool trip and id like to see what the bangor location has when its reopened!! ", "media": null, "score": 149, "upvote_ratio": 0.99, "comment_count": 4, "over_18": false}, "52": {"id": "1hpdtvp", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "MiRs_____", "link_flair_text": null, "time": 1735959517.959702, "created_utc": 1735529104.0, "url": "https://i.redd.it/8gid69s2nw9e1.jpeg", "title": "Clogs ", "permalink": "/r/cryptids/comments/1hpdtvp/clogs/", "selftext": "", "media": null, "score": 270, "upvote_ratio": 0.95, "comment_count": 18, "over_18": false}, "53": {"id": "1hso35v", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Puzzleheaded-Kiwi658", "link_flair_text": "Paranormal Investigation", "time": 1735959518.1309516, "created_utc": 1735915741.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1hso35v/my_cat_saw_a_ghostentity_invisible_to_my_eyes/", "title": "My cat saw a ghost/entity invisible to my eyes?", "permalink": "/r/Thetruthishere/comments/1hso35v/my_cat_saw_a_ghostentity_invisible_to_my_eyes/", "selftext": "Last night I was turning on the oven when suddenly the power went out. The circuit breaker had tripped. Living on the second floor of an apartment building, I went downstairs to turn the switch back on. When I returned home, I went back to the oven and turned it on. Meanwhile, my cat was staring at me from outside the kitchen, inside the entrance room. At one point, I saw him staring at some spots on the ceiling and following something with his gaze. I noticed he was starting to get agitated and was moving his tail, so I asked him, 'What's wrong?' He stared at me for a moment with dilated pupils and then returned to looking in that direction. After a couple of times of asking 'What's wrong?', he let out a growl, the kind cats make when they sense a threat, and that’s when I started to get really nervous. Then he walked toward the door as if whatever he was staring at was going outside, and then he started sniffing under the door. But there was nothing behind the door. After that, everything returned to normal. ", "media": null, "score": 6, "upvote_ratio": 0.8, "comment_count": 4, "over_18": false}, "54": {"id": "1hopgkh", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Mother_Demand1833", "link_flair_text": null, "time": 1735959518.2792568, "created_utc": 1735451439.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hopgkh/the_ballerina/", "title": "The Ballerina", "permalink": "/r/LetsNotMeet/comments/1hopgkh/the_ballerina/", "selftext": "This happened last week. \nI live alone in a small college town, although I'm not a student or faculty member. My apartment is in a duplex on a residential street just a few blocks from campus--which most of the students have left for their winter break. Things get very quiet when they're not around. \nLate Wednesday night, I woke up to a disturbing sound outside.\nIt was someone crying, but not in a \"normal\" way. This was more like delirious wailing. The person didn't sound grief-stricken or panicked, and there were no cries for help. Otherwise I'd probably have gone outside (cautiously) to check things out. \nThis sounded more like someone doing an impression of a ghost, but being a little too convincing. A sort of \"Woooooooh, Ooooooh, Aaah,\" over and over. \nNot a pleasant way to wake up! \nI got up and looked out the window but didn't see anyone. I couldn't tell where the sound was coming from. After a few minutes the wailing grew distant and things got quiet again. I went back to sleep, a little unsettled. \nThursday night rolled around and I went to bed as usual, wondering if I'd hear anything again. Sure enough, I was awakened a few hours later. But this time the sound was completely different.\nAt first I wondered if there had been a heavy snowfall, because I heard what sounded like the edge of a shovel scraping the sidewalk. It was very rhythmic. Two plodding footsteps followed by a long and drawn out scraping. \"Thud. Thud. Scrape. Thud. Thud. Scrape.\"\nI got up and looked out the window, where I saw no snow but a dense fog--and a woman across the street. \nIt took me a minute to tell if she was wearing some strange hat, but then I realized that the \"hat\" was her hair. It was long--down to her waist--and completely filthy and matted, bunched up into a single mass that looked like a gigantic glistening hairball. \nThe woman was standing with her shoulders hunched forward and her arms crossed behind her back, like a figure skater or dancer. \nShe was doing an unusual sort of dance, where she would take two heavy stomps and then glide as if she were on ice skates. But there was no ice. I couldn't tell how she was gliding so gracefully and effortlessly across the pavement.\nIt was almost hypnotic to watch, because she appeared to be elderly and frail. But she could spin, glide, and maintain balance on a level that would be hard for me to keep up with. Each time she would glide, I'd hear the \"scrape\" sound of her shoe against the pavement. \nThere were no additional steps to the dance. Just the rhythmic \"stomp, stomp, glide\" headed in one direction, before twirling around and doing the same steps in the other. \nAfter a few minutes, she stopped and then stooped down like a runner at the starting line, dramatically leaned forward with her fingertips lightly touching the ground. She stayed that way for a good minute or two. It was a very unsettling thing to see in the shadows and fog. \nThen she slowly stood up, turned facing away from me, and got up on her very tiptoes with her long, skinny arms outstretched. \nThen she broke into that rapid tiptoeing motion that professional ballerinas do. In my mind, I heard that classic cartoon sound effect that plays when a character scampers away. \nWithout a sound, she danced into the fog. \nI haven't seen or heard anything from her since.", "media": null, "score": 81, "upvote_ratio": 0.93, "comment_count": 9, "over_18": true}, "55": {"id": "1hqhn4v", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "sasbergers", "link_flair_text": null, "time": 1735959518.404417, "created_utc": 1735660839.0, "url": "https://i.redd.it/332bs08si7ae1.jpeg", "title": "The last known footage of Elisa Lam in the elevator of the Cecil Hotel in Los Angeles, weeks before she was found dead in the hotel's rooftop water tank", "permalink": "/r/truecreepy/comments/1hqhn4v/the_last_known_footage_of_elisa_lam_in_the/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.46, "comment_count": 24, "over_18": false}, "56": {"id": "1hstm98", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Campingwithdave", "link_flair_text": null, "time": 1735959519.0721114, "created_utc": 1735929743.0, "url": "https://www.reddit.com/gallery/1hstm98", "title": "Three days after my dog Koki passes away", "permalink": "/r/Ghosts/comments/1hstm98/three_days_after_my_dog_koki_passes_away/", "selftext": "", "media": null, "score": 940, "upvote_ratio": 0.92, "comment_count": 77, "over_18": false}, "57": {"id": "1hsvnd0", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "CoochieMan8000", "link_flair_text": null, "time": 1735959520.4091337, "created_utc": 1735934778.0, "url": "https://i.redd.it/hyctywnc5uae1.jpeg", "title": "Cybertruck Bomber's opinion on the UFOs/drones", "permalink": "/r/ufo/comments/1hsvnd0/cybertruck_bombers_opinion_on_the_ufosdrones/", "selftext": "", "media": null, "score": 652, "upvote_ratio": 0.84, "comment_count": 545, "over_18": false}, "58": {"id": "1hp3xq3", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "3xgtee", "link_flair_text": "Sighting", "time": 1735959521.5189404, "created_utc": 1735501296.0, "url": "https://www.reddit.com/gallery/1hp3xq3", "title": "Strange object seen in the sky, Myrtle Beach, South Carolina.", "permalink": "/r/UFOs/comments/1hp3xq3/strange_object_seen_in_the_sky_myrtle_beach_south/", "selftext": "Time: August 29, 2023. Afternoon.\nLocation: Myrtle Beach near Broadway \nMy family and I saw this object hovering in the sky in place while we were vacationing.  We were near a helicopter pad so I thought it could be a drone filming them taking off or something but upon closer inspection it was much higher in the sky. Its movements seemed to be rotating in place end over end.  Multiple people saw it but no one had any clue as to what it was.  Can anyone ID this object?", "media": null, "score": 4904, "upvote_ratio": 0.73, "comment_count": 2598, "over_18": false}, "59": {"id": "1hqkv3k", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "littlespacemochi", "link_flair_text": "Video", "time": 1735959522.9666889, "created_utc": 1735669859.0, "url": "https://v.redd.it/3swqzhlg98ae1", "title": "Former NASA employee claims that we have high-resolution photos of alien space crafts & offers to testify before Congress", "permalink": "/r/aliens/comments/1hqkv3k/former_nasa_employee_claims_that_we_have/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/3swqzhlg98ae1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 540, "scrubber_media_url": "https://v.redd.it/3swqzhlg98ae1/DASH_96.mp4", "dash_url": "https://v.redd.it/3swqzhlg98ae1/DASHPlaylist.mpd?a=1738551521%2CYzY3YjllMmMwMTdmNTI3NGYwNDVjNzBiMTZhODFkM2NlMmNlNjcyNTMzMjgyMmZmYWQ3NmYwNDYxMGUzNDVlNg%3D%3D&v=1&f=sd", "duration": 130, "hls_url": "https://v.redd.it/3swqzhlg98ae1/HLSPlaylist.m3u8?a=1738551521%2CZTM1MGNhYjk2NDdjOTYzYmYwNDIxMjY4NTBkYzZhM2IzZDcyN2Q1OWVhNmEwNmY5ZjMwM2Q3NjM0NjkxZmNjOQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3581, "upvote_ratio": 0.9, "comment_count": 331, "over_18": false}, "60": {"id": "1hrqczs", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Video", "time": 1735959523.4628568, "created_utc": 1735811626.0, "url": "https://v.redd.it/mmimqqnowdae1", "title": "CBS: FAA expands drone flight restrictions in New Jersey. Drones are now restricted in 9 more municipalities in addition to dozens of municipalities already under restriction. \"It's unclear why the new restrictions were put in place\". Nothing to see here folks.", "permalink": "/r/UAP/comments/1hrqczs/cbs_faa_expands_drone_flight_restrictions_in_new/", "selftext": "", "media": null, "score": 188, "upvote_ratio": 0.97, "comment_count": 15, "over_18": false}, "61": {"id": "1hp8sv5", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "skuzzy21", "link_flair_text": null, "time": 1735959524.589919, "created_utc": 1735514249.0, "url": "https://i.redd.it/39wnhakwev9e1.jpeg", "title": "Reminder: The 300+ year-old Vampire didn't kill himself.", "permalink": "/r/conspiracy/comments/1hp8sv5/reminder_the_300_yearold_vampire_didnt_kill/", "selftext": "", "media": null, "score": 3885, "upvote_ratio": 0.88, "comment_count": 303, "over_18": false}, "62": {"id": "1hp0yej", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "IPLEAD_THE_FIF", "link_flair_text": null, "time": 1735959524.7892592, "created_utc": 1735493460.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1hp0yej/a_secret_plan_by_a_group_to_do_something_unlawful/", "title": "A secret plan by a group to do something unlawful or harmful.", "permalink": "/r/conspiracyfact/comments/1hp0yej/a_secret_plan_by_a_group_to_do_something_unlawful/", "selftext": "As far as I'm concerned, all these are in fact conspiracies. Not theories. Not so secret anymore, but people are still too hard headed/blind to believe the truth. \nChem trails.\n5g towers spreading out the chem trails. No such thing as 5g chips in your phone, doesn't exist.\nFluoride in the tap water.\nPoison/sedatives in almost all processed foods. Food dyes, preservatives, high fructose corn syrup, Bioengineered food ingredient, etc.\nWe never been to the moon. \nThey are using H.A.A.R.P to manipulate our weather.\n9/11 was our own government/Criminals who think they run the world. (I'd say \"elites\" but they don't deserve to be called that.)\nSugar is the #1 drug in the world.\nPedophiles in the Vatican and other top ranking organizations. Approximately 840,000 children go missing each year. What do they do with all these kids after they're done? Probably chop em up and feed them to the sheeple at McDonalds.\nWe are herbivores and should only be eating things grown from the ground. Meat is bad for humans.\nMK Ultra, experimenting on peoples brains with psychedelic's, other chemicals and lobotomy's. Using what they learn to brainwash soldiers in the military to do their dirty work, no questions asked. Like spray chem trails for example.. \nCell phones/TV's (Black mirrors) Demonic technology.\nThe fires in Hawaii. Was in fact a giant laser beam (probably mounted to a plane) used to clear land to implement a new \"smart city\" using only digital currency.\nSince birth you have been taught so many lies and been conditioned to be a mindless, soulless worker, to be a part of the machine that is the world we live in. We still don't know the full truth. Is the earth a sphere? Is outer space water? Do reptilians run the government? Are cities giant computers? Does the giant particle collider C.E.R.N split are reality into pieces? I see allot of good theories but am still looking for the absolute truth. \nAnything I miss that you Believe in 100%? What are your thoughts?", "media": null, "score": 2, "upvote_ratio": 0.62, "comment_count": 0, "over_18": false}, "63": {"id": "1hpcv9e", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "armedsquatch", "link_flair_text": "photo", "time": 1735959525.5860362, "created_utc": 1735526129.0, "url": "https://www.reddit.com/gallery/1hpcv9e", "title": "My heart rate jumped for a moment when checking a trail cam today", "permalink": "/r/bigfoot/comments/1hpcv9e/my_heart_rate_jumped_for_a_moment_when_checking_a/", "selftext": "This trailcam got some moisture inside and took some wonky pics. These 1st 2 looked like some bipedal light haired creature. Turns out it is just an elk butt with water on the inside of the lens. Thought I would share.", "media": null, "score": 632, "upvote_ratio": 0.97, "comment_count": 35, "over_18": false}, "64": {"id": "1hrfyx8", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Sustained_disgust", "link_flair_text": "Article", "time": 1735959526.0449598, "created_utc": 1735774956.0, "url": "https://www.reddit.com/gallery/1hrfyx8", "title": "Winged Snake preserved in alcohol, 1912. \"This strange creature has the head and neck of a snake and wings that resemble those of a huge locust\"", "permalink": "/r/Cryptozoology/comments/1hrfyx8/winged_snake_preserved_in_alcohol_1912_this/", "selftext": "", "media": null, "score": 146, "upvote_ratio": 0.95, "comment_count": 34, "over_18": false}, "65": {"id": "1hrzmfs", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "DarkstarZero7", "link_flair_text": null, "time": 1735959526.6538527, "created_utc": 1735840201.0, "url": "https://i.redd.it/pgzt6ml4cmae1.jpeg", "title": "Burning of Champ in Vermont", "permalink": "/r/cryptids/comments/1hrzmfs/burning_of_champ_in_vermont/", "selftext": "", "media": null, "score": 148, "upvote_ratio": 0.99, "comment_count": 3, "over_18": false}, "66": {"id": "1hrr0zh", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Platomik", "link_flair_text": null, "time": 1735959526.8218145, "created_utc": 1735814600.0, "url": "/r/AskReddit/comments/1hrqkxd/do_you_believe_in_ghosts_whats_the_scariest/", "title": "Do you believe in ghosts? What’s the scariest paranormal experience you’ve ever had?", "permalink": "/r/Thetruthishere/comments/1hrr0zh/do_you_believe_in_ghosts_whats_the_scariest/", "selftext": "", "media": null, "score": 3, "upvote_ratio": 0.62, "comment_count": 2, "over_18": false}, "67": {"id": "1hrz1ls", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Tasty_Constant_870", "link_flair_text": null, "time": 1735959526.9665291, "created_utc": 1735838791.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hrz1ls/the_man/", "title": "The man ", "permalink": "/r/LetsNotMeet/comments/1hrz1ls/the_man/", "selftext": "My name is Lylie, I am 14 years old now, but I was only 10 at the time of the events. This story is mine, and it is entirely rational. You should know that this man lives in the building next to mine, but I have NEVER seen him outside of his home, only at his window. I was with a friend during this story, so I’ll call her Chloé. Chloé was staying at my place that day, but let’s start with the first day.\nIt was a Wednesday afternoon around 5 p.m., and we needed to take her dog out downstairs. We had to wait to take him out, so we decided to take a short break and sit down. Across from us was a window with a man who lives in the building next to mine. I don’t know what he was doing, but he opened his window and ordered us to go back home. We told him no. He then took a knife, held it in his hand, and told us to go home or he would call the police. So, we went back inside.\nWe obviously had to go back down around 10 p.m. to walk her dog again. It was dark and late. The man saw us again and once more told us to go home. This happened 4 years ago. Since that day, neither I nor the people living in my neighborhood had seen him again. But for some reason, I saw him recently at his window, and he said to me again, “Go back home.” I didn’t go back, but I know he’s not a very clear-headed person, and everyone agrees with me...", "media": null, "score": 5, "upvote_ratio": 0.57, "comment_count": 7, "over_18": true}, "68": {"id": "1hspgs1", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "DEVILWINGED660", "link_flair_text": null, "time": 1735959527.1120708, "created_utc": 1735919405.0, "url": "https://www.reddit.com/r/truecreepy/comments/1hspgs1/dont_let_them_in/", "title": "don,t let them in", "permalink": "/r/truecreepy/comments/1hspgs1/dont_let_them_in/", "selftext": "Don't let them in.\nAddiction took our mother slowly, rocked her through it and sung her to sleep sunk deep into the mattress on her bed. When her back teeth fell out she left them on the side of the bathtub. I was seven, and I kept them in a match box, the missing pieces of her kept safe, so she wouldn't be lost forever. So maybe one day we could put her back together. Our house fell down around us, and we tried our best to raise ourselves. The ceilings had water damage and the bottom stairs had dry rot and in the winters the radiators would bleed rust. But it was still our house, and Annie made it a home.\nMy sister Annie mothered me, with lopsided bandaids on bruised knees and lukewarm microwave meals. She told me ghost stories and didn’t mind when I crawled into her bed later on, too scared to sleep alone. She taught me to dance, barefoot on the living room carpet, music channel on full volume on the TV shaking our hips before they were fully grown. She always let me shower first so the water was hot, never complaining when she had to make do with cold. She brushed my hair everyday before school, even when I screamed and hit her when she caught the tangles. Annie was dark haired like her father, whoever he had been, but I was blonde. Annie was desperate to be blonde too, like Marilyn Monroe. Like mom. I think she thought it would make them closer, remind mom less of her dad. I’d give anything for her to have her hands in my hair one more time, even if it hurt. She moved to New York when I turned eighteen and never came back. I still dream about her sometimes.\nKeeping up with our mother was impossible and we learnt from a young age we would always be left behind. It didn’t make it any easier. When she was drinking light, she shone, would wake us up at 3am with pancakes, dripping in cherry syrup. Sometimes when the weather was right and she’d had enough being drunk alone, she would call our school up and tell them we had both come down with summer sickness and we’d drive to the beach instead. I remember being nine years old in the backseat of the car coming home after one of our ocean days, sucking the salt from my fingers. Annie had just dyed her hair blonde, her best friend Jane helping her bend over our kitchen sink. From behind, I couldn’t tell who was mother and who was daughter, radio up and windows down blowing the sky inside.\nWhen she was drinking heavy, she’d be out all night, hair piled up like a beauty queen, eyes glazed over and ringed with glitter and black. Sometimes she’d be gone a day or two. She would never tell us when, one day we’d just wake up to an empty house and the fridge packed full, post it note on the front with a smear of moms lipstick in the outline of a kiss, telling us she’d be back soon. Sometimes she’d bring guys home, filling the table with beer cans and ash trays, smoke up to the ceiling, mom lost in the haze. We’d sleep with pillows over our heads, trying to drown out the music they would blast until the am, and wake up to strangers at our kitchen table in the morning, asking us where we kept the coffee. \nWhen mom drank too little she fell apart. She wouldn’t buy food, refrigerator a gaping hole in the wall. She’d chain smoke, leaving cigarette burns on the wallpaper up by the stairs like the walls were sick and decaying. She barely slept, walking around with blue half moons under her eyes, knuckles raw. She would scream at the slightest thing. I remember once when I spilled a glass of juice on the couch. She looked over at me with dead eyes and dragged me off onto the carpet and then took every single cushion off the couch and into the back yard and set them on fire. Annie went to watch a while from the window and then sat next to me on the floor, backs pressed against the skeleton of the seats, head resting in the crater of my collar bones. \nWhen mom drank too much was the worst. She’d laugh too loud and too long at anything and everything, until her mouth started to shake and she started crying, at the breakfast table into her cereal. Annie shut down when mom was like this, went somewhere deep inside herself where nobody could hurt her. She’d stay up until the morning watching old black and white movies on TV, whispering the lines she knew by heart like prayers. When I was five I’d cry when I’d find mom passed out cold on her bed, sure she would never wake up. Annie would wipe my tears, tell me she was only sleeping just like the princesses in my story book. We’d sit on moms bed together and wait for her to wake up. When we were older, I was the one who would pick mom up off the bathroom floor again and again and Annie would put her to bed, smoothing her hair off her face and the vomit from her mouth, changing her clothes if she’d pissed herself. Watching them then, there was no doubt that Annie was the mother now.\nIt was October and I was thirteen, Annie sixteen. It was a Wednesday night and mom had been gone for two days. She’d called us that morning from a pay phone, voice slurring down the line, telling us she was having the best time with all her new friends, hoped we were doing fine. When she asked me if I was having a good birthday I hung up on her. My birthday had been the day before. Annie had given me a pile of presents, strawberry lipglosses and glittery nail polishes. I didn’t ask where she’d got the money for them. I didn’t care. We’d taken the bus to the beach with Jane, eaten the birthday cake she had made for me, sand getting into the frosting. It tasted like sweetness and the sea, and I savoured every bite and scrape of sugar against my teeth. We watched the sun go down, Annie snapping grainy photos on her shitty Nokia as I blew out my candles, wishing over and over that mom wouldn't come home, that she’d just stay gone this time. \nBut that Wednesday night, me and Annie weren't speaking. Anger hung heavy between us, seeping through the floorboards. It began when she tripped at the bottom of the stairs. We’d both laughed, Annie throwing her head back, gap between her front teeth catching the light. When I’d bent to pick her up, I’d caught her breath, warm against the freckles on my cheeks. I let go of her arms and she fell again, hitting the floor and grinning, shaking her hair from her face. Her breath was heavy with whiskey. I couldn't start picking her up too, couldn't watch her fall again and again. Just like mom, I knew she’d never get back up. \nI’d stared down at her, blonde hair fallen into her eyes and all I could see was our mother, and then I was running, feet slamming the hallway like heartbeats turned loose. I’d run for the kitchen and tipped every bottle we had down the sink, shoving Annie back as she fought to stop me, catching liquor on her fingers as it fell. She grabbed my shoulders and made me drop the very last bottle. It smashed between us on the floor, glass shards shining like we’d dragged the stars out of the sky and broken them, pieces we could never put back. Outside through the open windows, the sky turned pale gold, clouds a mess of pink and cream smeared across the horizon. I cried then, watching Annie on her knees picking up the pieces. That was Annie, always trying to fix things even when it was too late. \nThe smell of food dragged me from my room, stomach turning traitor inside my ribcage. Annie was cooking pasta, real food not made in a microwave. She’d set the table, Tammy Wynette singing softly from the CD player, Annie gently swaying her hips as she stirred the tomato sauce, rich and warm. As we ate in silence, with every bite I forgave her. Mom never cooked dinner, or remembered my favourite was spaghetti ever since I was a kid, or stayed sober long enough to sit up at a table. Annie wasn’t mom.\nWe were washing the dishes when we first heard it. A moth was crawling down the inside of the pane and I cracked the window to let it out into the dark. From the backyard came a faint sound. I tilted my head to listen as it was coming from far off. Crying. I figured it was Mika the two year old next door having a tantrum loud enough for us to catch, or maybe even Lucky Strike the cat that junkies down the street, begging for food like he sometimes did. I always wanted to feed him when he came around, winding over my ankles, but Annie always stopped me, saying once you started giving they never stopped taking. Looking back, I don’t think she was talking about the cat.\nAnnie flipped the christmas lights strung up around the porch and we sat on the plastic beach chairs watching the skies. When we were little, we’d sit outside and Annie would tell me the names of all the constellations and the stories of how they came to be hung up in the night sky. I had to grow up before I realised she made them all up as she went along. It was a game we still liked to play now, making up ridiculous stories for the shapes we could pick out. \n“Ah, yes, that one there is the Coors Light. It got there when God dropped it out of his convertible window and never picked it up,” she said, nodding sagely and hiding her smile. \n“Of course,” I said, waving my hands and pointing up past the power lines. “Right next to The Ashtray, left there by angels on a smoke break.”   \n“Yeah, they say if you wish on it, all your dreams will come true,” said Annie grinning. \nShe stopped laughing, voice quieter, face tilted up to all those dead stars. \n“Let’s wish Emmy. Let’s wish” So we did.\nThe sound of crying interrupted us. It was closer this time, and definitely human. We turned to each other, confused. Annie shrugged and I squinted out into the black. It sounded like a baby, lost and tired and alone. \n“It must be Mika?” I said, slowly getting to my feet. “Maybe he walked around the back? Shit, do you want to call Connie and tell her we’ll bring him over.” Annie didn't reply, and I sighed, rolling my eyes. “Guess I’ll do everything then.” \nI stepped off the porch, grass soft against my heels. The air smelled like it might rain, fresh and clean and growing. A promise unfulfilled.  \n“Em.” Annie’s voice was strained. I turned to her, smiling. It died on my face when I saw the look on her own. “Em get inside now.” She was staring out into the dark, past me, opening the door with one hand behind her, fingers fumbling on the catch. I froze, bare foot in the dirt. I’d found what she was looking at. \nIn the bushes by the back fence was a person, crouched with their knees tucked up neat under the chin, arms wrapped around legs. Their mouth hung wide, softly opening and closing as he cried. Like a child, lost in the dark. Not like a child, but a someone pretending. Mimicking the sound, open and closed out in the blackness. Suddenly they straightened, snapping upright face still hidden by the black. They were tall and thin, too thin to be a normal person. \nPanic made me move, animal instincts leftover from the days we lived up in the trees carrying me forward. I was faster than Annie, dragging her inside and slamming the door behind us, hearing it bounce on its hinges as I locked it. We watched as the person slowly walked towards the house, steps deliberate and long. \nAnnie reached for my hand, holding me tight and turned me to face her, holding my shoulders. \n“Don’t turn around Emmy. Don’t turn around.” Instinctively I started to look over my shoulder out into the darkness. Annie grabbed my face, hard, and shook her head. I knew then she was serious.\n“I’m…” her voice cracked, and she cleared her throat, gripping my hand tight enough to hurt, nails digging in, grounding herself. I looked down at our fingers interlocked, both of us grown from the same bones. \n“I’m gonna call the cops and everything is going to be…” her voice faltered, stuttering. Tears spilled over her lashes, dripping like the promise of rain. Annie never cried. \n“Your phone’s on the porch,” she whispered, and bile crawled its way up my throat. Her phone was upstairs, charging. \nA soft, tap-tap-tapping filled the silence. Annie turned to the window, eye whites showing her eyes were so wide.\nIt was the sound of someone’s forehead against the glass, slowly, over and over. They started to speed up, faster and harder, skin meeting glass until they was slamming into the window hard enough to shake the panes. The tapping stopped and I was about to ask Annie if I could look now when she screamed, followed by the sound of cracking glass and the loudest slam yet. Whoever was in our yard had just smashed their face hard enough into the window to break it. \nWe ran upstairs, two at a time, skipping the ones caved in with dry rot on instinct. I turned behind me once and Annie yanked my face back before I could see. The sound of broken glass echoed behind us as we made it to the bathroom, locking the door. A thin, wailing cry, like a baby calling for its mother filled the hallway, trapped between the walls and locked doors. \nAnnie threw her back against the door, feet jammed up against the bathtub, clutching the knife she had grabbed from the kitchen. I did the same, shoulder to shoulder. Slow footsteps started on the stairs, deliberate and casual. The crying had become mocking, almost laughter, shrill bursts of sound and then giggles, high pitched and abruptly stopping before starting again. The first door on the upstairs floor was my bedroom and we heard the distinct sound of it slamming open. They were looking for us. \n“What the fuck is going on,” I asked Annie, not even bothering to brush away the tears that I couldn't stop falling. I watched my sister pick herself up off the floor, and brace her hands on the door as we heard the sound of a second door slamming open. Mom’s room. The next room on the hallway was the bathroom. Annie pulled me to my feet and handed me the knife. I shook my head and pushed it back to her, terrified of what would happen if I had to use it. Annie shoved me and pressed the knife into my hands, thumb pressing hard enough on the blade to bleed. I watched my sisters blood drip down her wrist, a winding red road, still pushing into my hands despite the pain. I took the knife.\nSomething slammed against the wall that mom’s room shared with the bathroom. A high pitched wail followed. I held my breath, could feel my heart beat in the base of my throat, a wild and frantic thing. \n“I’m gonna get the phone from my room.” I shook my head violently about to argue. Annie clamped a hand over my mouth. I could taste the blood on her hand, salty and sweet. Like birthday cake by the ocean. “Yes. I’m gonna get the phone and I’m gonna call the cops and we’re going to be okay.” I shook my head again. “It’s the only way. When I go I need you to lock the door and you don’t open it for anything or anyone. Not for me not for… anyone. Promise me.” I shook my head and Annie pressed her hand into my mouth, crushing my teeth against my lips so it made my eyes water. “Yes. Promise me Em.” \nSomething smashed in the room next door. Annie brushed the hair off my face, gently tucking it behind my ear. Promise she mouthed and unlocked the door as slowly as possible, bolt scraping gently. I watched the curve of her shoulder disappear into the black hall outside, like the moon in eclipse. And then she was gone. I couldn't move or breathe for a second and then I slammed the bolt shut just as something bounced off the outside of the door. A high pitched scream followed, handle rattling up and down hard enough to pop one of the screws. I watched it roll towards me on the tiles. And then silence. \nI sat with my back to the door, holding the knife and wishing I was holding Annie’s hand instead. Still silence. Nothing but me and my lungs slowly filling the room with my breath. \n“Em?” Came a voice through the door. I started, hands gripping the knife. “Honey what’s going on?” \n“Mom?” my voice cracked. “Momma is that you?” I wrapped my arms around myself, shaking, trying to keep myself still. \n“Sweetie it’s okay just open the door. It’s okay just let me in.” The handle rattled again, gentler. “Just let me in, it’s all okay.” She banged on the door and I took my handle of the bolt. \n“Honey I’m sorry. I’m sorry I missed your birthday. I’m sorry I’m such a terrible mother. Please,” her voice broke and she started to cry, “just let me in baby I’m so sorry.” \nI screwed my eyes shut. She sounded so sad and so lost. I just wanted her to hold me like when I was a kid and I’d come in off the swings with a scraped knee. Maybe this time she meant it. Maybe it would all be okay. My hand found its way to the bolt again. \nMy sisters voice came through the door, warm and gentle. “Yeah Emilie let us in, it’s all okay.” \nMy hand froze on the bolt and I tightened my grip on the knife. Annie never called me by my full name. A hand banged on the door, handle rattling. “Emilie let us IN” Annie’s voice became low and guttural, followed by the same shrill giggles from before. Mom spoke now, pleading and crying, voice getting louder and louder. “Let us in let us in let us in,” over and over again, punctuated by her fists on the door. I thought about demons and monsters, all the bedtime stories we pray don’t crawl out from under the bed. \n“That’s not my sister and you’re not my mother!” I screamed through the door, hands over my head. I climbed into the bathtub and curled in a ball, cradling myself, knife clutched to my chest. I didn’t know what it was outside that door but I knew it wasn’t Annie. It wasn't the voice that yelled at when I changed TV channel, the one that sang  me happy birthday, the one that told me I was smart even when I got bad grades, the one that read me stories about princesses that never wake up.  It wasn’t human. \nBangs and yells came from downstairs followed by the footsteps of people running. A low guttural howl ripped through the house, filling the room until I felt like I was drowning in the sound and then the door was kicked in. I screamed, covering my eyes, waiting to die. Arms found me and lifted me from the tub carrying me from the room. I looked at the outside of the door as I was carried downstairs. It was covered in long scraping claw marks, dragged down to the floor. Pillows ripped apart covered the hallway in soft down, like it had snowed inside. I watched them drift slowly as men in uniforms checked each of the rooms that looked like they had been torn apart by something feral. \nOutside in our drive way were police cars and an ambulance. In the middle of it all was Annie. Bathed in blue and red light as it washed over her, lit up in the dark like a neon angel, face aglow. I threw myself from the cops shoulder and ran to her, holding us both together, broken pieces and all, standing under all those constellations we made up. Gentle screaming came from the ambulance which rocked occasionally. Annie gently turned my head away, smiling so sadly it made my chest ache as I understood. \nTurns out there was no demon. No wild animal or bad men trying to break in. Just mom, out of her mind on booze and drugs and everything in between, coming to the end of a week long binge. Something had finally broken inside her head, and this time we couldn't put her back together no matter how hard we tried. Sometimes you fall one last time and you never get back up.\nAnnie had seen her in the garden, blood dribbling from her mouth, track marks bulging on her forearms like unmapped roads, rail thin and desperate for one more hit, one more fix. She’d searched the kitchen for all the drink I’d thrown away and when she hadn’t found it, had come to hunt for the stash she hid in the bathroom. She hadn’t wanted me, just the drugs on the other side of the door, so high she could mimic Annie’s voice almost perfectly. \nTurns out the real monsters are the ones that eat you alive slowly, the kind that come in a bottle or a needle or at the end of a long list of reasons why you can’t get out of bed in the morning. Sometimes the monsters are the ones that raise you or love you the most. But it’s up to you if you let them in.", "media": null, "score": 0, "upvote_ratio": 0.23, "comment_count": 1, "over_18": true}, "69": {"id": "1hsdxsw", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Tiny-Ice-1150", "link_flair_text": null, "time": 1735959527.743757, "created_utc": 1735877974.0, "url": "https://i.redd.it/wovm6b0ggpae1.png", "title": "Voyeuristic ghost taken by cam on a dresser facing the bed", "permalink": "/r/Ghosts/comments/1hsdxsw/voyeuristic_ghost_taken_by_cam_on_a_dresser/", "selftext": "", "media": null, "score": 661, "upvote_ratio": 0.93, "comment_count": 98, "over_18": false}}}