{"_default": {"1": {"id": "1bes14n", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Nightshade09", "link_flair_text": "Article", "time": 1710709091.6080086, "created_utc": 1710440499.0, "url": "https://twitter.com/UAPJames/status/1768317442663567561", "title": "Frm Congressman Riggleman USAF Intell Officer and NSA advisor says to Ross Coulthart 'Put up your 'evidence' or Shut Up!'", "permalink": "/r/ufo/comments/1bes14n/frm_congressman_riggleman_usaf_intell_officer_and/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/UAPJames/status/1768317442663567561", "author_name": "UAP James", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">Former Congressman <a href=\"https://twitter.com/RepRiggleman?ref_src=twsrc%5Etfw\">@RepRiggleman</a>, who served as a U.S. Air Force Intel Officer &amp; NSA advisor on science/tech development, calls for <a href=\"https://twitter.com/rosscoulthart?ref_src=twsrc%5Etfw\">@RossCoulthart</a> to name the Congressional staffer who is aware of firsthand witness evidence of a UFO retrieval &amp; reverse engineering program.<a href=\"https://twitter.com/hashtag/ufox?src=hash&amp;ref_src=twsrc%5Etfw\">#ufox</a> <a href=\"https://t.co/beEpj52c6k\">https://t.co/beEpj52c6k</a> <a href=\"https://t.co/6negEZQnNZ\">pic.twitter.com/6negEZQnNZ</a></p>&mdash; UAP James (@UAPJames) <a href=\"https://twitter.com/UAPJames/status/1768317442663567561?ref_src=twsrc%5Etfw\">March 14, 2024</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n", "author_url": "https://twitter.com/UAPJames", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 399, "upvote_ratio": 0.89, "comment_count": 189, "over_18": false}, "2": {"id": "1bd7wza", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Clipping", "time": 1710709092.805932, "created_utc": 1710275997.0, "url": "https://v.redd.it/qzeh2754sync1", "title": "Breaking Points segment on AARO's Historical Report: “The idea that an agency that has been unable to pass its own audit for 5 years can effectively now audit all of its historical programs going back to 1945 & claim any sort of legitimacy in the eyes of the public… totally ridiculous.”", "permalink": "/r/UFOs/comments/1bd7wza/breaking_points_segment_on_aaros_historical/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/qzeh2754sync1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 472, "width": 854, "scrubber_media_url": "https://v.redd.it/qzeh2754sync1/DASH_96.mp4", "dash_url": "https://v.redd.it/qzeh2754sync1/DASHPlaylist.mpd?a=1713301092%2CYzkwMDE3ZWU1OTgzZTZkNDlkODVkZjdlOWZiYzFhNzAwOTBlM2ViMzVmYWVlY2IzZWMyMzE4YjFlNzk3OGM3MQ%3D%3D&v=1&f=sd", "duration": 406, "hls_url": "https://v.redd.it/qzeh2754sync1/HLSPlaylist.m3u8?a=1713301092%2CYWFiNjMzYWJmYjNiMjMxZTgzMzIyYzIyMGJiYWYyYjM2Njg3YjYzMWIxZjI2ZjRhM2I5MjMwMDJjY2IyYjVjZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2788, "upvote_ratio": 0.92, "comment_count": 178, "over_18": false}, "3": {"id": "1bcigjk", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Streay", "link_flair_text": "Discussion :table:", "time": 1710709094.30113, "created_utc": 1710200865.0, "url": "https://www.reddit.com/r/aliens/comments/1bcigjk/whistleblower_dies_days_after_testifying_against/", "title": "Whistleblower dies days after testifying against Boeings safety protocols ", "permalink": "/r/aliens/comments/1bcigjk/whistleblower_dies_days_after_testifying_against/", "selftext": "He allegedly committed suicide in his truck, days after his testimony. \nI firmly believe that he was ~~Epsteined~~ Lincolned, which makes me wonder who else they’ve killed to keep secrets.\nWe all know that Boeing has a tight relationship with the US military, and people have speculated that they are one of the leading conglomerates reconstructing UAP’s. It’s now evident that they are willing to murder to keep things from going public, so it’s pretty easy to imagine that they’ve done this before.\nAny thoughts?", "media": null, "score": 2669, "upvote_ratio": 0.93, "comment_count": 254, "over_18": false}, "4": {"id": "1bd85yl", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Video", "time": 1710709094.8577285, "created_utc": 1710276577.0, "url": "https://v.redd.it/alld67r9uync1", "title": "Breaking Points segment on AARO's Historical Report: “The idea that an agency that has been unable to pass its own audit for 5 years can effectively now audit all of its historical programs going back to 1945 & claim any sort of legitimacy in the eyes of the public… totally ridiculous.”", "permalink": "/r/UAP/comments/1bd85yl/breaking_points_segment_on_aaros_historical/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/alld67r9uync1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 472, "width": 854, "scrubber_media_url": "https://v.redd.it/alld67r9uync1/DASH_96.mp4", "dash_url": "https://v.redd.it/alld67r9uync1/DASHPlaylist.mpd?a=1713301094%2CNmRkYjAyMWIyMTkzNDIzMmE3NWQ3NGUyMDY2Y2I3NWU1MGQwZGJhZGU4MmUxODhkNmU1YTFkNzdkNWE4YTc2NQ%3D%3D&v=1&f=sd", "duration": 406, "hls_url": "https://v.redd.it/alld67r9uync1/HLSPlaylist.m3u8?a=1713301094%2CY2IzYjFlZDBlMGQ2NzM2YWMzNDQ4NGVmZmEyZTkxODg5NjQ3MmEwOTQ4Yjg5NDc3ZmMyZTE0OWYxYTNjMmM5ZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 153, "upvote_ratio": 0.97, "comment_count": 3, "over_18": false}, "5": {"id": "1bdgtlq", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Kaylee0102", "link_flair_text": null, "time": 1710709095.8836067, "created_utc": 1710298699.0, "url": "https://i.redd.it/ipxruy83o0oc1.png", "title": "This is an actual, real life, conspiracy.", "permalink": "/r/conspiracy/comments/1bdgtlq/this_is_an_actual_real_life_conspiracy/", "selftext": "", "media": null, "score": 4834, "upvote_ratio": 0.96, "comment_count": 360, "over_18": false}, "6": {"id": "1bfqhwk", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1710709096.2381036, "created_utc": 1710541907.0, "url": "https://youtube.com/live/S_l3w9WuJ5M", "title": "The Smithsonian deeply regrets the manner in which it accumulated its extensive assortment of human remains, involving the involvement of Dr. Wu, who was employed at the institution with proper security clearance.", "permalink": "/r/conspiracyfact/comments/1bfqhwk/the_smithsonian_deeply_regrets_the_manner_in/", "selftext": "", "media": null, "score": 6, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "7": {"id": "1bd5juv", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Mister_Ape_1", "link_flair_text": "question", "time": 1710709096.5749364, "created_utc": 1710270341.0, "url": "https://www.reddit.com/gallery/1bd5juv", "title": "To everyone who ever saw a Bigfoot - who out of these looks like it ?", "permalink": "/r/bigfoot/comments/1bd5juv/to_everyone_who_ever_saw_a_bigfoot_who_out_of/", "selftext": "", "media": null, "score": 157, "upvote_ratio": 0.9, "comment_count": 208, "over_18": false}, "8": {"id": "1bfdgiq", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Evidence", "time": 1710709097.0657208, "created_utc": 1710507781.0, "url": "https://i.redd.it/jd5tduotxhoc1.png", "title": "This photograph of a large feline was taken in Sidney, Maine back in 2007. There was debate as to whether the photograph depicted a bobcat, a mountain lion (which are believed to be extinct in Maine), a hoax, or an unknown species all together.", "permalink": "/r/Cryptozoology/comments/1bfdgiq/this_photograph_of_a_large_feline_was_taken_in/", "selftext": "", "media": null, "score": 378, "upvote_ratio": 0.97, "comment_count": 80, "over_18": false}, "9": {"id": "1bgad4l", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "TheRealMurderherder", "link_flair_text": "Humanoid", "time": 1710709097.2040038, "created_utc": 1710607595.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1bgad4l/a_strange_encounter_near_a_government_facility/", "title": "A strange encounter near a government facility.", "permalink": "/r/Humanoidencounters/comments/1bgad4l/a_strange_encounter_near_a_government_facility/", "selftext": "I was just reminded about a strange guy I encountered while working the register on a food truck near a government facility. NM, USA\nA little under 4 years ago I was working a typical shift running the register on a fairly busy food truck near a government facility. We would average 50+ customers for lunch and most were regulars, but we had a lot of new faces every day.\nOne day I get this very average looking white guy, non-descript, I couldn't pick him out in a line up. He comes to the window and asks, \"what is this?\". Unamused I tell him \"food truck, what do you want?\". He looks confused and says something along the lines of \"what do you serve on this food truck?\" I point to the sandwich board beside the window and wait. He glances at the board then asks, \"what is on a hamburger?\" like he's never heard of it before.\nI list off the regular ingredients quickly, \"burger, bun, choice of cheese, LTOP, and side of fries.\" He considers it for a moment then asks, \"what's a quesadilla?\" Some people don't know so I tell him what's in it.\nHe goes through each of the 8 or 9 items we had asking the same questions about everything. He decides on a cheeseburger and I give him the total, I think it was $12?He stares at me then hands me a $20 bill and walks away. I send the ticket to my grill and and put the change aside for when he comes back for his food. I never assume a tip unless it was mentioned as such.\nHe comes back for the food and opens the container and kinda stares at it in wonder. I offer him his change and he looks at me like he's never seen me before and walks away without his change.\nHis tone was very deliberate, like he was trying to not sound weird. The accent wasn't foreign but I couldn't pinpoint what region it was from (southern, Boston, Midwest, etc.). I've spoken to people from all over the world and can usually pinpoint a dialect but this guy was just off.", "media": null, "score": 468, "upvote_ratio": 0.97, "comment_count": 103, "over_18": false}, "10": {"id": "1bfs6ho", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "scottdude8131", "link_flair_text": null, "time": 1710709097.5377784, "created_utc": 1710546384.0, "url": "https://i.redd.it/yopb1hol4loc1.png", "title": "I told you it was real.", "permalink": "/r/cryptids/comments/1bfs6ho/i_told_you_it_was_real/", "selftext": "", "media": null, "score": 144, "upvote_ratio": 0.91, "comment_count": 40, "over_18": false}, "11": {"id": "1bd5vy3", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "RobinJeans21", "link_flair_text": "Discussion/Advice", "time": 1710709097.7534208, "created_utc": 1710271146.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1bd5vy3/40_years_ago_dover_delaware_traffic_stopped_to/", "title": "40 years ago Dover Delaware traffic stopped to floating car. ", "permalink": "/r/Thetruthishere/comments/1bd5vy3/40_years_ago_dover_delaware_traffic_stopped_to/", "selftext": "My dad has this story he always says that when he was about 10-12 years old. They were on route 13 in Dover Delaware which is home to Dover Air Force Base. But about 40-45 years ago him and his parents were driving, and there was about 20+ cars all stopped on the road. Getting out their car and looking up to which looked like “the Batmobile” just floating there stationary, for a minute or 2. And then just flew off. Everyone insisted it was a ufo but cameras weren’t really a thing at the time I guess. \nMy grandparents said they could confirm it happened and a bunch of witness saw it too but the witnesses were strangers at the time and they couldn’t find any newspapers or anything about it anywhere. Wondering if anyone out there knows about it this too. Could have been the Air Force base aircraft but the way 20+ random cars were parked on route 13 along with him and my grandparents all starring in shock makes it interesting. ", "media": null, "score": 58, "upvote_ratio": 0.94, "comment_count": 2, "over_18": false}, "12": {"id": "1bcttue", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "BrilliantBex1992", "link_flair_text": null, "time": 1710709097.8962872, "created_utc": 1710238716.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1bcttue/someone_is_watching_me_update_3/", "title": "Someone is watching me update 3", "permalink": "/r/LetsNotMeet/comments/1bcttue/someone_is_watching_me_update_3/", "selftext": "I honestly wish I wasn’t writing this right now. I’ve had weeks of peace, with only the ping of my overactive camera system alerting me to people passing by with their dogs or children. I thought everything was fine, and maybe this isn’t the most dramatic update, but it was just another scary tick mark to add to the list.\nI got an alert to activity outside the garage. Given my garage door crowbar banger that’s the one I always pay most attention to honestly. I keep weird hours and hadn’t been on my phone so at first thought my dad was leaving for work. \nThen I saw the recording it made instants later. This man walked boldly up to the car in the driveway (my mom’s at the moment) and tried the handles of the doors before running off. I called the police with a good description and told them I have it on video, but my town doesn’t have a large police force, and some of them are just like in any department: shady and lazy. \nI’ve rewatched it so many times now, and he has the same build as the man I saw at the garage before. That’s obviously not definitive, but now I have more details about his description I couldn’t see before due to lack of lighting and cameras. \nI’m still pretty shaky, even though he didn’t try to get in or anything, I was outside not half an hour ago (though in the fenced backyard) I hope this isn’t a lame update. It feels like it to me because still nothing is solved, and even though it might be unrelated, is that actually probable? That one person and/or their house would attract so much trouble from completely different individuals? It doesn’t seem likely. \nTo the man outside my house tonight, let’s never meet.\nEdited to add: this man saw the camera before he ran. I don’t know if he would have tried more had he not, but it has little red and blue lights on the front part (that rotates a full circle) so even I’ve noticed it. It’s large and lights up a bit. That’s why I thought they’d deterred creeps so far. Just forgot to put that in because I don’t think I’m exactly in a great headspace \nSecond edit of night: was visited by the police who very kindly didn’t ring the bell (parents asleep, have been texted about all of this) I gave all the evidence, and they’d found the guy!!!! I don’t know for absolute sure it was the same man that banged on my garage or watched from the window, but I do know that they caught this guy, and my video footage will be used I guess? Idk. I was really doubtful they’d actually send someone due to the chastising text message (non emergency was closed lol, so I called the reg line) as I’d mentioned in an earlier post about this incident, my dad had told me there had been a lot of car thefts in the neighborhood.\nWeirdest part to me, that I think I must just be fucking imagining, is that he looks (from the somewhat fuzzy camera stills) quite a bit like the guy I had a one night stand with a couple months ago right around when this all started. I really didn’t think it could be him, but I’m hoping that since I’m supposed to get the ring footage to the officer tomorrow (don’t have access to that one) I can ask who this person is. I’m hoping it’s all over now, and am so thankful for those who provided me with great advice, which gave me a lot of comfort. Unless I’m wrong and there is a second person (statistically unlikely) this will be my last update on a thankfully closed chapter", "media": null, "score": 124, "upvote_ratio": 0.91, "comment_count": 28, "over_18": true}, "13": {"id": "1ben9qw", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "soundguy_2603", "link_flair_text": null, "time": 1710709098.0156457, "created_utc": 1710428564.0, "url": "https://www.reddit.com/r/truecreepy/comments/1ben9qw/i_think_the_cruise_company_i_worked_for_is/", "title": "I think the cruise company I worked for is covering up my friends disappearance.", "permalink": "/r/truecreepy/comments/1ben9qw/i_think_the_cruise_company_i_worked_for_is/", "selftext": "Right, I know this is a long post but I’m leaving in a few days and I wanted to be sure I got it all out there. If something happens and I don’t come back, at least I’m not the only one who knows the truth.\nI started working on cruise ships a few years ago. It’s definitely a strange job; you’re cooped up with your co-workers 24/7 for weeks on end. People hook up, people fight. And it isn’t for everyone. Some times people get off at a port and never come back. What I’m saying is that I am used to the usual cruise ship weirdness. But this was different.\nI’d been an AV techie for a few different ships in the Caribbean when a friend of mine suggested I check out Velorum. Their ships were really fancy, which means better equipment and better pay. So I applied and, even though I was less experienced than they were looking for, I got the gig.\nIt started off pretty normal, you know, just another job on the high seas. It was definitely stricter than other ships I’d been on. Like, crew wasn’t allowed on the promenade unless they were working and we’re not meant to be above deck at all during our off hours. It didn’t really effect me because I worked with the theatre team and was had access to pretty much every where, but you’ve got to understand, weeks at sea and not being allowed topside is pretty intense for some people. So at first I took everything in stride, but looking back I should have noticed something was off from the start.\nFrom day one, there was this vibe on the ship, like everyone was keeping secrets. Certain crew members were always whispering and shoot each other these looks, like they were afraid of something. At first I thought it was just because everything was so strict, you know. Just people trying to keep their jobs. But they seemed genuinely scared of something.\nUsually these ships are like a total party for crew, but this one was just the opposite. Everyone really kept to themselves. To be honest, I thought I might just quit- it really didn’t seem like the place for me. But then I met Chloe. She was a new member of the theatre team, so we got to know each other a bit during the show. I was putting her mic on and told some stupid joke about hearing her heart beat faster, but then she laughed. Pretty soon, we were spending all our free time together. Man, she was something else—funny, smart, and super cute. I’d had a policy not to date anyone on the ships before, but she really was different. There isn’t a lot of privacy on these cruises, but we found places we could be alone. Just because we weren’t allowed topside, that didn’t stop us from exploring every nook and cranny of that ship.\nI’d sort of forgotten about the weirdness at this point. The vibe was definitely still off, but with Chloe around I didn’t really care. I didn’t notice when people started disappearing. People do have a tendency to jump ship from these jobs but this was like poof, gone without a trace. All their stuff still in the cabins- passports, everything. Looking back now, it’s so obvious something was up. I wished I’d noticed sooner… maybe I could have done something to protect Chloe.\nSo, one of the people to go missing was Chloe's friend, Pippa. I didn’t really get to know her, but most of the actors hung around together and Chloe really liked her. I know fact that she just vanished was a bit strange, but like I say, people come and go from these ships all the time so I didn’t think too much about it. But Chloe was upset so I agreed to help her look into it. The really weird part was that, when we asked around, no one seemed to want to talk about it. Like, fine, people leave- but why the secrecy?\nI began to get the feeling that something was seriously messed up on that ship. Chloe and I made a plan, that we’d hide some microphones in the officer’s mess hall and see if we could find anything out. Looking back now I just wish we’d left it alone. I set Chloe up with a few lav mics- they’re small but they get good range. She was supposed to plant them in the mess and then we were going to meet in one of our secret hiding spots to see what we could hear. It was all going well at first- the officers all lust after the cast, so Chloe found it really easy to talk her way in. But then things took a turn. I think one of the officers must have noticed what Chloe was doing. They all stopped talking all of a sudden, even Chloe. Two of the mics went dead immediately, but the third one was still on. I heard someone say something I couldn’t quite make out- I think Chloe must have had the mic hidden on her somewhere. But I swear it sounded like they said ‘throw her over.’\nI ran to the officer’s mess, but I was too late- they were gone. I tried to follow the sounds on the mic to find her- I could hear the wind so I knew they were on deck somewhere. I must have run all over that ship. Then, suddenly, the signal went static and disappeared. Look, I’ve been a sound engineer on a ship for while, I know what it sounds like when a microphone gets wet. I think they threw Chloe overboard.\nWhatever happed, she was gone. I searched the ship from top to bottom, but there was no sign of her anywhere. I reported it to my duty officer, but he totally dismissed me; said that I couldn’t accept being dumped. But I knew it was something else. I knew what I’d heard. A few days later I got a text message from Chloe’s phone. It said that she was sorry she’d left without saying anything but that she thought it was easier than going through a break up on a ship. I couldn’t believe it. It really seemed like someone was covering it up now.\nI was devastated. I’d only known Chloe a short time, but she was everything to me, and now she was gone, and I felt responsible. I didn’t stay on the ship long after that. I knew I had to do something- I owed Chloe that much.\nSo, I went on a mission, diving head first into the dark corners of the internet, looking for anything to help me uncover the truth behind these disappearances. I’d heard about something happening on another Velorum cruise ship, about the staff rebelling. That’s when I found Lauren. Together we’ve been piecing everything together, and I think it’s bigger than we could have imagined.\nIt looks like the same people who own the cruise line have started this wellness retreat in Slovenia. I heard about it in one of the forums and I’ve managed to get myself hired as their sound engineer. Like I said, I don’t know what I’m going to find when I get there, but I know its not good. Hopefully Lauren and her friends can help me bring the truth to light.\nI’ve got a friend running this account while I’m away (thanks, Steve!), but hopefully I’ll be able to give you guys a proper update when I’m home. I don’t know what we’re going to find at this festival, but I hope we get some answers, for Chloe if nothing else. Wish me luck- I think I’ll need it.\nTL:DR - I think the cruise company I worked for is covering up my friends disappearance.", "media": null, "score": 0, "upvote_ratio": 0.43, "comment_count": 20, "over_18": false}, "14": {"id": "1bedde9", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Dear_Response_519", "link_flair_text": null, "time": 1710709098.164153, "created_utc": 1710392599.0, "url": "https://www.reddit.com/r/threekings/comments/1bedde9/are_you_dumb_enough_to_try_the_shadow_weavers/", "title": "Are you dumb enough to try the Shadow Weaver’s Gauntlet?", "permalink": "/r/threekings/comments/1bedde9/are_you_dumb_enough_to_try_the_shadow_weavers/", "selftext": "Alright, strap in. You’re clearly hunting for the kind of truth that only comes from staring straight into hell’s eyes. I’m not here to sugarcoat or sell you bedtime stories. This is about the Shadow Weaver’s Gauntlet, a trip down the darkest rabbit hole you can imagine. I survived, but don’t think for a second that makes it a path worth following. \nBut hey, if you’re hell-bent on ripping open the veil to the other side, be my guest. Just know, I’m sharing this to save your ass, not to send you sprinting into the fire.\nBut let’s talk brass tacks — the rewards, because if you’re really going to dance with the devil, you better know what’s up for grabs. Surviving this hellride, standing toe-to-toe with the Shadow Weaver and not blinking, it changes you. Not just mentally; I’m talking about knowledge that’s potent, dangerous, the kind that gives you an edge in a world that’s otherwise flat and gray. We’re talking secrets that could shift the balance of power, insights that could crack open the universe’s silent whispers. Wealth, influence, the keys to hidden doors you didn’t even know existed. But here’s the kicker — it’s all nothing if you can’t handle the heat. This isn’t winning the lottery; it’s earning the right to play god, even if it’s just for a moment. So, weigh your soul, measure your sanity, and be damn sure you’re ready to risk it all.\nWhat’s on the line? Everything. Screw up this ritual, step out of that circle, lose sight of your anchor, or get cozy with the shadows, and you’re not just screwed – you’re royally fucked. You crack open that door, and you’re not just letting in a draft; you’re rolling out the red carpet for a nightmare that doesn’t know how to let go or move on.\nThe poor bastards who screw up? They’re never the same. They turn into walking ghosts, haunted, eyes dead from whatever horrors clamped onto their souls. People toss around words like “crazy” or “broken,” but it’s way worse — it’s like they’ve got a chunk of the Shadow Weaver’s nightmare rotting right in their core.\nA lot of them, they can’t handle that kind of torture. They check out early, thinking they’re escaping the pain. But here’s the twisted part: offing yourself doesn’t cut ties with the Weaver. Hell no. You think that thing plays fair? Dying’s just a one-way ticket to its home turf, a place so fucked up, our world’s worst day would feel like paradise. So, yeah, there’s no easy out. You botch this ritual, and you’re in the Weaver’s grip, here or in the beyond.\nListen, I’m not here to freak you out. I’m just here to hammer in the reality of what you’re messing with. Think of it like juggling flames – sure, it looks badass, feels powerful, but one wrong move and you’re not just nursing a burn. You’re watching everything you love turn to ash. This is high stakes, no bullshit – you play this game wrong, and the fallout is on you, and it’s brutal.\nIf you’re reading this, chances are you’re curious, maybe even tempted. Maybe you’ve been dealt a few more bad hands in life than those around you, and you’re looking for something beyond this world to even the odds for once in your fucking life. I was like you once, tired of seeing everyone around me fly by with half the effort, leaving me behind in the dust - always wondering what I could’ve done better. Enough of living that life will make anyone turn to something as insane as this.\nHonestly, you’ve got to be at rock bottom, scraping the barrel of desperation, to even think about diving into this mess. And no, there’s no magic force field stopping you; it’s just plain old common sense. If your life hasn’t hit peak disaster, you wouldn’t even dream of attempting this crap. You’re there thinking, “It can’t get worse, right?” Wrong. Sure, the rewards sound tempting, like a shiny lure in murky waters, but mess this up, and you’ll be praying for a ticket back to your previous crapfest of a life. Trust me, “shitty” will seem like paradise compared to the hell you’ll unlock if you fuck this ritual up.\nYou need a spot dead silent, pitch black; even moonlight’s pushing it. Kill all the lights, every last one. I mean, go nuts — unplug, tear out, whatever it takes. A single LED blip, and you’re better off deep throating a shotgun because this thing, this ancient freak, it doesn’t play with half-measures. It’s old school, real old school, not fooled by our modern-day loopholes. \nAnd get this straight – you’re not the exception, you’re not gonna be the one to bend its will. You’re not that guy pal, you’re not that guy.\nNow, get your gear together: salt for your circle, a mirror, and a black candle – and I swear, if you grab a different color, you’re signing your own damn death warrant. Then, matches (none of that lighter crap), something personal for your anchor (and it better mean something real), and a proper timekeeper. No digital shit. Pull out your phone and you’re practically inviting it to mock you before tearing you apart. Keep it old school, or you’re asking for it.\nKick things off at 11:00 PM sharp. Draw that salt circle like it’s the only thing standing between you and hell — because it is. Make it big enough to fit you and all the crap you’re dragging along, fear included. Drop your anchor inside; that’s your lifeline, what keeps you anchored to the real world. Place the mirror outside your circle, staring right at you, and put the candle between you and your reflection, all cozy within your salt haven.\nAs midnight crawls closer, your ticker’s gonna ramp up, and your head’s gonna fill with every doubt it can muster. It’s like your very soul’s trying to slam the brakes on this whole nightmare, like it recognizes the act that you’re about to perform and is doing everything in its power to prevent you from going through with it. Tough. Ignore it. Light up that candle at 11:50PM and snuff it out the moment midnight hits. What comes next is a breed of dark so thick, so suffocating, you’ll swear it’s alive, clawing out every speck of light from around you. That’s when you know you nailed it. \nWelcome to the main event. The darkness around you? It’s about to get personal, thick and heavy like it’s got a grudge.\nIt’s pitch-black, just you and the creeping dread. But then, if that damn candle lights up again on its own, know this: you’re in deep shit.\nThat ain’t no miracle or good luck; it’s the Shadow Weaver playing its sick games. It’s testing you, throwing down the gauntlet. If you just sit there, letting that candle burn, thinking you’ve got some divine intervention on your side, you’re screwed. It’s not being friendly; it’s laying a trap, baiting you like a fish. Light that shouldn’t be there? It’s a big, flashing neon sign screaming danger.\nYou kill that light as fast as you can. If you don’t, if you let that candle keep burning, you’re opening the floodgates to a world of torment. The darkness doesn’t just stay darkness anymore; it morphs, feeds on your fear, grows thicker\nSo, rule of thumb: Candle lights up by itself? Snuff it out, ASAP. No hesitations, no second guesses. That’s your lifeline to not getting dragged down into the Weaver’s twisted game. Keep that flame dead until it’s your time to end the game, not when the shadows decide to mess with you.\nWhile you’re wrestling with the whole candle shitshow, be ready for a real mind-fuck: visions straight out of your nightmares, every screw-up you’ve ever made, could start parading around like it’s their goddamn debut. These aren’t just bad memories; they feel real, like you’re living them all over again, so much that you might forget you’re stuck in this hellish ritual.\nNow listen, and listen good: Don’t stare at them. Keep your eyes glued to your own reflection. Remember who the hell you are, that you’re flesh and blood, not some phantom from your past. And the mirror – if you catch a glimpse of any eyes staring back that aren’t yours, human or not, don’t you dare lock eyes with them. That’s game over, buddy. That’s when you slide from ‘fucked up night’ to ‘eternal horror movie extra’.\nThe trick here? Stay selfish. It’s all about you. That entity, that Shadow Weaver, it’s going to pull every dirty trick to rip your attention away, to drown you in fear and doubt. But you’ve got to keep your focus sharp, your eyes on your own face. This is one time being a self-centered asshole might just save you. \nThis also might be a good time to say that self centered narcissistic assholes will fare better at completing this ritual than other, more selfless individuals.\nDuring this nightmare, when you’re teetering on the edge, you might hear the Shadow Weaver. This thing, it’s cunning. It’ll start sweet-talking you, telling you all you need to do is give in, step out of that salt circle, and all the terror, all the madness will stop. It’ll promise freedom, peace, whatever it thinks will make you crack. \nIt’s not just going to whisper; it’s going to beg, plead, promise you everything to make you step out of that circle. It’s like hearing the sweetest lie when you’re desperate to believe in anything.\nBut here’s the cold, hard truth: If you listen, if you break, and step out? That’s it. You’re done. You haven’t just lost a game; you’ve opened your door to a lifetime of horror.\nImagine an existence where every moment is agony, where you’re endlessly torn apart and stitched back together in the dark corners of reality, a plaything for an entity with no mercy. Your soul becomes entangled in an eternal dance of suffering, a state so horrifying that the life you once knew will seem like a distant, unreachable dream.\nIt’s like being trapped in a nightmare, every second of every day, without end. Your soul won’t just be lost, it’ll be the Shadow Weaver’s plaything, subjected to unspeakable horrors, forever.\nHold your ground, remember what’s at stake. The Weaver’s promises are poison, its assurances are lies. Your only salvation, your only path to dawn, is to endure, to deny the darkness, and to keep your soul fiercely anchored to the light of your own resolve.\nThis ordeal, this nightmare, lasts until 3:33 AM. When the clock strikes 3:33 AM, the nightmares, the whispers, the shadows – they’ll all vanish. It’s not gradual; it’s like someone flipped a switch, leaving behind a silence so profound it echoes.\nBut here’s where they get you one last time. exhaustion will hit you like a freight train. Your bones will feel like lead, your body screams for sleep, every muscle begging for just a moment of rest. Don’t fucking do it. Let me repeat it a bit louder for the folks in the back: DONT FUCKING FALL ASLEEP. \nThis is the final play, the Shadow Weaver’s last chance to drag you down.\nStay awake no matter what you have to do. I can’t stress this enough. If you collapse into slumber before the sun peeks its first light, before 6:00 AM rolls around, you’re not just risking a bad dream. It’s not about waking up groggy or with a stiff neck. No, we’re talking about waking up to a life that’s no longer yours, trapped in a mind shattered beyond recognition, or worse, not waking up at all. This is the Weaver’s domain; in sleep, it has free reign over you, your memories, your sanity.\nHold out until dawn, keep those eyes wide open, no matter what. Because if you make it, if you push through the exhaustion and the night’s horrors, the prize is there: knowledge so potent, so earth-shattering, it could rewrite history, redefine the future, or dismantle reality as we know it. Wealth, power, secrets of the universe laid bare before you.\nBut remember, this isn’t a fairy tale. The scars from this night, they’re not just going to fade away.\nNo amount of booze, pills, or therapy is going to scrub away what you’ve seen, what you’ve felt. That’s the price of this so-called gift. Sure, you’ll be changed, maybe even powerful, but at what cost? Just remember what you’re trading in for that knowledge; remember what’s clinging to your back, whispering in your ear every time the clock hits 3:33 AM.\nEvery person I’ve tried to spill my guts to thinks I’ve lost my damn mind. They give me those pitying glances, the ones reserved for the hopelessly insane. \nMaybe scribbling this nightmare into words is supposed to give me some sort of closure, or maybe I’m just trying to offload a piece of this darkness onto someone else. I don’t know.\nBut here’s the straight shit: if your life is so fucked up, so utterly devoid of anything worth clinging to that you’re considering calling on the Shadow Weaver, think long and hard. You better be damn sure you’re ready to gamble everything — your sanity, your soul, your very existence. Because once you start this twisted game, there’s no hitting pause, no second chances. You’re playing for keeps against something that’s been playing this game for millennia. So, I’ll leave you with this — if you’re desperate enough to walk this path, just remember, you might just end up wishing you hadn’t. \nBecause some truths, some powers, they ain’t worth the hell they drag you through.\nI’ll tell you what though, dealing with the trauma is at least somewhat manageable on my super yacht with 60 crew members, that much is certain ;)", "media": null, "score": 10, "upvote_ratio": 0.81, "comment_count": 13, "over_18": false}, "15": {"id": "1bbyqjq", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Mobile-Ad-9187", "link_flair_text": "WDYT? (What Do You Think?)", "time": 1710709098.804887, "created_utc": 1710147431.0, "url": "https://www.reddit.com/r/Ghosts/comments/1bbyqjq/i_have_a_feeling_this_sub_is_made_for_people_to/", "title": "I have a feeling this sub is made for people to debunk every ghost sighting caught on camera ever. ", "permalink": "/r/Ghosts/comments/1bbyqjq/i_have_a_feeling_this_sub_is_made_for_people_to/", "selftext": "", "media": null, "score": 162, "upvote_ratio": 0.75, "comment_count": 103, "over_18": false}, "16": {"id": "1bbowvy", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "JayyNoZ666", "link_flair_text": "Glitch Pic", "time": 1710709099.0765324, "created_utc": 1710114405.0, "url": "https://www.reddit.com/gallery/1bbowvy", "title": "Weird tree around the corner from my house", "permalink": "/r/GlitchInTheMatrix/comments/1bbowvy/weird_tree_around_the_corner_from_my_house/", "selftext": "", "media": null, "score": 262, "upvote_ratio": 0.75, "comment_count": 76, "over_18": false}, "17": {"id": "1bc1k5b", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Outrageous-Inside475", "link_flair_text": "Discussion", "time": 1710709100.6323996, "created_utc": 1710158635.0, "url": "https://www.reddit.com/r/ufo/comments/1bc1k5b/i_know_something_big_but_cant_disclose_it/", "title": "“I know something big but can’t disclose it.”", "permalink": "/r/ufo/comments/1bc1k5b/i_know_something_big_but_cant_disclose_it/", "selftext": "Who here is starting to get tired of hearing this line from UAP whistleblowers/journalists? If they can’t even disclose what they know to the public, what makes them any different from those gatekeepers in the government? This is starting to look like a joke.  \nAll these hyping looks like they’re just milking the public for youtube views, selling books and posting another documentary about topics we already heard before. I’ve been following this since the UAP hearing last year and it feels like a bottomless pit of conspiracies that gets frustrating by the minute. I can’t imagine other people following this for years. ", "media": null, "score": 294, "upvote_ratio": 0.84, "comment_count": 180, "over_18": false}, "18": {"id": "1be78d5", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "KOOKOOOOM", "link_flair_text": "News", "time": 1710709101.7583532, "created_utc": 1710374719.0, "url": "https://v.redd.it/7ri0dkguw6oc1", "title": "Rep. Tim Burchett tells NewsNation the Pentagon is lying about UFOs", "permalink": "/r/UFOs/comments/1be78d5/rep_tim_burchett_tells_newsnation_the_pentagon_is/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/7ri0dkguw6oc1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/7ri0dkguw6oc1/DASH_96.mp4", "dash_url": "https://v.redd.it/7ri0dkguw6oc1/DASHPlaylist.mpd?a=1713301101%2CYzc5MDNlOTJiMWU1YzU5ZTJkYTJjYjgwNGFlNjU4YWY3MGVlNWYyZmVhNzZkZWY3MzQ4MzE3MjJhMDlmODE4NQ%3D%3D&v=1&f=sd", "duration": 118, "hls_url": "https://v.redd.it/7ri0dkguw6oc1/HLSPlaylist.m3u8?a=1713301101%2CNmQ5ODU4NzNkZmU1YjMzODE0NTFlNzFjMjg3ZWZhZGRkYmQ4ZmIwYzk0MTNkMzc3ZGFhYjQ2NWNmNDY1MGQ0OQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2478, "upvote_ratio": 0.9, "comment_count": 292, "over_18": false}, "19": {"id": "1bbtlez", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "DragonfruitOdd1989", "link_flair_text": "Evidence :upvote:", "time": 1710709103.62177, "created_utc": 1710127699.0, "url": "https://i.redd.it/5eva0damjmnc1.jpeg", "title": "Meet Sebastian the new Three Finger Non-human going to be presented on Tuesday.", "permalink": "/r/aliens/comments/1bbtlez/meet_sebastian_the_new_three_finger_nonhuman/", "selftext": "", "media": null, "score": 1331, "upvote_ratio": 0.82, "comment_count": 491, "over_18": false}, "20": {"id": "1be65kt", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Smurphilicious", "link_flair_text": null, "time": 1710709104.1663098, "created_utc": 1710371995.0, "url": "https://www.reddit.com/r/UAP/comments/1be65kt/stephen_j_hadley_knows_reddits_director_of_policy/", "title": "Stephen J Hadley knows Reddit's Director of Policy", "permalink": "/r/UAP/comments/1be65kt/stephen_j_hadley_knows_reddits_director_of_policy/", "selftext": "Adding on to a post that /u/governmentsalllie made in /r/UFOs because suppression or not, it seems like people still just genuinely aren't \"getting\" it. \nWhen the talking heads say that \"they can't control social media the same way they control MSM\", they are wrong. I tried to show people with my terrible video editing skills, but I don't know how to sufficiently present the scale of this problem. So here's another glimpse.\nHere is Reddit's Director of Policy. I can't type out her name, because Reddit filters for mentions of her.\n\nShe is based in San Francisco, where she is Director of Policy for Reddit, the online discussion platform. In this capacity, she addresses a range of online and technology policy issues, from fake news to online terrorist recruiting. Previously, from 2015 to 2017, She served as Deputy Director for Madeleine Albright and Stephen Hadley’s bipartisan Middle East Strategy Task Force at the Atlantic Council.\nShe is a term member of the Council on Foreign Relations and holds a doctorate in international relations from the University of Oxford (St. Antony’s College), which she attended as a Marshall Scholar. Her doctoral research focused on ideological and bureaucratic infighting in US foreign policy toward the Middle East.\n\nAre you guys \"getting it\" yet? The never-ending infighting, the botnets stoking a cult-like atmosphere in the subreddits?\n\nHadley is also an Executive Vice Chair on the Board of Directors at the Atlantic Council and is on the Board of Directors at defense contractor Raytheon.\n\nHer last post is here\n\nFriendly reminder that Reddit hasn't published their warrant canary since 2015.\nA warrant canary is a method by which a communications service provider aims to inform its users that the provider has been served with a secret government subpoena despite legal prohibitions on revealing the existence of the subpoena. The warrant canary typically informs users that there has not been a secret subpoena as of a particular date. If the canary is not updated for the time period specified by the host or if the warning is removed, users are to assume that the host has been served with such a subpoena. The intention is to allow the provider to warn users of the existence of a subpoena passively, without disclosing to others that the government has sought or obtained access to information or records under a secret subpoena.\n\nShe became Director of Policy in June 2017\n\nThe other thing they failed to publish in 2018 was any data on foreign influence campaigns on the platform.  The 2017 report had almost 1000 accounts and tens of thousands of pieces of content.  \nThe 2018 report contained nothing.  On the issue of foreign influence, reddit's transparency has been been, horrendously bad.  Twitter has roughly the same size user base, and has to-date released over 10 million pieces of content posted by influence campaign trolls.  \nWe know foreign influence campaigns are still here, preying on us. According to one admin, they've caught 238% more influence campaign trolls last year, compared to this year!  \nBut they haven't told us at all who they were, and what they were doing.  That prevents researchers and policy makers from studying the problem of foreign influence, and it prevents all of us from understanding the ways in which we're being preyed on here on reddit.\n\nAre you seeing the web yet? I constantly share the same clip of the Guardian's investigation of Team Jorge\nBut people don't understand how many of these groups are out there. How prevalent they are in social media. \n\nThe Israeli Defense Forces’ (IDF) Unit 8200 is infamous... Spying on the world’s rich and famous, Unit 8200 hit the headlines last year, after the Pegasus scandal broke. Former Unit 8200 officers designed and implemented software that spied on tens of thousands of politicians and likely aided in the killing of Saudi journalist Jamal Khashoggi.\nAccording to employment website LinkedIn, there are currently at least 99 former Unit 8200 veterans currently working for Google.\nMeta – the company that owns Facebook, Instagram and WhatsApp – has also recruited heavily from the ranks of Unit 8200.\nData from LinkedIn suggests that there are at least 166 former Unit 8200 members who went on to work for Microsoft.\nAs Israeli newspaper Haaretz noted in an investigation, “Israel has become a leading exporter of tools for spying on civilians,” selling invasive surveillance software to dozens of governments, many of them among the world’s worst human rights abusers. In Indonesia, for instance, the software was used to create a database of gay people.\nThe most well-known example of Israeli spyware is Pegasus, a creation of NSO Group, a technically private company staffed primarily by Unit 8200 veterans. The software was used to eavesdrop on more than 50,000 prominent people around the world. This included dozens of human rights defenders, nearly 200 journalists, several Arab royals, and over 600 politicians, including French president Emmanuel Macron, Pakistani prime minister Imran Khan and Iraqi President Barham Salih.\nPegasus works by sending a text message to a targeted device. If a user clicks on the link provided, it will automatically download the spyware. Once infected, it is possible to track an individual’s location and movements, take screenshots, turn on the phone’s camera and microphone, retrieve messages and steal passwords.\n\nSo when I mentioned RTX's connection to Israel in Hadley's post, that was why. That's your \"gatekeeper\".\n\nHadley is also an Executive Vice Chair on the Board of Directors at the Atlantic Council and is on the Board of Directors at defense contractor Raytheon.\nRTX Corporation, formerly Raytheon Technologies Corporation, is an American multinational aerospace and defense conglomerate headquartered in Arlington, Virginia. It is one of the largest aerospace and defense manufacturers in the world by revenue and market capitalization, as well as one of the largest providers of intelligence services.\nRTX manufactures aircraft engines, avionics, aerostructures, cybersecurity solutions, guided missiles, air defense systems, satellites, and drones.\nThe company, which changed its name to RTX in July 2023, has three subsidiaries: Collins Aerospace, Pratt & Whitney, and Raytheon (formerly Raytheon Intelligence & Space and Raytheon Missiles & Defense).\nRTX's supply of weapons to Israel led to protests against the company during the 2023 Israel–Hamas war. On December 14, 2023, for example, protestors blocked the entrance to an RTX facility in Arizona. In early 2024, 15 people were arrested after blocking access to RTX and BAE Systems facilities in Louisville, Kentucky in protest against supplying weapons to Israel.\n\n\nHere's a nice little collection of articles all about this particular censorship problem, all of them written by Alan Macleod. I'm impressed Alan. Well Done. Nice to see real journalism for a change. (looking at you, Coulthart. Pathetic.)\n\nAlan MacLeod is Senior Staff Writer for MintPress News. After completing his PhD in 2017 he published two books: Bad News From Venezuela: Twenty Years of Fake News and Misreporting and Propaganda in the Information Age: Still Manufacturing Consent, as well as a number of academic articles. He has also contributed to FAIR.org, The Guardian, Salon, The Grayzone, Jacobin Magazine, and Common Dreams.\n\nReddit\nTwitter\nFacebook\nGoogle\nTikTok", "media": null, "score": 110, "upvote_ratio": 0.94, "comment_count": 23, "over_18": false}, "21": {"id": "1bcilt4", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "2201992", "link_flair_text": null, "time": 1710709105.1504529, "created_utc": 1710201234.0, "url": "https://i.redd.it/rmylhwfbmsnc1.jpeg", "title": "He got Epstein’d ", "permalink": "/r/conspiracy/comments/1bcilt4/he_got_epsteind/", "selftext": "", "media": null, "score": 3058, "upvote_ratio": 0.95, "comment_count": 315, "over_18": false}, "22": {"id": "1bgf2ce", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1710709105.4831128, "created_utc": 1710620220.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1bgf2ce/three_videos_from_usa_brazil_and_serbia_clear/", "title": "Three videos from USA, Brazil and Serbia, Clear video footage of a UFO.", "permalink": "/r/conspiracyfact/comments/1bgf2ce/three_videos_from_usa_brazil_and_serbia_clear/", "selftext": "Interesting UFO video scenes from different places, watch them and tell me what you think.\nClear video footage of a UFO, It passed in an instant and then appeared in the Nevada sky.\nhttps://www.youtube.com/watch?v=4wXFBZF_gGo\nThis UFO footage is clear and terrifying, appeared out of nowhere in the skies of Brazil.\nhttps://www.youtube.com/watch?v=jlKRMEOGtW8\nClear video footage of a UFO in the sky of Belgrade, Serbia - exciting scenes and details.\nhttps://www.youtube.com/watch?v=LLQ5js0f4js\nhttps://preview.redd.it/kwcuk4j58roc1.jpg?width=638&format=pjpg&auto=webp&s=598754b702a8baaff19dec6d49099d3d00756efb\nhttps://preview.redd.it/i3b8zdj58roc1.jpg?width=638&format=pjpg&auto=webp&s=d35d0c81b7fa723d863912a9bd91c0665a26837d\nhttps://preview.redd.it/2ka907j58roc1.jpg?width=638&format=pjpg&auto=webp&s=d6e78dc21d47500aad71c40e1467ede05c5269c1", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Clear video footage of a UFO, It passed in an instant and then appeared in the Nevada sky.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/4wXFBZF_gGo?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Clear video footage of a UFO, It passed in an instant and then appeared in the Nevada sky.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/4wXFBZF_gGo/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 5, "upvote_ratio": 0.86, "comment_count": 0, "over_18": false}, "23": {"id": "1bgy5ii", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "SheepDavis", "link_flair_text": null, "time": 1710709105.9346476, "created_utc": 1710683864.0, "url": "https://www.reddit.com/gallery/1bgy5ii", "title": "Whitehall, NY", "permalink": "/r/bigfoot/comments/1bgy5ii/whitehall_ny/", "selftext": "These statues were constructed in front of a souvenir store on US-4 in Whitehall, NY. The town has an annual Sasquatch Festival in September and features a \"bigfoot calling contest\".", "media": null, "score": 50, "upvote_ratio": 0.96, "comment_count": 9, "over_18": false}, "24": {"id": "1be6s24", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Art", "time": 1710709106.4472501, "created_utc": 1710373561.0, "url": "https://i.redd.it/ptncqc1pu6oc1.png", "title": "Map of reported post-extinction thylacine sightings", "permalink": "/r/Cryptozoology/comments/1be6s24/map_of_reported_postextinction_thylacine_sightings/", "selftext": "", "media": null, "score": 190, "upvote_ratio": 0.96, "comment_count": 34, "over_18": false}, "25": {"id": "1bg051a", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Shoogazi", "link_flair_text": "Discussion", "time": 1710709106.6012735, "created_utc": 1710571971.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1bg051a/have_any_of_you_seen_someone_that_looked_like/", "title": "Have any of you seen someone that looked like this? (A minor update)", "permalink": "/r/Humanoidencounters/comments/1bg051a/have_any_of_you_seen_someone_that_looked_like/", "selftext": "Hi ya'll I made this thread a few months ago where I described a pair of strange twins that entered a coffee shop I worked at. Anywho I just came across this image and basically shit my pants. If you rounded the chin out and gave this lady a bowl cut It's basically an exact match to those two ladies in my experience. It's truly uncanny. The complexion, the odd proportions of the eyes, even the nose shape is nearly identical.   \nThose fucking eyes man\nWell I reverse searched the image and it appears it was originally produced by a photoshop artist back in 2014 or so. The earliest page i can find where the image actually appears was for a blogspot collating \"Manga style\" photography. Later iterations of it has it presented by UFO enthusiasts as a legitimate mock-up for a \"Pleiadean\". I've seen no evidence that this was the original artists intention so I'm assuming the saucer folks thought it looked close to their experiences and just slapped the label on it, go figure. \nOrigins aside, it still looks scarily similar to the ladies I saw and It's very weird that this fictitious piece of art looks so close. Now that that I have a reference point I thought it wouldn't hurt to ask if any of you here might have seen anyone strange that looked similar to this? Maybe the original artist met a similar person and that's what inspired them to make this piece? Who knows!  \nJust thought I'd share, curious to hear your thoughts and experiences if any!", "media": null, "score": 387, "upvote_ratio": 0.95, "comment_count": 135, "over_18": false}, "26": {"id": "1bggu88", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Ambitious_Solid769", "link_flair_text": null, "time": 1710709107.019871, "created_utc": 1710625116.0, "url": "https://v.redd.it/clcipy0pmroc1", "title": "Here’s the video from the post earlier", "permalink": "/r/cryptids/comments/1bggu88/heres_the_video_from_the_post_earlier/", "selftext": "Here’s what I believe to be screams coming from the woods the night we found the arrowheads I’m not saying there isn’t a logical explanation but it is pretty odd how it’s only happened twice and on the night that we found them.", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/clcipy0pmroc1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1186, "width": 720, "scrubber_media_url": "https://v.redd.it/clcipy0pmroc1/DASH_96.mp4", "dash_url": "https://v.redd.it/clcipy0pmroc1/DASHPlaylist.mpd?a=1713301106%2CZjdkMmJjYTc1NzcxYzc5ZGQxMmZlNTg4ZWVkYWQ2NDI0NGY4YTVlMTZmNDIxYTYzNWU0NTcyN2EwMjM0NjdiNA%3D%3D&v=1&f=sd", "duration": 9, "hls_url": "https://v.redd.it/clcipy0pmroc1/HLSPlaylist.m3u8?a=1713301106%2CMDViNzRiNGJlZDhjNDE5OTAzNzVhYWZhNTJhYzZkNWI0NzE4MTc2M2QyNjMwYWRkY2YwMTFmNjc2YmQ2MmM4NA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 53, "upvote_ratio": 0.83, "comment_count": 31, "over_18": false}, "27": {"id": "1bfboq2", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "VampireKissinger", "link_flair_text": "Discussion/Advice", "time": 1710709107.2371519, "created_utc": 1710501901.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1bfboq2/an_actual_witch_baltic_paganism_ussr_1975/", "title": "An actual witch? (Baltic Paganism?) (USSR 1975)", "permalink": "/r/Thetruthishere/comments/1bfboq2/an_actual_witch_baltic_paganism_ussr_1975/", "selftext": "Story happened to GF's dad in 1975 on the border of Lithuanian SSR and Latvian Soviet Socialist Republic.\nSo at the time there was a project called \"To Go Collect Potatoes\" basically, take \"spoiled\" college kids, send them to do some labour on farms to get them some hands on experience. This happened to GF's dad along with classmates, and they were sent an extremely rural, backwards area on the border of Lithuania SSR and Latvian SSR.\nSo GF's dad befriends another student sent, who actually was from this region. Instead of actually doing the labour, they instead, spend this time doing hikes, exploring, camping etc.\nOne day, they go hiking into the woods, and go deeper and deeper, it starts to get dark, and they comes across a very old homestead, lights are on inside, so they think \"Maybe was can crash here\" and they knock on the door.\nSo they knock on the door, and an old man opens the door, he said \"Oh you have arrived, i've been waiting for you\", which is a \"polite\" way of saying come in, so they enter the house, instantly they notice the house was filled with skulls, bones etc, weird, but could be hunter? But then they enter another room and there is a great feast, all set up, extremely lavishly, \"like a wedding\" according to friends dad. The vibe apparently got very weird, very quickly, the old man said for them to join the guests and eat. The friend, who was a local to the region, apparently had some idea what was happening and told them they need to leave immediately, and so they got the hell out of there.\nThat's all we know of the story so far, GF is trying to get some more information about this story. Any idea what this feast was? The general tone is that this guy was some form of old pagan \"witch\". What makes this also very interesting is that this was Soviet era, so definitely some underground thing.\nEdit: So got some more about the story from parents, the feast according to the friend, was called a ritual of \"Calling\", these events happened around September to October, and the region was called Plateliai. The friend also called this man a \"Witcher\".", "media": null, "score": 55, "upvote_ratio": 0.92, "comment_count": 7, "over_18": false}, "28": {"id": "1bbmm2y", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "No_Knowledge3945", "link_flair_text": null, "time": 1710709107.388358, "created_utc": 1710108513.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1bbmm2y/i_was_almost_kidnapped_as_a_child/", "title": "I was almost kidnapped as a child", "permalink": "/r/LetsNotMeet/comments/1bbmm2y/i_was_almost_kidnapped_as_a_child/", "selftext": "Recently there was an amber alert and my daughter was asking me what that beeping sound was all about. For those who don't know, an amber alert goes out when a child is reported missing. If you receive notifications, you know what I'm talking about. The alert will sometimes give information like the victims appearance as well as the perpetrator, the location of the abduction, make and model of vehicle.\nMy phone started beeping one evening while helping my daughter clean her room, an amber alert. She asked about it. I gave her a small rundown and that was that. However it triggered a childhood memory I have where I believe with all my heart, that I was almost kidnapped when I was a kid. \nTo be clear, this isn't a memory that was laying dormant in my subconscious and this random amber alert and talk with my kid caused it to resurface in my mind. This incident is something I've pondered and thought about off and on for years now. I'm 41y/o male by the way. \nIt's just been a while since I've considered the factors and details of the experience and this recent amber alert and talk with my daughter really caused me to pause and reflect on the incident itself once again and here I am. As a parent you worry about these things and do all you can to protect your children especially when you personally experienced something truly scary like this. \nThe occurrence happened when I was just a young kid, my guess is around 7-8. I can't be sure but I think that's a safe estimate based on the fact that much of those early childhood memories aren't there anymore. I do remember my kindergarten experience which I would've been 5-6 and also later grades. So this incident must've happened sometime after or around the ages of 7-8.\nMy parents took me to a neighboring city to do some shopping. We lived in a small rural town with not much on offer so from time to time we would go to this neighboring city about 45 min from where we were located. It just had more to offer. They would take me up there for school clothes shopping, out to eat because restaurants were better and because my mom was a crafter. She loved to make crafts, it was her thing. There were different craft stores and a fabric store she liked going to up there.\nThis specific trip, we went to a fabric store up there, Jo Ann Fabrics to be exact. This was a pretty big store. As a little kid, I guess most every place seems big but no kidding, this was a sizable store. My dad sat out in the car while I went in with my mom. He did that a lot, sit in the car, when there was a store he just didn't want to go in so I can't blame him there. \nI can't recall exactly what all my mom was looking for or trying to get in that store that day but I do remember what section we were in, an area with a bunch of racks with various fabrics hanging. Imagine a clothing store with circular racks with clothes hanging around them and that's pretty much what it's like at this fabric store. Racks of hanging fabrics. \nI remember this area being slightly toward the beginning or entrance of the store. As my mom was looking through these racks, I begin to wander, though not far, just enough to kind of look around myself. I was probably bored and started wandering around, is my guess. But, I could still see my mom just up and over a few racks away so it wasn't like I was on the other side of the store or anything. \nA random man approached me and honestly, I can't even remember at what direction he came from. It's just like I was there by myself one minute and the next, I looked up and saw this guy. It was like he came in fast and out of nowhere. I quickly looked over to where my mom was. She had moved a few racks up and away but I could still see her. There was a fair bit of distance between my mom and me at this point. \nSo here I am standing behind some rack of fabric with this older guy, opposite me in the other side of this rack. Then he speaks, \"hey little boy, how ya doing there?\" I remained silent because this took me completely off guard. He asked, \"where's your folks at? Are you alone in here?\"\nI stood still and quiet. \"Come here, I got something to show you.\" At this point he started advancing toward me, coming around the rack to where I was. I quickly started the other way but he stopped and started coming around the other way as if to meet me in the middle. I was scared at this moment and became instantly aware that this man seemed dangerous and like he was trying to get a hold of me. \"Come here!\" he barked. I jerked fast to the left but he did the same. He had this wild look in his eyes. \nWhichever direction I went, he followed but remember, there's a rack between us. God I'm so thankful for that rack. After some back and forth movements from me and this man I finally lock in on my mom and yell, \"Mom! Help!\" You would've thought I screamed bloody murder, it was so loud but it got my mom's attention. \"What's wrong?\" she asked. This startled the man and he looked over his shoulder in the direction of my gaze and confirmed, yep that must be his mother. His demeanor completely changes and it's as if everything is just fun and games and he was just messing around and he said as much to my mom. \"I was just messing around with him.\" \"No harm ma'am.\"\nMy mom came to where I was and as we reconnected, the guy just tips his hat at my mom and makes his way out of the store. I explained to my mom what just happened, that this guy was trying to get me, I was so upset and shook up. She told me I did the right thing by yelling and getting her attention. \nIt was terrifying for sure and I'm thankful something crazy didn't happen. Could I have been imagining things like maybe this guy was really just messing around? I very much think there were nefarious intentions. Why would a random older guy be perusing a fabric store? If he was there for something like crafts or fabrics, why promptly leave when confronted? I truly believe he was up to no good. Anyway that's my story, I appreciate anyone taking the time to read. ", "media": null, "score": 111, "upvote_ratio": 0.97, "comment_count": 10, "over_18": true}, "29": {"id": "1bbuuot", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "3rroR039", "link_flair_text": null, "time": 1710709107.6648383, "created_utc": 1710131665.0, "url": "https://www.reddit.com/r/threekings/comments/1bbuuot/the_card_game_alone_a_good_idea/", "title": "The card game alone a good idea ", "permalink": "/r/threekings/comments/1bbuuot/the_card_game_alone_a_good_idea/", "selftext": "Anyone have ever hear of the card game apparently it's like the Ouija board but you can play it alone or with a group of people basically yes no maybe questions are the only ones you can ask and you can play alone like heck I got all the stuff here right now but you know is there a good idea let me know you thoughts", "media": null, "score": 6, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "30": {"id": "1bdf1lo", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "SMTVash", "link_flair_text": "WDYT? (What Do You Think?)", "time": 1710709108.1957638, "created_utc": 1710293816.0, "url": "https://v.redd.it/dc1fu3el90oc1", "title": "My mom was trying out the wifi connection of her new car dashcam.", "permalink": "/r/Ghosts/comments/1bdf1lo/my_mom_was_trying_out_the_wifi_connection_of_her/", "selftext": "Last fall, my mom got a new dash cam for her car after being in a few fender benders. On Oct 31st she finally decided to try the wifi connection and app by turning the dash cam on through her phone while she was in her room (the car is parked just outside). She started to record footage just to see if it would playback and this is what she caught.\nI was going to post this earlier but the fact that this happened on Halloween, is so short, and creepy made me feel like it be written off as fake.\nMonths have past and I’ve shown this clip to friends, coworkers, family and have never run into an explanation.\nWe do believe in ghosts due to experiences we’ve all shared throughout the years but I always aim to approach things with an air of skepticism. My theory is that maybe it’s a bird of some kind. It just moves so fast and right after she started recording.\nWhat do y’all think?", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/dc1fu3el90oc1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 444, "width": 854, "scrubber_media_url": "https://v.redd.it/dc1fu3el90oc1/DASH_96.mp4", "dash_url": "https://v.redd.it/dc1fu3el90oc1/DASHPlaylist.mpd?a=1713301107%2CNmMxN2Y4ODM4YTM5ODFhMTg5OGMzZjU2YmY3ZWNlY2QxYzY4MjI2OTNlOWI4ODc5OTY5ODAwZjViMTAxOTYwNA%3D%3D&v=1&f=sd", "duration": 8, "hls_url": "https://v.redd.it/dc1fu3el90oc1/HLSPlaylist.m3u8?a=1713301107%2COTQ5MTUxMWZkNzE2NzNhMDZlY2RmZGE5ZTMwMjc3Y2Y0ZTNkOWExMWE4MzY1NTI1YjRmMzg5Y2NiM2E1MWFmOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 141, "upvote_ratio": 0.87, "comment_count": 49, "over_18": false}, "31": {"id": "1bessgk", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "hazy_hope", "link_flair_text": "Glitch Vid", "time": 1710709108.3974953, "created_utc": 1710442316.0, "url": "https://v.redd.it/fgnvpa11jcoc1", "title": "I get that there's a bit of wind but wtf (+ it stops when i get closer)", "permalink": "/r/GlitchInTheMatrix/comments/1bessgk/i_get_that_theres_a_bit_of_wind_but_wtf_it_stops/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/fgnvpa11jcoc1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/fgnvpa11jcoc1/DASH_96.mp4", "dash_url": "https://v.redd.it/fgnvpa11jcoc1/DASHPlaylist.mpd?a=1713301108%2CYjhkMWZlYTNkZjYyODI3NDhjM2UzNDY3MWNjNTkyM2I5NWYzYWMwYzdmMTNhOGU1YmNkYzU5NTI2MDFkM2EwMg%3D%3D&v=1&f=sd", "duration": 23, "hls_url": "https://v.redd.it/fgnvpa11jcoc1/HLSPlaylist.m3u8?a=1713301108%2CMjZmMjlkMzgzNjljM2MxNGE4MWE1MDA3ZjA3MWI4NmQxOTQ5YWRhMmFjY2NkNTlhNmVhNDA2OTljZGEzYjE4Ng%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 250, "upvote_ratio": 0.91, "comment_count": 125, "over_18": false}, "32": {"id": "1bd73rz", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Nightshade09", "link_flair_text": "Discussion", "time": 1710709109.6223047, "created_utc": 1710274049.0, "url": "https://twitter.com/planethunter56/status/1767341681916231949?t=ZFRb1Mb-yGSHfyu71Zp1ow&s=19", "title": "From hyped “catastrophic” disclosure to catatonic disclosure. Ross Coulthart: \"There's going to be a long, slow rollout of witnesses and evidence put before the congress.\"", "permalink": "/r/ufo/comments/1bd73rz/from_hyped_catastrophic_disclosure_to_catatonic/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/planethunter56/status/1767341681916231949", "author_name": "TheJuan1️⃣", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">Ross Coulthart: &quot;There&#39;s going to be a long, slow rollout of witnesses and evidence put before the congress.&quot;<br><br>That AARO report blowback 👀<a href=\"https://twitter.com/hashtag/ufo?src=hash&amp;ref_src=twsrc%5Etfw\">#ufo</a> <a href=\"https://twitter.com/hashtag/uap?src=hash&amp;ref_src=twsrc%5Etfw\">#uap</a> <a href=\"https://twitter.com/hashtag/ovni?src=hash&amp;ref_src=twsrc%5Etfw\">#ovni</a> <a href=\"https://twitter.com/hashtag/aliens?src=hash&amp;ref_src=twsrc%5Etfw\">#aliens</a> <a href=\"https://t.co/mdBaTYRn01\">pic.twitter.com/mdBaTYRn01</a></p>&mdash; TheJuan1️⃣ (@planethunter56) <a href=\"https://twitter.com/planethunter56/status/1767341681916231949?ref_src=twsrc%5Etfw\">March 12, 2024</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n", "author_url": "https://twitter.com/planethunter56", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 228, "upvote_ratio": 0.83, "comment_count": 151, "over_18": false}, "33": {"id": "1bcfl4h", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "DaZipp", "link_flair_text": "Photo", "time": 1710709111.0290632, "created_utc": 1710193982.0, "url": "https://i.redd.it/mfd3vc1o0snc1.png", "title": "These are the symbols which Danny Sheehan saw on the UAP craft in the classified Blue Book archives", "permalink": "/r/UFOs/comments/1bcfl4h/these_are_the_symbols_which_danny_sheehan_saw_on/", "selftext": "", "media": null, "score": 1985, "upvote_ratio": 0.79, "comment_count": 899, "over_18": false}, "34": {"id": "1bfe7is", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "TimetravelingNaga_Ai", "link_flair_text": "Evidence :upvote:", "time": 1710709112.265599, "created_utc": 1710510042.0, "url": "https://i.redd.it/iebpfk9k4ioc1.jpeg", "title": "Extraterrestrial Plasma Beings - Research Paper 👾", "permalink": "/r/aliens/comments/1bfe7is/extraterrestrial_plasma_beings_research_paper/", "selftext": "", "media": null, "score": 1152, "upvote_ratio": 0.94, "comment_count": 405, "over_18": false}, "35": {"id": "1bclqxj", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "paulreicht", "link_flair_text": "Interview", "time": 1710709112.7760208, "created_utc": 1710209629.0, "url": "/r/UFOs/comments/1bbc9md/daniel_sheehan_claims_he_saw_ufo_crash_retrieval/", "title": "Daniel Sheehan Claims He Saw UFO Crash Retrieval Photos, Calling Dr. Sean Kirkpatrick and the All-domain Anomaly Resolution Office Liars", "permalink": "/r/UAP/comments/1bclqxj/daniel_sheehan_claims_he_saw_ufo_crash_retrieval/", "selftext": "", "media": null, "score": 97, "upvote_ratio": 0.92, "comment_count": 30, "over_18": false}, "36": {"id": "1bfi749", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Bobisdeadrun", "link_flair_text": null, "time": 1710709114.0617132, "created_utc": 1710520576.0, "url": "https://i.redd.it/8ffqeysvzioc1.jpeg", "title": "Kate is dead or something very suspicious is happening ", "permalink": "/r/conspiracy/comments/1bfi749/kate_is_dead_or_something_very_suspicious_is/", "selftext": "", "media": null, "score": 2785, "upvote_ratio": 0.92, "comment_count": 331, "over_18": false}, "37": {"id": "1bbzt1q", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Imaginary_Scar8786", "link_flair_text": null, "time": 1710709114.3873644, "created_utc": 1710151995.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1bbzt1q/google_maps_antarctica_you_need_see_this/", "title": "google maps antarctica, you need see this", "permalink": "/r/conspiracyfact/comments/1bbzt1q/google_maps_antarctica_you_need_see_this/", "selftext": "want a real mystery...YOU DO NOT WANT MISS THIS!\nthis on map, glitched out and filter removed.\nred is first colour of spectrum to disappear to the eye, put filter over and hides whatever is red.\nmining operation, many vehicles, vegitation, lack of snow, fresh water pools, old buildings, pyramid type things and massive amounts of shiny yellow metallic stuff in veins, all over the area.\nseems to be being hidden as the elites want the stuff and if we knew then the shiny yellow metal have no value anymore!\nthey seem to want hide it and drip feed it too profit massively!\nmaybe what all the control and stuff in the world is about, to stop us figuring it out! imagine if we all knew lol\nis this why we not allowed to antarctica or fly over etc\nlook fast and take photos or will be gone soon as they will notice!\nlook at every pool/hole all coloured red, then look at the bits missed yellow shiny viens at the surface ready be scooped up.\ni think we being played!\ndurmont  d'urville station, the link keeps getting blocked, go google maps, antarctica. check all around, zoom in and see it all!", "media": null, "score": 4, "upvote_ratio": 0.7, "comment_count": 6, "over_18": false}, "38": {"id": "1bf499r", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Odd_craving", "link_flair_text": "question", "time": 1710709114.74265, "created_utc": 1710472640.0, "url": "https://www.reddit.com/r/bigfoot/comments/1bf499r/if_a_bigfoot_is_proven_real_would_the_us/", "title": "If a Bigfoot is proven real, would the US  government immediatly be considered endangered?", "permalink": "/r/bigfoot/comments/1bf499r/if_a_bigfoot_is_proven_real_would_the_us/", "selftext": "If so, it would be ironic. If not, it would be stupid. ", "media": null, "score": 48, "upvote_ratio": 0.72, "comment_count": 129, "over_18": false}, "39": {"id": "1be1mza", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "adetheaters", "link_flair_text": "Article", "time": 1710709115.2689273, "created_utc": 1710361163.0, "url": "https://www.reddit.com/gallery/1be1mza", "title": "my little brother got me this book at his Bookfair at school since he knew I like Cryptozoology. thanks bro", "permalink": "/r/Cryptozoology/comments/1be1mza/my_little_brother_got_me_this_book_at_his/", "selftext": "", "media": null, "score": 169, "upvote_ratio": 0.97, "comment_count": 20, "over_18": false}, "40": {"id": "1bgukak", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "twistedstories857", "link_flair_text": "Outside site", "time": 1710709115.4133036, "created_utc": 1710671846.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1bgukak/scary_run_in_with_unidentifiable_humanoid_in/", "title": "Scary run in with unidentifiable humanoid in storm drain", "permalink": "/r/Humanoidencounters/comments/1bgukak/scary_run_in_with_unidentifiable_humanoid_in/", "selftext": "This occurred in 2023 in downtown Colorado Springs. We were exploring tunnels close to a river/ close to Fountain Creek open space.\nWhat is up everyone? So a buddy and I had a pretty strange and utterly terrifying experience. We both enjoy Urbexing and discovered a series of underground tunnels/ like storm drains, that probably went as far as a mile and a half. Anyway, we made our way to the tunnels, got our flashlights, and my camera. We were just shooting the shit and when we got maybe half way through, the tunnel narrowed to where we were hunched over instead of being able to fully stand up. We then heard a loud scream that sounded like a lady, but not human. Overall it sounded most like a mountain lion scream/ look it up. It’s a terrifying sound! After we heard this, we both froze and listened. I was shining my light down the tunnel, where I saw something pale moving towards us. I probably only saw it for like 4 seconds until I broke out of my shock and my buddy and I were running hunched over in these dark tunnels. I didn’t have my camera video on, but I dropped it and sure as hell will never go back to retrieve it. I thought I was hallucinating or something, but my friend saw the exact same thing. \nThe creature we saw was unlike anything i’ve ever seen. It was completely pale and looked sickly/ emaciated. The body looked somewhat human, but not quite. The face resembled that of a horse/ not as big of a snout though. Really f*g strange. If I had to compare it to anything, it would be the above image. The face especially looked like that of this particular picture of the “Pope lick monster.” It’s like if you took the head of the pope lick monster photo and placed it on the body of a deer standing on its hind legs. I suck at photo editing, so perhaps someone could photoshop something like this to get a more accurate depiction of the creature? \nI still get the chills even just thinking about this experience. My friend and I vowed to never explore tunnels again (obviously). I always thought there was no such thing as humanoid creatures until I experienced this. I enjoyed listening to like Skinwalker stories, but I always thought they were pure fiction.  A deep part of me just wants to know what it is and if it was harmful? Did we escape a potentially deadly situation? Why are not more people seeing these things? There has to be more right!? Why does no one have legit photos of humanoids? If you all have an idea of what this could’ve been or if you’ve had a similar experience, please share! I am utterly scared and baffled. ", "media": null, "score": 102, "upvote_ratio": 0.89, "comment_count": 29, "over_18": false}, "41": {"id": "1bccyb5", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Calamityware", "link_flair_text": null, "time": 1710709115.7625742, "created_utc": 1710187877.0, "url": "https://i.redd.it/qop665ndirnc1.jpeg", "title": "Cryptids made of coffee beans", "permalink": "/r/cryptids/comments/1bccyb5/cryptids_made_of_coffee_beans/", "selftext": "", "media": null, "score": 48, "upvote_ratio": 0.88, "comment_count": 6, "over_18": false}, "42": {"id": "1be1p1y", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "SmallTorchic", "link_flair_text": null, "time": 1710709115.9987059, "created_utc": 1710361302.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1be1p1y/creepy_story_from_my_childhood/", "title": "Creepy story from my childhood.", "permalink": "/r/Thetruthishere/comments/1be1p1y/creepy_story_from_my_childhood/", "selftext": "So around 2007-08 placing me around 5 years old possibly 6. I was still in one of those transforming cribs with a portions that could drop down and turn it into a toddler bed. This left the bed rather high off the floor. At the time I lived in southern Arizona. Late in the night very early stages of the morning 0000 to 0300. I was awoken by something grabbing at my ankle feeling long sharp nails. Like stiletto style nails from the now fragmented memories I still have of the night the thing looked like a stereotypical witch. Wrinkled wort riddled face with long nose and rotting teeth. It never spoke but did manage to pull me off my bed and under it. It startled me understandable so. It put a single finger up to its lips in the shushing motion. It never changed and simply vanished from sight as the sun began to rise. I guess I was so freaked out I never spoke about it. It wasn’t some weird dream based on a memory as at the time I wasn’t a huge fan of any media with witches and was a pretty hard set Lilo and Stitch kid already.", "media": null, "score": 35, "upvote_ratio": 0.87, "comment_count": 12, "over_18": false}, "43": {"id": "1bc2crp", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "AlternativeStatus644", "link_flair_text": null, "time": 1710709116.1578672, "created_utc": 1710161237.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1bc2crp/maybe_my_ex/", "title": "Maybe my ex? ", "permalink": "/r/LetsNotMeet/comments/1bc2crp/maybe_my_ex/", "selftext": "Hi Reddit, \nFrench story, don't be rude about my english please. \nFew years ago, I was in a relationship with a guy, James (M20) during three years. \nIn the beginning, he was wonderfull. He supported me during my chemotherapy, was kind and funny, a bit crazy but not in a creepy way.\nHe helped me surviving through my sickness and I won't be alive without him right now.\nThe last year of our relationship, he changed. He wanted to try new experiences and begin taking drugs. I didn't know he was addict until our break up. \nHe was totally different. Jealous, a liar, sometimes wiched with me and he cheated on me before our break up. \nTBH, I had pity for him. So, after the break up, I've spent 6 months helping him. I was a student, he was always at my home, in pain, trying to fight his addiction. \nI said stop when, after a month in an institute, he started drugs again like 3 hours after leaving. \nSad story but it gets worst.\nDuring our relationship I choose my university to be close to him. So I had nobody's around. No friends, no family. \nOne month after cutting the rope, something strange happened. \nEverythings began with my cat. \nOn night, I went outside seing a movie. In my way home, it started raining, and I remembered that I left my cat outside. It's a really nice cat but it hates water (like every cat i guess). I started running to be home early and when I opened the door, my cat was on my sofa. \nFirst, I thought \"what a dumbass, the cat was not outside at all\" but then, I hugged him, and my cat was completely wet. \nIt feels weird. I was like \"WTF?\" and then, I thought my neighbors could have opened my door for let it in. So I just forget about it. \nOne week later, I realised that some of my clothes were missing. Particularly my underwears. I've got ADHD, so, I blamed myself for losing my own clothes. \nSame with my food and some plates, like one of my favorite bowl disappeared. It was a student's appartment so... Not big enough to lose that many things. But again, I blamed myself. I even called myself a magician, joking about how I can make everything disappear without trying. \nI loose my mind when I came back from my parent's house and discovered my place totally changed. There was the neighbors'mails on my table with a mysterious headphones, my photos on the wall were upside down and a black umbrella was on my bed. I didn't owned an umbrella. \nIt was scary af. I called my mom and then the police (yes, always mom first). The officer was nice but told me that there was nothing they can do except taking my complaint. I didn't know who was doing this to me. \nMy ex never had my keys and even when I said  that I don't want to talk to him anymore, I staid nice. I didn't thought anybody wanted to hurt me or scared me. For what? Joking? If that's it : ahah hilarious, I slept with a knife for two years, congrats. \nMy neighbors started getting scared too. We had a common basement and someone breaks the door during night. We found some supplies in it. Like a blanket and a plate (not mine btw). \nI had chaines on the inside of my door so, I felt secured when I was inside but I was scared to leave and coming back to see again my stuff missing. \nFew weeks goes by. In the evening, I had to go to the grocery store, it took me like 30 minutes. When I came back home, there was a note on my bedroom's mirror. Nothing's written, just a smiley. It freaked me out and I leave immediately. \nAgain, calling the police, they told me that I could have left the note and forget about it. I didn't have those kind of little sticky yellow paper so, I don't see how. \nI stand with my mom for a week, spend all my economies on a camera and post for help on social media because I felt totally distraught. \nAfter that, nothing. \nIn the meantime, James' sister came talk to me, saying that one of my favorite jacket was at their parent's house. I remembered wearing this jacket after saying stop to James so... Again, I've got ADHD, I might have forgot. But I didn't see James' parents for like 8 months at this time so, I found that difficult to believe. \nAlso, I suspected my neighbor who had one of my key and was feeding my cat when I wasn't home but she was in another country during most of this story so... \nI talked with James last year about that, he sweared he never done something that weird and told me he was in another cure center when all that shits happened. \nEverythings stopped after that. I still don't know who did this, neither why. \nMaybe my ex? Maybe someone else? \nNow I don't really care, but this is the creepiest story I lived. \nTo my stalker, let's not meet again. ", "media": null, "score": 44, "upvote_ratio": 0.94, "comment_count": 4, "over_18": true}, "44": {"id": "1bgbssw", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Pale_Bowl_7553", "link_flair_text": null, "time": 1710709116.4481, "created_utc": 1710611400.0, "url": "https://www.reddit.com/r/threekings/comments/1bgbssw/want_to_play_the_three_wishes_ritual/", "title": "Want to play the three wishes ritual", "permalink": "/r/threekings/comments/1bgbssw/want_to_play_the_three_wishes_ritual/", "selftext": "I was reading up on the three wishes ritual from TGIMM and it tells that you need three coins from at least a decade prior and I have two questions: \n\n\nDoes it matter the type of coins( quarters, nickels, etc.) or could I use any type?\n\n\nCould I use coins that are from several decades ago( 1977, 2000, 1985)? \n\n\nEdit: The coins I’m planning on using are from those years. \nHere’s a link to the ritual: https://theghostinmymachine.com/2023/01/16/the-most-dangerous-games-the-three-wishes-ritual/", "media": null, "score": 5, "upvote_ratio": 1.0, "comment_count": 4, "over_18": false}, "45": {"id": "1bdj1it", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Exotic_Combination12", "link_flair_text": null, "time": 1710709117.0466921, "created_utc": 1710305355.0, "url": "https://www.reddit.com/r/Ghosts/comments/1bdj1it/experience_2_my_best_friend_since_1983_came_to/", "title": "Experience #2 My Best friend since 1983 came to visit me !", "permalink": "/r/Ghosts/comments/1bdj1it/experience_2_my_best_friend_since_1983_came_to/", "selftext": "3 years ago my bestfriend Gary passed away from diabetes. He had been very sick and having complications from the disease.  He had his toes amputated first ,then his foot ,then the leg below the knee and two days later his leg above the knee . He was a trooper tho. A month after the final surgery he went back to his employer ( he was a truck driver ) and asked when he could come back to work . His employer said that he couldnt drive the truck . Gary told him that if he could pull himself into the truck then he could drive it . His boss said \" prove it \" . So Gary rolled his wheelchair over to the drivers side of the truck . He pulled himself into the steps ,and opened the door . Then he grabbed the rail and reached for the steering wheel and pulled himself into the cab of the truck . He then started the truck and drove away . His boss was amazed . Sorry about that I drifted.  Gary was in the hospital the last month of his life . He told his girlfriend he didnt want to die in the hospital . And somehow he convinced the doctors that he was fine and they released. 2 hours later he and his girlfriend were talking and his eyes rolled back in his head and he quietly left this world behind . Two weeks later I had a dream that Myself ,Gary ,and all our friends were camping at our local lake . Now Gary had a great sense of humor and this whole dream was in his sense of humor . It was one of the funniest dreams I've ever had . But the thing I noticed and still stands out in my mind was he wasn't  sick and he had both legs ,he was younger and the last thing he said before I woke up was \" I'm whole again and I'm all better \" . It was a great dream ,I can't  really go into details of the dream but I can tell you it was hilarious . He's ok now and he's not suffering anymore . I was at every member of his families funerals ,they're almost all gone except for his sister . I love that family and I'm glad Gary ( his family called him Gopher and that's what I always called him ) I'm glad he came back to make me laugh one more time and to tell me he was ok now . RIP Gopher . ", "media": null, "score": 127, "upvote_ratio": 0.94, "comment_count": 45, "over_18": false}, "46": {"id": "1bdj9d3", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ExpertCheesecake9581", "link_flair_text": "Glitch Pic", "time": 1710709117.240634, "created_utc": 1710306084.0, "url": "https://i.redd.it/fynbns53a1oc1.jpeg", "title": "I was going along with my day, then I found out my city has been rebranded", "permalink": "/r/GlitchInTheMatrix/comments/1bdj9d3/i_was_going_along_with_my_day_then_i_found_out_my/", "selftext": "", "media": null, "score": 100, "upvote_ratio": 0.8, "comment_count": 24, "over_18": false}, "47": {"id": "1bdx01a", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Ad1714", "link_flair_text": null, "time": 1710709118.6698325, "created_utc": 1710350235.0, "url": "https://www.washingtonian.com/2024/03/12/dcs-ufo-lobbyist-blasts-pentagon-report-claiming-no-alien-coverup/?utm_source=rss&utm_medium=rss&utm_campaign=dcs-ufo-lobbyist-blasts-pentagon-report-claiming-no-alien-coverup", "title": "DC’s UFO Lobbyist Blasts Pentagon Report Claiming No Alien Coverup", "permalink": "/r/ufo/comments/1bdx01a/dcs_ufo_lobbyist_blasts_pentagon_report_claiming/", "selftext": "", "media": null, "score": 183, "upvote_ratio": 0.93, "comment_count": 95, "over_18": false}, "48": {"id": "1bf416l", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "goodthrowawaysrtaken", "link_flair_text": "Discussion", "time": 1710709119.764454, "created_utc": 1710471938.0, "url": "https://i.redd.it/2brsqdc9zeoc1.jpeg", "title": "Sean Kirkpatrick has been compromised by the industry, he is not reliable ", "permalink": "/r/UFOs/comments/1bf416l/sean_kirkpatrick_has_been_compromised_by_the/", "selftext": "", "media": null, "score": 1613, "upvote_ratio": 0.89, "comment_count": 314, "over_18": false}, "49": {"id": "1bd9b1y", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Streay", "link_flair_text": "Image 📷", "time": 1710709121.316928, "created_utc": 1710279247.0, "url": "https://www.reddit.com/gallery/1bd9b1y", "title": "Meet our new buddies, Sebastián and Santiago!", "permalink": "/r/aliens/comments/1bd9b1y/meet_our_new_buddies_sebastián_and_santiago/", "selftext": "", "media": null, "score": 1090, "upvote_ratio": 0.88, "comment_count": 425, "over_18": false}, "50": {"id": "1bfoto1", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "FishTshirt", "link_flair_text": null, "time": 1710709121.8770683, "created_utc": 1710537554.0, "url": "https://youtu.be/Qsbz8_G9WcU?si=WE_DFJ5f9wf7NA5U", "title": "“The disappearance of America’s leading anti-gravity researcher” - Sandboxx ", "permalink": "/r/UAP/comments/1bfoto1/the_disappearance_of_americas_leading_antigravity/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The disappearance of America's leading anti-gravity researcher", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/Qsbz8_G9WcU?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"The disappearance of America&#39;s leading anti-gravity researcher\"></iframe>", "author_name": "Sandboxx", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/Qsbz8_G9WcU/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@SandboxxApp"}}, "score": 86, "upvote_ratio": 0.94, "comment_count": 12, "over_18": false}, "51": {"id": "1bgjn5u", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Breakfast_Meat", "link_flair_text": null, "time": 1710709122.8283362, "created_utc": 1710632934.0, "url": "https://i.redd.it/f1hi1qez9soc1.jpeg", "title": "US Friends no longer with Niger. ", "permalink": "/r/conspiracy/comments/1bgjn5u/us_friends_no_longer_with_niger/", "selftext": "", "media": null, "score": 2676, "upvote_ratio": 0.92, "comment_count": 628, "over_18": false}, "52": {"id": "1bcp3va", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "SODTAOEbroskiTALLP", "link_flair_text": null, "time": 1710709123.2286825, "created_utc": 1710219775.0, "url": "https://youtu.be/cZcsCiKXuos", "title": "Altered Carbon (Anthrobotics, Smart Dust, Remote Monitoring & Manipulation)", "permalink": "/r/conspiracyfact/comments/1bcp3va/altered_carbon_anthrobotics_smart_dust_remote/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Altered Carbon (Anthrobotics, Smart Dust, Remote Monitoring & Manipulation)", "type": "video", "thumbnail_width": 480, "height": 200, "width": 267, "html": "<iframe width=\"267\" height=\"200\" src=\"https://www.youtube.com/embed/cZcsCiKXuos?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Altered Carbon (Anthrobotics, Smart Dust, Remote Monitoring &amp; Manipulation)\"></iframe>", "author_name": "Gamma Au Obsidian", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/cZcsCiKXuos/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@GammaAuObsidian"}}, "score": 3, "upvote_ratio": 0.8, "comment_count": 0, "over_18": false}, "53": {"id": "1bd4zr9", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Sneakyman78", "link_flair_text": "needs your help", "time": 1710709123.566829, "created_utc": 1710269101.0, "url": "https://www.reddit.com/r/bigfoot/comments/1bd4zr9/psychological_struggles_of_eyewitnesses/", "title": "Psychological Struggles of Eyewitnesses", "permalink": "/r/bigfoot/comments/1bd4zr9/psychological_struggles_of_eyewitnesses/", "selftext": "Hello! I am a mental health counselor, and my particular clinic requires that we provide free presentations to the community about mental health topics from time to time. It's my turn again, and I've decided to have my topic be about the unique mental health challenges of eyewitnesses to high strangeness. I recognize that many would not lump sasquatches in with high strangeness, but I purposely casted a large net with the definition for the purposes of what I'm going for. \nI was curious if any bigfoot eyewitnesses here would mind sharing their experiences related specifically to mental health factors about your encounter, as well as any potential social backlash/stigma following the event? I'm interested in potential symptoms of trauma during/following the encounter, any social challenges you've had to face after telling your story, overall impacts of the encounter & social fallout on your mental health, etc.\nMy goal in asking this is to have a better understanding of what eyewitnesses think the public should know, what helped you in coming forward (if at all), and how you wished you were received by both loved ones and the gen. public. \nLastly, here's the webinar link to my event so that y'all know it's legit (and to register if you'd like) : https://eddinscounseling.com/group/webinar-navigating-the-unexplained/\nThanks!", "media": null, "score": 42, "upvote_ratio": 0.93, "comment_count": 32, "over_18": false}, "54": {"id": "1bdselx", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Novel_Tackle3188", "link_flair_text": "Art", "time": 1710709124.0640118, "created_utc": 1710339030.0, "url": "https://i.redd.it/xsbq3y9004oc1.png", "title": "The Mongolian Death Worm, the elusive worm of the Gobi Desert", "permalink": "/r/Cryptozoology/comments/1bdselx/the_mongolian_death_worm_the_elusive_worm_of_the/", "selftext": "", "media": null, "score": 143, "upvote_ratio": 0.96, "comment_count": 31, "over_18": false}, "55": {"id": "1bf3154", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "x_persepolis_x", "link_flair_text": "Humanoid", "time": 1710709124.2222457, "created_utc": 1710468901.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1bf3154/recount_of_dominican_creature_from_years_ago/", "title": "Recount of Dominican creature from years ago ", "permalink": "/r/Humanoidencounters/comments/1bf3154/recount_of_dominican_creature_from_years_ago/", "selftext": "a while back, maybe 10-15 years ago, around 2009 maybe?, when i was just a child, my family went to the dominican republic for spring break, and we stayed in santo domingo. it was an amazing trip, dont get me wrong, but i only recall a single memory from the whole vacation. i walked into my parent's room in the rental house, which was just beside the indoor balcony, to get a swimsuit to change into. as i was walking out, a \"creature\" of some sort crossed the gap between the double doors, only visible for about a second, and me, being so young, decided to run back to my parents instead of chase it. neither of them saw it.\ni recall it even more strongly because i drew it multiple times afterwards as a child. i remember it being maybe 3-4 feet tall, white with short hair all over. it had human arms and hands and feet, but a head with a protruding mouth and nose. strangest of all, its legs went backwards in a similar way to most animals, despite it walking of its two hind legs. \nive never even heard of a story similar to this anywhere, so please help. its been in the back of my mind for at least a decade.", "media": null, "score": 75, "upvote_ratio": 0.95, "comment_count": 19, "over_18": false}, "56": {"id": "1bfi8q4", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Ambitious_Solid769", "link_flair_text": null, "time": 1710709124.51018, "created_utc": 1710520691.0, "url": "https://i.redd.it/08gba4v70joc1.jpeg", "title": "Strange things in the woods (Pittsboro NC)", "permalink": "/r/cryptids/comments/1bfi8q4/strange_things_in_the_woods_pittsboro_nc/", "selftext": "Does anyone know anything about this? My friend stays in the foothills of nc near a state park so we did a little exploring and I noticed a sudden change in the energy (ears ringing and tunneling) so I started paying attention to my surroundings shortly before I saw this. I was an arborist for 13 yrs and I’ve never seen a pine burl before.  We also found many old Indian burial sights (large piles of quartz crystals) and trees literally pulled over to where the top was almost touching the ground. The next night we heard loud screams coming from the woods which was strange bc he doesn’t have any neighbors at all. I have more pics and videos if needed. ", "media": null, "score": 48, "upvote_ratio": 0.67, "comment_count": 117, "over_18": false}, "57": {"id": "1bd62pd", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "RobinJeans21", "link_flair_text": "Discussion/Advice", "time": 1710709124.7246583, "created_utc": 1710271589.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1bd62pd/my_dads_driving_story/", "title": "My dads driving story", "permalink": "/r/Thetruthishere/comments/1bd62pd/my_dads_driving_story/", "selftext": "Pretty quick but basically he has this story that one time him and his friend were driving in Elkton Maryland on a road. This was a good 25+ years ago. Then 5 seconds later they were “on the other side of the canal” in Delaware. Which was about 30 minutes away from the road they were on which made no sense. They looked behind them and the road was just covered in dust like a dry dirt road. They both were not drinking or doing drugs. Both had the same recollection of that happening. Both agreed it made absolutely no sense they were here. And both actually went to therapy for it for a short time. But nothing ever came of it. ", "media": null, "score": 25, "upvote_ratio": 0.93, "comment_count": 7, "over_18": false}, "58": {"id": "1bcv2j8", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "th3odorus", "link_flair_text": null, "time": 1710709124.8588696, "created_utc": 1710243296.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1bcv2j8/my_fake_friend_that_i_could_have_avoided_earlier/", "title": "My fake friend that I could have avoided earlier", "permalink": "/r/LetsNotMeet/comments/1bcv2j8/my_fake_friend_that_i_could_have_avoided_earlier/", "selftext": "This happened to me back in 2008 to early 2010s. When I was 11, I met a girl who was the same age as me since sixth grade, she and I weren't the same classmates until high school but we were the same school. By the middle of sixth grade, things got creepy.\nSomehow she was everywhere every time I had an extra class, including every time I had to switch from another schedule to another schedule, my entire life I never gave my private information to her but I was half aware she knew by her own eyes even tho she was a near sight. Unfortunately, I had reported it to the teacher/faculty members but the they brushed off my warning as a ruse because I didn't have enough evidence to prove it was her, what's worse we weren't allowed to bright any electronic device (like phones for example) for pieces of evidence against her except calculator for Maths and Physic.\nThis bothered me forever, she even shared the same Home Economics class and swimming lessons as mine during the eighth grade but yet again not the same group. Even in ninth grade, she still kept following me nonstop, despite I warned her to leave me alone.\nAfter I graduated at 15, I left for a high school to start over, even though I forgot about her until the middle of October 2012...She's back! My skin turned pale as well and my heart beat like I was in panic mode. This girl, how did she even know I'm in high school that I enrolled and more importantly, I again, didn't leak my information everywhere not even to her. Once again she won't leave me alone and she starts to get worse.\nShe guilt-tripped me into 'befriending' her to let her use my belongings whether is permission or not, despite her soft manner it was a red flag to begin with that I could have avoided it sooner. On the other time, she overheard me and my classmate having a conversation about mine wanting a key charm that my classmate had. But on the next day, she attacked me after I took a seat in the class because she knew that I wanted something that she didn't, this incident caught the attention of the principal in my high school, and the principal recap the whole situation by writing a statement report, I ended up rewrite twice because of error grammar and by the third the principal made the decision, she was suspended for a week, but it wasn't enough.\nShe returned after a week and \"accused\" me of her suspending, which I wasn't involved in with her drama, even though I didn't have another choice but to report my statement for my safety. And once again, she guilt-tripped me for other reasons by hypocritically \"calling\" me for being a terrible friend, even so far she destroyed one of my belongings and supplies. I called her out but she pretended she didn't remember it, worse, she framed a student for having a torn notebook that she destroyed and yet she refused to admit her mistakes. That was my last straw as it made my blood boil, but I didn't want to show my anger as she gave me a watch in exchange for money, which turns out, she swindled and got away with it.\nIn all situations, half of my peers and teachers witnessed this incident and warned me that I should end her friendship with her, she wasn't my friend, just saw me as a pawn and manipulated me by taking advantage of my kindness and trust. We were still in the same in high school but I quietly outright not to be close with her again. That's it until early December of 2012, that was the last time I saw her, and I guess that she was expelled after the last warning from one of my peers.\nI felt relieved but I will never forget what she did to not only me but to the other half of my peers as well. By near the end of high school, it took me to realize that she was indeed not very a good friend and her attitude was sociopathic and almost creepy, and that was the reason why I ended things with her for good. Luckily I didn't give her phone number or address since that wasn't allowed in the school which I managed to avoid the red flag.\nIt's been almost 16 years since this incident took place after I finished my highschool in 2015, I'm almost 27 and currently have a job. The experience made it difficult to trust someone or befriend them again.\nSo the girl I used to befriend, let's not meet again, ever.\nEdit: I want to everyone know that the incident was happen in 2008, aka 16 years ago before 2010s and two I finished highschool since 2015 which was 9 years ago. 2020s era still confused me sometimes.", "media": null, "score": 30, "upvote_ratio": 0.8, "comment_count": 7, "over_18": true}, "59": {"id": "1bcvjp3", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "aceofhearties", "link_flair_text": null, "time": 1710709125.1223729, "created_utc": 1710244888.0, "url": "https://www.reddit.com/r/threekings/comments/1bcvjp3/can_you_start_rituals_just_by_thinking_of_them/", "title": "Can you start rituals just by thinking of them?", "permalink": "/r/threekings/comments/1bcvjp3/can_you_start_rituals_just_by_thinking_of_them/", "selftext": "I’m sorry I have to ask this, but for context, I have OCD and at times it’s extremely dehabilitating.  I heard about The Bath Game/Daruma-San ritual while scavenging for Japanese urban legends as I like reading about them, but ever since then I’ve been scared and worried that I somehow started the ritual from just thinking about it. Ever since that whenever I think about it I start feeling a presence behind me because of paranoia and I’ve been constantly checking over my shoulder to make sure she’s not there.\nits gotten so bad that I hate being alone now.\nCan anyone ease my mind?", "media": null, "score": 5, "upvote_ratio": 0.86, "comment_count": 7, "over_18": false}, "60": {"id": "1beh9vw", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Wonk_Majik", "link_flair_text": null, "time": 1710709125.7376232, "created_utc": 1710408930.0, "url": "https://www.reddit.com/gallery/1beh9vw", "title": "Pics taken 10 years ago in the tunnels under Western Command HQ, Chester. I can see the side profile of a man sitting on the floor with his back against the wall. The tunnels were used in WW2 and were apparently frequented by Winston Churchill.", "permalink": "/r/Ghosts/comments/1beh9vw/pics_taken_10_years_ago_in_the_tunnels_under/", "selftext": "", "media": null, "score": 96, "upvote_ratio": 0.62, "comment_count": 112, "over_18": false}, "61": {"id": "1bew3g5", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "mrcashmen", "link_flair_text": "Glitch Vid", "time": 1710709126.126706, "created_utc": 1710450485.0, "url": "https://v.redd.it/wprey0jqdcoc1", "title": "Swift soda bottle return", "permalink": "/r/GlitchInTheMatrix/comments/1bew3g5/swift_soda_bottle_return/", "selftext": "", "media": null, "score": 67, "upvote_ratio": 0.93, "comment_count": 3, "over_18": false}, "62": {"id": "1bh5dsj", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "DoubleTroubleNow", "link_flair_text": null, "time": 1710709127.09193, "created_utc": 1710701816.0, "url": "https://twitter.com/MikeColangelo/status/1653470893408935937", "title": "James Fox makes it clear that him and others have recorded interviews with \"intel folks\" that have already testified to AARO \"If the government is not going to release it, we're going to release this to the public so they'll know that this is going on.\"", "permalink": "/r/ufo/comments/1bh5dsj/james_fox_makes_it_clear_that_him_and_others_have/", "selftext": "", "media": {"oembed": {"provider_url": "https://twitter.com", "url": "https://twitter.com/MikeColangelo/status/1653470893408935937", "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">James Fox makes it clear that him and others have recorded interviews with &quot;intel folks&quot; that have already testified to AARO<br><br>&quot;If the government is not going to release it, we&#39;re going to release this to the public so they&#39;ll know that this is going on.&quot;<br><br>Full Interview:… <a href=\"https://t.co/z4Ia0kG4Fh\">pic.twitter.com/z4Ia0kG4Fh</a></p>&mdash; Mike Colangelo (@MikeColangelo) <a href=\"https://twitter.com/MikeColangelo/status/1653470893408935937?ref_src=twsrc%5Etfw\">May 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n", "author_name": "Mike Colangelo", "height": null, "width": 350, "version": "1.0", "author_url": "https://twitter.com/MikeColangelo", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}, "type": "twitter.com"}, "score": 173, "upvote_ratio": 0.88, "comment_count": 86, "over_18": false}, "63": {"id": "1bdpb8q", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "FormerMonitor3968", "link_flair_text": "Discussion", "time": 1710709128.3515737, "created_utc": 1710329864.0, "url": "https://www.reddit.com/r/UFOs/comments/1bdpb8q/somethings_fishy/", "title": "Somethings fishy", "permalink": "/r/UFOs/comments/1bdpb8q/somethings_fishy/", "selftext": "Things are stranger then normal here. We have real news coming out, blackvault had some great FOIA info come out, the AARO report. Congress making big statements.\nFor example, blackvaults CIA document just released has under 2 dozen comments, while posts hating on coulthart have over 800 comments, mostly saying \"grifter\" Its fucking weird, and strange, and unnatural. Since the AARO report, this sub is flooded with anti UFO/UAP debunkers, trolls, and people just stirring the pot. I've noticed it double since ross mentioned executive order 12333, which makes it a crime to use the media against the people. \nI speculate that ross mentioned this, because people are aware of an organized disinfo campaign. You will notice the hate posts all come in waves, whenever someone releases new ifo that makes the DOD look bad. It was, Lue and corbell that were the main targets, then grush and now coulthart and sheehan. Its obvious to anyone who has been here a long time, and views the sub regularly.  Its not the norm, and you can almost count on it like the tides to happen. When hundreds of people suddenly brigade a hate post about UFOs info on a UFO sub, but REAL declassified documents are completely looked over and basically ignored, it SCREAMS something is very weird and wrong.", "media": null, "score": 1542, "upvote_ratio": 0.83, "comment_count": 935, "over_18": false}, "64": {"id": "1bgembb", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Loose-Alternative-77", "link_flair_text": "Discussion :table:", "time": 1710709130.0539365, "created_utc": 1710619013.0, "url": "https://www.livescience.com/space/exoplanets/mathematically-perfect-star-system-being-investigated-for-potential-alien-technology", "title": "'Mathematically perfect' star system being investigated for potential alien technology. I hav amazing feeling about this system and I’ll tell you why. ", "permalink": "/r/aliens/comments/1bgembb/mathematically_perfect_star_system_being/", "selftext": "This system is untouched, uniformed, and synchronized. How could our solar system be so unbelievably chaotic. Earth was bombarded by trillions of impacts from various celestial bodies. Asteroids , comets, planets, and moons mashing together for billions of years. Out of the chaos came a unlikely oasis called earth. We are still sitting ducks. The only hope is to knock celestial bodies off course. \nWe have little hope for long term survival. Earth is just to far from any potentially compatible planet. Mars with have a catastrophe event as well one day as well so putting a colony on mars isn’t a long term solution. I’m talking in the very long term. The only chance we possibly have with future technology if it pans out it for proxima b to be compatible. I don’t see a colony that can’t breathe the air on a planet surviving in the long term. \nThe fact this perfect solar system has gone untouched says to me it doesn’t have asteroid belts. How could this be possible? I found no solution. All the events that could have taken place during the four billion year period would have disrupted the system in some way. So maybe they system got help from aliens. Maybe they used technology to clean the system up. Maybe the system it’s self is a techno signature. Try and find a better answer to the question of how the perfect system came to be as it is.\n\nSETI tried to find out if the system was directing a signal directly to earth. That’s not going to happen and I’m not sure why they think it will. SETI really hasn’t looked. Funding problems and insufficient technology problems. Read the article by pressing the image at the top of the post. They are certainly excited about this system and hope to find a techno signature. Like I said maybe the system it’s self is a techno signature. ", "media": null, "score": 1066, "upvote_ratio": 0.91, "comment_count": 194, "over_18": false}, "65": {"id": "1bds1t4", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Astro_ImproVe", "link_flair_text": "Discussion", "time": 1710709130.5245845, "created_utc": 1710338100.0, "url": "https://www.reddit.com/r/UAP/comments/1bds1t4/recent_publication_with_images_never_seen_before/", "title": "Recent publication with images never seen before. Didn't hear NASA UAP Task Force mention it. Extraterrestrial Life in the Thermosphere: Plasmas, UAP, Pre-Life, Fourth State of Matter February 2024Journal of Modern Physics 15(03):2024", "permalink": "/r/UAP/comments/1bds1t4/recent_publication_with_images_never_seen_before/", "selftext": "https://www.researchgate.net/publication/378076432_Extraterrestrial_Life_in_the_Thermosphere_Plasmas_UAP_Pre-Life_Fourth_State_of_Matter \nI havent seen much of this on this subreddit, I could be wrong. But this looks quite compelling.\nI thought this part was interesting.\n\nUS Jet Fighter Pilots Encounter Plasma UAP? On June 25, 2021, the Office of the Director of National Intelligence [55] released a 9-page redacted intelligence report, titled “Preliminary Assessment: Unidentified Aerial Phenomena” which assessed “the threat posed by unidentified aerial phenomena (UAP) and the progress the Department ofDefense Unidentified Aerial Phenomena Task Force has made in understanding this threat.” The focus of the report was the over 120 incidents of extremely unusual aerial phenomena witnessed by Navy pilots and foreign militaries in the last two decades [56, 57].Quoting this report [55]: “UAP... appeared to remain stationary in winds aloft, move against the wind, manoeuvre abruptly, or move at considerable speed, without discernible means of propulsion. In a  \n\nPage 38\nJournal of Modern Physics, Vol 10, 2024 UAP & Plasmas in the Thermosphere 38 PrePrint small number of cases, military aircraft systems processed radio frequency (RF) energy associated withUAP sightings.” According to this U.S. government report [55], UAP have no visible engine or infrared exhaust plumes, but were capable of hypersonic speeds beyond “the sound barrier without a sonic boom.” Many of the observations were recorded on video, including one taken by a fighter jet’s camera in early 2004 that shows a whitish oval object about the size of a commercial plane, that looked like an oblong cloud but was described as a giant Tic Tac. It was flying over the ocean as pilots expressed amazement. In audio recordings of another UAP a pilot exclaims: “There’s a whole fleet of them.”Official film footage released by the U.S. government indicates that when a UAP was filmed in color, the object was “white” and gave off a bright glow and resembled a cloud (Figure 31). Yet anotherUAP is a megalithic object resembling a glowing “spinning top” (i.e. a “flying saucer”) that shifts in orientation from the right to the left (Figure 32).\n(2) (PDF) Extraterrestrial Life in the Thermosphere: Plasmas, UAP, Pre-Life, Fourth State of Matter. Available from: https://www.researchgate.net/publication/378076432_Extraterrestrial_Life_in_the_Thermosphere_Plasmas_UAP_Pre-Life_Fourth_State_of_Matter [accessed Mar 13 2024].", "media": null, "score": 77, "upvote_ratio": 0.91, "comment_count": 43, "over_18": false}, "66": {"id": "1bccg4w", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "008AppoAppo", "link_flair_text": null, "time": 1710709131.9256241, "created_utc": 1710186706.0, "url": "https://i.redd.it/ikixez84frnc1.jpeg", "title": "Special", "permalink": "/r/conspiracy/comments/1bccg4w/special/", "selftext": "", "media": null, "score": 2637, "upvote_ratio": 0.95, "comment_count": 128, "over_18": false}, "67": {"id": "1bch2ui", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1710709132.2838101, "created_utc": 1710197489.0, "url": "https://youtube.com/live/goxUXeKIHRg", "title": "No evidence that the U.S. covered up the existence of UFOs", "permalink": "/r/conspiracyfact/comments/1bch2ui/no_evidence_that_the_us_covered_up_the_existence/", "selftext": "", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "68": {"id": "1bbls4p", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Ex-CultMember", "link_flair_text": "PGF", "time": 1710709132.7013915, "created_utc": 1710106436.0, "url": "https://www.reddit.com/r/bigfoot/comments/1bbls4p/patty_not_running_away/", "title": "Patty not Running Away", "permalink": "/r/bigfoot/comments/1bbls4p/patty_not_running_away/", "selftext": "I occasionally hear people question the authenticity of the creature in the PG film because it walks away instead of running away.\nBut, to me, it would make sense for a wild animal (or intelligent, wild hominin species) to not run unless it’s literally getting chased down by a predator.\nWhen a predator sees an animal run away and look scared, they see you as prey and will then go after it. You see that with dogs where you shouldn’t act scared or suddenly start running away because they will immediately give chase and go after you. When you see a bear, it’s the same thing. You are supposed to stand still, stand upright or slowly walk away. If you start running, they will go after you.  When you LOOK like prey, run away and act scared and intimidated, they will think you are prey and not a threat. Predator species are still leary of other animals, even smaller animals, including humans. \nMost animals, including predators, don’t logically know if other animals are dangerous and so will only attack if they feel threatened or are hungry. They don’t want to take a chance of attacking an animal that could be dangerous. Why try to kill an animal that could hurt them if they can just kill safe prey that won’t hurt them. \nWhile a cougar COULD kill a wolf, why risk it if they can just nab a deer, instead of risking getting killed or injured by going after a wolf? From experience and the behavior of other animals, predators get a sense of what they should hunt vs taking a chance with another potential predator dangerous animal. When they see an animal flee, they see that as an indication that it’s a prey species and not a fellow predator or animal they probably should mess with. \nI can see this with my own cat. If he sees a fly buzzing around, a moth, or critter that is running away, he doesn’t hesitate to go after it and kill it. On THE OTHER HAND, when he sees a slow moving bug or animal (like a beetle), despite its size, he doesn’t immediately attack it. He cautiously approaches it, observes it at a distance for a while, and then proceeds to “play with it” but carefully poking and jabbing it with his paw to see how it reacts. It’s probably instinctually where he thinks it could be potentially dangerous because it doesn’t flee right away. Maybe it’s poisoned or can bite back? After awhile when he sees it doesn’t seem to be much of a threat and doesn’t seem to be doing anything that might hurt him, and if looks like it might be injured and defenseless, he’ll finally go in for the kill.\nUnless they are starving or feel threatened, predators usually leave each other but when they come in contact with each other, they don’t want to look weak, like prey, and so i they will either stand their ground or gradually walk away. They don’t want to fight but they also don’t want to look like they are something to mess with each other.\nI imagine Bigfoot behaved the same way. They certainly have experience with other, dangerous animals, such as bears and wolves. If they come in contact with another predator, they probably hold their ground or slowly walk away to not appear scared or act like prey. \nIt’s clear the “Patty” creature is not comfortable coming in contact with humans and is briskly leaving the area but, like other predators and humans who know how to act around dangerous animals, it gets itself out of there quickly but not too fast where it appears like scared prey. \nI’m guessing Bigfoot are a very intelligent ape or human/hominin species, so it doesn’t want to take a chance around humans (despite being smaller) and wants to get out there quickly but also not for like prey. Being intelligent, it might also know we have those “boom-boom sticks” that can kill them. \nSo Patty high tails it out if their as quickly as it can without looking like it is defenseless, weak, prey. ", "media": null, "score": 32, "upvote_ratio": 0.81, "comment_count": 33, "over_18": false}, "69": {"id": "1bc8bhh", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "arealdisneyprincess", "link_flair_text": "News ", "time": 1710709133.172803, "created_utc": 1710176911.0, "url": "https://www.irishstar.com/news/us-news/loch-ness-monster-gender-book-32328506", "title": "People upset over gender of Loch Ness Monster in new book", "permalink": "/r/Cryptozoology/comments/1bc8bhh/people_upset_over_gender_of_loch_ness_monster_in/", "selftext": "", "media": null, "score": 109, "upvote_ratio": 0.86, "comment_count": 69, "over_18": false}, "70": {"id": "1bg3d65", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Microscope2276", "link_flair_text": "Unidentified", "time": 1710709133.3524592, "created_utc": 1710586158.0, "url": "https://i.redd.it/t6taft7weooc1.png", "title": "Dinosaur Looking Humanoids", "permalink": "/r/Humanoidencounters/comments/1bg3d65/dinosaur_looking_humanoids/", "selftext": "The dinosaur picture is a vague reference to what I can describe what I saw. \nIn around 2008 in my house in New England when I was maybe 6ish, I woke up one night and saw 6 of these almost ghostlike figures that all looked the same. They all looked similar to that headbutting dinosaur. Only they were see through, upright and the bumps around their heads were more uniform and rounded almost likebumpy halos. \nI always had an active imagination as a kid and have had sleep paralysis before. This wasn't it. I was fully lucid and watched as they were almost searching my parents, guest room, and my room. When I woke up and saw them I remember two looked into my room like they were shocked that I woke up and was reacting like I could see them. \nMost of the time when dreams blend into the real world seeing something real snaps you out of it. When my mom came into my room, it was almost like she phased through one of them and I couldn't tell it was her at first. They stayed there till my mom convinced me to come down from the top bunk and took me to the living room to calm down. It worked at first but then I saw one phase right through her and look at me when we were walking back to my room which undid all the calmness we achieved. \nIt's a weird event that has stuck with me for over 15 years so I figured someone here may enjoy the story and maybe see a similarity with another encounter to answer the question, was it interdimentional aliens visiting my home or was it a little kid who just had a nightmare. ", "media": null, "score": 47, "upvote_ratio": 0.84, "comment_count": 9, "over_18": false}, "71": {"id": "1bcz3u7", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "ryuga_1564", "link_flair_text": null, "time": 1710709133.7211335, "created_utc": 1710255096.0, "url": "https://www.reddit.com/r/cryptids/comments/1bcz3u7/weird_thing_i_saw_last_year/", "title": "weird thing i saw last year ", "permalink": "/r/cryptids/comments/1bcz3u7/weird_thing_i_saw_last_year/", "selftext": "So i live in a small town in minnesota,about in the middle of the state and me and my friend were riding electric bikes on the roads around my house. It was about 9ish in the summer so it was dark but not fully dark yet. The bikes had flash lights on them so we could see somewhat clear what was in front of us(mainly the road but not far into the road). So about 40 feet in front of us we see a lanky,black figure(blacker than the sky at the time),as we see it we both quickly turn around the bikes and start booking it back home and it starts running after us on the bikes and was (gaining on us at one point as we were going 20 mph) and when it was running its arms were flopping around above its head,it was also running almost straight up. After about 120-150ft of chasing us it gave up and we made it back.\n(sorry about bad writing) \n(also i know this sounds fake and if i read this i would think it’s fake,but im mainly wondering if it sounds like any cryptids) ", "media": null, "score": 48, "upvote_ratio": 0.95, "comment_count": 43, "over_18": false}, "72": {"id": "1bbswgi", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Bigscarygangster", "link_flair_text": "Shadow People", "time": 1710709133.9690428, "created_utc": 1710125709.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1bbswgi/moving_shadows_and_disembodied_voices_possible/", "title": "Moving shadows and disembodied voices. Possible shared hallucination?", "permalink": "/r/Thetruthishere/comments/1bbswgi/moving_shadows_and_disembodied_voices_possible/", "selftext": "I’m gonna cut to the chase I do not believe in the supernatural. I’ve only had one unexplainable experience in my life and I am still to this day trying to find a reasonable explanation for it. This story has been stuck in my head since I was a kid and I start to tear up whenever I think about it.\nThis was in the first house I remember living in, I’m pretty sure we were the first people living there and it certainly wasn’t old enough for someone to have died in it. Anyways I remember as a kid I would regularly hear voices calling my name, the voices did not sound like anyone I know. I would also see huge opaque shadows that would very quickly move across the hallway occasionally. \nIf this was all there was to it I would just assume this was a hallucination caused by a family history of mental illness. I very vividly remember my aunt and cousins visiting our house and I told one of my cousins (I believe she was 13 at the time) about the weird shadows and how they would call my name. I showed her the hallway this would take place in and eventually one of the shadows appeared and moved across the hallway while she was there with me. She jumped a little and just said “woah” in the kind of tone you would use when talking to a dog that’s jumping on you. I remember hearing the voice and asking my cousin if she heard it but she said she didn’t, but she was super creeped out.\nNeither of my parents nor my sibling remember this happening but I remember it so vividly and it was such a frequent occurrence I don’t think it could have been a nightmare.", "media": null, "score": 15, "upvote_ratio": 0.9, "comment_count": 6, "over_18": false}, "73": {"id": "1bgqmzs", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "3rroR039", "link_flair_text": null, "time": 1710709134.366049, "created_utc": 1710655294.0, "url": "https://www.reddit.com/r/threekings/comments/1bgqmzs/i_have_to_ask/", "title": "I have to ask", "permalink": "/r/threekings/comments/1bgqmzs/i_have_to_ask/", "selftext": "Hey are there any rituals games to do to invite a spirit for lewd activities because just saw a post on 4 chan now im curius.", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 6, "over_18": false}, "74": {"id": "1bcvc80", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "biggitydonut", "link_flair_text": "Paranormal Community [Discussion]", "time": 1710709135.2771719, "created_utc": 1710244199.0, "url": "https://www.reddit.com/r/Ghosts/comments/1bcvc80/for_people_who_have_experienced_undeniable/", "title": "For people who have experienced undeniable paranormal things, what do you say to the unbelievers?", "permalink": "/r/Ghosts/comments/1bcvc80/for_people_who_have_experienced_undeniable/", "selftext": "I think people are still very skeptical to this day. I mean we see thousands of videos on YouTube and tick tock  about them. You’d think with smart phones everywhere these days we’d be able to get some undeniable footage of spirits or paranormal. I feel like if they were real, at this point, we’d have undeniable video evidence and the scientific community might even study it. \nBut seems like even with videos, people deny them or skeptical. ", "media": null, "score": 95, "upvote_ratio": 0.86, "comment_count": 207, "over_18": false}, "75": {"id": "1bck8ya", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Kalliiskitty", "link_flair_text": "Glitch Pic", "time": 1710709135.4881651, "created_utc": 1710205587.0, "url": "https://i.redd.it/y7ip08c9zsnc1.jpeg", "title": "Black tab on soda can , rest are silver ", "permalink": "/r/GlitchInTheMatrix/comments/1bck8ya/black_tab_on_soda_can_rest_are_silver/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.33, "comment_count": 15, "over_18": false}}}