{"_default": {"1": {"id": "183vx59", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "GodzillaPunch", "link_flair_text": "Twitter", "time": 1701499666.6506007, "created_utc": 1700952817.0, "url": "https://x.com/KimDotcom/status/1728532157394714739?s=20", "title": "KimDotcom has place a $100,000 bounty on debunking the MH370x situation. He is asking for original video files without the orbs.", "permalink": "/r/ufo/comments/183vx59/kimdotcom_has_place_a_100000_bounty_on_debunking/", "selftext": "", "media": null, "score": 1358, "upvote_ratio": 0.93, "comment_count": 546, "over_18": false}, "2": {"id": "183dkea", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "geekandgamer", "link_flair_text": "Article", "time": 1701499668.1827338, "created_utc": 1700894048.0, "url": "https://i.redd.it/aq6r46l9vf2c1.jpg", "title": "Four Politicians are trying to kill the Unidentified Anomalous Phenomena Disclosure Act", "permalink": "/r/UFOs/comments/183dkea/four_politicians_are_trying_to_kill_the/", "selftext": "Source \nhttps://www.liberationtimes.com/home/black-friday-republican-leadership-takes-axe-to-ufo-transparency-legislation", "media": null, "score": 5670, "upvote_ratio": 0.91, "comment_count": 735, "over_18": false}, "3": {"id": "183lyt5", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Im__not__leaving", "link_flair_text": "Analysis Required :snoo_thoughtful:", "time": 1701499670.276446, "created_utc": 1700925678.0, "url": "https://v.redd.it/gpwdpa4zgi2c1", "title": "What is this?!", "permalink": "/r/aliens/comments/183lyt5/what_is_this/", "selftext": "Filmed 6/22/23 around 5:30am while driving NB I75 near Riverview, FL. Any ideas? ", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/gpwdpa4zgi2c1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/gpwdpa4zgi2c1/DASH_96.mp4", "dash_url": "https://v.redd.it/gpwdpa4zgi2c1/DASHPlaylist.mpd?a=1704091668%2CYzAyOThiNzAxM2RjNTEyMjk3MGM3M2ZjZDY4NWE1OTcxZjU4YzU2ZGY5ZDVlMjEzZmYyZDAxNGUwZmNkOTIxYQ%3D%3D&v=1&f=sd", "duration": 133, "hls_url": "https://v.redd.it/gpwdpa4zgi2c1/HLSPlaylist.m3u8?a=1704091668%2CNDZkMzM5OTA1MjliMGJjOWQ2ZDM3YmY1NTVkYzM0M2YxNGQxY2RmYjBlYjgzYmJiNDg2M2JlZjk2MWQyZjUyNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1667, "upvote_ratio": 0.81, "comment_count": 603, "over_18": false}, "4": {"id": "184xj9s", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Jesusalanis111", "link_flair_text": "Video", "time": 1701499671.5251365, "created_utc": 1701070749.0, "url": "https://v.redd.it/hdreh42ngu2c1", "title": "They need our Help!!! The Final Fight for UFO / UAP Transparency, Tim Burchett & David Grusch are being attacked by Mike Turner, Kevin McCarthy, Mike Rogers, The Pentagon & other Gatekeepers (Part 1)", "permalink": "/r/UAP/comments/184xj9s/they_need_our_help_the_final_fight_for_ufo_uap/", "selftext": "Act Now!!!\nhttps://twitter.com/SafeAerospace/status/1728081844372201530\nSenator Chuck Schumer Amendment\nUnidentified Anomalous Phenomena Disclosure Act of 2023", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/hdreh42ngu2c1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 852, "scrubber_media_url": "https://v.redd.it/hdreh42ngu2c1/DASH_96.mp4", "dash_url": "https://v.redd.it/hdreh42ngu2c1/DASHPlaylist.mpd?a=1704091670%2CZGZmNWViMmFkYjMwNjdkNzNlZDg0ZDM4YmZiYmM3OGU0MzIyMzhkYjgxMTUxNDIwYmIxMzAyZWE4MjVlNDgxNQ%3D%3D&v=1&f=sd", "duration": 886, "hls_url": "https://v.redd.it/hdreh42ngu2c1/HLSPlaylist.m3u8?a=1704091670%2CM2M2YjY2OGQ0MTNlZWEyNmQ1YWI1MWMyYTExYTMwNjhiNjRiYTI4NmZkOWE0MWY5MzljODExNWJiNmE2OThlZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 500, "upvote_ratio": 0.97, "comment_count": 35, "over_18": false}, "5": {"id": "1876sya", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "2201992", "link_flair_text": "Rule 10 Reminder", "time": 1701499672.8032687, "created_utc": 1701309830.0, "url": "https://i.redd.it/4x4nqkvl7e3c1.jpeg", "title": "The world just got a little safer.", "permalink": "/r/conspiracy/comments/1876sya/the_world_just_got_a_little_safer/", "selftext": "", "media": null, "score": 1933, "upvote_ratio": 0.94, "comment_count": 233, "over_18": false}, "6": {"id": "183qzy3", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Dramatic_Waltz_3645", "link_flair_text": null, "time": 1701499673.1348493, "created_utc": 1700939390.0, "url": "https://anonmags.com/bombshell-report-moderna-ran-secret-operation-to-silence-vaccine-critics/", "title": "Bombshell Report: Moderna Ran Secret Operation To Silence Vaccine Critics", "permalink": "/r/conspiracyfact/comments/183qzy3/bombshell_report_moderna_ran_secret_operation_to/", "selftext": "", "media": null, "score": 7, "upvote_ratio": 0.73, "comment_count": 0, "over_18": false}, "7": {"id": "185hyd7", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Treedom_Lighter", "link_flair_text": "humor", "time": 1701499674.1392193, "created_utc": 1701129540.0, "url": "https://i.redd.it/iam3q4rhbz2c1.jpg", "title": "My friends and family threw me a surprise 40th party Saturday night. My wife decided to make the cake herself", "permalink": "/r/bigfoot/comments/185hyd7/my_friends_and_family_threw_me_a_surprise_40th/", "selftext": "Just posting something I thought was awesome because it’s Christmas season and why the hell not. Hope everyone has a happy and healthy month-or-so of super self-conscious and confused generic holiday jargon. Keep it squatchy yo!", "media": null, "score": 389, "upvote_ratio": 0.99, "comment_count": 35, "over_18": false}, "8": {"id": "184p126", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "lilseastar", "link_flair_text": "Lore ", "time": 1701499675.0572894, "created_utc": 1701043226.0, "url": "https://i.redd.it/tkfi3qtu6s2c1.jpg", "title": "The forgotten lore of supersized spiders in cathedrals and churches", "permalink": "/r/Cryptozoology/comments/184p126/the_forgotten_lore_of_supersized_spiders_in/", "selftext": "In Bram Stoker's Dracula-  an inspiring book in many ways in terms of dark mythological creature lore-  Van Helsing illustrates a point about unnatural life with the story of an abnormally large spider: \n\"There are always mysteries in life. Why was it that Methuselah lived nine hundred years, and ‘Old Parr’ one hundred and sixty-nine, and yet that poor Lucy, with four men’s blood in her poor veins, could not live even one day?....Do you know all the mystery of life and death?.... Can you tell me why, when other spiders die small and soon, that one great spider lived for centuries in the tower of the old Spanish church and grew and grew, till, on descending, he could drink the oil of all the church lamps?\"\nThe story of this centuries-old, freakishly large spider that Van Helsing describes as growing fat from oil lamps is likely exaggerated for the dramatic purposes of a horror novel, however it chimes with a real life documented source- Volume 88 of the Edinburgh Magazine and Literary Miscellany (1821). This source was published 70 years prior to the publishing of Dracula.\nThe extract reads: \n  \"The sexton of the church of St Eustace, at Paris, amazed to find frequently a particular lamp extinct early, and yet the oil consumed only, sat up several nights to perceive the cause. At length he detected that a spider of surprising size came down the cord to drink the oil. A still more extraordinary instance of the same kind occurred during the year 1751, in the Cathedral of Milan. A vast spider was observed there, which fed on the oil of the lamps. M. Morland, of the Academy of Sciences, has described this spider, and furnished a drawing of it. It weighed four pounds, and was sent to the Emperor of Austria, and is now in the Imperial Museum at Vienna.\" \nIt is not inconceivable that a spider or other church-dwelling creature would be able to extract some nutrients from oil lamps at that time; the oil was essentially a product of whale blubber. However, the main barrier to a spider growing to weigh four pounds (about the same as a smallish rabbit) would be the biological limitations on its respiratory system supporting a body that size. \nI'm unable to conclusively substantiate what happened to the body from my own research; I could swear that I remember reading somewhere that the body of the spider was eventually lost in a fire. \nFurther reading on a seperate story about a Polish church spider.\nCover image for funsies: Kumo, the spider mascot of Ottawa's Notre Dame Cathedral \nHope everyone finds this interesting!", "media": null, "score": 619, "upvote_ratio": 0.99, "comment_count": 58, "over_18": false}, "9": {"id": "17vxq1h", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Ufonauter", "link_flair_text": "Abduction Event", "time": 1701499675.2626548, "created_utc": 1700066658.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/17vxq1h/in_1949_a_peruvian_man_encountered_mummylike/", "title": "In 1949 a Peruvian man encountered mummy-like entities, bearing a striking resemblance to those encountered in the much more well known 1973 Pascagoula Abduction.", "permalink": "/r/Humanoidencounters/comments/17vxq1h/in_1949_a_peruvian_man_encountered_mummylike/", "selftext": "Published in 1968, a full five years before the Pascagoula abduction even took place. Jim & Coral Lorenzen's book \"UFO'S OVER THE AMERICAS\" chapter \"the flesh crawlers\" goes on to describe the event as relayed by investigator Richard Greenwell to the APRO (now defunct), and was put into contact with the abductee via a Peruvian group going by \"Institute Peruano de Relaciones Interplanetarias\". \nIn this encounter the abductee is referred to as C.A.V, an acronym to protect their identify as Mr. C.A.V or \"v\" as described in the report via the recorded tapes of this interaction between Mr. Greenwell and V. The following will be a summation of these events in best order I could manage as C.A.V during this interaction with Mr. Greenwell has himself a difficult time recalling which events happened in which order. \nIn 1949 V/C.A.V was driving on the Pan American Highway to a location called Lomo de Ballena en route from Pucusana to Lima. C.A.V spotted a shining metallic Disc hovering off to the side of the highway and was approx. 500 meters from where C.A.V had parked. He made his way over to the disc which appeared to be hovering six feet off of the ground taking around ten minutes to arrive. \nC.A.V was twenty meters away from the object when three entities exited the craft, the beings did not appear as far as C.A.V could recall, to exit from a visible door but simply arrived in front of him. Quoting C.A.V directly he described the entities as \"-they didn't have a defined form. They looked like three mummies. They had the profile of human beings but their legs were joined. They did not have two legs but one \"double\" one--like twins.\"\nAgain he reiterated \"-they had the form of, well, the description was as if they were sort of mummies. They had no exterior sign of sex, ears, or eyes. A body, a head, and legs joined together.\"\nHe would then go on to state to Mr.Greenwell that these entities has \"one large foot\", and they moved as such \"Yes, yes. They went along the ground but they moved, they sort of slid along the ground.\" Going on to state they moved \"normally\" and made no sound when doing so. \nWhen describing the hands and arms he would go on to say \"Yes, they had arms but their hands consisted of a group of four fingers stuck together and a separate thumb.\"\nThe question of their overall appearance was as such \"No. They had a sort of strange skin, a sort of towely, sandy-colored skin.\"\nWhen asked by Mr.Greenwell if C.A.V meant \"clothing\" or a suit of some sort C.A.V replied \"No, no! They didn't have any clothing. Their only covering was a strange towely skin.\" As well as adding to their facial features or lack-there of\n\"The head had no features at all, except at about the height of the eyes there was an oblong substance like jelly with a sort of bubble in the center. It was the only exterior feature. No ears, no mouth, no nose, nothing. The nose, or where it should be, had a form of a nose, sort of like when you pass a tight stocking over your face. No Nostrils.\"\nIt was at this point these entities began to speak (In the interview C.A.V could not determine which entities were speaking, and whether or not this conversation was occurring via normal speech or via some sort of telepathy) \nAdding to this already strange encounter, the entities did not speak to him in Spanish but in an English accent he described as \"someone who learned the language without adopting an accent.\" The entities would then ask C.A.V where they were located, and if they were located in north america, to which C.A.V informed them that it was in fact south america. At this point the entities swapped from using english into Spanish. Again C.A.V would refer to this spanish as \"learned spanish\" without a specific accent. \nWhen asked if these entities were surprised to find themselves in the wrong continent C.A.V stated they did not, and to speak with the \"chief\" of the land which C.A.V would state there were many \"chiefs\", he attempted to correct the entities asking if they meant \"president\" however according to him they were adamant in using the term \"chief\" specifically. \nIn C.A.V's words he would then say, \"Well, I said I could arrange maybe for someone to come and speak to them. I said I was frightened that they would do us harm, but they answered that they wanted to do no harm and just wanted to speak to my chief, as they had very important things to tell him. then came a series of questions and answers on both sides-\"\nEmphasizing he could not recall which order these questions were answered C.A.V would state the following questions and responses between him and these entities. \n\"One of the things they told me is that we were playing around with a new substance that could endanger the peace of the world--of the universe\"\n\"I asked them where they came from, and they said a strange name. We would call it a star they said, but they came from a place with a strange name I could not understand; probably their planet somewhere.\"\n\"From the conversation we had, I was able to deduce that they were frightened that, by playing around with atomic explosions, we would create some sort of chain reaction which would not only destroy the world but endanger the universe\"\n\"In another question, I [C.A.V] asked them who their God was and I noticed a sort of mockery. \"God?.\" they said. \"What God?\" \"Well, the Supreme Creator,\" I said, \"who made the universe.\" \"Well, we are like gods,\" they said. \"How can you be gods?\" I asked. And they said that we were very backward. They said that we fought over a flag, over a frontier, that we had wars of trifling matters, like children. We were like children literally still in our diapers. We fought over food, we fought over sea. I then asked them if they did not have those same defects. but they said that they had overcome those years, centuries ago.\"\nMr Greenwell would ask for clarification of years or centuries which C.A.V would reply with \"Well, I couldn't say. They said a long time, a long time ago they had overcome the defects of our planet. They told me that they extracted from the sun...I learned later that this is called photosynthesis--which I did not know. the sun, which is the chief source of all energy, provided them with all their necessary energy. They obtained humidity from the atmosphere.\"\nAgain during this conversation as C.A.V asked the entities how they traveled across space \"\nV: No. The name they gave me was strange and unknown to me...I asked them what propulsion method they employed to cross space. They said that, at will, they could add or subtract weight from their vehicle. They accumulated energy through a heat system. Well, I don't understand it at all, but they said it was a method of changes in temperature which created some sort of energy. They said that we had to swallow, digest, and convert our food into energy, whilst they received their energy directly from the sun. They also said they did not practice sex. they said they had no sexes any more or sexual desires, and had no sex problems like us humans. They never felt hunger, which did not make them envious of their brothers. Everything belonged to everyone, while the humans on earth fought over silly things like flags and lands. I then asked them if they had no sex, how did they reproduce? They said that they had the ability to divide themselves down the middle and split themselves into two creatures.\"\nC.A.V would then ask how they could survive traveling at high speeds without their bodies being harmed and one instructed C.A.V to touch him. From C.A.V \"I sort of put my arm around one and pressed his body and had the idea that, if I could make him stay, this would be my proof. You see, I was under a state of shock and was not thinking too clearly. I felt something sort of \"biscuity\"--they had hard bodies. They had no bones, apparently, but cartilages--this permitted them to receive all sorts of blows without damage. I asked them if they had hostile intentions toward us, and they said no; all that they wanted is that we stopped playing around with such a dangerous weapon.\"\nAt this point the entities invited C.A.V aboard the object itself, unlike other such UFO encounters, C.A.V had to physically pull himself into the craft as there was no ladder or steps (which was described as semi-circular), nor was he lifted by any sort of anti-graivty system. He would state that the inside of the craft was mostly empty besides a \"ledge\" that circled the whole interior of the craft. \nOnce C.A.V was inside the craft the entities made noises among themselves described as similar to static on a radio. These beings would then show C.A.V how they would share liquids between each other simply by placing their shoulders together. C.A.V was unsure whether or not this was water as we know it or some other type of bodily substance. But he was told that they receive such moisture from the atmosphere via humidity. \nInside the craft itself C.A.V would state this ledge and the encompassing area on the inside of the craft was transparent and curved towards the edges of the inside where the disc would naturally appeared to follow. And when asked by C.A.V the entities stated the \"ledge\" was all that was needed to accumulate  energy and to pilot the craft. \nThe craft then rose up as C.A.V could feel the process as it flew over the coast, stopped  and went back to its original position. C.A.V would remark that this felt \"rather fast\" and the entities stated they could travel and maneuver at higher speeds but C.A.V would be unable to survive it himself. \nAs they returned and \"landed\" back to their original position C.A.V would ask these entities to demonstrate this ability to split and divide to which they complied. One of these entities would lay down on the ground inside the craft and the middle section of the entity would begin to thin in the middle before splitting in half to form another identical being. The entities stated that the newly formed being retained all memories and knowledge of the original entity after splitting apart. C.A.V asked if they got bored of being \"eternal\" and that this process was a kind of catharsis for them. C.A.V would state that one of these entities was smaller in size than the original and remained that way for the remainder of the encounter. \nThen in a next step which might surprise many, C.A.V attempted to actually grab or capture one of these entities (stating that he was under some type of altered thought process, and that normally this would never be something he would consider otherwise). But when embracing the entity it released a type of soapy liquid that let it slip out of his arms. C.A.V stated that he believed if he had proof of this encounter by taking one of them that he could become rich. \nAt some point they agreed to return the following day in the same location with the requested \"chief\", the entities climbed aboard the craft (C.A.V did not recall how the door closed or if it did). C.A.V would remark how it left, stating \"no. It inclined at about thirty degrees, made a semicircle as if it were going toward the hills, turned toward the sea, picked up great speed and disappeared.\"\nThe entire encounter was as far as he could tell, about half an hour. \nC.A.V would later return to that area, however the entities did not return possibly due to the \"chief\" not being in tow with C.A.V but we can only speculate.", "media": null, "score": 163, "upvote_ratio": 0.97, "comment_count": 11, "over_18": false}, "10": {"id": "184ixsp", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Impulsive_Creature", "link_flair_text": null, "time": 1701499676.2060773, "created_utc": 1701027958.0, "url": "https://v.redd.it/f37z6qagxq2c1", "title": "\"Sasquatch and Hunter's Encounter\" Handmade polymer clay Sculpture by me. I'm selling it.", "permalink": "/r/cryptids/comments/184ixsp/sasquatch_and_hunters_encounter_handmade_polymer/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/f37z6qagxq2c1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/f37z6qagxq2c1/DASH_96.mp4", "dash_url": "https://v.redd.it/f37z6qagxq2c1/DASHPlaylist.mpd?a=1704091675%2CNDE5MGYyZTljMjY3ZDUzN2Y3NTdiOTU3MGIwYTBjNDE2ODMxNTJjOWI4YTdlNTViMmM5ZmI5ZjdkNTI3YjM2Mw%3D%3D&v=1&f=sd", "duration": 72, "hls_url": "https://v.redd.it/f37z6qagxq2c1/HLSPlaylist.m3u8?a=1704091675%2CMzJiODJmOWEwMzI2MTBkNzFhNTg5OTUyNTZiNTc1Y2FkYTg1NDE1MDVhZDlmZTc5OTEyMjFiNzU0YzgyODIzYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 107, "upvote_ratio": 0.94, "comment_count": 12, "over_18": false}, "11": {"id": "18419dz", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "fanfictionmusiclover", "link_flair_text": "Theory/Debunking", "time": 1701499676.5274324, "created_utc": 1700968702.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/18419dz/i_think_i_died_twice_when_i_was_a_child/", "title": "I Think I Died Twice When I Was A Child", "permalink": "/r/Thetruthishere/comments/18419dz/i_think_i_died_twice_when_i_was_a_child/", "selftext": "Yesterday, I was on a school trip to Kozani, Greece and we were four in a car, V, Me, Z and E when the topic of the conversation went to car crashes, seatbelts and speed since my classmates are a bit older than me and remember when seatbelts weren't compulsory when these memories came to the front of my mind while always being in the back but always knew they didn't make sense.\nThe first memory is one I had always thought that it was a dream because I have it in two different versions in my head.\nThe memory goes as such, I'm little, age maybe 4 or 5 years old and I'm in my parents' car and sitting between my paternal grandma and my paternal aunt, I wasn't wearing a seatbelt because at that time we didn't know the car had a third seatbelt buried in the seats, we figured it out later though. We were driving pretty normally until a police car got in front of us and drove at high speed, we kept our distance till the police car abruptly stopped and we smashed into it.\nThat is where the memory splits in half; in one memory I'm about to fly into the windshield but my grandma holds me back and I only hit my ear on the pillow of the front seat. \nThe other memory that I really thought I dreamt of was me going through the windshield and laying on top of the car then from an out-of-body perspective, I saw myself who had her eyes open staring up and blood coming out of her ears. I saw the police officers we crashed into come out and rush to see what they did and my mum and dad on the side of the road sobbing. \nI remember thinking that I didn't like hearing my mum cry and wanted to go back so I floated towards my body and the next thing I knew I was blinking because somebody was shaking me. I realize that I'm in my bed and Dad is waking up for the trip. I threw a tantrum refusing to go into the car and I demanded that my booster seat be in the car instead of not taking it with us. Mum and Dad try to place my booster seat in the middle of the back seats and that is how they figure out the third seatbelt! Seeing the third seatbelt and my booster seat installed I calmly climb into the car, wipe my tears and start playing with my stuffed monkey. \nThroughout the trip, I didn't let go of my grandma's hand or my stuffed monkey and I stared through the windshield so intensely that Dad found it out and asked me why I was being so weird. I told him I had a bad dream of me dying because of the police car. Dad was about to say that there was no police car when the police car appeared and I begged Dad to take a different exit, my begging and crying woke Mum up and asked what happened and was clued in. Dad sighing and shaking his head tells me that the 2nd exit will make our trip longer so I better hold my pee. \nUnfortunately, we met the police car at the second stop light after taking exit 2 and we crashed I hit my ear in the pillow of the front seat but grandma had a semi-firm hold of me and the belt did its job to a good extent. But I didn't die this time!\nNow whenever I recall this event with my family, they all say that I didn't hurt my ear much just bumped it and that grandma held me in place. The third seatbelt was discovered by us AND the police on scene as we were stopped and gave our statements. Dad said that I was on the side of the road staring at the windshield with an angry look and even went up to it and smacked it with my palm calling it a bad windshield. \nTo this day I have an intense fear of not wearing my seatbelt, I don't take my seatbelt off if the car engine isn't off too. Dad says I was always like this, especially after that crash, he found it funny and one more odd thing about me. The other odd thing was my table manners which were like an adutl's while not being taught table etiquette up to that age. Even the restaurant staff had found it funny and odd I have been told, my age during that time was three years old, a year or two before the car crash.\nThe second time I think I died was when I got run over by a car when I was seven years old. I was in my current hometown, back then it was just my maternal grandma's town\nWe were visiting in the summer and running some errands when I started having a fight with my mum about me not wanting to go to another shoe store because I was tired of tying and untying my shoes. Mum crossed the road and I refused in an act of rebellion when I bumped into someone coming out of the bank that was on the same pavement as me. That someone was my Dad. He asked what was going on and Mum yelled across the street the whole story. People passing by looked at us weirdly when a man on a motorcycle in the process of climbing down, told me I was being ungrateful and that kids in Africa would love to have more shoes. Dad agreed with the stranger and told me to cross the street and stop being difficult, I'm old now and not a child. \nAnnoyed I set out to cross the street but I don't look both ways. Next thing I know I'm staring at the driver of a Jeep and my hands and feet are at odd angles and they hurt and so is my neck. The look of pure horror is the last thing I recall before my vision faded into black. The next thing I knew I was standing by my mum's side telling me that we needed to go to another shoe store and I recognized the bank. I keep my mouth shut but my whole body is tingling and I'm shivering. We meet up with Dad who comes out of the bank and he grabs me to hug me and says I'm cold and then starts rubbing my shoulders to start warming me up. For the rest of the errands, I'm forced to stay by the sun to keep me warm. \nTo this day, I'm 24 years old, whenever I'm on that street I stand across the bank and I feel shivers. I almost had a panic attack when I had to enter said bank last year to settle some things with my debit card. \nBoth death memories snuck up on me while we were driving and we were talking about car crashes. I added to the conversation that I have been in four car crashes and then we changed the subject. But the realization stayed with me throughout the trip. \nDid I quantum-jump universes those times? My theory is yes and it's not the first time....\nAny other thoughts?", "media": null, "score": 80, "upvote_ratio": 0.94, "comment_count": 22, "over_18": false}, "12": {"id": "186g0e0", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Bitter-Melona", "link_flair_text": null, "time": 1701499676.8819993, "created_utc": 1701229475.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/186g0e0/couldve_been_strangled_today/", "title": "Could’ve been strangled today", "permalink": "/r/LetsNotMeet/comments/186g0e0/couldve_been_strangled_today/", "selftext": "Found out about this sub after posting in creepy encounters and thought I would post here after being redirected by a mod. \nToday, I was enjoying the nice weather at my local park. They have two pretty small loops, one a little more covered by trees and one that circles around a small pond. \nWhen I got there only a few other people were there, so I had my AirPods in one ear and was enjoying my music, singing to the open air. As I got closer to people, I would take my singing down to a lower volume (slightly louder than a whisper). While it is a public park, I was trying not to be too much of a nuisance to the other people there. People were smiling at me as I passed and everyone seemed to be in a good mood. \nWell, I decided to go on the slightly more wooded/secluded path for my last lap before I go home. An older man passed by with his dog, and we passed by each other no problem, when I start to hear this weird almost chirping sound. We are outside, so I assume maybe it’s bugs, but it starts getting louder and less bug sounding. I briefly look over my shoulder and realize it’s an alarm or something and getting closer, because another guy is walking behind me. He goes to pass me and I notice he has some weird plastic looking rope in his hand (the kind they use around packages some times). It is the middle of the day and we are in a pretty public space, where I didn’t feel unsafe. \nThat is until, this guy, as he is passing me, looks at me dead in the eye and says “If that other guy wasn’t here, I would’ve strangled you”. Not really processing what he said, I got out a “Really?”and he replies “Yes”, as he twists this rope around his hand. He continues walking and I got this deep chill down my spine, as the reality sunk in of what this guy had told me. I texted my partner and he immediately called me and stayed on the phone with me until I got home. \nI truly believe I would have been in danger, if no one else was around. Incidents like this make me scared of going out alone as a woman.\nUpdate: Nov. 29, 2023 \nAfter seeing all of your comments, I called the police this morning to report it. They’re sending officers to my apartment, so I can make the official report. ", "media": null, "score": 527, "upvote_ratio": 0.99, "comment_count": 27, "over_18": true}, "13": {"id": "185fuf6", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "Throwayforasickmind", "link_flair_text": null, "time": 1701499677.0875912, "created_utc": 1701124240.0, "url": "https://youtube.com/watch?v=sHwzoQ2m7w4&si=bPtMVAc4qut7qCKW", "title": "Hole in the head: Lost documentary about a woman drilling a hole in her head with a dentist's drill", "permalink": "/r/truecreepy/comments/185fuf6/hole_in_the_head_lost_documentary_about_a_woman/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "WOMAN DRILLS HOLE IN HEAD: The DEEPEST Lost Media Iceberg Explained part 18", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/sHwzoQ2m7w4?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"WOMAN DRILLS HOLE IN HEAD: The DEEPEST Lost Media Iceberg Explained part 18\"></iframe>", "author_name": "A YouTube Account", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/sHwzoQ2m7w4/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@SATANS_SPHYNX"}}, "score": 9, "upvote_ratio": 0.91, "comment_count": 2, "over_18": false}, "14": {"id": "186dt92", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Thefemcelbreederfan", "link_flair_text": null, "time": 1701499677.2871852, "created_utc": 1701223411.0, "url": "https://www.reddit.com/r/threekings/comments/186dt92/any_harmless_rituals/", "title": "Any harmless rituals?", "permalink": "/r/threekings/comments/186dt92/any_harmless_rituals/", "selftext": "I'm a scared cat", "media": null, "score": 10, "upvote_ratio": 0.92, "comment_count": 6, "over_18": false}, "15": {"id": "1851ted", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "syahir92", "link_flair_text": null, "time": 1701499678.1467247, "created_utc": 1701087958.0, "url": "https://v.redd.it/b38luqmuvv2c1", "title": "At police statiton...........................", "permalink": "/r/Ghosts/comments/1851ted/at_police_statiton/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/b38luqmuvv2c1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/b38luqmuvv2c1/DASH_96.mp4", "dash_url": "https://v.redd.it/b38luqmuvv2c1/DASHPlaylist.mpd?a=1704091677%2CMjgxNTdjZGE5MDRlMzNlOTJmMDAyZGQ4ZmU2OWM2ZmI2YzY2ODk3MjQ2MmNkOWUyM2JkYjc0NTQ1MDY0MzFhZQ%3D%3D&v=1&f=sd", "duration": 114, "hls_url": "https://v.redd.it/b38luqmuvv2c1/HLSPlaylist.m3u8?a=1704091677%2CNjBkOGVhZWU4YmFjM2JkZjRkNjkyZGJlNzEyNTUzMmZhZGRhZTczNWVjNjM4YzgzYWFkMzhjMzA3ZjliNjk0OA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 906, "upvote_ratio": 0.9, "comment_count": 164, "over_18": false}, "16": {"id": "186rdhh", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "HammingZaza", "link_flair_text": "Glitch Vid", "time": 1701499678.5640926, "created_utc": 1701270003.0, "url": "https://v.redd.it/jcs5b5gs383c1", "title": "What on this planet is happening here?", "permalink": "/r/GlitchInTheMatrix/comments/186rdhh/what_on_this_planet_is_happening_here/", "selftext": "", "media": null, "score": 147, "upvote_ratio": 0.88, "comment_count": 35, "over_18": false}, "17": {"id": "1867fk5", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "MK121895", "link_flair_text": "Local News", "time": 1701499680.1694202, "created_utc": 1701207252.0, "url": "https://www.the-express.com/news/us-news/119750/CIA-secret-office-helped-military-get-UFOs-worldwide", "title": "The CIA has retrieved 'at least nine UFOs' from crash sites worldwide", "permalink": "/r/ufo/comments/1867fk5/the_cia_has_retrieved_at_least_nine_ufos_from/", "selftext": "", "media": null, "score": 852, "upvote_ratio": 0.93, "comment_count": 148, "over_18": false}, "18": {"id": "186swnl", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "JeffTS", "link_flair_text": "Article", "time": 1701499682.0247936, "created_utc": 1701273886.0, "url": "https://www.express.co.uk/news/weird/1839079/ufo-catastrophic-leak-usa-warning", "title": "US staring down the barrel of 'catastrophic' UFO leak, retired army colonel says", "permalink": "/r/UFOs/comments/186swnl/us_staring_down_the_barrel_of_catastrophic_ufo/", "selftext": "", "media": null, "score": 4137, "upvote_ratio": 0.82, "comment_count": 1298, "over_18": false}, "19": {"id": "187fssi", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "twist_games", "link_flair_text": "Image 📷", "time": 1701499684.0332692, "created_utc": 1701341388.0, "url": "https://i.redd.it/078dhzwftg3c1.jpg", "title": "What a pupil could say about extraterrestrial live.", "permalink": "/r/aliens/comments/187fssi/what_a_pupil_could_say_about_extraterrestrial_live/", "selftext": "If we ever come in contact with alien live and especially intelligent alien live, then it's important to look at there pupils, allot of reports on aliens show that they have black eyes, this could be some kind of glasses to protect there eyes.", "media": null, "score": 1401, "upvote_ratio": 0.93, "comment_count": 159, "over_18": false}, "20": {"id": "186fpcp", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "News", "time": 1701499684.9504602, "created_utc": 1701228594.0, "url": "https://x.com/RepLuna/status/1729694609255645551?s=20", "title": "[Rep. Anna Paulina Luna] My office is now putting together a bipartisan press conference on the pushback we are getting regarding UAPs. To be held at the Capitol this Thursday morning. This will be open to the public. More to come. @timburchett @mattgaetz @JaredEMoskowitz", "permalink": "/r/UAP/comments/186fpcp/rep_anna_paulina_luna_my_office_is_now_putting/", "selftext": "", "media": null, "score": 385, "upvote_ratio": 0.98, "comment_count": 25, "over_18": false}, "21": {"id": "187s8qk", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "EuphoricTrilby", "link_flair_text": null, "time": 1701499686.5054321, "created_utc": 1701376086.0, "url": "https://i.redd.it/2028qobmoj3c1.jpg", "title": "Tell me you’re on Epstein’s client list, without actually saying it", "permalink": "/r/conspiracy/comments/187s8qk/tell_me_youre_on_epsteins_client_list_without/", "selftext": "", "media": null, "score": 1876, "upvote_ratio": 0.92, "comment_count": 137, "over_18": false}, "22": {"id": "184iil5", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1701499686.8050952, "created_utc": 1701026841.0, "url": "https://youtu.be/M1G8ZzfahIM", "title": "University Instructor Says Space Aliens Are Breeding With Humans!", "permalink": "/r/conspiracyfact/comments/184iil5/university_instructor_says_space_aliens_are/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "University Instructor Says Space Aliens Are Breeding With Humans!", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/M1G8ZzfahIM?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"University Instructor Says Space Aliens Are Breeding With Humans!\"></iframe>", "author_name": "Paranormal Highway", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/M1G8ZzfahIM/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@ParanormalHighway"}}, "score": 4, "upvote_ratio": 0.83, "comment_count": 0, "over_18": false}, "23": {"id": "1846ag4", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "DarthVader808", "link_flair_text": "holiday cheer", "time": 1701499687.521122, "created_utc": 1700987505.0, "url": "https://v.redd.it/girw25o5ln2c1", "title": "The Patterson Gimlin Holiday Special", "permalink": "/r/bigfoot/comments/1846ag4/the_patterson_gimlin_holiday_special/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/girw25o5ln2c1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/girw25o5ln2c1/DASH_96.mp4", "dash_url": "https://v.redd.it/girw25o5ln2c1/DASHPlaylist.mpd?a=1704091687%2CYTQxMWQ2MGFlZDAyMzEyMmM2YzVmNmMzMjJkMWI4M2U3YTZjNGM1YzcxNzAzOGFjNzgzZmYwZmM5YmU4YTVhNw%3D%3D&v=1&f=sd", "duration": 13, "hls_url": "https://v.redd.it/girw25o5ln2c1/HLSPlaylist.m3u8?a=1704091687%2CMzA1MWMzNzdlMGViOTNhNjczMzRhYWI0MjdhNWRhMTFkNjAwMjQ3NDUzOWEyNGEzYzM0OTNiZjNjNDY4NjcyZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 209, "upvote_ratio": 0.88, "comment_count": 33, "over_18": false}, "24": {"id": "1857u8c", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "allseeingian", "link_flair_text": null, "time": 1701499688.5314896, "created_utc": 1701104817.0, "url": "https://v.redd.it/g92ax2zniw2c1", "title": "Giant crab", "permalink": "/r/Cryptozoology/comments/1857u8c/giant_crab/", "selftext": "", "media": null, "score": 502, "upvote_ratio": 0.93, "comment_count": 71, "over_18": false}, "25": {"id": "1867w1z", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "ndonadio22", "link_flair_text": null, "time": 1701499690.1272426, "created_utc": 1701208321.0, "url": "https://i.redd.it/phb3ewjrt53c1.jpg", "title": "Visited the Flatwoods Monster Museum yesterday in WV. Did not disappoint.", "permalink": "/r/cryptids/comments/1867w1z/visited_the_flatwoods_monster_museum_yesterday_in/", "selftext": "Awesome little museum; took home my very own Braxxie lantern.", "media": null, "score": 57, "upvote_ratio": 0.97, "comment_count": 2, "over_18": false}, "26": {"id": "187aux5", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Addiason_Vess", "link_flair_text": "Discussion/Advice", "time": 1701499690.3649104, "created_utc": 1701322109.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/187aux5/my_experience_with_a_creature/", "title": "My experience with a creature", "permalink": "/r/Thetruthishere/comments/187aux5/my_experience_with_a_creature/", "selftext": "Starting off I live in the Appalachian mountains, but this happened in my front yard. Back in 2014 around early fall, I was outside with my dog letting him do his business before bed. I looked out by the well and saw movement but dismissed it, about 2 or 3 minutes later I saw dog like legs moving in front of the vehicles about 5ish feet from me, thinking it was a stray I yelled at it to leave but it stopped and turned like a horse does, 2 glowing yellow eyes the size of dinner plates with it's head just below the powerlines maybe 9 foot. My dog looked up and started to growl and bark in a way he never has before or since, that's the only reason I know I didn't hallucinate it. After a minute it just turned and walked back the way it came and I've never saw it again. If anyone has an idea about what that thing was I'd love an explanation.", "media": null, "score": 59, "upvote_ratio": 0.94, "comment_count": 17, "over_18": false}, "27": {"id": "185befi", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Conscious_Reading_16", "link_flair_text": null, "time": 1701499690.7300687, "created_utc": 1701113511.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/185befi/narrowly_avoided_being_murdered/", "title": "Narrowly avoided being murdered", "permalink": "/r/LetsNotMeet/comments/185befi/narrowly_avoided_being_murdered/", "selftext": "This is a story of someone I knew and had cut ties with because he was a fucking psycho, the first half will be to add context as to why I cut him off and the second half is what makes it a \"let's not meet\"  I don't know if he uses reddit so I'll omit ages and locations\nIt started about 4 years ago when I was living in a friend's house while attending a nearby university, it was myself, my friend, his sister and their parents.\nRoughly about 2 weeks into staying there my friends sister invited her boyfriend to live in the house too and by all accounts he was a pretty cool guy at first, very sociable and full of great stories, we often sat around the table for drinks or talked about life having a smoke in the garden. within the first month however as he started to get comfortable cracks started to show in this veneer. \nHe would rant about government conspiracy, how he was always a wronged party, he was big into sigma male bullshit and martial arts and christ did he have a temper. He had this big dog he always kept in a cage that was extremely violent when he wasn't around. The dog attacked his girlfriend and had to be put down, that's when the guilt trips towards her began and the ranting became incessant. \nAbout 2 months later he had the bright idea to live in a shipping container (mainly because the parents wanted him out) and dragged his girlfriend along for the ride, I'm not talking about one of those chique little restoration jobs.\nThis was a rented container, in a storage yard among the outskirts of the town we were living in, he would intimidate and threaten the staff there constantly until they called the police. This of course was another conspiracy, he became increasingly abusive to his girlfriend to the point where the family got involved to get her out of there, I stuck close to them havibg pretend to be on his side until we could safely get her out, he . They broke up which he blamed me for claiming I was poisoning her against him to make her mine, she has a new partner now and they are happy,, we all blocked the psycho ex on everything possible but he continued to harass them until eventually he disappeared or so we thought\nFast forward to last year, I started to revieve messages over social media from several different accounts, blocking each one in turn when I discovered who it was.\nSome friendly and some hostile, one of these profiles however was pretending to be someone I knew from university, we talked about life and how things were going eventually I was invited to a house party, claiming it was a free house and plenty of people were coming, I booked the time off work, made my travel plans and kept talking to this friend coming up to the date of the party, I mentioned it to my friends sister  and she was interested in going herself, until I mentioned the address and she panicked.\nThe address in question was a property belonging to the crazy exes father that was scheduled for sale. I waited until the day of the party and called the police to check the property claiming a suspected break in, they found 5 people there including the ex, parked out the front was a butchers van equipped for food storage and a collection of knives, hammers and rope.\nI'm glad I didn't go", "media": null, "score": 260, "upvote_ratio": 1.0, "comment_count": 20, "over_18": true}, "28": {"id": "185an58", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "_White_W0lf", "link_flair_text": null, "time": 1701499690.9045472, "created_utc": 1701111644.0, "url": "https://www.reddit.com/r/truecreepy/comments/185an58/wtf_is_this/", "title": "Wtf is this ?", "permalink": "/r/truecreepy/comments/185an58/wtf_is_this/", "selftext": "https://www.reddit.com/r/truecreepy/comments/175cuw6/cant_risk_it/?utm_source=share&utm_medium=web2x&context=3", "media": null, "score": 0, "upvote_ratio": 0.23, "comment_count": 0, "over_18": false}, "29": {"id": "184ysje", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "lookslikeyoureSOL", "link_flair_text": null, "time": 1701499691.088391, "created_utc": 1701076115.0, "url": "https://www.reddit.com/r/threekings/comments/184ysje/is_there_an_erowid_experience_reports_website_or/", "title": "Is there an \"Erowid experience reports\" website (or book) that serves as a compilation of experiences people have had while doing deliberate invocation rituals/theurgy?", "permalink": "/r/threekings/comments/184ysje/is_there_an_erowid_experience_reports_website_or/", "selftext": "I posted this over on /r/occult and somebody pointed me in the direction of this sub. Im interested in reading about serious attempts.", "media": null, "score": 7, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "30": {"id": "186134x", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "WarningNo9188", "link_flair_text": null, "time": 1701499692.0395906, "created_utc": 1701191471.0, "url": "https://v.redd.it/ofy53oimf43c1", "title": "Spirits of deceased pets? My dog passed last month and on two separate occasions I have experienced what look like things moving for no definitive reason. Both clips were taken the same day one during the day and one at night.", "permalink": "/r/Ghosts/comments/186134x/spirits_of_deceased_pets_my_dog_passed_last_month/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/ofy53oimf43c1/DASH_1080.mp4?source=fallback", "has_audio": false, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/ofy53oimf43c1/DASH_96.mp4", "dash_url": "https://v.redd.it/ofy53oimf43c1/DASHPlaylist.mpd?a=1704091691%2CYWVlMDg4MjUwOGVjMTY4MzQwNTYxYjNjM2M1MGEzYzM3YzNlMjQ2ODM1MGJlNGFkNTQxYzdkNGM3YTFkYmQ4MQ%3D%3D&v=1&f=sd", "duration": 19, "hls_url": "https://v.redd.it/ofy53oimf43c1/HLSPlaylist.m3u8?a=1704091691%2CNGQwOGU5ZDNjNzZhZmZhNzdmMzNmMjNlMzk1ZmRlNzk2NDQxMmY1Y2ViN2E3MGNiNDRhZjBiZmIxNjIxNjcwNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 689, "upvote_ratio": 0.82, "comment_count": 180, "over_18": false}, "31": {"id": "185ed18", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Negative-Money6629", "link_flair_text": "Glitch Pic", "time": 1701499692.4125676, "created_utc": 1701120713.0, "url": "https://i.redd.it/c9s80zt8ly2c1.jpg", "title": "When the textures don't load IRL", "permalink": "/r/GlitchInTheMatrix/comments/185ed18/when_the_textures_dont_load_irl/", "selftext": "", "media": null, "score": 97, "upvote_ratio": 0.98, "comment_count": 8, "over_18": false}, "32": {"id": "187jcn3", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Nightshade09", "link_flair_text": "Article", "time": 1701499694.4365082, "created_utc": 1701353263.0, "url": "https://www.dailystar.co.uk/news/world-news/mystery-mexican-aliens-definitely-not-31562153", "title": "Mystery Mexican aliens are 'definitely not human' and have 30% DNA of 'unknown species' - Daily Star", "permalink": "/r/ufo/comments/187jcn3/mystery_mexican_aliens_are_definitely_not_human/", "selftext": "", "media": null, "score": 566, "upvote_ratio": 0.79, "comment_count": 399, "over_18": false}, "33": {"id": "185xjx0", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "CreditCardOnly", "link_flair_text": "Article", "time": 1701499695.9865763, "created_utc": 1701182344.0, "url": "https://www.dailymail.co.uk/news/article-12796167/CIA-secret-office-UFO-retrieval-missions-whistleblowers.html", "title": "Matt Ford reveal: CIA has a secret office that conducts UFO retrieval missions", "permalink": "/r/UFOs/comments/185xjx0/matt_ford_reveal_cia_has_a_secret_office_that/", "selftext": "", "media": null, "score": 3674, "upvote_ratio": 0.85, "comment_count": 754, "over_18": false}, "34": {"id": "188ldcb", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Grey-Hat111", "link_flair_text": "Experience ", "time": 1701499697.8783937, "created_utc": 1701462007.0, "url": "https://v.redd.it/ap2t3zyxrq3c1", "title": "Figured I'd share this here as well. In 2001, I was abducted by 2 \"Greys\"", "permalink": "/r/aliens/comments/188ldcb/figured_id_share_this_here_as_well_in_2001_i_was/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/ap2t3zyxrq3c1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 854, "scrubber_media_url": "https://v.redd.it/ap2t3zyxrq3c1/DASH_96.mp4", "dash_url": "https://v.redd.it/ap2t3zyxrq3c1/DASHPlaylist.mpd?a=1704091696%2CYzc2Zjc1YjUzZDAwODFjN2YwOTZhOWNmY2FhNjM3MWI3NTVlM2IzNDRmNjg4ODJmNTAxZjAzY2Q2YTQzMzVmOQ%3D%3D&v=1&f=sd", "duration": 396, "hls_url": "https://v.redd.it/ap2t3zyxrq3c1/HLSPlaylist.m3u8?a=1704091696%2CYThjMTE4MGYwYzgwNDA4NTAzZWI0NmIzNDMzZjQzZGIwM2JmNDkwMGQ5OTcxMTQ4Y2FlMTBmZTFjYjYzNTM3OQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1274, "upvote_ratio": 0.77, "comment_count": 568, "over_18": false}, "35": {"id": "183uuxq", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "News", "time": 1701499698.9517345, "created_utc": 1700949951.0, "url": "https://twitter.com/ChrisKMellon/status/1728529969196781994", "title": "[Christopher Mellon] Unfortunately, my understanding is that the Schumer-Rounds Amendment is poised to be shot down on Monday by Republican leadership on the House Armed Services Committee. This is the last opportunity for interested constituents to make their voice heard on this issue.", "permalink": "/r/UAP/comments/183uuxq/christopher_mellon_unfortunately_my_understanding/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/ChrisKMellon/status/1728529969196781994", "author_name": "Christopher K. Mellon", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">Unfortunately, my understanding is that the Schumer-Rounds Amendment is poised to be shot down on Monday by Republican leadership on the House Armed Services Committee. This is the last opportunity for interested constituents to make their voice heard on this issue.</p>&mdash; Christopher K. Mellon (@ChrisKMellon) <a href=\"https://twitter.com/ChrisKMellon/status/1728529969196781994?ref_src=twsrc%5Etfw\">November 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n", "author_url": "https://twitter.com/ChrisKMellon", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 363, "upvote_ratio": 0.98, "comment_count": 36, "over_18": false}, "36": {"id": "186l8hu", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "AvailableChoice3130", "link_flair_text": null, "time": 1701499700.2241683, "created_utc": 1701248876.0, "url": "https://i.redd.it/s05evs1b693c1.png", "title": "He deserves to be allowed to sue media outlets that smeared him", "permalink": "/r/conspiracy/comments/186l8hu/he_deserves_to_be_allowed_to_sue_media_outlets/", "selftext": "", "media": null, "score": 1595, "upvote_ratio": 0.86, "comment_count": 279, "over_18": false}, "37": {"id": "186o67q", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Dramatic_Waltz_3645", "link_flair_text": null, "time": 1701499700.5303888, "created_utc": 1701260570.0, "url": "https://anonmags.com/moderna-halts-mrna-vaccine-trial-for-young-peope-due-to-suspected-heart-damage/", "title": "Moderna Halts mRNA Vaccine Trial For Young Peope Due To Suspected Heart Damage", "permalink": "/r/conspiracyfact/comments/186o67q/moderna_halts_mrna_vaccine_trial_for_young_peope/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.58, "comment_count": 0, "over_18": false}, "38": {"id": "187ufc9", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Lopsided_Upstairs365", "link_flair_text": "encounter story", "time": 1701499701.2537897, "created_utc": 1701381483.0, "url": "https://www.reddit.com/r/bigfoot/comments/187ufc9/no_evidence_but_i_seen_bigfoot/", "title": "No evidence but I seen bigfoot", "permalink": "/r/bigfoot/comments/187ufc9/no_evidence_but_i_seen_bigfoot/", "selftext": "I was hanging out with my cousin the other night and I walked to the edge of the woods to take a piss when I thought I seen someone staring at me through the woods. So I waved and I looked closer to see if it was just a bush or a tree but confirmed it was someone as they waved back. Once they waved back, I shook off and zipped my zipper, took a few steps closer and they did as well.\n    Thats when I seen it wasnt someone, but something. Something covered in hair and about 6 1/2 feet tall. Im certain it could only be bigfoot as there is no wildlife similar to that around here.\n   I was much too scared to do anything except return to my cousin and tell him what I'd seen. As soon as I did, he informed me that he had seen bigfoot and bigfoot's wife previously in the same woods", "media": null, "score": 190, "upvote_ratio": 0.8, "comment_count": 137, "over_18": false}, "39": {"id": "1850cwv", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Mythic-Insanity", "link_flair_text": "Discussion ", "time": 1701499702.0793955, "created_utc": 1701082648.0, "url": "https://www.reddit.com/r/Cryptozoology/comments/1850cwv/can_we_ban_or_limit_ai_generated_imagery_posts/", "title": "Can we ban or limit A.I. generated imagery posts? They are low effort and don’t create much discussion.", "permalink": "/r/Cryptozoology/comments/1850cwv/can_we_ban_or_limit_ai_generated_imagery_posts/", "selftext": "I am getting tired of the constant spam of low effort content that does not facilitate any discussion beyond ,”Weird, what A.I. did you use?” and ,”What prompt did you use.” To which the reply is something like, “Bigfoot, lol.”", "media": null, "score": 242, "upvote_ratio": 0.95, "comment_count": 50, "over_18": false}, "40": {"id": "183y5fi", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "dorothea0831", "link_flair_text": null, "time": 1701499703.2739704, "created_utc": 1700959228.0, "url": "https://i.redd.it/mxn8fw539l2c1.jpeg", "title": "Any one recognize this monster?", "permalink": "/r/cryptids/comments/183y5fi/any_one_recognize_this_monster/", "selftext": "Not sure if this is the right sub to ask but I can't I'd this and it's driving me crazy. I have a tattoo of this and until now though it was something the artist thought up😅 who is sheee", "media": null, "score": 57, "upvote_ratio": 0.87, "comment_count": 37, "over_18": false}, "41": {"id": "18408xc", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Professional_Peak376", "link_flair_text": "Discussion/Advice", "time": 1701499703.5274441, "created_utc": 1700965532.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/18408xc/my_nightly_talks_with_a_ghost_when_i_was_young/", "title": "My nightly talks with a ghost when I was young", "permalink": "/r/Thetruthishere/comments/18408xc/my_nightly_talks_with_a_ghost_when_i_was_young/", "selftext": "Hi! I’m not really sure if this story fits here but I thought I might as well post it.\nSo as the title says I used to have nightly talks with what I can only assume to be a ghost, I used to stay at my dads on weekends in a nice house he rented in a place called Longridge in Scotland (I think? I honestly am not too sure but I’m pretty sure that’s were the house was, I no longer talk to my dad so can’t really confirm)\nSo anyway, it was a 3 story house my room was at the top to the left of the stairs on the second floor where I was able to see the banister and top step, every night this thing would appear and just talk to me, it was kind of yellow translucent? Its head looked like a lemon on its side (like Stewie griffins head on its side) with huge eyes I called him the lemon man. Honestly I can’t remember many if any of the conversations but I do remember it being friendly, we just chatted every night it kept me calm it was my friend. It told me never to tell anyone about it or he wouldn’t come back I know that sounds very cliche but it’s really what happened. \nOne day I brought it upto my dad and his girlfriend, my dad never believed in that kind of thing but he told me later that it scared him out the house, probably not really why we moved out he was terrible at keeping jobs and with money. After I told him he said I shouldn’t speak to it anymore. Though we did still stay there a good while after, I never ever seen the lemon man again, I was really upset about it.\nAgain sorry not sure if this fits in the sub just wanted to share ! Thanks", "media": null, "score": 48, "upvote_ratio": 0.96, "comment_count": 5, "over_18": false}, "42": {"id": "184ndx3", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "MarzipanInevitable55", "link_flair_text": null, "time": 1701499703.7688615, "created_utc": 1701038974.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/184ndx3/i_was_in_a_very_bizarre_robbery/", "title": "I was in a very bizarre robbery.", "permalink": "/r/LetsNotMeet/comments/184ndx3/i_was_in_a_very_bizarre_robbery/", "selftext": "Throwaway account, because I don’t know why. Just didn’t want this on my main one. Not much else a reason.\nSo I’m a 29M. This happened when I was 20, and it had led to some charming anxiety issues, which were actually only addressed about six months ago. I’ve been told the best way to cope with things is to confront the issues head on, and in a way, that’s what I’m trying to accomplish.\nSo before I got my life together, I used to work odd jobs around my hometowns neighboring towns. It was my way of avoiding college and going into the oil field. I made my money fixing fences, cleaning out horse stalls, and unloading feed and hay.\nNot actually bad work to be honest, but I’ll admit that I used it as an excuse for not doing more with myself.\nWhen I knocked off of work, there was this one little country styled gas station that I used to go to because they never ID’d, and it was easy to get a bottle of liquor or a six pack, and they sold some of the best fried chicken that even to this day I’ve ever had.\nWell on this particular day, there was nobody at the register. It was a little after five in the afternoon, and there were literally only there employees at this store, as it was a family owned and operated place.\nI had plans with a girl that I was seeing, and I promised her a six pack and a night of relaxation at her place while her parents weren’t home. I was in a hurry because of this, so I went to inquire about why nobody was working.\nI went into the back room of the store, where I found the owner, along with four other guys playing poker on a fold out table. I said I needed to make a purchase, and he said he would be there in a minute.\nThe owner, while a very good man, defiantly had his share of addictions. At this time he was high on something, which could have been a number of things. He told me to sit down and play a few hands.\nThe owner was wearing a vest that had all of his money clipped into it. I told him that I wasn’t trying to lose any money, the. He offered to float me the buy in. I said I’d rather not, but 20 year old me was always much easier to persuade.\nI’m not a good card player, but something my family had always told me was that I have more luck than I do sense, and within an hour of playing, I had made enough money to give the owner his entry fee back, and still had a lot of money left over.\nI’ll put it this way. This wasn’t an extremely high stakes game of cards, but after paying the owner his fee, I was holding on to close to 4000 bucks. I’m not a gambler, and you’ll learn why, so I’m not sure even to this day how the dynamics work.\nWe were playing, talking shit, drinking beer, and smoking cigarettes. Just a good time. Then the time became not so good.\nThe beep from the front door rang into the back room. I’m one for punctuality, at least when it comes to doing your job, so I was a little annoyed when the owner didn’t tend to whoever was coming into the store, much like he didn’t tend to me when I initially walked in. That’s a random irk of mine.\nThis pet still gives me chills to think about. I could hear the clacking of steel toed boots hitting the floor, which made its way towards the back room that we were in. It didn’t seem like much, meaning that it wasn’t completely out of the ordinary.\nThen the door of the room flew open and four guys entered the room, all were wearing either red or blue bandannas over their faces. As far as their attire, they didn’t look much different from anybody else. Two wore cowboy hats, the other two wore trucker styled caps.\nAll four were holding shoulder durable weapons.\nWe were all ordered to our feet. Everybody complied. It took me longer than expected to register what was actually happening. The table was flipped over and five of us, minus the owner, were forced against the wall at gunpoint.\nThere was a guy on the door, who apparently missed orientation, because two of the guys in our party had slipped past him, and he had to chase them down through the main store.\nThe four of us that remained were held against the wall by a guy holding what I’m assuming now to be an M16 assault rifle. The owner was taken, beaten, and one of the guys that I’m assuming, or have always assumed to be the ring leader, took a buck knife and cut his clothing off.\nI honestly thought this was going somewhere else, but I guess thankfully it didn’t. One of the guys started duct taping his ankles and his wrists.\nAt the time I’m thinking, okay, they’re just going to restrain us, take the money, and then leave. Not ideal, but that’s manageable enough.\nThen they put what looked like a pillow case, or a sack, and put it over his head, then sloppily started wrapping duct tape around it.\n20 year old me wasn’t having it. A bunch of punks with guns weren’t going to walk in and start messing with me or my company. Boy was I stupid.\nI through a nearly empty Heineken bottle at the owners primary assailant, then progressed towards him. The bottle went nowhere near where I was aiming it, and I literally lifted one foot off the floor, and didn’t even put it down, before I was struck and fell back into the wall.\nThe guy that hit me screamed in my face. Don’t even remember what he said. Still gives me a panic attack when I try to revisit it.\nThe remainder of us were duct taped by our wrists and ankles as well. At one point I had the barrel of a rifle in my face, and the guy next to me, God bless his soul, chastised the guy by saying:\n“You wanna point that at somebody, then point it at me. Not him.”\nThe next part screws with me in a variety of ways that I don’t even know how to explain. One of the masked men pointed the rifle at him, then pulled the trigger.\nAll that could be heard was a metallic click.\nI don’t know about all of them, but the one who that pulled the trigger definitely didn’t have a loaded gun, which leads me to believe that the guns were just “props”.\nThey took the money, then shut the lights off, and left the store.\nThe back room had no windows, so it was dark. Like really dark. I kept a multi tool in my pocket for work, but it wasn’t one of the heavier grade ones. It was a 2x2 inch one that could fit in my wallet, but I always kept in loose in my pocket during the day.\nIt took some flexibility on my part to contort my restrained body enough to be able to get it out of my pocket, but I was eventually able to free myself.\nFor whatever reason, I thought the owner was going to suffocate, so I went to him to free him first. He was fine. Just in pain.\nEverybody made it out with nursing and trauma at most. No fatalities. The two that got away were found restrained the same way in the walk in freezer.\nPolice were called. No investigation was conducted. I couldn’t even drive myself home. I had to call my sister to come pick me up.\nI don’t know about what was actually in store for us and what would have happened if we didn’t comply. This is the source of many anxiety attacks, and the reason I’m partially afraid of the dark.\nNot sure if this classifies for the sub, but defiantly worth getting off my chest.", "media": null, "score": 101, "upvote_ratio": 0.99, "comment_count": 12, "over_18": true}, "43": {"id": "186eba4", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "forhealthy", "link_flair_text": null, "time": 1701499704.031426, "created_utc": 1701224807.0, "url": "https://www.youtube.com/watch?v=ZDc2Pc46J60", "title": "Very clear video footage of a UFO in the sky of New Mexico. It looks like a rescue mission.", "permalink": "/r/truecreepy/comments/186eba4/very_clear_video_footage_of_a_ufo_in_the_sky_of/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Very clear video footage of a UFO in the sky of New Mexico. It looks like a rescue mission.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/ZDc2Pc46J60?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Very clear video footage of a UFO in the sky of New Mexico. It looks like a rescue mission.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/ZDc2Pc46J60/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 0, "upvote_ratio": 0.2, "comment_count": 6, "over_18": false}, "44": {"id": "186xq1k", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "LimpWristedMushroom", "link_flair_text": null, "time": 1701499705.068174, "created_utc": 1701285841.0, "url": "https://www.reddit.com/r/Ghosts/comments/186xq1k/have_you_asked_someone_before_the_passed_away_to/", "title": "Have you asked someone before the passed away to give you proof of an afterlife?", "permalink": "/r/Ghosts/comments/186xq1k/have_you_asked_someone_before_the_passed_away_to/", "selftext": "For example, a word or gesture that only the two of us would know. Did you get proof? My husband, the love of my life, passed away unexpectedly. After his death, he began appearing in my daughter's dreams (his stepdaughter). \nI sat there and wondered if my husband had met up with his dad, my dad, and our dog who had passed away shortly before him. The very next morning, my daughter called me. She told me about the strangest dream she had ever had. In her dream, there was a room where she saw her stepfather, her grandfather, and my dog. They were just standing there, silent, doing nothing.\nThat dream answered two big questions for me. Firstly, it convinced me that there may be an afterlife. Secondly, it showed me that pets are there too. Several other things have happened since then, but nothing compares to this experience. I know many might think I'm crazy, but that's okay. I believe it happened, and it has brought me immense comfort.", "media": null, "score": 669, "upvote_ratio": 0.95, "comment_count": 305, "over_18": false}, "45": {"id": "1862ejd", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "FACastello", "link_flair_text": "Glitch Vid", "time": 1701499705.5163894, "created_utc": 1701194791.0, "url": "https://v.redd.it/uhhad2o4f33c1", "title": "There’s a glitch in the matrix.", "permalink": "/r/GlitchInTheMatrix/comments/1862ejd/theres_a_glitch_in_the_matrix/", "selftext": "", "media": null, "score": 41, "upvote_ratio": 0.84, "comment_count": 4, "over_18": false}, "46": {"id": "186h7cm", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Hard_reboot_button", "link_flair_text": null, "time": 1701499707.632444, "created_utc": 1701233274.0, "url": "https://twitter.com/JeremyCorbell/status/1729723127670685701", "title": "Corbell: This is an interesting takeaway... \"If key Republicans succeed in neutering or quashing the UAPDA (Unidentified Anomalous Phenomena Disclosure Act) in its entirety, they may inadvertently spur the leak of sensitive information that they ostensibly fear.\" https://thehill.com/opinion/congres", "permalink": "/r/ufo/comments/186h7cm/corbell_this_is_an_interesting_takeaway_if_key/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/JeremyCorbell/status/1729723127670685701", "author_name": "Jeremy Kenyon Lockyer Corbell", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">This is an interesting takeaway... &quot;If key Republicans succeed in neutering or quashing the UAPDA (Unidentified Anomalous Phenomena Disclosure Act) in its entirety, they may inadvertently spur the leak of sensitive information that they ostensibly fear.&quot;<a href=\"https://t.co/QBJS7f02th\">https://t.co/QBJS7f02th</a> <a href=\"https://t.co/ozx7WlQVRb\">https://t.co/ozx7WlQVRb</a></p>&mdash; Jeremy Kenyon Lockyer Corbell (@JeremyCorbell) <a href=\"https://twitter.com/JeremyCorbell/status/1729723127670685701?ref_src=twsrc%5Etfw\">November 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n", "author_url": "https://twitter.com/JeremyCorbell", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 332, "upvote_ratio": 0.97, "comment_count": 75, "over_18": false}, "47": {"id": "183uh56", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "jrv", "link_flair_text": "News", "time": 1701499709.1841474, "created_utc": 1700948919.0, "url": "https://twitter.com/ChrisKMellon/status/1728529969196781994?t=_YTRaQq-r0bqG1zwjApNPw&s=19", "title": "Chris Mellon on X: \"Unfortunately, my understanding is that the Schumer-Rounds Amendment is poised to be shot down on Monday by Republican leadership on the House Armed Services Committee. This is the last opportunity for interested constituents to make their voice heard on this issue.\"", "permalink": "/r/UFOs/comments/183uh56/chris_mellon_on_x_unfortunately_my_understanding/", "selftext": "", "media": {"type": "twitter.com", "oembed": {"provider_url": "https://twitter.com", "version": "1.0", "url": "https://twitter.com/ChrisKMellon/status/1728529969196781994", "author_name": "Christopher K. Mellon", "height": null, "width": 350, "html": "<blockquote class=\"twitter-video\"><p lang=\"en\" dir=\"ltr\">Unfortunately, my understanding is that the Schumer-Rounds Amendment is poised to be shot down on Monday by Republican leadership on the House Armed Services Committee. This is the last opportunity for interested constituents to make their voice heard on this issue.</p>&mdash; Christopher K. Mellon (@ChrisKMellon) <a href=\"https://twitter.com/ChrisKMellon/status/1728529969196781994?ref_src=twsrc%5Etfw\">November 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n", "author_url": "https://twitter.com/ChrisKMellon", "provider_name": "Twitter", "cache_age": 3153600000, "type": "rich"}}, "score": 3171, "upvote_ratio": 0.89, "comment_count": 709, "over_18": false}, "48": {"id": "184xalw", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Jesusalanis111", "link_flair_text": "Video", "time": 1701499710.590951, "created_utc": 1701069702.0, "url": "https://v.redd.it/tavjl9vhdu2c1", "title": "They need our Help!!! The Final Fight for UFO / UAP Transparency, Tim Burchett & David Grusch are being attacked by Mike Turner, Kevin McCarthy, Mike Rogers, The Pentagon & other Gatekeepers (Part 1)", "permalink": "/r/aliens/comments/184xalw/they_need_our_help_the_final_fight_for_ufo_uap/", "selftext": "Act Now!!!\nhttps://twitter.com/SafeAerospace/status/1728081844372201530\nSenator Chuck Schumer Amendment\nUnidentified Anomalous Phenomena Disclosure Act of 2023", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/tavjl9vhdu2c1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 852, "scrubber_media_url": "https://v.redd.it/tavjl9vhdu2c1/DASH_96.mp4", "dash_url": "https://v.redd.it/tavjl9vhdu2c1/DASHPlaylist.mpd?a=1704091709%2CYmU1NDBmNjlmZTgzZjM5ZDQ5MGNiNmU2YjlkYzFkMTg4MDNkNWYyNWU0MWE1Mzk3NWZiNGIyMmY5MDU3ZjBiZA%3D%3D&v=1&f=sd", "duration": 886, "hls_url": "https://v.redd.it/tavjl9vhdu2c1/HLSPlaylist.m3u8?a=1704091709%2CYTM1YmE0YjhiMmFiM2YyMTY1YzE1YjRjYjkxOWMxNzViNDk3YjYzNWEzMDZmZmM0ZjU5ZjVjZjRjYzZjZTlkNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1247, "upvote_ratio": 0.95, "comment_count": 87, "over_18": false}, "49": {"id": "186s1wd", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "mike_from_the_dales", "link_flair_text": "Video", "time": 1701499711.5506585, "created_utc": 1701271725.0, "url": "https://www.reddit.com/r/UAP/comments/186s1wd/latest_new_reporting_on_cias_role_in_ufo/", "title": "Latest : New reporting on CIA’s role in UFO retrieval accurate: Coulthart | Cuomo", "permalink": "/r/UAP/comments/186s1wd/latest_new_reporting_on_cias_role_in_ufo/", "selftext": "For those who have not seen this. This is beginning to debunk some of my thinking. I tend to be a skeptic but gradually i see more, what appears to be (notice appears to be ?) credible news.  This video: https://youtu.be/-yao8Pzffw8?si=PAzUZx-C_GtrHznO\nThis post of mine is also for those who have told me to wake up and keep up with the pace, i assured you i do and i watch too much of this stuff. If i had a good memory i could set up a channel and set up as an expert. But i have not so i cannot be an expert.", "media": null, "score": 308, "upvote_ratio": 0.95, "comment_count": 33, "over_18": false}, "50": {"id": "185cova", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Specific_Candy_6453", "link_flair_text": null, "time": 1701499713.1383464, "created_utc": 1701116741.0, "url": "https://www.reddit.com/r/conspiracy/comments/185cova/im_not_a_conspiracy_theorist_but_its_something_we/", "title": "I’m not a conspiracy theorist but it’s something we aren’t seeing", "permalink": "/r/conspiracy/comments/185cova/im_not_a_conspiracy_theorist_but_its_something_we/", "selftext": "I’m new to posting on  Reddit I don’t know if this is the place for something like this and I’m usually not the type to voice my thoughts, but this is the only place I can do it without people I know seeing it and thinking I’m crazy. MAYBE I am crazy or just exhausted or idk something mental but everything seems so fake  people, Media, school, work, even the weather everyone is so fake happy. Maybe it’s jus me but how can you be happy working for a man/women you don’t even know until you get too old to do anything. I’m not saying this because I’m lazy I’ve been working since I was 15 and still have a job I know we need money to live and life isn’t all sunshine and rainbows, but do people really not see what goin on it’s something missing it’s obviously some kind of corruption. I tried to explain to my family that a large percentage of media is controlled and false and they started calling me a conspiracy theorist how is that so hard to believe?they taught us Columbus was some kind of hero and Abraham Lincoln freed the slaves because he was just a nice guy and gave me all this “useful” information like how to find the circumference of a soda can why do I need this? I had to learn how to do taxes by myself I learned about interest by myself I didn’t even know what credit was. is it really that hard to believe the guy on your tv reading from a teleprompter hasn’t told a little bit of misinformation? I feel alone everywhere I go it’s like I’m surrounded by people staring at the ground and I’m not the smartest guy in the world not even close but I know for a fact we are in some big big big big trap it’s all meant to distract us from something I just don’t know what it is or like I said maybe I’m crazy.", "media": null, "score": 1285, "upvote_ratio": 0.88, "comment_count": 613, "over_18": false}, "51": {"id": "188kr81", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1701499713.5194137, "created_utc": 1701460368.0, "url": "https://youtube.com/live/-0IzKe-32pw", "title": "Who's Next To Be Abducted By Aliens?", "permalink": "/r/conspiracyfact/comments/188kr81/whos_next_to_be_abducted_by_aliens/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "52": {"id": "185im62", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Tandomtuckerupper", "link_flair_text": "footprints", "time": 1701499714.329722, "created_utc": 1701131249.0, "url": "https://i.redd.it/ikxmn01jgz2c1.jpg", "title": "West Yellowstone, Mt", "permalink": "/r/bigfoot/comments/185im62/west_yellowstone_mt/", "selftext": "First and foremost- Not judging anyone but I’m not a believer. Just haven’t seen the evidence I need, BUT I can’t get a solid answer on these tracks so figured I’d post here.  I found these few years back hunting in the forest outside Yellowstone National park in Montana\nSame size as my 13 boot heel to toe and 2 boots wide \nI’m 6 foot tall and I tried to copy the stride and wasn’t even close \nThe prints are in front of each other not side to side (I think?) so I don’t understand\nWas told a lynx but after doing research the only pic I found that were the same was a set of pics that were speculated to be Bigfoot in Canada but I’m no professional tracker", "media": null, "score": 184, "upvote_ratio": 0.89, "comment_count": 110, "over_18": false}, "53": {"id": "183pffn", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "therealblabyloo", "link_flair_text": "Discussion ", "time": 1701499715.3490026, "created_utc": 1700935148.0, "url": "https://i.redd.it/akg2s5hh9j2c1.jpg", "title": "There is another option…", "permalink": "/r/Cryptozoology/comments/183pffn/there_is_another_option/", "selftext": "(Please don’t take this seriously)", "media": null, "score": 121, "upvote_ratio": 0.89, "comment_count": 40, "over_18": false}, "54": {"id": "188k6ro", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "turocedo", "link_flair_text": null, "time": 1701499716.531207, "created_utc": 1701458858.0, "url": "https://i.redd.it/q141a7oqiq3c1.jpg", "title": "My new cryptid baby", "permalink": "/r/cryptids/comments/188k6ro/my_new_cryptid_baby/", "selftext": "I thought you all might get a kick out of my new fetal Loch Ness monster specimen. She’s grossed my family out, but I think she’s cute.", "media": null, "score": 47, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "55": {"id": "1880tyk", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "sweetandspooky", "link_flair_text": null, "time": 1701499716.769738, "created_utc": 1701398519.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1880tyk/lady_in_white/", "title": "Lady in White", "permalink": "/r/Thetruthishere/comments/1880tyk/lady_in_white/", "selftext": "I’d like to preface this with the fact that I have no idea exactly who or what it was that I saw, but it’s pretty spooky regardless of whether or not it has an earthly explanation & that’s the part that continues to haunt me, 10+ years later.\nI grew up in Sleepy Hollow, NY—home of the headless horseman (and allegedly a number of other hauntings). I was 16 at the time and riding shotgun in my then-boyfriend’s car, headed home on Old Sleepy Hollow Road at ~3 am (this was before my parents enforced a curfew because I was taking advantage). At the end of Old Sleepy Hollow road is Sleepy Hollow road, and a stop sign, at which making a left brings you through a densely wooded area to my parents’ house. Old Sleepy Hollow Road is dark and curvy, and cuts through the woods that contain the old carriage trails which connect to the cemetery, where the headless horseman is laid to rest and said to ride, as well as where some of the other legends of Sleepy Hollow originated. Not many cars frequent this road. Outside of tourist season, the village is quiet and the houses back there are quite sparse. This was the case even moreso about ten years ago. \nThere weren’t (and still aren’t) many lights on these backroads, but there is one right next to the stop sign, almost like a spotlight. When we pulled up to the stop sign, I got such a fright because a young woman wearing nothing but a long white nightgown or otherwise thin white dress was very suddenly standing on the road right next to the stop sign. At first I was scared that we were going to hit her, but when we drove away the reality of the situation really started to sink in and that’s when I felt extremely unsettled. What was she doing there at 3 am?  It gave me a heavy pit in my stomach. This was around November in NY, it was quite frigid, and she had no jacket or any shoes on. There are houses back there, but not many. She didn’t look directly at us at all, despite us almost hitting her— it almost seemed like she was staring straight through or beyond us. She was unblinking and unmoving. Very pale, with the cliche long dark hair to match. \nI remember asking my boyfriend if he just fucking saw what I saw, and he just nodded. We never spoke about it again, until many years later when I confirmed with him that it really happened and wasn’t just a figment or a dream or something. \nMy parents live up against those woods, with my room on the bottom floor. I don’t think I slept in my own room for months after that incident. I still think of it when I visit. \nI’ve read a lot about this figure and different accounts of it. There are stories of “ladies in white” across many cultures, but one thing that many of the tales have in common is the betrayal of a lover. This boyfriend was my first “love”, and unbeknownst to me at the time, he was secretly banging my best friend behind my back. To this day it remains one of the worst betrayals of my life. Eventually he became very violent towards me. I can’t help but wonder if she was a warning of some sort? \nOf course, there are other related ghost stories in the immediate vicinity of where this occurred… Like the woman who froze to death at Raven Rock where she sought refuge during a harsh winter storm, a colonial woman who died hiding from a violent suitor, a Native American girl who was killed at the hands of her jealous lover, a teenager who died after being pushed out of her boyfriend’s car during an argument... Hulda of Bohemia’s homestead was in those woods— a quick fifteen minute walk from my parent’s house. (I doubt it was her, btw, but she has a very sad and incredible story associated with her for those who are interested, my fav sleepy hollow figure). Truthfully, the list of the many supposed apparitions of the area could go on for far longer. \nThe happy ending I guess is that I dumped that loser and I grew up to work in the morgue! I definitely don’t scare easily, and while I’ve had a few other “unusual” experiences throughout my life, this one is truly a mystery to me. I think of it every time I drive past that stop sign, and I sometimes still have dreams about it (as was the case last night), so I’ve resolved to get it all out in writing in an attempt to unload it to some internet strangers.  Feel free to share your opinion or theories or similar stories, skeptic or not!", "media": null, "score": 31, "upvote_ratio": 0.91, "comment_count": 11, "over_18": false}, "56": {"id": "183p6c4", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "asphodel2020", "link_flair_text": null, "time": 1701499717.0396183, "created_utc": 1700934437.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/183p6c4/john_the_job_centre_stalker/", "title": "John the Job Centre Stalker", "permalink": "/r/LetsNotMeet/comments/183p6c4/john_the_job_centre_stalker/", "selftext": "When I was 18 and newly graduated, I ran into some issues with my attempts to enrol in college and also had a hard time finding a job in my area in the meantime, which led to me having to sign on at the Job Centre. They determined that I was 'too shy' to succeed in interviews and placed me in a group that was supposed to teach interview skills in order to fix that. The group ended up ultimately being a complete waste of time - I honestly think they put me in the wrong group or just needed an extra member and made an excuse to throw me in to make up the numbers but that's not really relevant to the story - and the other group members didn't do much to help with my 'shyness' either since they were all men who at least four decades older than me and obviously didn't share any of my interests. Unfortunately, I ended up gaining the attention of the one member I wanted nothing to do with.\nI don't actually remember the man's name at this point but I think it was something generic like John so that's what I'll call him. John immediately got off on the wrong foot with the rest of the group when he interrupted the instructor during their introduction to the course to complain that him being there was useless since he would be retiring in 'a few years' anyways and no one wanted to hire someone who had spent 'over ten years' in prison. When that didn't get him the reaction he wanted - I assume the rest of the group thought he was just attention-seeking and the instructor had heard similar things before from people who weren't happy about being in the course - he waited until we had been given paperwork to complete and then turned to the man next to him and loudly explained his prison sentence was for beating his ex-wife but that she was a lying bitch and he never put a hand on her. She didn't even have any bruises on her at the trial or any evidence of bruises/other injuries before that either but because she was a woman, the judge automatically believed her and sent him to jail.\nThis immediately set me on edge. I'm not an expert when it comes to the law but I do watch true crime channels on Youtube and I have never heard of a sentence of over ten years for a single beating that supposedly never even happened/didn't leave visible injuries. Either John was lying and had severely beaten his wife to the point of putting her in the hospital or he had been arrested on other charges and was covering up what he actually went to prison for. I immediately decided I wanted nothing to do with him regardless of which one it was and would avoid interacting with him as much as possible outside of polite hellos and passing him things if asked.\nLike I said before, I didn't really interact much with the other members of the group at all because of their ages. I attended the first half of the meeting in the morning, spent the dinner break in the library while the men all snuck off to the pub and then went home immediately after the second half was over. No one ever asked me how I had spent my breaks and since the pub and library were in opposite directions from each other and couldn't be seen from the front of the building the group met in because of the way the streets were arranged, there should have been no way for any of them to know where I had been, which made what happened next even more worrying.\nAbout halfway through the course, there was a day where I had bumped into a friend on my dinner break and decided to put off visiting the library until the course was over for the day to catch up with them instead. When I did get around to it, I spent at least quarter of an hour there before heading to the desk to check out my books and ended up being drawn into a conversation by the librarian, who had noticed I was checking out books related to a franchise he also enjoyed and that was getting a new movie the next year. There were only a handful of other people in the library, so I didn't see anything wrong with talking to a friendly man around my age who shared my interests after eight hours of boredom and paperwork. We had been talking for another quarter of an hour when he suddenly glanced over my shoulder, looking confused and concerned, and was just opening his mouth to say something when someone grabbed me by my shoulders. My friends and family know that I hate having my shoulders touched without warning and would never have done that to me, so I immediately knew that whoever was touching me was a stranger and knocked their hands away while turning around and backing up into the librarian's desk.\nIt was John. He was standing directly behind me with a huge smile on his face and as soon as I turned around, he made a joke about knowing he would find me there and how I practically lived there before chattering at me as if we were close friends.\nI was just completely confused. It was obvious that he hadn't just coincidentally bumped into me from the way he was talking but John had been kept behind while the group was heading out because he had filled out his paperwork incorrectly and as I mentioned before, you can't see the library from the building, so he shouldn't have had any way of seeing where I had gone. It had also been half an hour since I left the building, so if he had left not long after me and just seen me go in while we were walking in the same direction, he would have come inside by then. The only way it made sense for him to know to look for me there and joke that I practically lived there would be if he had somehow learned I was going to the library during dinner breaks, known I hadn't that day and guessed I would go after the meeting instead. What made that even stranger than it already was is the fact that John had never show any interest in me during the group sessions and mostly ignored me the way I ignored him unless we were forced to interact for whatever reason, so why was he now following me into other buildings to start conversations out of nowhere and acting like we were close?\nWhile John was still talking, the librarian leaned in to ask if I knew the man because he had obviously seen my negative reaction to being touched by John and when I briefly explained the situation to him, he asked John politely to please leave me alone or leave the building. John refused and tried to tell the man that we were friends, completely ignoring the fact that I had just said we weren't and how ridiculous it would be to claim an eighteen-year-old girl and an fifty-something-/sixty-something-year-old man were friends in the first place. When the librarian asked again and outright told him that harassing other customers wasn't acceptable and he would be removed from the building if he refused to leave me alone, John smiled and agreed to leave in a tone that you use when humouring a child before walking out and very obviously stationing himself right outside the doors, waiting for me to leave, too. The librarian was clearly concerned by this and asked for the full story of what was going on and I told him, including my suspicions that John had been following me around without my knowledge to know I would be there in the first place. He suggested I should stay in the library until his break so he could walk me to my bus stop to make sure John left me alone but it would be several hours and if I had waited, I wouldn't have gotten home in time to change and head to another meeting I had later that evening, so he asked me to at least come in the next time I was there to let him know I was safe and reluctantly watched me leave.\nJohn immediately stepped into my personal space when I got outside, jokingly asking what the librarian's problem was and still acting like we were friends. I tried to walk around him without answering him and head to the bus station to go home but he grabbed me by my arm and reminded me that there was a closer stop for 'our bus'. When I told him that we aren't getting the same bus because I had never seen him on the same one as me, he corrected me that we both needed the #__ bus and told me where he lived, which was in fact on the same bus route as me. Although I was still tempted to walk away and go to the station instead - and possibly sneakily get on a different bus and just walk the rest of the walk home - it was very clear he was going to follow me if I did because he still had a hold of my arm, refusing to let go when I tried to pull away, and there were several dark alleys on the way that I had no intention of going anywhere near while in his company. When I agreed to go to the closer bus stop, he let go of me and started walking at my side, chattering like we were good friends again.\nJohn kept walking when we reached the stop which was odd but I was hoping that my lack of response to anything he said had made him give up and decide to leave me alone or that he had mixed up that stop with one further along and I could run while his back was turned. No luck. As soon as he realised I wasn't following him any more, John came back, frowning as if he was confused and asking me, \"I thought we were going for coffee together?\" Shocked, I told him bluntly no. He kept pushing, trying to convince me that I had agreed to go with him and when that didn't work, he switched tactics and claimed I had mentioned while leaving the 'classroom' that I wanted some coffee, so he thought we could go together. That was an obvious lie, too, since I don't drink coffee and told him so. John's only answer was to say I didn't have to get coffee and keep pushing me to go to a cafe with him. I firmly told him no and apparently he took that as me not wanting to drink in public because he attempted to invite me to his flat. It that wasn't weird enough, he started telling me that if there is a naked girl on the couch when we get there I'm not to worry because that's his eighteen-year-old daughter. Because an eighteen-year-old is definitely going to lounge around naked on her father's furniture in front of him, right? Other people at the stop were staring at us now and I took the opportunity to point out that I was also eighteen and firmly tell John that I don't want to go to his flat with him and to leave me alone. He completely ignored the last part and tried to claim I was lying about my age and was at least 29, when most people at the time still mistook me for being in my early teens at first glance.\nThe bus arrived at that moment and I got on as quickly as possible, thinking I would be safe there and the driver would throw him off if need be. No. When I sat in an aisle seat to stop John sitting next to me, he physically shoved me across the seat, penning me in against the window to the point I could barely move and pressing his knees up against the seat in front of him to make sure I had no room to get past him unless he allowed it. The only way for me to get out would have involved me straddling his lap since the seats in front of us were occupied. I loudly told him to move and to leave me alone but he ignored me and continued trying to convince me to come to his flat and although a few people gave me uncomfortable looks, when I tried to make eye contact with some of the men in the hopes they would help, they would look away as if they hadn't noticed or suddenly become very interested in their phones. I spent the ride huddled against the window trying to touch him as little as possible and was ignored again when I shouted at him to stop touching me because he kept putting his hand on my thigh, as high up as he could get without directly groping me. No one did anything about it but he stopped touching me after that. He had apparently also given up on convincing me to go to his flat that day but when we were coming up to the apartment block, he pointed it out to me - physically turning my face when I refused to look - told me his apartment number and tried to give me a kiss goodbye on the cheek, which I dodged, before getting off the bus and knocking on the opposite window to try and get my attention so he could wave at me. When the bus set off again, several people started loudly talking about how disgusting he was and that men like him should be reported, while refusing to look in my direction where I was sat shaking and seething in my seat, and other than an awkward, \"Er, so... are you alright?\" from the driver just as I was about to step off the bus, no one bothered to check on me.\nAs soon as I got home, I sent an email to the instructor, telling her that I wanted to switch groups and never see the man, explaining what he had done. She read it but ignored it for an entire week until I sent a follow-up, threatening to get the police involved if they forced me to interact with the man again and their solution was to tell me I could leave the course early instead, essentially kicking me out as if I was the problem.\nI bumped into the man not long afterwards and he tried to ask me why I hadn't been attending the group any more, admitting that he had asked the instructor and they had refused to tell him, but I managed to get away and lose him in the crowd. I've seen him a few times in passing in the years since but fortunately he has never noticed me or approached me again and I hope it stays that way.", "media": null, "score": 94, "upvote_ratio": 0.97, "comment_count": 11, "over_18": true}, "57": {"id": "187szro", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "MaximumSupport6222", "link_flair_text": null, "time": 1701499717.2461278, "created_utc": 1701378021.0, "url": "https://i.redd.it/a0p5jt0cuj3c1.png", "title": "Can't risk it", "permalink": "/r/truecreepy/comments/187szro/cant_risk_it/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.17, "comment_count": 3, "over_18": false}, "58": {"id": "18806bp", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "violet664", "link_flair_text": null, "time": 1701499718.297731, "created_utc": 1701396631.0, "url": "https://www.reddit.com/r/Ghosts/comments/18806bp/sister_died_recently_odd_things_happening_seeing/", "title": "Sister died recently, odd things happening. Seeing something now too", "permalink": "/r/Ghosts/comments/18806bp/sister_died_recently_odd_things_happening_seeing/", "selftext": "Okay so I’ve always believed in ghosts and the afterlife for as long as I can remember. My little sister passed away this summer and ever since, random weird little things have been happening. The past week has been like, way more active than normal 😂. To start it off I heard a noise before bed the other night and the cat was acting weird.. brushed it off. Woke up in the morning and see the scrapbook that I have made in memory of her was knocked over off balance and opened to the “letters to (her name)” page. Asked my boyfriend if he bumped the shelf it’s on and he looked at me funny and said no. \nKeep on going through the week and more noises. Today, me and the hubby were sitting watching tv, I was colouring. Huge noise right beside me like something was knocked off the table. Neither of us had moved, and I still can’t find whatever it was that “fell” off the table. Now call me crazy, but I know 100% these things happening are my sister. I even told (?) her a few weeks ago that I wished it was more noticeable when she was around. And now all these things are happening. \nAlso the past like 5 days maybe, I’m totally seeing something. Not like a person, but definitely a something lol. It’s kind of like a greyish smudge/movement. But a lot of the time I see it last minute, before it disappears. I’ve never been able to see ghosts (however people in my family can). I like to think it’s my sister but I’m also curious to know, are other peoples experiences with seeing ghosts similar?", "media": null, "score": 274, "upvote_ratio": 0.87, "comment_count": 118, "over_18": false}, "59": {"id": "183xa03", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "masterchefguy", "link_flair_text": "Glitch Pic", "time": 1701499718.9159274, "created_utc": 1700956712.0, "url": "https://i.redd.it/b71ko9uj1l2c1.jpg", "title": "Mike and Mike and Mike and Mi....", "permalink": "/r/GlitchInTheMatrix/comments/183xa03/mike_and_mike_and_mike_and_mi/", "selftext": "", "media": null, "score": 32, "upvote_ratio": 0.78, "comment_count": 2, "over_18": false}, "60": {"id": "185wnxi", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Awstun_", "link_flair_text": null, "time": 1701499720.4013124, "created_utc": 1701179932.0, "url": "https://thehill.com/opinion/congress-blog/4329153-why-are-key-republicans-fighting-transparency-on-ufos/", "title": "Why are key Republicans resisting transparency on UFOs?", "permalink": "/r/ufo/comments/185wnxi/why_are_key_republicans_resisting_transparency_on/", "selftext": "Opinion contributor Marik Von Rennenkampff poses the question “Why are key Republicans resisting transparency on UFOs?” like it’s some big mystery. We know these Republicans have taken legal bribes from Aerospace and Defense contractors.\nHis headline should read “Why money in politics is destroying the American dream.”", "media": null, "score": 326, "upvote_ratio": 0.91, "comment_count": 180, "over_18": false}, "61": {"id": "186b0vn", "locked": false, "subreddit": "ufos", "stickied": true, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Discussion", "time": 1701499721.8577192, "created_utc": 1701215935.0, "url": "https://v.redd.it/dw1vggieg63c1", "title": "Ross Coulthart on NewsNation discussing CIA UFO retrievals, catastrophic disclosure, and The UAP Disclosure Act.", "permalink": "/r/UFOs/comments/186b0vn/ross_coulthart_on_newsnation_discussing_cia_ufo/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/dw1vggieg63c1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 476, "width": 854, "scrubber_media_url": "https://v.redd.it/dw1vggieg63c1/DASH_96.mp4", "dash_url": "https://v.redd.it/dw1vggieg63c1/DASHPlaylist.mpd?a=1704091720%2CODQ3MzMwNDMyYjBjYmE0ZDBlODkwZDRiYjVkMjYzYjU2NzQ1ZGRkNDJjMGI1ODNjMzg4NDE5MDFiNWUzMWJhMQ%3D%3D&v=1&f=sd", "duration": 402, "hls_url": "https://v.redd.it/dw1vggieg63c1/HLSPlaylist.m3u8?a=1704091720%2CNDY2NTFkMzA2MDIyYzVlMTI5YzFhNGExNGQwMDFkNDRhNjVmNjQ4NzI0MmNmMGFhNTBjMzg5MzUxNWQyYzEyNA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2735, "upvote_ratio": 0.91, "comment_count": 431, "over_18": false}, "62": {"id": "187kfjf", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "ineedahashtag4myswag", "link_flair_text": "Image 📷", "time": 1701499723.743917, "created_utc": 1701356158.0, "url": "https://i.redd.it/9mdvgsyc1i3c1.jpg", "title": "Mummified Non Identifiable Remains exhibited in Belgian Zoo", "permalink": "/r/aliens/comments/187kfjf/mummified_non_identifiable_remains_exhibited_in/", "selftext": "", "media": null, "score": 1236, "upvote_ratio": 0.93, "comment_count": 224, "over_18": false}, "63": {"id": "186893t", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Article", "time": 1701499724.7029479, "created_utc": 1701209158.0, "url": "https://thehill.com/opinion/congress-blog/4329153-why-are-key-republicans-fighting-transparency-on-ufos/", "title": "[The Hill] Why are key Republicans resisting transparency on UFOs?", "permalink": "/r/UAP/comments/186893t/the_hill_why_are_key_republicans_resisting/", "selftext": "", "media": null, "score": 295, "upvote_ratio": 0.96, "comment_count": 42, "over_18": false}, "64": {"id": "186x66a", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "KrarkOClock", "link_flair_text": null, "time": 1701499726.2274926, "created_utc": 1701284410.0, "url": "https://i.redd.it/azvk3eww3c3c1.jpg", "title": "Saying \"Irish Lives Matter\" in Ireland is now considered a hate crime.", "permalink": "/r/conspiracy/comments/186x66a/saying_irish_lives_matter_in_ireland_is_now/", "selftext": "", "media": null, "score": 1278, "upvote_ratio": 0.84, "comment_count": 478, "over_18": false}, "65": {"id": "1864ye4", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1701499726.5264559, "created_utc": 1701201113.0, "url": "https://youtube.com/live/KWzCOa685UA", "title": "Can UFO/Paranormal and Bigfoot Hunters work together?", "permalink": "/r/conspiracyfact/comments/1864ye4/can_ufoparanormal_and_bigfoot_hunters_work/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 0.67, "comment_count": 1, "over_18": false}, "66": {"id": "186sjqc", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "between3and20spaces", "link_flair_text": "art", "time": 1701499727.5451717, "created_utc": 1701273003.0, "url": "https://i.redd.it/fwr9htd36b3c1.png", "title": "Bigfoot spotted in friend's home.", "permalink": "/r/bigfoot/comments/186sjqc/bigfoot_spotted_in_friends_home/", "selftext": "A friend's father used to modify paintings he found at thrift stores, and made this treasure.", "media": null, "score": 93, "upvote_ratio": 0.93, "comment_count": 16, "over_18": false}, "67": {"id": "188iaz8", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "The_Match_Maker", "link_flair_text": "News ", "time": 1701499728.4789753, "created_utc": 1701453955.0, "url": "https://nypost.com/2023/11/29/news/first-photo-shows-rare-rat-that-can-get-as-big-as-human-baby/", "title": "Ultra-rare Giant Rat That Can Grow as Big as Human Baby and Chew Through Coconuts Photographed for First Time.", "permalink": "/r/Cryptozoology/comments/188iaz8/ultrarare_giant_rat_that_can_grow_as_big_as_human/", "selftext": "", "media": null, "score": 115, "upvote_ratio": 0.99, "comment_count": 30, "over_18": false}, "68": {"id": "187ke7q", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Alternative_Spite_11", "link_flair_text": null, "time": 1701499729.618686, "created_utc": 1701356060.0, "url": "https://www.reddit.com/r/cryptids/comments/187ke7q/i_just_want_to_point_out_that_anybody_who_claims/", "title": "I just want to point out that anybody who claims to be on some government “cryptid killer” team is 100% stupid and a liar", "permalink": "/r/cryptids/comments/187ke7q/i_just_want_to_point_out_that_anybody_who_claims/", "selftext": "Why do we, as the “cryptid community”, accept this trash and treat them like they’re not complete idiots for saying that stuff?", "media": null, "score": 45, "upvote_ratio": 0.89, "comment_count": 83, "over_18": false}, "69": {"id": "183t7wy", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "spooky_b1tch", "link_flair_text": "Disemb. Voice", "time": 1701499729.8749366, "created_utc": 1700945517.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/183t7wy/i_heard_a_voice_but_i_was_completely_alone/", "title": "I heard a voice, but I was completely alone.", "permalink": "/r/Thetruthishere/comments/183t7wy/i_heard_a_voice_but_i_was_completely_alone/", "selftext": "When I was a freshman in high school, I decided to move in with my mom. She was moving to a different city with her boyfriend and my siblings, and I was ready for a change of pace from where I'd been before. We moved into a nice 3-bedroom in town and settled in well, at first. It didn't take long for us to start noticing some odd things happening around the house.\nThe atmosphere in the house always felt a bit off. I, having been more skeptical at the time than I am now, chalked it up to everyone adjusting to our new blended family and new way of life. It didn't take long for me to start having doubts, though. \nWe'd hear weird thumps in the walls at night, find cabinets opened that were previously closed, little odd things that could maybe be chalked up to explainable phenomenon, but all together definitely gave everyone the creeps.\nOn a few occasions, my family members claimed to have seen or heard something unexplainable. My little brother told us that he saw the apparition of a child, turning his TV on and off, and messing with his toys. He barely slept that night, and was anxious about sleeping in his room alone for a few weeks after. \nMy mom said she saw a shadow figure standing at the entrance to her room on several occasions. She usually left her door open as to be able to hear us, and several times she said she had woken up to see a tall shadow figure standing in the doorway.\nHer boyfriend also had a weird experience. He was extremely skeptical, but this spooked him too. There was a time that they were on the phone and he asked my mom where she was. She responded that she was in her room, she had been watching TV but turned it off to take his call. He said it sounded like there were other people in the room talking, but there were not. It was just her. He said it was like several whispers, not super quiet but not loud enough to be able to make out what they were saying. It was very strange. I'm not sure myself if there's a logical explanation for it, but it definitely spooked them both a little and he started taking us a little more seriously when we mentioned weird things happening at home.\nA few months into living there, I found myself home alone for the weekend. My brother was off to his dad's, my stepsis was camping with her friends a couple hours away, and my mom had gone off to see her boyfriend, who was out of town for work a few hours away. While it was offered for me to go somewhere else or come with her, I declined. Having the whole house to myself for the weekend sounded like a dream. I could cook and take care of myself just fine, and I wasn't a wild teen in the slightest, so my mom wasn't worried about me getting into trouble. \nI saw my mom off and locked up the house for the weekend, excited for a weekend of me-time. I was sitting at the dining room table drawing in my sketchbook, the house empty and completely silent, when I heard a few weird thumps in the hallway. It jumpscared me a little since I was so focused, but I brushed it off and continued with what I was doing. The house was totally silent again for a moment. Suddenly, I heard a voice go \"Hey!\" Very loudly from down the hallway, the tone of voice as if it was trying to grab my attention or call me over.\nIt sounded extremely similar to my sister, despite her being hours away. That really freaked me out. I ran into my mom's room in a panic and grabbed the metal bat she kept by her bed. I dialed her up and luckily she answered me quickly. I start telling her what happened while I'm slowly making my way toward the hall, peeking in all the rooms with my bat at the ready. Needless to say, I didn't find anything or anyone in any of the rooms in the house. I checked under all the beds, in the closets, everywhere. Now extremely unsettled, I sat in the back yard for at least an hour talking to my mom while I calmed down. The rest of my weekend was okay, albeit very tense as I was now super spooked. \nThe only other time I've heard such a clear voice, I was living in a different place with my mom. Once again, home alone. I was about 18 or 19 at the time. I was just up in my room, my dog laying on the floor next to me and my cat cuddled up in my lap while I was reading a book. Door locked. Nobody else around. \nI heard what sounded like a child's voice call my dog's name from downstairs. At first I thought I was going nuts, but all of my animals reacted to the voice, so I know what I heard was real. My dog, however, did not go after the voice. Instead he got up, peeked out my bedroom door, then turned right around and hopped up in bed with me. Whatever it was, I don't think he liked it!\nOnce again I checked the whole house and even looked outside. Nobody was home. Nobody was outside. No TVs were on. There is no explanation for what I heard.\nIn both instances where I heard a voice, I was not asleep or even laying down. It was the middle of the day. I do not have any mental disorders that would cause auditory hallucinations. I've never experienced sleep paralysis. \nI have had times where I was asleep or half asleep and woke up because I swore I heard my name being called (I am a very light sleeper and am easily woken by sounds, but in every instance of this, nobody in my home was calling for me and I very clearly heard my name). Because I was asleep or almost sleep, though, I am not including these stories in this post, as there is a possibility that they could have been a dream.\nDo any of you have stories about disembodied voices you've heard? Please share!", "media": null, "score": 17, "upvote_ratio": 0.87, "comment_count": 11, "over_18": false}, "70": {"id": "1845wo3", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "MrFluffPants1349", "link_flair_text": null, "time": 1701499730.1229587, "created_utc": 1700985857.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1845wo3/and_i_never_went_back_to_that_skatepark/", "title": "And I never went back to that skatepark", "permalink": "/r/LetsNotMeet/comments/1845wo3/and_i_never_went_back_to_that_skatepark/", "selftext": "Back when I was attending college for my undergrad, I went to the skatepark downtown nearly every chance I got between classes and work. I also lived downtown, very close to my university in California. Let's just say, it's the type of downtown where, if you're not careful, you can get yourself into a lot of trouble by being too trusting or naive. \nThe skatepark wasn't your typical \"rebellious teenagers smoking cigarettes and being intimidating\" kind of skatepark, but moreso a \"if you look at the wrong person in a way they don't like, you'll probably get stabbed\" kind of skatepark. Knowing this, and having heard stories from a friend who had been jumped by gang members in that area before, I knew skating there could be risky; especially since I wasn't very intimidating in looks or behavior. It didn't help that, while I lived in that city for a couple years already, I grew up in a small town and lacked street smarts. I always felt predatory people could pick up on that . \nDespite my reservations about it, I figured as long as I kept to myself and was constantly aware of my surroundings, I should get by just fine without getting into it with anyone. This worked great, I even kind of made friends with some regulars there and shared some beers with them. And just as I was starting to get comfortable and drop my guard a bit, I was reminded of why I shouldn't do that. \nOne day, I showed up at the skatepark in the afternoon, probably like 3pm, and locked my bike to the inside of the fence surrounding the skatepark. There was bike racks, but I never locked my bike up to those because you can't see them as well, and I knew that's how you get your bike stolen. As I was doing this, obvious gang members were sitting on the bench on the other side of the fence, and one of them spoke up, saying, \n\"Hey! Why aren't you locking your bike up on the rack? That's what it's there for\"\nI'm neurodivergent, and easily startled, especially when I am already on edge. My ears began to ring, and my body started to go numb. Seems like an innocuous question, but you just get the vibe that there's ill intention behind it. I locked my bike up that way for months, and no one ever took issue with it.  This man wasn't trying to appeal to common courtesy, or trying to reinforce skatepark etiquette. \nI finally found my voice after pausing for a moment, and probably mumbled something about it being fine where it was. He kept pushing, kept saying I should lock it up on the rack.\nOnce it was clear he wasn't going to drop it, I knew I had three choices:\n\n\nignore him, leave it where it was, and risk escalating it to the point where he would fight me.\n\n\ndo what he is saying, lock it up on the rack, and either have him steal my bike or worse. Probably worse. \n\n\nact like I was going to lock it up, and just get on my bike and leave. \n\n\nI chose the latter, pedaled as fast as I could, and didn't look behind me. I never went back to that skatepark, on the off chance that the guy would recognize me. He knew I would be easy prey now, since I obviously wasn't interested in fighting. I look back on this choice, and while part of me feels like a bit of a coward, I know I'd much rather feel like a coward than needlessly put myself in a dangerous situation. There was just something about the way he was going about it, I knew it wasn't about the bike; he wanted to get me out of the skatepark. If I had locked up the bike, that might have had me off guard long enough for him to jump me. \nPride isn't always worth it. Either way, it would have been a fight I couldn't win. I walked out the same way I walked in, and that's the best outcome.", "media": null, "score": 51, "upvote_ratio": 0.87, "comment_count": 11, "over_18": true}, "71": {"id": "186y8ku", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "T_T_U", "link_flair_text": null, "time": 1701499731.4011805, "created_utc": 1701287182.0, "url": "https://v.redd.it/l1dtvfgqyb3c1", "title": "My sister filmed a wedge of cranes and caught unexplained whisper on video", "permalink": "/r/Ghosts/comments/186y8ku/my_sister_filmed_a_wedge_of_cranes_and_caught/", "selftext": "My sister was in a forest with her dog when she spotted this big wedge of cranes and decided to film it. \nWhen watching the video later she noticed that strange whisper can be heard\nIt is hard to hear what it is saying or even what language it is. If anyone recognises the language it would be interesting to know. \nThere was nothing at the moment in the forest that could have made this whisper and she claims there was totally quiet at the time.", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/l1dtvfgqyb3c1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 474, "scrubber_media_url": "https://v.redd.it/l1dtvfgqyb3c1/DASH_96.mp4", "dash_url": "https://v.redd.it/l1dtvfgqyb3c1/DASHPlaylist.mpd?a=1704091730%2CYWU3MjMwM2ZiZDc1ZjY0Mjg2OWIwYTIxYTRlNGE0MGJjZjQ1OTlkMzdmNjFhOWYyOGViMzQ5ZWMyZjkxMDUwOQ%3D%3D&v=1&f=sd", "duration": 10, "hls_url": "https://v.redd.it/l1dtvfgqyb3c1/HLSPlaylist.m3u8?a=1704091730%2CYjVhMzcyMGRiZmE4ODgxM2Y4NDhmODVlMmNkZmUwYjI1YmE5MGQxZTkyM2U3ODE0NGNkYWZmYjRhYmY0MzliOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 205, "upvote_ratio": 0.83, "comment_count": 68, "over_18": false}, "72": {"id": "187peof", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "4everonlyninja", "link_flair_text": "Glitch Pic", "time": 1701499731.8591244, "created_utc": 1701368902.0, "url": "https://i.redd.it/0uxn2zs13j3c1.png", "title": "glitch in the matrix , they are both news anchors. L: Dennis ritter & R: Lester Don Holt", "permalink": "/r/GlitchInTheMatrix/comments/187peof/glitch_in_the_matrix_they_are_both_news_anchors_l/", "selftext": "", "media": null, "score": 26, "upvote_ratio": 0.8, "comment_count": 7, "over_18": false}}}