{"_default": {"1": {"id": "1epxobc", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "No_System_2777", "link_flair_text": null, "time": 1723862709.8460553, "created_utc": 1723416067.0, "url": "https://i.redd.it/4rdjn4ms44id1.jpeg", "title": "What are your thoughts on the Travis Walton story and do you believe he is telling the truth?", "permalink": "/r/ufo/comments/1epxobc/what_are_your_thoughts_on_the_travis_walton_story/", "selftext": "", "media": null, "score": 863, "upvote_ratio": 0.96, "comment_count": 416, "over_18": false}, "2": {"id": "1eqbrrz", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "Video", "time": 1723862711.0351682, "created_utc": 1723463898.0, "url": "https://v.redd.it/3ywjnivo28id1", "title": "Pilots flying from Saudi Arabia to Nigeria in a Boeing 747 just had a multi-UFO encounter and filmed it. Multiple UFOs moving erratically. One pilot says they were extremely bright and moved freely as well as in formation: \"They seemed to entertain us, dancing, making us awake when we are sleepy\".", "permalink": "/r/UFOs/comments/1eqbrrz/pilots_flying_from_saudi_arabia_to_nigeria_in_a/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/3ywjnivo28id1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/3ywjnivo28id1/DASH_96.mp4", "dash_url": "https://v.redd.it/3ywjnivo28id1/DASHPlaylist.mpd?a=1726454710%2CZWNhMTVmZjYwMmU5NDZlNDBiMTY1NjMyMGJhNzFmY2NlZTE3NThkZWE2YjMzNWJiMzk1MmNhYjMwODlkYjA0MA%3D%3D&v=1&f=sd", "duration": 243, "hls_url": "https://v.redd.it/3ywjnivo28id1/HLSPlaylist.m3u8?a=1726454710%2CZDlhZDM3ZWM0YTYxMzc0ZjMyNzFjNzhlMTAzM2M1OGRjNmI3ZjQyMmYxZTc3MjA1ODNlZjVhNDc2OGRiZmYyZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 8705, "upvote_ratio": 0.83, "comment_count": 1152, "over_18": false}, "3": {"id": "1eqmgff", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "TheBl4ckFox", "link_flair_text": "News :illuminati:", "time": 1723862712.323241, "created_utc": 1723489907.0, "url": "https://www.reddit.com/r/aliens/comments/1eqmgff/liquid_water_found_on_mars/", "title": "Liquid water found on Mars", "permalink": "/r/aliens/comments/1eqmgff/liquid_water_found_on_mars/", "selftext": "https://www.bbc.com/news/articles/czxl849j77ko\nThis is damned exciting. ", "media": null, "score": 2858, "upvote_ratio": 0.96, "comment_count": 354, "over_18": false}, "4": {"id": "1eqrsvm", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "disclosurediaries", "link_flair_text": "Reference", "time": 1723862712.5479488, "created_utc": 1723502841.0, "url": "https://www.reddit.com/r/UAP/comments/1eqrsvm/all_the_relevant_uap_updates_from_aug_511/", "title": "All the relevant UAP updates from Aug 5-11", "permalink": "/r/UAP/comments/1eqrsvm/all_the_relevant_uap_updates_from_aug_511/", "selftext": "This past week in Disclosure:\nAug 7 – Rep. Moskowitz says #1 question he's asked campaigning in 2024 has been regarding UAPs\nVia Askapol, Rep. Jared Moskowitz indicated that the UAP topic has seemingly captured the public's attention to a significant extent in 2024:\n\n“We’ve gotta continue to keep the topic going on...you know, of all the things people come up and talk to me about — and obviously, right now we're talking about the election and Biden and Kamala Harris and Trump and all these things and the assassination attempt — but more people come to me and talk to me about, ‘Hey, what's going on with UAPs?’” \n\nAug 8 – international conference on Aeronautics and Astronautics addresses UAPs\nAs covered here on Aug 8, the world's largest international aviation and space exploration conference took place in Las Vegas from July 29 to August 2. There, the UAP topic was debated in a technical and rigorous fashion, representing a significant advance in the level of discourse and understanding.\nAug 8 – Christopher Mellon shares his concerns regarding analysis of the infamous Gimbal UAP incicent\nTaking to X, Christopher Mellon shared his thoughts on recent statements from Dr. Kirkpatrick that seemed to misrepresent the infamous 2004 Gimbal UAP encounter:\n\n\"I share the concerns expressed here regarding Dr. Kirkpatrick’s assessments of the UAP videos taken by US Navy aviators that appeared on the front page of the NYT on December 16th, 2022. And if the Gimbal object had been a balloon somehow resisting hurricane-force winds, what about the cluster of smaller UAPs that were accompanying it, dispersed when the Navy F-18s arrived, and rejoined the Gimbal object when the Navy fighters departed?\"\n\nAug 10 – UAP Caucus announces upcoming advocacy ramp-up to support the UAPDA legislation\nUAP Caucus, an independent community-driven platform that advocates for UAP transparency, has announced an upcoming ramp-up of efforts to support the inclusion of crucial UAP transparency-related legislation in the FY24 NDAA.\nThe UAP Caucus website includes a variety of useful research, advocacy tools, and more. \nNote – Disclosure Diaries has no official affiliation with the UAP Caucus platform, but this author has had the pleasure of speaking with their founder in the past. \n\nThings to look out for in the near future:\nAugust/September\n\nAccording to Senator Gillibrand – a public hearing in line with AARO's latest report can be expected soon, saying –\"I’m hoping July, and if not then September. But I’m trying to do July.”\nSpeaking with Askapol, Reps. Luna and Burchett indicated that the next UAP hearing is likely to come after the August recess.\nLue Elizondo has indicated his much-awaited book will be published in August 2024. Elizondo was the former director of the now defunct Advanced Aerospace Threat Identification Program (AATIP) – a program associated with the release of the Pentagon UFO videos.\n\nBeyond/currently unknown\n\nFollowing the UAP hearing on the 26th of July, Members of Congress have called for a select committee with subpoena authority, to “go about the task of collecting information from the Pentagon and elsewhere” on unidentified flying objects. There have been conflicting messages from various Members of Congress on whether this is likely to happen anytime soon. Note – a select subcommittee was formally requested on March 13th.\nReps. Moskowitz, Luna, and Burchett have repeatedly stated their intent to hold field hearings to overcome stonewalling from the Pentagon and military establishment \"I think we [Congress] should try to get into one of these places [housing UAP evidence]...and if they won't let us in I think we should have a field hearing right outside the building...and the military will have to explain why that is.\" – Rep. Moskowitz (D) It is currently unknown when exactly we might expect that to occur, however as of Jan 12 – Rep. Luna confirmed: \"I feel confident that we have enough evidence to move forward with our first field hearing. We will be announcing details soon.\"\nSeveral journalists have indicated that first-hand witnesses of the alleged UAP legacy programs are in the process of providing testimony/evidence to the relevant authorities (e.g. the IC IG) and/or are on the verge of making public statements in the near future (Example 1, example 2, example 3, example 4)\nDavid Grusch has received additional clearances through DOPSR to discuss some of his (alleged) first-hand knowledge of Legacy programs. He has mentioned he may be covering more of this information in an upcoming Op-Ed\n\nSkimmed through this post but need a quick refresher on how we got to this point? Check out this handy Disclosure Timeline to get up to speed.", "media": null, "score": 59, "upvote_ratio": 1.0, "comment_count": 12, "over_18": false}, "5": {"id": "1ep28ua", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "toreachtheapex", "link_flair_text": null, "time": 1723862714.4034376, "created_utc": 1723320844.0, "url": "https://www.reddit.com/gallery/1ep28ua", "title": "Look in the reflections of the plane lmao", "permalink": "/r/conspiracy/comments/1ep28ua/look_in_the_reflections_of_the_plane_lmao/", "selftext": "", "media": null, "score": 4128, "upvote_ratio": 0.77, "comment_count": 1112, "over_18": false}, "6": {"id": "1esd1m9", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1723862714.5907414, "created_utc": 1723670309.0, "url": "/r/wallstreetSHITS/comments/1es4snt/cpi_rate_of_inflation_slowed_slightly_but_prices/", "title": "CPI rate of inflation slowed slightly but prices still rising. Press tells public to ignore what they see every time they go shopping.\nEstablishment propaganda in election year?\nA rate cut here disastrously inflationary for stressed working class, but temporary boost for struggling incumbent admin..", "permalink": "/r/conspiracyfact/comments/1esd1m9/cpi_rate_of_inflation_slowed_slightly_but_prices/", "selftext": "", "media": null, "score": 6, "upvote_ratio": 0.8, "comment_count": 0, "over_18": false}, "7": {"id": "1et0t1x", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "LordDelphi", "link_flair_text": "photo", "time": 1723862715.361167, "created_utc": 1723742289.0, "url": "https://i.redd.it/lhuf958t2vid1.jpeg", "title": "Here is a picture I took a couple of years ago in the forest. ", "permalink": "/r/bigfoot/comments/1et0t1x/here_is_a_picture_i_took_a_couple_of_years_ago_in/", "selftext": "Yes, it is a black bear. However, here is my point. I was driving my truck down a forest road and came across a black bear just a few feet in front of me. By the time I stopped, reached for my IPhone which was right on my console, did Face ID, pulled up the app, framed it and hit the button, the bear had ran down the road 25 yards. \nThe result is a crappy photo. Yes, you can tell that it is a bear. But say it was a Bigfoot. It would still look like a tall big black blob. Or at least, the classic potato photo and no proof of anything. \nI am also a photographer and actually can take amazing pictures with my IPhone. But that is when the set up is perfect and I have time to make it a good shot. \nMy point is that it at least proved to me that it is very difficult to take a picture of a wild animal. Most often it is a brief and unexpected occurrence and when so, the photo is pretty much crap. ", "media": null, "score": 346, "upvote_ratio": 0.73, "comment_count": 147, "over_18": false}, "8": {"id": "1epvbbk", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Sevenclans", "link_flair_text": "Art", "time": 1723862715.8756456, "created_utc": 1723409945.0, "url": "https://i.redd.it/rc0gapclm3id1.jpeg", "title": "My explanation for the Jersey devil.", "permalink": "/r/Cryptozoology/comments/1epvbbk/my_explanation_for_the_jersey_devil/", "selftext": "", "media": null, "score": 1384, "upvote_ratio": 0.98, "comment_count": 83, "over_18": false}, "9": {"id": "1esbocn", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Johanharry74", "link_flair_text": "U.F.O. Humanoid", "time": 1723862715.9925396, "created_utc": 1723666938.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1esbocn/three_humanoid_closeencounter_cases_from_the/", "title": "Three Humanoid close-encounter cases from the Nordic countries.", "permalink": "/r/Humanoidencounters/comments/1esbocn/three_humanoid_closeencounter_cases_from_the/", "selftext": "Scandinavia and the Nordic countries have also had their fair amount of UFO-sightings and close encounters with humanoid alien beings during the years. Here are 3 strange humanoid-cases from Norway, Sweden and Finland which I find very intresting and fascinating.\nThe girl and the Greys(?).\nMålselv in northen Norway, sometime in the 1950s.\nThis is a story which was told by a woman many, many years after it happened. This took place when she was only seven or eight years old. At the time of the incident, she was out playing by a river close to her home. She then saw a gray oval object on the other side of the river. It disappeared in and out of the forest. The girl waved and smiled at the craft. After a while it came slowly and calmly gliding over the river and landed close to the girl. Of course she didn't know what this was. A hatched opened and at first she thought it was people coming out of the craft, but then she saw they were not humans. The beings were around the same height as the girl. They were pale and had big, dark eyes, a small snarled mouth and a nose that was barely visible. Despite this, the girl was not afraid. They said that they were going to look at her and take some tests. The beings looked at her teeth, took off her boots and looked at her feet and then took some samples. When the survey was ready, they asked if she wanted to follow them and see how they were living at their home planet. The girl thought of her mother and therefore did not want to come along. Then they promised to come back again, entered the craft and waved to her. Then the craft took off and went straight up into the air. Finally, the craft was so small that the girl could no longer see it. The woman remembered that the beings had not been talking to her during the whole encounter. They had been communicating telepathically all the time.\nThe girl met strange beings and their craft at the shore of the river. (artistic impression)\nWas this an early authentic Grey encounter? Or was this only something from the girl’s imagination, later “remembered” as memory by the woman and affected by pop-culture of what an alien should look like? We will probably never know...\nSource: UFO - NORSKE NÆRKONTAKTER AV 3. GRAD\nHeld at gunpoint by an Alien.\nKolmården in Sweden, August 23 1967.\nThe witnesses wanted to remain anonymous because of this strange incident and fear from being ridiculed. A boy and a girl (lets call them \"Peter & Fia\"), both 15, were out walking on a small road one evening in a residential area in the small community of Kolmården. The time was around 8 pm when they passed an abandoned industrial plot, and they noticed a reddish glow descending without a sound into a nearby forest. The teenagers felt a little anxious and they also had a strange feeling of being watched, so they walked faster towards home.\nOn their way home Peter and Fia could see the red light once again hovering above the tree tops. And now curiosity takes over and they decide to investigate. When they reached an old uninhabited cabin in the woods, they could see small mysterious yellow lights hovering and moving around all over the place. They are surprised to see that some of the lights are also inside the old cabin. And they could hear the sound of someone pounding on wood. Now they also see the red light again and it is coming in lower towards them, and stops and hovers at a small stream nearby. Peter and Fia are now very afraid and runs out of the woods and onto the road and walks with a very fast pace towards the home of the boy’s older sister who lived very close.\nWhen they reached the house of the sister they knocked at the front door, but no one answered. Seemed like no one was home. When they walk out to the road again, they see a round, brightly luminous object hovering about 3 meter (15 feet) in the air in front of them. Almost after they hear a strange whistling sound (similar to the sound produced by blowing on a blade of grass held between the palms and thumbs of one's hands) and footsteps, and finally a strange, small being jumps out (or maybe he was floating?) onto the road from behind some bushes, 10-12 meter (30-36 feet) away. It was only 130 centimeter tall (4 feet, 4 inches) and very skinny. Its face was at first in shadow, so Fia thinks it could be some kind of prank, so she is trying to get a few steps closer. But then the being looks in their direction with a nasty and intense gaze from its dark eyes and Peter grabs Fia’s arm shouting \"Watch out, he is not human!\".  Suddenly the being jerkily raised its arms, holding a box from which a short tube protruded with a glowing bow above. The small humanoids’s head was very large and covered by hair, a hood or a helmet, it had large black eyes, and a nose and mouth that together formed an \"X.\" It was bowlegged, and around each ankle it had a white-glowing wire or ribbon. The being appeared both tough and somewhat frightened and shivering at the same time. The witnesses were now terrified and fled for home.\nDetails from the encounter.\nThe next day, at the site of the humanoid-sighting, the boy found some apples that had been broken apart, some with the marks of 5 fingernails or claws, on the broken surfaces, and others that were coated with an ill-smelling slime. Also, deep, strange, footprints, 25 cm (6\") long and with 3 toes, were found outside the sister’s house.\nDuring the two next nights, Erik's older sister heard soft footsteps and ticking and scraping sounds outside their home, and saw lights moving about the area. In the morning after this incident, they found out that two shutters had been torn.\nUfologist Sven Schalin could find no natural explanation for the case. He regarded the witnesses as sincere and serious when recounting the experience. Peter´s mother confirmed that the teenagers were shocked when coming home and Peter didn´t want to go outside after dark for some time after the incident. This was an unusual behavior on his part.  \nSources: APRO Bulletin, Sep.-Oct. I967, 1 & 5 and Håkan Blomqvist blog May 25 2014.\nThe mystery in Imjärvi.\nImjärvi in ​​southern Finland, January 7 1970.\nIt was late afternoon and two friends were out cross-country skiing (Aarno Heinonen 36 and Esko Viljo 38). It was dusk, cold -17 degrees Celsius (1.4 F) and no wind. The men came to a clearing, where they rested a little. After a few minutes they heard a humming sound. Both Aarno and Esko looked up to see a bright light coming from the north, which looked like a brilliant, pulsating cloud. It stopped above the men and slowly began to descend towards them. At a height of about 15 meters (45 feet) they could make out a ship inside the cloud. It was maybe 3 meters (15 feet) in diameter and had 3 balls underneath (looked a bit like a typical Adamski-ship). The saucer now came closer and the buzzing got louder.\nThe case was featured in an issue of the Flying Saucer review and the picture shows the craft and the being inside the light beam.\nAt about 3-4 meters (15-18 feet) above the men it stopped and the sound stopped. The cloud had now almost disappeared. Suddenly they saw a bright beam of light from the underside of the ship, coming down towards the snow and illuminating it, like a lone spotlight on a stage. Now a red-grey mist also descends around the two men. Then the light disappears as quickly as it came. But soon it comes back and now they see a small creature standing in the middle of the cone of light 3 meters (15 feet) from them. It was one meter high (3 feet) and narrow. The face was pale and with small eyes and a sharp witchlike nose. On its head it had a pointy helmet or cap. On the body, the creature wore a light green tight-fitting overall or jumpsuit. It had dark green tall boots and white long gloves. In both of its hands it held a small glowing device, which it then pointed at Aarno and Esko. The pulsing light that came at the men was very bright and blinding. As the creature stood there and pointed the light at the men, sparks began to fly around the red-gray mist and the mist begins to thicken more and more. Finally, they could no longer see the creature or each other. Suddenly the beam of light on the ground got smaller and smaller and floated upwards towards the ship and disappeared. Then the fog also fell away. The forest was now quiet and empty and the men could see each other again. Of the creature and the ship there was no trace. They just stood there looking at each other in silence for several minutes.\nThe being had a green jumpsuit and a pointy hood or helmet. The facial features were very goblin-like.\nNow Aarno noticed that his right side felt strange, it stung, and when he took a step forward with the ski he collapsed. He couldn't get up even though he tried several times. Esko had to help Aarno home and it took them an hour to walk 2 kilometers (1.25 miles) through the snow. When they got home to Aarno's cabin, he had a backache, a headache, difficulty breathing and felt so bad that he had to vomit. When Aarno then went to urinate, the urine was black as coffee. These symptoms continued on and off for several months until the summer. He also had a fever at times and difficulty with balance. He was also unable to work during this period. Viljo also suffered from health problems. When he dropped off Aarno, his face swelled up and turned red. He also had difficulty with his balance. A few days later, Viljo started to become sensitive to light. And tingling in the feet appeared. Viljo's symptoms also remained for several months. Doctors who examined the two men believe they were exposed to radioactive radiation. In the month of June, a reporting team investigated the place where the two men had their terrible encounter that night. And several people on the team complained of headaches and red hands. Other people who visited the site after the incident have also claimed to have felt ill for days afterwards.\nExactly what really happened that late afternoon in Imjärvi is still a mystery. And we will probably never get an answer. But we see similarities with other UFO cases where people have had close contact with UFOs, orbs or aliens, and that is that many have injuries similar to those caused by exposure of too much radioactive or ultraviolet radiation.\nSource: UFO-Sverige", "media": null, "score": 43, "upvote_ratio": 0.89, "comment_count": 2, "over_18": false}, "10": {"id": "1escrhw", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "TheCryptidAtlas", "link_flair_text": null, "time": 1723862716.4449952, "created_utc": 1723669610.0, "url": "https://www.reddit.com/r/cryptids/comments/1escrhw/what_cryptid_do_you_believe_to_be_100_with_out_a/", "title": "What cryptid do you believe to be 100%, with out a doubt, completely real? - And what caused you to be such a firm believer?", "permalink": "/r/cryptids/comments/1escrhw/what_cryptid_do_you_believe_to_be_100_with_out_a/", "selftext": "I want to hear your story, evidence, or encounter that led you to be a staunch believer in whichever cryptid it is you believe in!", "media": null, "score": 296, "upvote_ratio": 0.98, "comment_count": 332, "over_18": false}, "11": {"id": "1esl9qy", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "legaladvice10293848", "link_flair_text": "Child Sensitivity", "time": 1723862716.7301304, "created_utc": 1723692827.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1esl9qy/my_toddler_is_freaking_me_out/", "title": "My toddler is freaking me out", "permalink": "/r/Thetruthishere/comments/1esl9qy/my_toddler_is_freaking_me_out/", "selftext": "A few nights ago my toddler woke up in the middle of the night screaming for me. She was terrified. I ran to her room and laid down next to her bed and she calmed down and went back to sleep. I chalked it up to a nightmare that night. But every day since then, when we go in her room she references an octopus. “Oh no! Octopus! I get out!” Then she runs out. It’s some variation of exclaiming there’s an octopus and wanting to leave. \nShe’s never had an octopus toy or anything and it’s kind of giving me the creeps. I don’t like being in her room anymore either. Any theories or advice? We are not religious and I’m a bit of a skeptic, but I do think kids can sense things that adults are more numb to. \nUpdate: she woke up at 5am screaming so I went and got her and brought her to my bed. She pointed at MY closet and said “Uh oh. Octopus.” 😭 I told her to go night night and she did not go back to sleep. Later in the morning I asked her to show me where the octopus is and she pointed to the kitchen. So we went to the kitchen and then she pointed at the back door and said “outside”. Then she threw a tantrum because she wanted to go play outside and I said no. \nSO IDK. ", "media": null, "score": 324, "upvote_ratio": 0.93, "comment_count": 138, "over_18": false}, "12": {"id": "1erxg7g", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "throwaway2963432", "link_flair_text": null, "time": 1723862716.9830782, "created_utc": 1723628678.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1erxg7g/horror_at_dubai_airport/", "title": "Horror at Dubai Airport", "permalink": "/r/LetsNotMeet/comments/1erxg7g/horror_at_dubai_airport/", "selftext": "Okay so this is a situation that happened in Dubai airport although i wasn't the main victim in this story. I was trying to get to the terminal in order to catch a flight out of dubai when i realised the taxi driver took me to the wrong terminal. Disappointed at the fact that i was at the wrong place, i let out a f***ing hell out of frustration at myself and decided to try and figure out where to go next. A few minutes later, 2 police officers came and detained me and went off at me for swearing at an arab woman (whom i assume was somewhere around me) and a whole host of insults that would only really be offensive in arab/asian culture, including threats of violence until they saw i had a passport from a western country and suddenly became polite (I don't look like i'm from the west). However, the worst part of that hour long ordeal was the fact that there was a hungarian girl that came in with her dad and complained about being raped only to get yelled at by the police and told to get lost. Is this a common experience in authoritarian countries? What would a woman do if she was attacked like this? Anyway i was glad i wasn't a girl at that time. Also, Dubai police, let's not meet", "media": null, "score": 2496, "upvote_ratio": 0.96, "comment_count": 228, "over_18": true}, "13": {"id": "1eqixmz", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "happypants69", "link_flair_text": null, "time": 1723862717.1183772, "created_utc": 1723481726.0, "url": "https://i.redd.it/dn5pkw21k9id1.jpeg", "title": "Korean serial killer Kim Sun-ja laced her friend's tea with cyanide, causing her to vomit. She told her friend that she would feel better if she drank more of the beverage, but her friend became suspicious and refused, becoming the only known survivor of 6 poisoning victims from 1986 to 1988", "permalink": "/r/truecreepy/comments/1eqixmz/korean_serial_killer_kim_sunja_laced_her_friends/", "selftext": "", "media": null, "score": 93, "upvote_ratio": 1.0, "comment_count": 6, "over_18": false}, "14": {"id": "1epzvmu", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "knee_nerr", "link_flair_text": null, "time": 1723862717.2606544, "created_utc": 1723422136.0, "url": "https://www.reddit.com/r/threekings/comments/1epzvmu/i_think_my_neighbor_summoned_something_please/", "title": "I think my neighbor summoned something? (Please give input) ", "permalink": "/r/threekings/comments/1epzvmu/i_think_my_neighbor_summoned_something_please/", "selftext": "Okay so a little back story..\nYesterday around 8:40pm I had to go back into work after my break. I don't live on the first floor of my apartment so I use the elevators. As I walked down the hall towards the elevators I heard sounds of what sounded like bad karaoke thinking nothing of it. However once I turned the corner it sounded like moaning, groaning, and screaming almost like someone was in pain. The noise of course getting louder once I reached the elevators. As I pressed the button to the elevators and waited I heard it clear as day \"HELP ME\" the voice coming from one of the apartment doors directly in front of the elevators . Of course my first instinct was to maybe knock on the door as check up on the person but I got this unsettling feeling immediately after, a gut feeling telling me not to do that especially not alone. I rushed back down the hall to my apartment not wanting to stand there a minute longer and to drag my husband over. As we reached the elevators once again we heard the strange noises, same voice screaming only this time it sounded like singing only no music and a very ominous tone. The only way to describe it would be like gibberish it didn't sound like a common language there was maybe a normal word here and there but other wise there where no full sentences I'd pass it off as someone being belligerent drunk, if only we both didn't get a bad vibe from it. The air felt heavy and uncomfortable as we listened, searching for signs of distress, then we heard the voice get closer to the door and bolted. My husband urging me to get in the elevator and go straight to work. Me telling him to lock himself in the apartment. So far nothing weird has happened but my husband did sleep with the lights on. Does anyone have any input? I feel like a need to smudge my apartment and use protection assets such as cinnamon and salt on the doorway/window sills.", "media": null, "score": 8, "upvote_ratio": 0.75, "comment_count": 1, "over_18": false}, "15": {"id": "1eqmwt4", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "AppalacheeQueen", "link_flair_text": "Captured Apparition ", "time": 1723862717.580862, "created_utc": 1723490984.0, "url": "https://v.redd.it/h0efcs8kbaid1", "title": "Apparition caught on home security camera?", "permalink": "/r/Ghosts/comments/1eqmwt4/apparition_caught_on_home_security_camera/", "selftext": "Captured by our in home camera. My roommate is convinced it’s her mother. I do see glasses at one point and her mom did wear glasses. No one else was in the home or awake. What do y’all think?", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/h0efcs8kbaid1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 640, "scrubber_media_url": "https://v.redd.it/h0efcs8kbaid1/DASH_96.mp4", "dash_url": "https://v.redd.it/h0efcs8kbaid1/DASHPlaylist.mpd?a=1726454717%2CYzM2NjkyOGFmYzRlMDBmYjMyYTQ3NWM4MGZiNTJkYWZjZGI2ZmU4YzkxZDg0ZmMxMTgwZTgyZDQ5ZTc0YTFmYg%3D%3D&v=1&f=sd", "duration": 4, "hls_url": "https://v.redd.it/h0efcs8kbaid1/HLSPlaylist.m3u8?a=1726454717%2CMzEzMjEyMTg5NDQ2ZTM3OGU2ZTk5YzIyZjc1NWJmMGIyMWM3ODM1ZTA2NmM0OWQ2NjQ3NjIyZjg4M2RiZDE5Ng%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 910, "upvote_ratio": 0.96, "comment_count": 140, "over_18": false}, "16": {"id": "1esz50i", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Bieb_8", "link_flair_text": "Glitch Pic", "time": 1723862717.7020595, "created_utc": 1723738195.0, "url": "https://i.redd.it/ypiqiqymquid1.jpeg", "title": "I think his glasses are glitching", "permalink": "/r/GlitchInTheMatrix/comments/1esz50i/i_think_his_glasses_are_glitching/", "selftext": "", "media": null, "score": 42, "upvote_ratio": 0.73, "comment_count": 16, "over_18": false}, "17": {"id": "1eqg6nz", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "humbingrooden", "link_flair_text": null, "time": 1723862718.9983044, "created_utc": 1723475260.0, "url": "https://i.redd.it/mu03l1hznt8b1.jpg", "title": "Honestly cannot wait for this", "permalink": "/r/ufo/comments/1eqg6nz/honestly_cannot_wait_for_this/", "selftext": "", "media": null, "score": 722, "upvote_ratio": 0.87, "comment_count": 239, "over_18": false}, "18": {"id": "1es0csj", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "peachydiesel", "link_flair_text": "Likely CGI", "time": 1723862720.5940363, "created_utc": 1723638605.0, "url": "https://v.redd.it/p3cshdhbimid1", "title": "Another video posted in response to the 4chan gimbal video posted last night. I have not seen this one before.", "permalink": "/r/UFOs/comments/1es0csj/another_video_posted_in_response_to_the_4chan/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/p3cshdhbimid1/DASH_720.mp4?source=fallback", "has_audio": false, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/p3cshdhbimid1/DASH_96.mp4", "dash_url": "https://v.redd.it/p3cshdhbimid1/DASHPlaylist.mpd?a=1726454719%2CNDY1NGRkYWUyMjVjNzZjZDRkNmFiYzI3M2Y4YjM2M2E3NjMzMTY0ZTljMDNmYjc2MzA3ZDZkN2RhNjg1YWZiNQ%3D%3D&v=1&f=sd", "duration": 45, "hls_url": "https://v.redd.it/p3cshdhbimid1/HLSPlaylist.m3u8?a=1726454719%2CMzQzZGVjMjM0MjJlNzY3MmFlYjkyM2Y0N2MzMDI5NzE2N2RjMjk3YjdkNjNlYmVmZGVmNDA0MjRjZDJlMGMxOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2561, "upvote_ratio": 0.86, "comment_count": 412, "over_18": false}, "19": {"id": "1ep7bwu", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Molech996", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1723862722.1154583, "created_utc": 1723335075.0, "url": "https://www.reddit.com/gallery/1ep7bwu", "title": "I made my own Nazca alien mummy.I’ve been working on it for four days and it’s finally done.What do you guys think?", "permalink": "/r/aliens/comments/1ep7bwu/i_made_my_own_nazca_alien_mummyive_been_working/", "selftext": "", "media": null, "score": 2387, "upvote_ratio": 0.87, "comment_count": 552, "over_18": false}, "20": {"id": "1erpfpw", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "TheGoodTroubleShow", "link_flair_text": "Video", "time": 1723862724.3770554, "created_utc": 1723600187.0, "url": "https://v.redd.it/60irsv03bjid1", "title": "The latest on the UAP Disclosure Act from Senators Schumer and Rounds, co-sponsored by Senator Gillibrand.  More to come!", "permalink": "/r/UAP/comments/1erpfpw/the_latest_on_the_uap_disclosure_act_from/", "selftext": "", "media": null, "score": 58, "upvote_ratio": 0.95, "comment_count": 5, "over_18": false}, "21": {"id": "1ep0jys", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "PuzzledPrinciple1549", "link_flair_text": null, "time": 1723862725.737951, "created_utc": 1723316250.0, "url": "https://www.reddit.com/gallery/1ep0jys", "title": "Me 4 days after vaccination.", "permalink": "/r/conspiracy/comments/1ep0jys/me_4_days_after_vaccination/", "selftext": "Merely 4 days after receiving the covid vaccine I was hospitalized for seizures at the age of 22. Every doctor,neurologist, and rheumatologist shrugs and says we have no idea what’s going on. I was healthy and never went to the hospital before getting the vaccine. Now I’m in the ICU on a ventilator monthly with psoriatic rashes all over my body from my own immune system attacking my body,joints, and brain. Never in my life had I had a seizure nor any autoimmune disorder. Please be careful if you are planning on getting this vaccine.", "media": null, "score": 3490, "upvote_ratio": 0.72, "comment_count": 2239, "over_18": false}, "22": {"id": "1epu1zt", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Typical_Spring_3733", "link_flair_text": null, "time": 1723862725.898869, "created_utc": 1723406698.0, "url": "https://i.redd.it/to49fqfvc3id1.png", "title": "Japan is in Imminent Danger...", "permalink": "/r/conspiracyfact/comments/1epu1zt/japan_is_in_imminent_danger/", "selftext": "", "media": null, "score": 8, "upvote_ratio": 0.83, "comment_count": 1, "over_18": false}, "23": {"id": "1eoyo9y", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Limp_Vegetable7227", "link_flair_text": "humor", "time": 1723862726.6718614, "created_utc": 1723311302.0, "url": "https://i.redd.it/auelcq0ahvhd1.jpeg", "title": "I have crystal clear photographic proof of bigfoot", "permalink": "/r/bigfoot/comments/1eoyo9y/i_have_crystal_clear_photographic_proof_of_bigfoot/", "selftext": "", "media": null, "score": 264, "upvote_ratio": 0.8, "comment_count": 85, "over_18": false}, "24": {"id": "1etnuwo", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Meme", "time": 1723862727.6271524, "created_utc": 1723812383.0, "url": "https://i.redd.it/35kzv2g8v0jd1.png", "title": "This is quite possibly the most real story to have ever happened", "permalink": "/r/Cryptozoology/comments/1etnuwo/this_is_quite_possibly_the_most_real_story_to/", "selftext": "", "media": null, "score": 734, "upvote_ratio": 0.92, "comment_count": 140, "over_18": false}, "25": {"id": "1epvagt", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Sevenclans", "link_flair_text": null, "time": 1723862728.1940942, "created_utc": 1723409882.0, "url": "https://i.redd.it/50ba1wmem3id1.jpeg", "title": "A rational explanation for the Jersey devil.", "permalink": "/r/cryptids/comments/1epvagt/a_rational_explanation_for_the_jersey_devil/", "selftext": "", "media": null, "score": 273, "upvote_ratio": 0.99, "comment_count": 23, "over_18": false}, "26": {"id": "1eq5vpu", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "zetia2", "link_flair_text": "Paranormal Investigation", "time": 1723862728.4346437, "created_utc": 1723441243.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1eq5vpu/not_my_mom/", "title": "Not My Mom ", "permalink": "/r/Thetruthishere/comments/1eq5vpu/not_my_mom/", "selftext": "During high school, both my parents worked and I would be home alone after school until around 7pm. Normally, I would come home and mess around on the computer in my basement until my parents came home. Right above this area are the kitchen and laundry room which are connected to the garage. Every so often after school, I heard footsteps above me in the kitchen. I blamed it on the house settling and never really took it seriously. But one day after school something happened that I could not explain away with pipes. \nI was on the computer like usual and heard the door to the garage from the laundry room open(the alarm makes a beep when someone opens an exterior door). Then there were footsteps from the laundry room into the kitchen, and the sound of a woman chatting loudly like she was talking on a cellphone. Thinking my mom came home early, I went upstairs to see her. When I opened the basement door, I was greeted with a pitch black house.\nI called out, \"Mom?\"...silence...,\"Hello?\"...no response...\nScared shitless, I turned a few lights on and looked around. All the doors were locked, there were no cars in the garage, and nothing was missing. At this point I was freaking out a little and went back to the safety of the basement. Once my mom came home I asked if she was home earlier and of course she was not.", "media": null, "score": 58, "upvote_ratio": 1.0, "comment_count": 9, "over_18": false}, "27": {"id": "1erh1jg", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "LauraZaid11", "link_flair_text": null, "time": 1723862728.6118636, "created_utc": 1723577857.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1erh1jg/a_man_wanted_to_eat_my_tattoo/", "title": "A man wanted to eat my tattoo", "permalink": "/r/LetsNotMeet/comments/1erh1jg/a_man_wanted_to_eat_my_tattoo/", "selftext": "I’m a 29 year old woman. I lived in a big city all my life, but at the beginning of April I moved to a medium sized town about 1 hour away from that big city, along with my sister and our 4 pets. \nThis happened after a month of living here. My sister was preparing her final presentation for her arts undergraduate which was going to be shown in the city, so she had to spend the whole day there to make her preparations. I was left home alone with our cats and dogs, so in the early evening I decided to go for a long walk with my 2 dogs. \nWe walked for like an hour, but about 5 away from our home as we were headed back I saw a man knocking on a door about a block away. I thought he looked a bit weird because he would knock on the door, look around, then knock on the door, and then look around again, but he didn’t look dangerous so I just kept walking since I had to pass by him to take the street that would take me to my home. When I was about 10 meters away he looked my way and started walking towards me. He was tall and slender, and was carrying what looked like a box of candy. He asked me if I had any coins to spare, I told him “sorry mate, I only have my dogs’ poopy bags, have a good one”, and I was ready to keep walking when he saw one of my tattoos and stopped me. \nFor some context, I have tattoos. I’m not heavily tattooed but I have several in my arms and legs, and since I was wearing shorts the ones on my legs were visible. The specific one he was looking at is of a ghost woman in a traditional Japanese style. As he stopped me he said “that’s a really cool tattoo, would you give it to me?”. I just laughed uncomfortably, thinking he was joking, but he was dead serious, just staring unblinking at my tattoo. He then continued talking, “no? So you’re just gonna let the maggots eat it? Such a shame, it would be better if a person ate it”. At this point he raised his face and looked me straight in the eyes, with a very flat smile that seemed to be an attempt to be friendly, but only made me feel even more uncomfortable. \nHe then asked me for my name, and not wanting to antagonize him I gave him a fake one, let’s say it was Regina. He then asked me if I lived in town, to which I also lied and said that I was from the big city and just visiting; he then told me he used to live in that city too, he lived on the streets downtown. He told me he used to rap in buses to get money, and just out of the blue started rapping about me, still looking me straight in the eye. He rapped about how I was very pretty, how amazing my tattoos are, and in his rap he said my name was Lorena. I corrected him and said my name was Regina and not Lorena, since I had a suspicion he realized I had given him a fake name and was testing me. He just smiled and nodded. \nHe then asked me if I’d give him my number. I said that me and my dogs had to go home, that we were expected. He pointed at a butcher shop a block away and told me that we could sit over there while I gave him my number, that it wouldn’t take long, but I told him that I couldn’t, that the one waiting for me at home was my boyfriend, but I was lying again, since I was home alone. His smile faded a bit and he just said “well that sucks”. \nI wished him a good evening and turned around to leave, only for him to drop to his knees and grab my leg with both of his hands. He started caressing my tattoo while whispering “it really is a goddamn cool tattoo”. My dogs are pretty friendly and they were very calm during this whole exchange, but when he grabbed my leg they started growling. I pulled my leg out of his hand, wished him a good evening again and just walked away as fast as I could. I took a longer way home to make sure he didn’t follow me, and once home I took a shower and scrubbed my leg real well, since I felt gross after all that. \nLuckily for me I haven’t seen him again, but for a while after that I made sure to cover my tattoos every time I went outside, just in case. ", "media": null, "score": 338, "upvote_ratio": 0.97, "comment_count": 39, "over_18": true}, "28": {"id": "1es9934", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "dangerdangerman", "link_flair_text": null, "time": 1723862728.748478, "created_utc": 1723660519.0, "url": "https://v.redd.it/wrtq2tojboid1", "title": "Sewer alligators aren't just a myth", "permalink": "/r/truecreepy/comments/1es9934/sewer_alligators_arent_just_a_myth/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/wrtq2tojboid1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 592, "width": 1280, "scrubber_media_url": "https://v.redd.it/wrtq2tojboid1/DASH_96.mp4", "dash_url": "https://v.redd.it/wrtq2tojboid1/DASHPlaylist.mpd?a=1726454728%2CNzg1NjVlMzYyNzY1OWVmNGI1MTdhZDZmMWYyZjA2YTJjNDI5Y2FhN2RkZDNiYmU0ZTRjNGM2ZThjZDI2NGNkYg%3D%3D&v=1&f=sd", "duration": 13, "hls_url": "https://v.redd.it/wrtq2tojboid1/HLSPlaylist.m3u8?a=1726454728%2CNjdjNjRjNGFhYzFlYTkzZTkyYzM5ODhlOTdiZTRjOGNhMjEyOTUwN2NhM2RhNDI1YjVkM2NjMjQzOTBhZGFkYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 61, "upvote_ratio": 0.96, "comment_count": 3, "over_18": false}, "29": {"id": "1ervi5q", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Thefemcelbreederfan", "link_flair_text": null, "time": 1723862728.8666825, "created_utc": 1723620671.0, "url": "https://www.reddit.com/r/threekings/comments/1ervi5q/any_rituals_to_get_good_grades_on_the_exams/", "title": "Any rituals to get good grades on the exams?", "permalink": "/r/threekings/comments/1ervi5q/any_rituals_to_get_good_grades_on_the_exams/", "selftext": "I've studied for the exams but I want to make sure I get the good grades. Learning from past experience, I recognize that simply studying isn't going to help as these test as honestly pretty unclear \nI don't mind if the ritual isn't exactly the safest thing you can do, only the fact that I'm not yet an adult so complicated things like buying a goat's heart isn't going to make it. I would like something simple to do ", "media": null, "score": 4, "upvote_ratio": 0.75, "comment_count": 5, "over_18": false}, "30": {"id": "1eomfuo", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "StaffordshirePE", "link_flair_text": "Paranormal Tourism", "time": 1723862729.2156954, "created_utc": 1723271738.0, "url": "https://www.reddit.com/gallery/1eomfuo", "title": "BIRDCAGE FARMHOUSE EST 1695 - BEHIND THE SCENES PHOTOS ", "permalink": "/r/Ghosts/comments/1eomfuo/birdcage_farmhouse_est_1695_behind_the_scenes/", "selftext": "A Farmhouse in the UK lost in time with everything still inside, this place had a creepy vibe but I'm not sure if it is haunted.", "media": null, "score": 326, "upvote_ratio": 0.98, "comment_count": 33, "over_18": false}, "31": {"id": "1epib2g", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "thecookiekicked", "link_flair_text": "Glitch Pic", "time": 1723862729.3470023, "created_utc": 1723374621.0, "url": "https://i.redd.it/l9zhusxjp0id1.jpeg", "title": "Normal stairs", "permalink": "/r/GlitchInTheMatrix/comments/1epib2g/normal_stairs/", "selftext": "", "media": null, "score": 34, "upvote_ratio": 0.76, "comment_count": 1, "over_18": false}, "32": {"id": "1epuiit", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "No_System_2777", "link_flair_text": "Discussion", "time": 1723862731.1665432, "created_utc": 1723407882.0, "url": "https://i.redd.it/p6fkiikgg3id1.jpeg", "title": "What is your opinion on the Nuremberg 1561 incident and do you believe it was really aliens?", "permalink": "/r/ufo/comments/1epuiit/what_is_your_opinion_on_the_nuremberg_1561/", "selftext": "", "media": null, "score": 560, "upvote_ratio": 0.96, "comment_count": 285, "over_18": false}, "33": {"id": "1es3v82", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Gari_305", "link_flair_text": "Article", "time": 1723862733.0794373, "created_utc": 1723647696.0, "url": "https://www.dailymail.co.uk/sciencetech/article-13739361/congress-investigates-alien-mummies-peru-independent-analysis-tennessee.html", "title": "US Congress to investigate controversial Peru 'alien' mummies amid fears they could be linked to UFOs", "permalink": "/r/UFOs/comments/1es3v82/us_congress_to_investigate_controversial_peru/", "selftext": "", "media": null, "score": 1806, "upvote_ratio": 0.79, "comment_count": 523, "over_18": false}, "34": {"id": "1epnneo", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "TimpRambler", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1723862734.2155697, "created_utc": 1723390491.0, "url": "https://i.redd.it/yc2c8iwq02id1.jpeg", "title": "I'm so tired of the 'prison planet' 'energy slave' bullshit", "permalink": "/r/aliens/comments/1epnneo/im_so_tired_of_the_prison_planet_energy_slave/", "selftext": "", "media": null, "score": 878, "upvote_ratio": 0.89, "comment_count": 189, "over_18": false}, "35": {"id": "1etxcqu", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Article", "time": 1723862734.4321449, "created_utc": 1723835723.0, "url": "https://www.nytimes.com/2024/08/16/books/booksupdate/imminent-luiz-elizondo.html?smid=nytcore-ios-share&referringSource=articleShare", "title": "[New York Times] A Memoir Offers an Insider’s Perspective Into the Pentagon’s U.F.O. Hunt", "permalink": "/r/UAP/comments/1etxcqu/new_york_times_a_memoir_offers_an_insiders/", "selftext": "", "media": null, "score": 52, "upvote_ratio": 0.93, "comment_count": 9, "over_18": false}, "36": {"id": "1errv5a", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "PlanetFord", "link_flair_text": null, "time": 1723862735.6902218, "created_utc": 1723607369.0, "url": "https://i.redd.it/soiyjanmxjid1.jpeg", "title": "Remember when they dumped sand into skateparks in California to \"contain\" the spread of an allegedly dangerous virus?", "permalink": "/r/conspiracy/comments/1errv5a/remember_when_they_dumped_sand_into_skateparks_in/", "selftext": "", "media": null, "score": 3269, "upvote_ratio": 0.86, "comment_count": 673, "over_18": false}, "37": {"id": "1epqugs", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Vib_ration", "link_flair_text": null, "time": 1723862735.8686025, "created_utc": 1723398524.0, "url": "https://www.reddit.com/r/conspiracyfact/comments/1epqugs/the_controlling_parasitical_global_elite_want_you/", "title": "The controlling parasitical global elite want you to feel powerless, helpless, out of control and like a victim.", "permalink": "/r/conspiracyfact/comments/1epqugs/the_controlling_parasitical_global_elite_want_you/", "selftext": "How? By pushing everything they can to you that destroys your vital energy.\nWhat is your vital energy and why should you care about it?\nIt is a mixture of both your parents genetic materials inherited from them at the time of your conception. This part is said to be with you all of your life.\nOn-top of theirs is then added your vital energy and this said to then go through three stages of evolution.\nThe first stage starts as an accumulation of what you ingest, your oxygen and sexual essence. For most of your life it develops and strengthens overtime but can get depleted or attacked because of what you ingest, your lifestyle choices, how frequently you orgasm and your manner of breathing.\nThe next level is when your vital energy has reached a high enough amount. It then transforms into a sort of ''etheric'' vapor and can be felt as neutral, negative or euphoric.\nThis is the level that was coined as \"Qi\" (pronounced Chee) by the ancient Chinese culture. This level is what is activated when experiencing Frisson, or as the Runner's High, as the Vibrational State before an Astral Projection, as Qi in Taoism / Martial Arts, as Prana in Hindu philosophy, during an ASMR session and as Chills from positive events/stimuli. In ancient Chinese culture and ancient Indian culture, they observed that when its second stage of evolution gets activated, you can cause a few physical reactions like controlling your temperature, dilating your pupils, controlling your heartbeat, perspiration, smiling, teary eyes, flooding yourself with euphoria or activating in certain parts of your body and of course goosebumps.\nAfter successfully developing your vital energy in an healthy way and accumulating enough of its Etheric aspect, it refines itself even more and reaches the ''Spiritual Energy'' level where it increases your awareness of your spirit, your mental clarity, your power of focus, intent and is the key to accessing \"superhuman\" abilities.\nUnfortunately because of the agenda and societal influences pushed by these elites(liquor consumption, cigarettes, other short circuiting detrimental substances, pornographic content and the culture of wasting one's sexual essence) most people rarely develop the required amount of this vital energy to reach this stage.\nIt has been documented in various cultures and has been coined under many names like Bioelectricity, Life force, Prana, Qi, Runner'sHigh, Euphoria, ASMR, Ecstasy, Orgone, Rapture, Tension, Aura, Mana, Vayus, Nen, Intent, Tummo, Odic force, Pitī, Frisson, Ruah, Spiritual Energy, Secret Fire, The Tingles, on-demand quickening, Voluntary Piloerection, Aether, Chills, Spiritual Chills and many more to be discovered hopefully with your help.\nTo delve deeper into how to control your vital energy check out the following three written tutorials.\nP.S. Everyone feels its activation at certain points in their life, some brush it off while others notice that there is something much deeper going on. Those are exactly the people you can find on the subreddit community r/spiritualchills where they share experiences, knowledge and tips on it.", "media": null, "score": 4, "upvote_ratio": 0.6, "comment_count": 1, "over_18": false}, "38": {"id": "1epr94d", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Wellifitisntjoe", "link_flair_text": "discussion", "time": 1723862736.729397, "created_utc": 1723399554.0, "url": "https://i.redd.it/7mshpl3pr2id1.jpeg", "title": "every fossil of the common gorilla ever found in the wild ", "permalink": "/r/bigfoot/comments/1epr94d/every_fossil_of_the_common_gorilla_ever_found_in/", "selftext": "", "media": null, "score": 240, "upvote_ratio": 0.89, "comment_count": 84, "over_18": false}, "39": {"id": "1eov5p0", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "success_snifty21", "link_flair_text": null, "time": 1723862737.2593622, "created_utc": 1723302244.0, "url": "https://i.redd.it/7ei33wfimvaa1.png", "title": "...", "permalink": "/r/Cryptozoology/comments/1eov5p0/_/", "selftext": "", "media": null, "score": 582, "upvote_ratio": 0.97, "comment_count": 33, "over_18": false}, "40": {"id": "1epd0sc", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Strange_Mirror6992", "link_flair_text": null, "time": 1723862737.7826505, "created_utc": 1723353623.0, "url": "https://www.reddit.com/r/cryptids/comments/1epd0sc/what_was_this_scary_creature/", "title": "What was this scary creature?", "permalink": "/r/cryptids/comments/1epd0sc/what_was_this_scary_creature/", "selftext": "I’m from Montana. I was staying in Billings with some buddies a few days ago. We ran out of beds so me and my friend (I’ll call him John) slept on the two couches in the living room. I woke up in the middle of the night to the sound of what sounded like John saying “come over here, I got some stuff to show you”. I went to get up when I realized he was sound asleep on the other couch. The voice got more desperate and tried to pressure me into walking over. I. WAS. SPOOKED. I yelled “John wake up!” And as soon as I did I could hear incredibly fast foot steps run away through THE OPEN sliding door. I don’t want to jump to a conclusion on what this entity was so what do y’all think this could have been? I’m thinking skinwalker.", "media": null, "score": 238, "upvote_ratio": 0.96, "comment_count": 83, "over_18": false}, "41": {"id": "1es5nd6", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Prudent_Meringue4827", "link_flair_text": null, "time": 1723862738.0071201, "created_utc": 1723651836.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1es5nd6/st_anthony/", "title": "St. Anthony ", "permalink": "/r/Thetruthishere/comments/1es5nd6/st_anthony/", "selftext": "hi. im not sure what this means but about a couple of years ago (5ish) while i was with my family i found a random pendant on the floor. i never knew what it was or meant but it didn’t belong to anyone and no one knew where it came from. \ncircling back to today. i decided to do a picture search of it to find out if its of any importance and come to find out its a st. Anthony pendant. now when i googled more info all i know is that he is the patron of lost things (and ppl). but for me to find this im confused and was wondering if anyone could provide insight ", "media": null, "score": 36, "upvote_ratio": 0.89, "comment_count": 16, "over_18": false}, "42": {"id": "1ep9l33", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "FlakyTraffic50", "link_flair_text": null, "time": 1723862738.1812344, "created_utc": 1723342119.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1ep9l33/got_chased_by_a_random_guy_in_a_parking_lot/", "title": "Got Chased by a Random Guy in a Parking Lot", "permalink": "/r/LetsNotMeet/comments/1ep9l33/got_chased_by_a_random_guy_in_a_parking_lot/", "selftext": "So, when I was 17, I had just gotten my first car. One day, I drove my brother and myself to the dentist. While we were waiting in the lobby, I noticed someone had parked really badly right next to my car. Since it was new, I was pretty paranoid about it getting scratched or something. My brother went in for his appointment, and I decided to go move the car to a safer spot.\nAfter I parked in a new spot, I was walking back to the office. Just before I could cross the parking lot to get inside, a minivan with super tinted windows—like, so tinted they had this weird blue hue—pulled up so close to me that it almost hit me. I thought it was strange, but I just walked around it.\nAs I was heading to the door, I caught my reflection in the glass and noticed a guy getting out of the van and starting to follow me. At first, I didn’t think much of it and just started walking faster, but then he started running after me. That’s when I realized, “Okay, this is actually happening,” and I started running too. I barely made it to the door before he could grab me.\nThe door was glass, and I could see his reflection—he was reaching out, like inches away from me. He looked like a totally regular guy, wearing a button-up shirt and khakis, which made the whole thing even more surreal. I ran inside, and he didn’t follow, probably because he didn’t want to be seen. I was completely shocked and kind of in denial about what just happened because it all went down so fast.\nI looked out the window and saw him holding a purple cloth in his hand—no idea what that was about. He looked around, then got back in the minivan and sped off. I told the receptionist, but I was still pretty shaken up and confused.\nThe whole thing happened in less than a minute. I’ve wondered what would have happened to me if I hadn’t run. ", "media": null, "score": 210, "upvote_ratio": 0.98, "comment_count": 13, "over_18": true}, "43": {"id": "1ettxip", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "HamletX95", "link_flair_text": null, "time": 1723862738.3090436, "created_utc": 1723827298.0, "url": "https://i.redd.it/emcmz83l32jd1.jpeg", "title": "Gas masks for babies being tested at an English hospital (1940)", "permalink": "/r/truecreepy/comments/1ettxip/gas_masks_for_babies_being_tested_at_an_english/", "selftext": "", "media": null, "score": 39, "upvote_ratio": 0.96, "comment_count": 3, "over_18": false}, "44": {"id": "1erzrxi", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Feisty_Lime8450", "link_flair_text": null, "time": 1723862738.4333467, "created_utc": 1723636865.0, "url": "https://www.reddit.com/r/threekings/comments/1erzrxi/violet_loves_citrusexperiencequestions/", "title": "Violet loves citrus-Experience+Questions", "permalink": "/r/threekings/comments/1erzrxi/violet_loves_citrusexperiencequestions/", "selftext": "I did this ritual yesterday in my bedroom at around 2:30-3pm (I don’t remember the exact time). I was a little unsure about the 'purifying' part, and I used salt water as I didn't have any sage lying around, which may be why the ritual didn't work. \nI ground my Vitamin C capsule into a powder and put it in a bit of water. I then pricked my finger with a compass needle and squeezed the blood out so that a little got in the juice. I covered the cup with a lid and a tissue (the lid had a hole in it for the straw). I said the required sentence and left 15 capsules on the table.\nAfter stating my request, my whole body did not feel much warmer, but I felt my hands heating up a lot so I took that as a sign that I could continue. I said the other sentence and ate one capsule. It tasted very bad, and, after attempting to swallow and almost choking, I spat it out onto a tissue (I’ll probably use oranges if I do this again). I said the final sentence, poured salt into the juice and poured it down the drain as the recipe stated. I put a purple index card and black pen on my table.\nThat night, I did not dream at all, and, when I woke up, I found that capsules, index card and pen were totally untouched. So that’s my experience for this.\nQuestions:\nAre there any ways of purifying that does not require sage or similar plants? I am a minor who lives with my Christian parents, and they might find it suspicious if I ask them to buy sage. Ideally, something that would not require fire at all. Would a sage candle work?\nCan you give Violet nonphysical requests? Like something that does not involve a physical item at all (think fame, love, anything along those lines.)\nDo you have to drink the blood juice? I believe the original recipe said something about drinking, but I’m not too sure.\nWould it be possible to hide the offerings somehow? I live with other people, and they might find it weird that there are Vitamin C capsules/oranges just lying on my table, and tidy them away. How could I do this in a more discreet way in general?\nThank you!", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "45": {"id": "1eq0svp", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "macmommy4", "link_flair_text": null, "time": 1723862738.7857623, "created_utc": 1723424769.0, "url": "https://v.redd.it/ys3clyklu4id1", "title": "Ghost interaction? Or poor electrical? I need input", "permalink": "/r/Ghosts/comments/1eq0svp/ghost_interaction_or_poor_electrical_i_need_input/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/ys3clyklu4id1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/ys3clyklu4id1/DASH_96.mp4", "dash_url": "https://v.redd.it/ys3clyklu4id1/DASHPlaylist.mpd?a=1726454738%2CNjcxODZhZjNiMzJjZmNjZTkzZThmMTNlNTVjZmJkZTQxMjBkZmY3YzRkNjdiZmFiYTJkZGZhOWUyMzFhMzAwNw%3D%3D&v=1&f=sd", "duration": 42, "hls_url": "https://v.redd.it/ys3clyklu4id1/HLSPlaylist.m3u8?a=1726454738%2CZjE0ZjZiMjE1NWExN2ZlNDRkMDIxMTA0NzRiMmM2ODU1ZjFiY2ZjMmJlMDJjZGM4ZTVjZGIyNmRkMDQyNTkzYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 141, "upvote_ratio": 0.73, "comment_count": 85, "over_18": false}, "46": {"id": "1eplx7w", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "wowahungrypigeon", "link_flair_text": "Glitch Pic", "time": 1723862738.913176, "created_utc": 1723386087.0, "url": "https://i.redd.it/o797ldign1id1.png", "title": "Bookmark duplicated itself. Bookstore this came from only gives out a bookmark per book you buy, with extras for 50 cents. I did not buy any extras.", "permalink": "/r/GlitchInTheMatrix/comments/1eplx7w/bookmark_duplicated_itself_bookstore_this_came/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.33, "comment_count": 3, "over_18": false}, "47": {"id": "1eskw5c", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "nbayoungfemboyy", "link_flair_text": "Discussion", "time": 1723862740.7902243, "created_utc": 1723691620.0, "url": "https://www.reddit.com/gallery/1eskw5c", "title": "My brother thinks he found a UFO", "permalink": "/r/ufo/comments/1eskw5c/my_brother_thinks_he_found_a_ufo/", "selftext": "my brother sent me this picture of a “UFO” \nhe said it didn’t move or make a sound for over half an hour and just sat in the sky… any ideas on what it could be? ", "media": null, "score": 342, "upvote_ratio": 0.92, "comment_count": 107, "over_18": false}, "48": {"id": "1et57tb", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "News", "time": 1723862742.1294332, "created_utc": 1723752795.0, "url": "https://archive.ph/4KhLj", "title": "Popular Mechanics: Japan Is the World’s No. 1 Hotspot for UFO Sightings. Officials Are Trying to Figure Out Why. “It is extremely irresponsible of us to be resigned to the fact that something is unknowable and to keep turning a blind eye to the unidentified,” - Former Defense Minister Yasuka Hamada.", "permalink": "/r/UFOs/comments/1et57tb/popular_mechanics_japan_is_the_worlds_no_1/", "selftext": "", "media": null, "score": 1725, "upvote_ratio": 0.95, "comment_count": 238, "over_18": false}, "49": {"id": "1eropyb", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "insanisprimero", "link_flair_text": "Video", "time": 1723862743.360248, "created_utc": 1723598152.0, "url": "https://v.redd.it/foih8m986jid1", "title": "Serious - Nazca Mummies 5 min video summary", "permalink": "/r/aliens/comments/1eropyb/serious_nazca_mummies_5_min_video_summary/", "selftext": "Full credit \"The Lucid Lens\" video channel:\nhttps://m.youtube.com/watch?v=43gHMFn9WCA\nHere is an easy shearble vid with the key conectps and developments until now.", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/foih8m986jid1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 360, "width": 592, "scrubber_media_url": "https://v.redd.it/foih8m986jid1/DASH_96.mp4", "dash_url": "https://v.redd.it/foih8m986jid1/DASHPlaylist.mpd?a=1726454742%2CNzRhMTM5NTZjYmFkNWE2NGY2OGZlODg3YTM3ZjllNDE3YzhmNjQwY2JjMjM3ZWZkMDNhMjNjYzE3ZTc1NWFhYQ%3D%3D&v=1&f=sd", "duration": 344, "hls_url": "https://v.redd.it/foih8m986jid1/HLSPlaylist.m3u8?a=1726454742%2CZjE3Y2E1N2JhYmNiOTVmNTE1YmUzOTU4OTM1ZjlkOWY1MWU5ZWU0NTU2NTBmZDQ1ZTkzZTUwMDI5Y2QyMGEyNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 604, "upvote_ratio": 0.87, "comment_count": 258, "over_18": false}, "50": {"id": "1epr8b9", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "TheGoodTroubleShow", "link_flair_text": "Podcast", "time": 1723862743.5757856, "created_utc": 1723399502.0, "url": "https://youtu.be/VLy4PN7bSkY", "title": "Matt returns on #TGTS with info on the #UAP Disclosure Act, Lue Elizondo, Dr. Sean Kirkpatrick & why Mick West is posting Lue's unpublished book and the debunker's efforts to disparage Lue Elizondo and David Grusch", "permalink": "/r/UAP/comments/1epr8b9/matt_returns_on_tgts_with_info_on_the_uap/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "The Latest UFO / UAP News:  Lue Elizondo, Congress & Mick West", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/VLy4PN7bSkY?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"The Latest UFO / UAP News:  Lue Elizondo, Congress &amp; Mick West\"></iframe>", "author_name": "The Good Trouble Show with Matt Ford #TGTS", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/VLy4PN7bSkY/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@TheGoodTroubleShow"}}, "score": 18, "upvote_ratio": 0.78, "comment_count": 0, "over_18": false}, "51": {"id": "1eqpsug", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Itsacocthing", "link_flair_text": "Not banned by Conspiracy mods- See Sticky", "time": 1723862744.6706991, "created_utc": 1723497861.0, "url": "https://i.redd.it/a1fqyre0waid1.jpeg", "title": "I AM THE GUY IN THE HOSPITAL (you guys got my account banned)", "permalink": "/r/conspiracy/comments/1eqpsug/i_am_the_guy_in_the_hospital_you_guys_got_my/", "selftext": "I don’t expect this to get as much attention as my last post, but I really was the guy hospitalized for seizures due to the vaccine. Some of you pro-covid-vaxers reported my account for “impersonating” and got me banned. Here is proof that is me. Seriously you vax pushers need to get a life and stop harassing me for just telling my actual story.", "media": null, "score": 3117, "upvote_ratio": 0.8, "comment_count": 1121, "over_18": false}, "52": {"id": "1et5eir", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1723862744.8456686, "created_utc": 1723753265.0, "url": "https://www.youtube.com/watch?v=Ob8SYD993hM", "title": "Great and clear UFO video footage, filmed in California, Arizona in USA.", "permalink": "/r/conspiracyfact/comments/1et5eir/great_and_clear_ufo_video_footage_filmed_in/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Great and clear UFO video footage, filmed in California, Arizona in USA.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/Ob8SYD993hM?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Great and clear UFO video footage, filmed in California, Arizona in USA.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/Ob8SYD993hM/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 1, "upvote_ratio": 0.57, "comment_count": 0, "over_18": false}, "53": {"id": "1ep7fsq", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Northwest_Radio", "link_flair_text": "crosspost", "time": 1723862745.6358063, "created_utc": 1723335407.0, "url": "https://www.reddit.com/gallery/1enys7e", "title": "Update: I found a mandible in the travertine floor at my parents house", "permalink": "/r/bigfoot/comments/1ep7fsq/update_i_found_a_mandible_in_the_travertine_floor/", "selftext": "", "media": null, "score": 166, "upvote_ratio": 0.93, "comment_count": 19, "over_18": false}, "54": {"id": "1eqai7u", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Evidence", "time": 1723862746.1572, "created_utc": 1723459717.0, "url": "https://v.redd.it/1igaennhq7id1", "title": "Video captured of Champ during filming for a movie on Lake Champlain (lower right).", "permalink": "/r/Cryptozoology/comments/1eqai7u/video_captured_of_champ_during_filming_for_a/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/1igaennhq7id1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/1igaennhq7id1/DASH_96.mp4", "dash_url": "https://v.redd.it/1igaennhq7id1/DASHPlaylist.mpd?a=1726454745%2CY2I1NTdiMTA0YWIzMDNiZDg0MDUzNTFlMmNmNTIyNWVmODQ4N2UzOWRiZWM2MTgyNTliOTkxODZkMjRhM2Q3NA%3D%3D&v=1&f=sd", "duration": 10, "hls_url": "https://v.redd.it/1igaennhq7id1/HLSPlaylist.m3u8?a=1726454745%2CNWM5NjI1YTI2NTk1NTljNmQzYWJkNjQxNzgzMzAyZDlhYzMyZDY1M2U0OWMxNWZlZTlmYTM0ZmNhOTVkMmVmYg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 477, "upvote_ratio": 0.91, "comment_count": 69, "over_18": false}, "55": {"id": "1ep1f94", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "dustinkz", "link_flair_text": null, "time": 1723862747.055609, "created_utc": 1723318612.0, "url": "https://i.redd.it/l8571xuz2whd1.jpeg", "title": "cute mothman tattoo", "permalink": "/r/cryptids/comments/1ep1f94/cute_mothman_tattoo/", "selftext": "thought it was apt to share this to the cryptids group :] mothman done by me ( @ dust.inkz on IG) ♡ ", "media": null, "score": 183, "upvote_ratio": 0.99, "comment_count": 9, "over_18": false}, "56": {"id": "1eq5ibw", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "gottaknowcrime", "link_flair_text": "Discussion/Advice", "time": 1723862747.2860749, "created_utc": 1723439886.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1eq5ibw/my_mom_was_never_really_there/", "title": "My mom was never really there???", "permalink": "/r/Thetruthishere/comments/1eq5ibw/my_mom_was_never_really_there/", "selftext": "Hi! New to the community but this experience pops up in my head every once in a while and I wanted to share it and see if anyone else has experienced anything else similar. I’m a total skeptic of all things strange but to this day it gives me chills. \nA couple years ago I was still living at home with my parents. Both of our bedrooms are upstairs. That particular night, my dad was working the night shift, so it was just my mom and I at the house. We hung out together that evening and then went our separate ways for the night, she went to her room and I went to mine.\nMy bed is positioned so that my head is as far away from the door as possible and my feet are as close to the door as possible, so when I sleep, I’m facing the door. Around 2am, I woke up lying flat on my back because I felt like someone was staring at me from my left side (I know it was around 2am because after this happened I checked the clock, and this event couldn’t have lasted longer than maybe a minute). I looked over, and clear as day there was my mom standing there. I remember vividly, she had on a white nightgown with little baby blue colored flowers on it that she wears all the time to this day and was standing quiet as could be next to me. \nI laughed kinda startled and I audibly said “What the hell, you scared the fuck outta me! What do you want?” It’s entirely important at this point to mention that my mom and I are best friends (lol), so we always mess with each other. It isn’t uncommon for us to have late night hang out sessions, so in my sleepy state it was entirely plausible that she had come over to wake me to go downstairs to get a snack with her or something.\nNot a peep. Absolutely nothing from her, no movement whatsoever. I said something like “Come on what da hell” thinking she was going to break and laugh, but nothing. At that point I started to worry thinking something was wrong with her, like maybe she was sick or something terrible had happened to a family member and she wasn’t sure how to say it. \nAgain, I said “Mom what is it?” As I said that, I used my left elbow (the elbow closest to her) to gain leverage to start pulling myself into a sitting position on the bed and began to twist to face her. One more time I said “Mom?” And as I said that, I reached out to push/touch her on the shoulder to try to get some sort of reaction from her but my entire body slumped forward over the bed when she disappeared. COMPLETELY. Like, absolutely was not there. I almost shit my pants. \nI got up so fast thinking that I had completely lost it or she did pull something on me. I threw the light on and darted across the hall into her room, where she was (very peacefully) asleep with her breathing machine. I woke her up to ask her about it and was met with a lot of confusion and mild annoyance that I disturbed her slumber. \nI absolutely did not sleep the rest of the night. Anyone else ever have anything like this happen???\nTLDR; Creepy ass replica of my mom disappeared right before I could make physical contact with her. ", "media": null, "score": 31, "upvote_ratio": 0.92, "comment_count": 3, "over_18": false}, "57": {"id": "1erc1cd", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "idkwhattoputhere293", "link_flair_text": null, "time": 1723862747.4727552, "created_utc": 1723565760.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1erc1cd/to_the_man_who_kept_calling_me_morgan/", "title": "to the man who kept calling me \"morgan\"", "permalink": "/r/LetsNotMeet/comments/1erc1cd/to_the_man_who_kept_calling_me_morgan/", "selftext": "this just happened last night and it doesn't even feel real. in retrospect I did the right thing and kept myself out of danger, but things could have gone worse for me I realize.\nI walked to a bar by myself last night, already intoxicated and just looking for something to do. met some people, ordered a g&t- it was a vibe.\nthe entire time, there's a man with a moustache sitting at a table by himself leering at me. I wasn't dressed cute or anything. but i figured he was on something so i just didn't pay attention to him silently sitting there.\neventually I'm alone at my table again, about to finish up my drink and leave. when I hear a voice next to me. \"you're morgan.\" I look up from my phone and moustache man is sitting beside me.\n\"nope, I'm [my first name]\" stupidly giving him my real name. didn't matter though, because he kept insisting my name was morgan.\n\"what do you want to own someday, morgan?\" odd question. but I humored him because that's what you do with crazy people.\n\"uhhh nothing in particular, why?\" \nwhen I tell you this man got genuinely angry at my response... so I followed it up with \"a house maybe\"\nhe clicked his tongue and locked his head, looking at me like I'd just failed some kind of test that only be knew the rules to. this man looked at me like he had decided I was worthless. like I deserved whatever fate he was envisioning for me.\n\"listen dude, you can stay here and chat as long as you aren't 1) on some weird drugs 2) planning on drinking more because I think you've had enough and 3) not going to murder me.\" I added the last bit jokingly. \n\"oh I can't promise I'm going to let you live.\" \nI've read the phrase \"his eyes darkened\" in several romance novels before. I never knew what that was supposed to look like until last night when that man delivered that sentence. and lemme tell you, it's not sexy. it's fucking bone chilling.\nI've listened to enough true crime podcasts to take that as my sign to dip. maybe he was just joking, but I wasn't taking any chances. I hurriedly approached the bartender and moustache guy got kicked out and I took an uber home.\nI don't know who morgan is. and don't know who that man is. but regardless...let's not meet.", "media": null, "score": 193, "upvote_ratio": 0.96, "comment_count": 13, "over_18": true}, "58": {"id": "1ervr5s", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "GhostsMods", "link_flair_text": "Paranormal Tourism", "time": 1723862748.0528483, "created_utc": 1723621728.0, "url": "https://i.redd.it/m43valsb4lid1.jpeg", "title": "Featured Community Discussion Topic: Eastern State Penitentiary (Read Description)", "permalink": "/r/Ghosts/comments/1ervr5s/featured_community_discussion_topic_eastern_state/", "selftext": "Eastern State Penitentiary is not just a historical landmark but a site steeped in eerie tales and ghostly encounters. Once home to some of America's most notorious criminals, the prison's cold, crumbling walls have long been rumored to harbor the restless spirits of former inmates. Built in 1829, the prison's imposing Gothic architecture and dark history have fueled ghost stories for decades, particularly in the notoriously haunted Cellblock 12, where visitors and paranormal investigators have reported chilling whispers and shadowy figures darting through the halls. Many claim to have experienced unexplainable phenomena, from disembodied voices to an overwhelming sense of dread. But is it the power of suggestion, or is there something truly supernatural at play within these walls? Have you ever encountered anything spine-tingling or mysterious at Eastern State Penitentiary? Please share your experiences.  We’d love to hear from you! 👻 \nFor more information about the history of this purportedly haunted location, please read more here.", "media": null, "score": 129, "upvote_ratio": 0.98, "comment_count": 41, "over_18": false}, "59": {"id": "1es2krf", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "PodwithPat", "link_flair_text": null, "time": 1723862749.4502182, "created_utc": 1723644589.0, "url": "https://youtube.com/watch?v=CLELL01Idj8&feature=shared", "title": "George Knapp REVEALS NEW \"Transmedium\" UFO Video Coming Soon", "permalink": "/r/ufo/comments/1es2krf/george_knapp_reveals_new_transmedium_ufo_video/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "George Knapp REVEALS NEW \"Transmedium\" UFO Video Coming Soon", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/CLELL01Idj8?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"George Knapp REVEALS NEW &quot;Transmedium&quot; UFO Video Coming Soon\"></iframe>", "author_name": "VETTED", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/CLELL01Idj8/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@VETTEDPODCAST"}}, "score": 332, "upvote_ratio": 0.85, "comment_count": 131, "over_18": false}, "60": {"id": "1epqbwu", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "sawaflyingsaucer", "link_flair_text": "Classic Case", "time": 1723862750.7450836, "created_utc": 1723397221.0, "url": "https://streamable.com/c5g8fr", "title": "What do we know about this footage? Some of the most real looking triangle video I've seen.", "permalink": "/r/UFOs/comments/1epqbwu/what_do_we_know_about_this_footage_some_of_the/", "selftext": "", "media": {"type": "streamable.com", "oembed": {"provider_url": "https://streamable.com", "description": "Watch \"Triangle UFO Sighting January 22, 2022\" on Streamable.", "title": "Triangle UFO Sighting January 22, 2022", "type": "video", "thumbnail_width": 850, "height": 508, "width": 600, "html": "<iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fstreamable.com%2Fo%2Fc5g8fr&display_name=Streamable&url=https%3A%2F%2Fstreamable.com%2Fc5g8fr&image=https%3A%2F%2Fcdn-cf-east.streamable.com%2Fimage%2Fc5g8fr.jpg%3FExpires%3D1723656421825%26Key-Pair-Id%3DAPKAIEYUVEN4EVB2OKEQ%26Signature%3DCfXCcHKH9gKXB9xNb6vNZNrfnCGb1V2dE-E0-Ti8ILYh7beSgSz%7E3uG3WYljI2o2UUgXoi%7ExmkXMH%7EtkVSCYKU2hFyuBc2e2WTY27XkcaoqEwt1KG4hi2xtJ7KH2AKsX9iupzqrqXujtxkK9MbxGWYEiU2k8MUHVIGeKGBQnoX-w5OraAhbo9MAkyILOfT3eRl0VqkjOTEmL%7EjDQB7xqUh6gLovaivlL3MrY5wIclDI%7EZZYun89%7EEebsuk1za26AIkYzD7zJMqIfbTOFR8QQzdYg9GSU0-JicGL4Ay9yDooiPgaMqXrhZcCs6hX53v84q1r5UCObV%7ELRf1FSuCxVGw__&key=2aa3c4d5f3de4f5b9120b660ad850dc9&type=text%2Fhtml&schema=streamable\" width=\"600\" height=\"508\" scrolling=\"no\" title=\"Streamable embed\" frameborder=\"0\" allow=\"autoplay; fullscreen; encrypted-media; picture-in-picture;\" allowfullscreen=\"true\"></iframe>", "version": "1.0", "provider_name": "Streamable", "thumbnail_url": "https://cdn-cf-east.streamable.com/image/c5g8fr.jpg?Expires=1723656421825&Key-Pair-Id=APKAIEYUVEN4EVB2OKEQ&Signature=CfXCcHKH9gKXB9xNb6vNZNrfnCGb1V2dE-E0-Ti8ILYh7beSgSz~3uG3WYljI2o2UUgXoi~xmkXMH~tkVSCYKU2hFyuBc2e2WTY27XkcaoqEwt1KG4hi2xtJ7KH2AKsX9iupzqrqXujtxkK9MbxGWYEiU2k8MUHVIGeKGBQnoX-w5OraAhbo9MAkyILOfT3eRl0VqkjOTEmL~jDQB7xqUh6gLovaivlL3MrY5wIclDI~ZZYun89~Eebsuk1za26AIkYzD7zJMqIfbTOFR8QQzdYg9GSU0-JicGL4Ay9yDooiPgaMqXrhZcCs6hX53v84q1r5UCObV~LRf1FSuCxVGw__", "thumbnail_height": 720}}, "score": 1292, "upvote_ratio": 0.95, "comment_count": 220, "over_18": false}, "61": {"id": "1epvcka", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "DragonfruitOdd1989", "link_flair_text": "Discussion :table:", "time": 1723862752.0795383, "created_utc": 1723410030.0, "url": "https://v.redd.it/pah2crsqm3id1", "title": "Tim Burchett is willing to assist on the Nazca Mummies research and support the effort to have them examined in the US.", "permalink": "/r/aliens/comments/1epvcka/tim_burchett_is_willing_to_assist_on_the_nazca/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/pah2crsqm3id1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 354, "width": 640, "scrubber_media_url": "https://v.redd.it/pah2crsqm3id1/DASH_96.mp4", "dash_url": "https://v.redd.it/pah2crsqm3id1/DASHPlaylist.mpd?a=1726454751%2CYjViYTRiZDNiZmQxNmUyMzA1ZDgyZmJjYWQzOWM3MmQ0MGJkNjliODY5Nzk2MGNiZjY2MmQ4MzVjZDNkMGRkNw%3D%3D&v=1&f=sd", "duration": 115, "hls_url": "https://v.redd.it/pah2crsqm3id1/HLSPlaylist.m3u8?a=1726454751%2COWY3NTU2YTlhOTY4M2VhMzI3YWMzNTlmZWQ5NTUwZGUzOGY2ODUyMDZlYjk2NzJmOWE0YWJkNWE1YWIxYTZmMA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 545, "upvote_ratio": 0.88, "comment_count": 164, "over_18": false}, "62": {"id": "1etxk1s", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "TheGoodTroubleShow", "link_flair_text": null, "time": 1723862752.2991204, "created_utc": 1723836244.0, "url": "https://youtube.com/live/XYSzbsAZ-Ek", "title": "Erik Zidek, Fortune 500 investment leader & the Deputy Chief Investment Officer for Pacific Gas & Electric (who manages 30 billion in investments), on the potentially catastrophic consequences of UAP disclosure for Wall Street and world financial markets.   Tune in live on August 18th, noon PST.", "permalink": "/r/UAP/comments/1etxk1s/erik_zidek_fortune_500_investment_leader_the/", "selftext": "", "media": null, "score": 4, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "63": {"id": "1et37f5", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "happycouplehtx", "link_flair_text": null, "time": 1723862753.4931056, "created_utc": 1723748009.0, "url": "https://i.redd.it/3bgxrlztjvid1.jpeg", "title": "No lies told here.  The Matrix was a documentary.  ", "permalink": "/r/conspiracy/comments/1et37f5/no_lies_told_here_the_matrix_was_a_documentary/", "selftext": "", "media": null, "score": 3019, "upvote_ratio": 0.81, "comment_count": 488, "over_18": false}, "64": {"id": "1epujpv", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "forhealthy", "link_flair_text": null, "time": 1723862753.6638005, "created_utc": 1723407968.0, "url": "https://www.youtube.com/watch?v=0W2hhE9jMMU", "title": "Clear video footage of a UFO, a pulsating object filmed in the sky in Los Angeles.", "permalink": "/r/conspiracyfact/comments/1epujpv/clear_video_footage_of_a_ufo_a_pulsating_object/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Clear video footage of a UFO, a pulsating object filmed in the sky in Los Angeles.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/0W2hhE9jMMU?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Clear video footage of a UFO, a pulsating object filmed in the sky in Los Angeles.\"></iframe>", "author_name": "Minute To Know", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/0W2hhE9jMMU/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@minutetoknow88"}}, "score": 0, "upvote_ratio": 0.33, "comment_count": 0, "over_18": false}, "65": {"id": "1epvprc", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Due-Introduction-941", "link_flair_text": "YouTube", "time": 1723862754.7643635, "created_utc": 1723410961.0, "url": "https://www.reddit.com/r/bigfoot/comments/1epvprc/scariest_bigfoot_911_call_ever_recorded/", "title": "Scariest Bigfoot 911 Call Ever Recorded", "permalink": "/r/bigfoot/comments/1epvprc/scariest_bigfoot_911_call_ever_recorded/", "selftext": "Hello everyone.\nI've been following this subreddit for a long time and I've been into Bigfoot/Paranormal/Conspiracy stuff even longer but I've never seen this video posted here so there you go guys.\nI wonder what sceptics keyboard warriors will say about that. Of course everything is fake!\nGreetings from UK from a fellow Polish Bigfoot fan. I love this subreddit. Keep posting guys!\nhttps://youtu.be/Yat8Hv4Cr3U?si=RAs2NYqVE9XLoSe_", "media": null, "score": 156, "upvote_ratio": 0.88, "comment_count": 34, "over_18": false}, "66": {"id": "1eoqy10", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Lazakhstan", "link_flair_text": null, "time": 1723862755.7535424, "created_utc": 1723289862.0, "url": "https://i.redd.it/3uzqq5wipthd1.jpeg", "title": "So what do you think of this art I found? ", "permalink": "/r/Cryptozoology/comments/1eoqy10/so_what_do_you_think_of_this_art_i_found/", "selftext": "So I decided to scroll on Facebook and found this. It's a plesiosaur attacking a boat in the Amazon River which was made by Lionel May. Any thoughts? I wonder if this was based on a cryptic sighting of a plesiosaur in the Amazon. ", "media": null, "score": 411, "upvote_ratio": 0.95, "comment_count": 26, "over_18": false}, "67": {"id": "1etbpl5", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Routine_Aerie_6160", "link_flair_text": null, "time": 1723862756.255422, "created_utc": 1723769691.0, "url": "https://i.redd.it/yuiz6nzacxid1.jpeg", "title": "My Cryptid Characters - Mothman", "permalink": "/r/cryptids/comments/1etbpl5/my_cryptid_characters_mothman/", "selftext": "Hi, im currently workshopping a graphic novel/comic about cyrptids and drew up 4 main characters. It centers around Mothman being a single dad to his little mothgirl, Mo. She dreams of a world where Cryptids don't have to hide and can integrate. There are a lot more im working on, such as Skinwalkers, the Wendigo, Lechuza (a lesser known one) and mooorrreee. Thanks for checking them out!\nP.S. I just realized I can't post multiple pictures on this reddit so I'll share then gradually 🥰 thanks! ", "media": null, "score": 80, "upvote_ratio": 0.95, "comment_count": 11, "over_18": false}, "68": {"id": "1eoy39z", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Aria_Bartolozzi-", "link_flair_text": "Skinwalkers", "time": 1723862756.5481305, "created_utc": 1723309781.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1eoy39z/skinwalker/", "title": "Skinwalker??", "permalink": "/r/Thetruthishere/comments/1eoy39z/skinwalker/", "selftext": "So my father lives on a ranch in Montana, USA. He used to live in Russia but he immigrated to the US in 1984. My mom was also from Russia but she died in 2002 because of birth complications when she had me. So I help my dad trail cows at our ranch (we only use horses, no vehicles) and we stumbled upon our horse Bullet. Her ears and eyes were missing and we couldn’t find them. It looked like someone took a sharp blade and cut parts of her coat off. We have had things like this happen to our cows, dogs, and cats. But this was the first time it happened to one of our horses. We have a timber pasture behind my fathers house and sometimes we go spotlight hunting. we saw some like wolf like creature in the back trees but it was like 3x the size of a normal wolf and it stood on 2 legs. My dad tried to shoot at it but it didn’t do anything. We decided to get the hell out of there and returned home. He does not live anywhere near civilization so I don’t think it would be a human. What do you guys think? Btw I only made it nsfw because if you guys want I can put up pictures of the horse.", "media": null, "score": 26, "upvote_ratio": 0.91, "comment_count": 21, "over_18": false}, "69": {"id": "1et3rag", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Throwawayglitterbomb", "link_flair_text": null, "time": 1723862756.7619517, "created_utc": 1723749241.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1et3rag/update_crazy_ex_beauty_queen_stalker/", "title": "UPDATE Crazy Ex Beauty Queen Stalker", "permalink": "/r/LetsNotMeet/comments/1et3rag/update_crazy_ex_beauty_queen_stalker/", "selftext": "Hi Everyone, I posted about my family's experience with my husband's crazy beauty queen ex, it's been a few years now. I wasn't going to post an update because I wanted to let sleeping ex beauty queen stalkers lie, but I still get a ton of messages asking how things are going, I figured why not. We feel more protected now that it's over. Thank you again for all your kindness and support.\nHere's my original post https://www.reddit.com/r/LetsNotMeet/comments/pbj64o/crazy_beauty_queen_stalker/\nTo recap, my husband dated a beauty queen of a well-known pageant before we met. Once we started\ndating, she went nuclear and it felt like we were living straight out of a Stephen King novel. It was a scary and stressful time, to say the least. I'm sure it would give her great satisfaction to know she affected our lives in such a negative way.\nLet me start off by saying, the court process is looooong. It took years for resolution. During that time, she had to live with an Assurer. For those who don't know (because I certainly didn't) the Assurer has to front up the bail money, which was over $1,000 but under $5,000 in her case, and have the defendant live with them while they are out on bail. Her initial Assurer was her mother, but after she was rearrested for continuing to harass us, the judge said that she had to have a new Assurer since she kept breaking the law under her mother's watch.\nSince Covid, everything is done via zoom and a virtual courtroom. There have been a few court dates during the past few years but only her lawyer was present. These court sessions were basically asking to defer, etc. It was all very long and drawn out. The last court date was last August of 2023. I was curious as to what she looked like now, and to have this finally behind us. Finally, she appeared in the virtual courtroom. She was no longer wearing the wig, it looked like she had some real hair, it was short, brown and pin straight. She was the same weight as I had last seen her in person and she was wearing a long white sort of coat, almost like a lab coat. No makeup. She was scattered, couldn't get her zoom to work, wouldn't come into focus in the meeting, even though the judge repeatedly asked her to be visible during the proceedings but she didn't listen to him, she kept going out of sight. She had the San Francisco bridge as her zoom background. Anyway, it was a gongshow. But in the end, the result of this last court session was that she didn't plead guilty or not guilty, instead she was able to agree to certain terms or risk being arrested again. To be honest, I found it slightly confusing but at least it was officially over.\nThe most interesting part for us was after the virtual court proceedings were finished, the judge told us we could switch off our cameras. We did - but she didn't. So my husband and I watched, fascinated, as the judge presided over other virtual cases and she, (on mute) sat on a chair and called someone on her phone. She began crying, then laughing hysterically, then crying again, but LOOKING INTO THE CAMERA as she's doing this. I couldn't tell if this was accidental or not. Was she trying to gain some sympathy or was it an honest mistake? We will never know.\nLastly,  I add this with a huge caveat that this is pure speculation. I had mentioned in my original post how she posted pictures of her dog's s*** with my name beside it. However, when my friend looked through the pictures, she observed that no way could s*** that size come from such a tiny dog. And when I look at it, I couldn't help but agree but my brain refuses to process. If it's true than...ew. However, this also will be something we'll never know. Probably for the best.\nEither way, karma has caught up with her big time. We know from one of the bail variation requests, she lives in subsidized housing. I haven't seen her since her in person since the original court date back in February of 2020. I received quite a few messages from people who knew who this was and said they had had run-ins with her, specifically a person who claimed a family member had been scammed out of money by her.\nThat's all there is to tell. Our lives have moved on and I'm happy to report that no news is good news. I'll always be extremely cautious about my social media settings but I don't think about her anymore unless I get a request for an update, etc. Thank you again for your messages and for all the support.\nAnd to the Crazy Ex Beauty Queen Stalker, we are thrilled to never meet again.", "media": null, "score": 145, "upvote_ratio": 0.97, "comment_count": 4, "over_18": true}, "70": {"id": "1esnhhb", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Mumbumbo_boi", "link_flair_text": "Personal Encounter ", "time": 1723862757.3822212, "created_utc": 1723700475.0, "url": "https://v.redd.it/henehddgmrid1", "title": "Evp I got alone in a cell block of Eastern State Penitentiary", "permalink": "/r/Ghosts/comments/1esnhhb/evp_i_got_alone_in_a_cell_block_of_eastern_state/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/henehddgmrid1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/henehddgmrid1/DASH_96.mp4", "dash_url": "https://v.redd.it/henehddgmrid1/DASHPlaylist.mpd?a=1726454757%2COTcwMjgzZmQwMzc1MTE0ZjQyNjAzOTFjYjIzYTA2OWRlYzkyNTcxNTk0OTU4NzY2ZTlmYzIzN2ZjMGI4ZDY5NA%3D%3D&v=1&f=sd", "duration": 9, "hls_url": "https://v.redd.it/henehddgmrid1/HLSPlaylist.m3u8?a=1726454757%2COTUxMmQxYWFmZmY5YWQ0MDc4MWJhMmJmNjUwZDgzNWJmYWE4NDdmMWRjZjdiMWFlODY4ZDJkNzhjYjZiNTRhZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 53, "upvote_ratio": 0.78, "comment_count": 45, "over_18": false}}}