{"_default": {"1": {"id": "17i4v4d", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "TallTree9127", "link_flair_text": null, "time": 1699065337.1864326, "created_utc": 1698463131.0, "url": "https://i.redd.it/kq7gtvqw2vwb1.jpg", "title": "Wild", "permalink": "/r/conspiracy/comments/17i4v4d/wild/", "selftext": "", "media": null, "score": 2915, "upvote_ratio": 0.81, "comment_count": 894, "over_18": false}, "2": {"id": "17jzjms", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1699065337.4432945, "created_utc": 1698689062.0, "url": "https://youtube.com/live/GeuJRPMf-dY", "title": "Alien Abductions: What Are We To Make of These Bizarre Stories?", "permalink": "/r/conspiracyfact/comments/17jzjms/alien_abductions_what_are_we_to_make_of_these/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 3, "over_18": false}, "3": {"id": "17kj5cc", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Majesticlub", "link_flair_text": "Twitter", "time": 1699065339.0377188, "created_utc": 1698752942.0, "url": "https://i.redd.it/6ri0zfij0jxb1.png", "title": "Shit, he's got the jacket and sneakers too :-)", "permalink": "/r/ufo/comments/17kj5cc/shit_hes_got_the_jacket_and_sneakers_too/", "selftext": "", "media": null, "score": 640, "upvote_ratio": 0.94, "comment_count": 141, "over_18": false}, "4": {"id": "17mgsrj", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "skywalker3819r", "link_flair_text": "News", "time": 1699065340.3531592, "created_utc": 1698967074.0, "url": "https://v.redd.it/1dz78m1ep0yb1", "title": "NewsNation Exclusive: 8-9 UAP were spotted by NORAD with jets being scrambled over the Arctic Circle.🛸 ", "permalink": "/r/UFOs/comments/17mgsrj/newsnation_exclusive_89_uap_were_spotted_by_norad/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/1dz78m1ep0yb1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 478, "width": 854, "scrubber_media_url": "https://v.redd.it/1dz78m1ep0yb1/DASH_96.mp4", "dash_url": "https://v.redd.it/1dz78m1ep0yb1/DASHPlaylist.mpd?a=1701657339%2CNzUyMzNkNjk3NmRjNjIzNmZiZWY2YTFiODI1YTYzNTRmYzc4Mjk0ZjhmOTk3ZjlmNDNmOGNmNDJmOTExNTAzYw%3D%3D&v=1&f=sd", "duration": 108, "hls_url": "https://v.redd.it/1dz78m1ep0yb1/HLSPlaylist.m3u8?a=1701657339%2CYmE4YWE1YzEzODc5ZTU4Zjc4MWE3ZTRmMDU2YzMxOGU3ZmQzMjRkMTczMDU2MjgwNTEzNzM3NDFlODAzYjJjYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 3161, "upvote_ratio": 0.88, "comment_count": 524, "over_18": false}, "5": {"id": "17mb0l0", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "StaticBang", "link_flair_text": "Evidence :upvote:", "time": 1699065341.9974074, "created_utc": 1698951947.0, "url": "https://i.redd.it/ezekvna4gzxb1.jpg", "title": "Exact same UFO photographed in Mexico 1993 and then in Texas 2008.", "permalink": "/r/aliens/comments/17mb0l0/exact_same_ufo_photographed_in_mexico_1993_and/", "selftext": "", "media": null, "score": 5030, "upvote_ratio": 0.74, "comment_count": 1261, "over_18": false}, "6": {"id": "17mor87", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Article", "time": 1699065342.5356991, "created_utc": 1698992922.0, "url": "https://www.dailymail.co.uk/sciencetech/article-12703835/Pentagon-UFO-chief-AARO-Kirkpatrick-REPLACED-whistleblowers-accuse-lying-public-ignoring-witnesses.html", "title": "Pentagon UFO chief Dr. Sean Kirkpatrick will be REPLACED by end of the year as whistleblowers accuse him of lying to the public and ignoring witnesses", "permalink": "/r/UAP/comments/17mor87/pentagon_ufo_chief_dr_sean_kirkpatrick_will_be/", "selftext": "", "media": null, "score": 542, "upvote_ratio": 0.97, "comment_count": 69, "over_18": false}, "7": {"id": "17jxnut", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "StarlightDown", "link_flair_text": "Unexplained Death", "time": 1699065343.1798143, "created_utc": 1698684109.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/17jxnut/michael_17_miraculously_is_still_alive_his_body/", "title": "\"Michael, 17, miraculously, is still alive. His body is riddled with tumors and he's about the size of a 7-year-old, stunted from years of taking chemotherapy drugs.\" Michael G. was born in Toms River, New Jersey, where brain cancer was killing toddlers at a rate 7 times above the rest of the state.", "permalink": "/r/UnresolvedMysteries/comments/17jxnut/michael_17_miraculously_is_still_alive_his_body/", "selftext": "The horrifying public announcement came in 1996, but state health authorities had been tipped off to the cancer cluster as far back as 1982. In the mid-1980s, numerous requests to investigate an unusually large number of childhood cancer deaths in Toms River, New Jersey were turned down. Then, in 1986, the case was finally taken up by Michael Berry, the new chief investigator of disease clusters at the New Jersey Department of Health (NJDOH). The push was spearheaded by Charles Kauffman, the Ocean County public health coordinator. Kauffman was the first person to sound the alarm—as early as 1974, he had requested that the NJ Department of Environmental Protection (NJDEP) investigate the Toms River water supply for chemical contamination. Link, link\nBerry's 1986 incidence study was inconclusive. He was working with small numbers in a small population. However, in 1994, a more comprehensive study by the NJDOH made a shocking discovery—cases of childhood brain tumors in Ocean County were 70% higher than in the rest of the state. In 1995, Berry was again asked to investigate the Toms River cancer cluster, this time with an updated dataset and an analysis on neurological cancers specifically. Talk grew of a growing deluge of children with brain tumors, but Berry doubted that he would find anything new. He could not have been more wrong. Link, link\nToddlers (under 5) in Toms River were dying from neurological cancers at a rate 7 times above the state average. Children (under 20) were dying at 3 times the rate. Deaths had increased sharply since the late 1980s. Link, link\nThese findings were reported internally in August 1995, to very little reaction. They were not reported publicly until March 1996, when investigative journalists at The Star-Ledger finally broke the story. The public reacted in horror, both to the scale of the suffering and the disturbingly slow, opaque government inquiry. Protesters swarmed the local health department office, demanding answers and an aggressive response. Link, link\nThe victims and their diagnoses\nMichael Gillick, who gave a famous speech at Toms River High School in March 1996, was diagnosed with neuroblastoma at just 3 months old, after his mother noticed a mass in his abdomen. He has endured a lifelong fight against the disease on chemotherapy, which has left him disfigured, blinded in one eye and deaf in one ear. He could never attend school. Neuroblastoma begins as a cancer of the peripheral nervous system, but can metastasize to other organs. The disease is caused by mutations in certain genes during early development, but what causes those mutations is unknown. Most patients survive. Link, link, link\nGabrielle Pascarella was diagnosed with central nervous system lymphoma at 10 months old. This is a cancer of white blood cells (WBCs) in the cerebrospinal fluid (CSF), which bathes the brain and spinal cord. The root cause (i.e. why a WBC becomes a cancer cell) is unknown. CSF allows the cancer to invade the brain quite easily, making the disease very deadly—patients die within a few months or years. The high-dose chemotherapy and whole-brain radiation treatment used to treat are of little help, and have horrifying side effects. Gabrielle died in 1990. She was just 14 months old. Link, link, link\nAmber Dering was diagnosed with leukemia at age two. A cancer of blood cells, this disease was also prevalent in Toms River. A medley of causes have been established for leukemia, such as radiation poisoning, smoking, and Epstein-Barr virus infection. Leukemia is usually treated with chemotherapy, and has a 5-year survival rate of \\~50%. Amber was placed on chemotherapy and entered remission. Doctors said she was at low risk for relapse. Her cancer returned anyway. Amber lost her battle in 2018, at age 26; she had been in school to become a medical assistant, and left behind two young children. Link, link, link\nBetween 1990 and 2010, US health agencies investigated 428 cancer clusters. In all that, only 1 investigation successfully identified the cause. Due to the stunning failure rate, authorities warned locals from the start that the cancer cluster investigation was nearly guaranteed to fail. You can guess what happened, and it painfully killed the community's trust in science and government. Anyway, here are the theories. Link, link\nTheories\nIrradiated drinking water\nIn April 1996, the NJDEP found elevated radiation levels in two United Water wells, which were then shut down. The radiation was coming from radium in the water. Investigators later clarified that radium is found naturally in the environment, and that its levels vary naturally with rainfall patterns. In 1997, the NJDEP announced that radiation and radium levels were unusually high across southern New Jersey for unknown reasons, and that this was not a problem specific to Toms River. The NJDEP concluded that radioactive water was not the cause of the town's cancer cluster. Link, link, link\nIllegal dump of plastics manufacturing waste from Union Carbide Corporation (UCC)\nIn 1971, an independent contractor illegally dumped 4,500 barrels of chemical waste from a UCC manufacturing plant into a poultry farm near Toms River. Beginning in 1974, the carcinogen trichloroethylene (TCE) was detected in hundreds of private wells in the area, triggering the first NJDEP investigation in Toms River at Kauffman's request. They determined that there was no TCE contamination in the public drinking water. However, the area and its wells were condemned and designated as an EPA Superfund site. Link, link, link\nIn 1987, as the contamination spread, TCE was detected in United Water public drinking wells. However, the NJDEP argued that TCE was unlikely to be the cause of the cluster, since contaminations elsewhere in the US which were much more severe than the one at Toms River did not trigger cancer clusters. A much higher exposure to TCE is seemingly needed to cause cancer. Link, link\nStyrene-acrylonitrile (SAN) trimer\nIn 1987, treatment systems were revamped to remove TCE from drinking water. Unfortunately, for 10 years after this, Toms River residents were unknowingly drinking another contaminant—SAN trimer, a chemical not yet known to science. In November 1996, the chemical was detected and a large part of the Toms River water supply was shut down. SAN trimer is very similar to acrylonitrile, a carcinogen. Link, link, link, link\nIn June 1998, the federal government launched a long-term project to determine the toxicity of SAN trimer. In September 2013, the study concluded that the chemical does not cause cancer. Some raised the possibility of an acrylonitrile contamination, but this chemical was never detected despite tests on >1,000 groundwater samples. Link, link, link\nLead poisoning from Dover Township Municipal Landfill (DTML)\nFrom June 1981, the NJDEP began receiving complaints from residents near DTML of a strange taste and odor in their private well water. This was initially believed to be caused by a gasoline leak from an underground storage tank, but investigators could not find proof. In 1990, investigators determined that the wells were contaminated by DTML, and in 1997 found high levels of lead in 18 wells. Lead is a carcinogen and well-known to cause neurological problems in children. Then again, lead is a common contaminant in New Jersey, making it unclear why there would be a cancer cluster specifically in Toms River. Link, link\nIn 1971, \\~1,000 drums of chemical waste from UCC were dumped into the landfill. TCE and other carcinogens were later detected in local groundwater and well water. Link\nCiba Specialty Chemicals Corporation\nIt was once Ocean County's biggest employer, but today, it's another Superfund scar. From the 50s to the 90s, Ciba manufactured plastics, additives, pigments, and dyes—and dumped its waste into the Toms River and unlined landfills, contaminating the aquifer and thousands of acres of land with a horrifying array of carcinogens, including TCE and chloroform. There are another 9 Superfund sites in Ocean County. Link, link\nGiven an environmental disaster of this scale, you would think it would be easy to find a link to the cancer cluster. Ciba, today the Swiss pharmaceutical company Novartis, and UCC reached a settlement with the families in December 2001. However, a major NJDOH epidemiological study published in January 2003 found no link between neurological cancer cases and exposure to pollution from Ciba or UCC. It did find a link between leukemia cases and air pollution from Ciba, and well water pollution from UCC, but only if the statistical analysis was restricted to girls, and leukemia cases were less elevated anyway. The investigators could not explain why the toxins were harming prenatal girls but not boys—counter to what is known about leukemia and the carcinogens—which led some scientists to say that this finding was just a statistical fluke. Link, link, link, link\nWas it all a statistical fluke?\nAs cold as it sounds, some scientists believe that the whole thing was just a statistical anomaly. In March 2013, the science novelist George Johnson wrote, in response to the failure of investigators to resolve the Toms River cancer cluster, and the hundreds of other clusters across the country:\n\nLay a chessboard on a table. Then grab a handful of rice and let the grains fall and scatter where they may. They won’t spread out uniformly with the same number occupying each square. Instead there will be clusters. Now suppose that the chessboard is a map of the United States and the grains are cases of cancer. Each year about 1.6 million cases of cancer are diagnosed in the United States, and epidemiologists regularly hear from people worried that their town has been plagued with an unusually large visitation. Time after time, the clusters have turned out to be statistical illusions—artifacts of chance.  \nI couldn't shake the feeling that the bigger story was how human grief can drive the brain to see cause and effect whether or not it’s really there. After five years and an investigation that cost more than $10 million, it is not certain that anyone in Toms River got cancer from toxic waste discharged by local companies into the atmosphere. The frustrating thing about the science of cancer is that we will probably never know.\n\nThere are few mysteries as painful as the mystery of cancer. Another 10 years since, we still don't know, and we don't know if we'll ever know.", "media": null, "score": 1202, "upvote_ratio": 0.98, "comment_count": 176, "over_18": false}, "8": {"id": "17lks6g", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "illiteratemad", "link_flair_text": null, "time": 1699065343.5062778, "created_utc": 1698868759.0, "url": "https://www.kentonline.co.uk/maidstone/news/amp/tragic-bridge-fall-teen-was-pregnant-207744/", "title": "18 year old girl died jumping from bridge 15 years after she miraculously survived her mothers suicide where she jumped while holding her as a baby in her arms", "permalink": "/r/MorbidReality/comments/17lks6g/18_year_old_girl_died_jumping_from_bridge_15/", "selftext": "This happened near me a few years ago and i always think about how absolutely tragic her life was. Just awful", "media": null, "score": 3422, "upvote_ratio": 0.99, "comment_count": 114, "over_18": true}, "9": {"id": "17isclv", "locked": false, "subreddit": "jessicamshannon", "stickied": false, "category": "Crime", "author": "chubachus", "link_flair_text": "Warfare", "time": 1699065343.6754487, "created_utc": 1698543280.0, "url": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Confederate_dead_at_Fort_Robinette%2C_Corinth%2C_by_Taylor_%26_Huntington.jpg", "title": "Stereoview photo card of dead Confederate soldiers and a horse in front of Battery Robinette after the Second Battle of Corinth, in Corinth, Mississippi, October 1862.", "permalink": "/r/Jessicamshannon/comments/17isclv/stereoview_photo_card_of_dead_confederate/", "selftext": "", "media": null, "score": 29, "upvote_ratio": 0.91, "comment_count": 2, "over_18": true}, "10": {"id": "17i7dou", "locked": false, "subreddit": "urbanmyths", "stickied": false, "category": "Paranormal", "author": "BeliCro101", "link_flair_text": null, "time": 1699065343.8556273, "created_utc": 1698473079.0, "url": "/r/MecThology/comments/17ee53c/the_ratman_of_southend/", "title": "The Ratman of Southend.", "permalink": "/r/UrbanMyths/comments/17i7dou/the_ratman_of_southend/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.75, "comment_count": 0, "over_18": true}, "11": {"id": "17l1p25", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Evol-Chan", "link_flair_text": "Discussion/Advice", "time": 1699065344.0545933, "created_utc": 1698804371.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/17l1p25/creepiest_or_weirdest_thing_that_you_have_seen_in/", "title": "Creepiest or weirdest thing that you have seen in your childhood that still makes you question it?", "permalink": "/r/Thetruthishere/comments/17l1p25/creepiest_or_weirdest_thing_that_you_have_seen_in/", "selftext": "Since its a Halloween night, I thought i would ask this. Its no secret that Children see all kinds of thing, rather it be from their dreams, or play pretend or something they just misinterpet. Its easy to explain away things you see in your childhood on your young undeveloped brain. But sometimes, there are things we see when we are young that we just cant explain and nothing make sense of it. Most of the times, the truth of these events will never have an answer but its an interesting read, imo. \n​\nSo what things have you seen from your childhood that still have you questioning it. Rather it be creepy or anything out of the normal. ", "media": null, "score": 781, "upvote_ratio": 0.99, "comment_count": 725, "over_18": false}, "12": {"id": "17jwfji", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "cece8873", "link_flair_text": null, "time": 1699065344.2931938, "created_utc": 1698680839.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/17jwfji/the_lady_at_my_door/", "title": "The lady at my door", "permalink": "/r/LetsNotMeet/comments/17jwfji/the_lady_at_my_door/", "selftext": "Back when I lived in the rural Midwest (about 10 years ago) I lived in a house right off of the highway. My house was right between one town and another, almost right on the county line. Our house had a big circle driveway. If you drove in the driveway you would be going straight towards our barn, if you curved right, you could pull into our garage. If you went past the garage you could circle around, in front of the house and pull back out to where you started. \nOur house had two large double doors in the front which we rarely used. We always used the door that was inside the garage. \nOne night, it was very late, my doorbell rang. My husband, my three year old daughter and I were all asleep. It woke me up and I thought maybe I was dreaming. It rang again. I woke my husband up. He thought I was hearing things until it rang again.\nIt was very dark outside but we have a dusk to dawn light so most of the driveway is pretty lit up. Unfortunately you can't really see the front door(s) unless you open the door and look out. You can open just one at a time, or you can open them both by using two latch like things that are in the top and the bottom of one of the doors. My husband gets up and I follow him. He decides he is going to open the door. I want to call the cops but because we live on the county line we know it's going to be awhile before they can get there. \nHe opens the door to a girl, maybe early twenties. She looks normal except for the fact that she's standing at my door in the middle of the night. I look past her and her car is pulled into my driveway just off of the road, not up to the house, not around the circle. She says she needs to use the phone. She says her car battery died, or something, she's not sure but she can't get it to start. I told my husband no fucking way, this is how horror movies start and we offered to call the cops (which would be the county sheriff). She asks over and over but I am not letting her in. We tell her we will call and she kind of stomps off. \nWe watch her walk back to the car, maybe 50 feet away (I'm a bad judge of distance, sorry). I can see her car, I can see her. I call the cops. They say they will be there as soon as they can. About 15 minutes. They don't sound very concerned and at this point, I'm not really either. I mean, it's just a girl. She probably does have a dead battery. She opens the trunk. No lights come on. She rummages around in the trunk. Then the driver's side door opens. Out steps a guy. Then the back passenger door opens. Out steps one more guy. They all rummage around the trunk. No lights on. I can't hear anything. I can't hear them talking and I can't tell what they are doing. They all get back in the car. \nNow at this point maybe 5 minutes have gone by and I am silently praying that the sheriff puts his foot on the gas and gets here quick but I know it's going to be another 10 minutes or so. They just sit there, in the car, lights off, not moving. I can't see them when they are in the car but I know they are in there. I know they didn't get out of the car and walk past the house because they would have had to walk right under the dusk to dawn light. I would have seen them. I think I see the driver light a smoke. That part I'm not sure about. \nThen I see something, someone, walking towards the car from the right, coming from the direction of the barn. It's a man. I have no idea who this man is. We don't have a neighbor for at least a mile and he's coming from the back of my property which ends in a creek. He walks under the dusk to dawn light straight to the car. He doesn't look at the house, he just walks to the car and gets in the back. The car starts up and they slowly back out of my driveway and head north. \nThe cops arrive about 10 minutes later and at this point I am freaking out. They search around, but can't find anything. Ask us if we got a license plate but they were parked too far away. Tell us to call if they come back (sure, buddy, thanks). My husband goes and gets his shotgun from the shop (on our property) and we try to go back to sleep. \nThey never came back. I don't know who those people were and I don't know what they wanted. Creepy people in a car without a dead battery, let's never, ever meet again.", "media": null, "score": 482, "upvote_ratio": 0.99, "comment_count": 33, "over_18": true}, "13": {"id": "17l9zoh", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "CreativeHistoryMike", "link_flair_text": null, "time": 1699065344.5312724, "created_utc": 1698838272.0, "url": "https://creativehistorystories.blogspot.com/2023/10/locked-away-in-poitiers-horrific.html", "title": "Locked Away in Poitiers: The Horrific Imprisonment of Blanche Monnier a Crime that Shocked the World in 1901", "permalink": "/r/MorbidHistory/comments/17l9zoh/locked_away_in_poitiers_the_horrific_imprisonment/", "selftext": "", "media": null, "score": 8, "upvote_ratio": 0.91, "comment_count": 0, "over_18": false}, "14": {"id": "17luqo9", "locked": false, "subreddit": "crimescene", "stickied": false, "category": "Crime", "author": "vaughndag", "link_flair_text": null, "time": 1699065344.7341783, "created_utc": 1698896385.0, "url": "https://www.reddit.com/gallery/17luqo9", "title": "A Dire Warning, Unheeded", "permalink": "/r/CrimeScene/comments/17luqo9/a_dire_warning_unheeded/", "selftext": "", "media": null, "score": 1171, "upvote_ratio": 0.98, "comment_count": 132, "over_18": true}, "15": {"id": "17lnz6n", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "AccomplishedWaltz609", "link_flair_text": null, "time": 1699065344.944956, "created_utc": 1698877211.0, "url": "https://www.youtube.com/watch?v=3oag79hWUMM", "title": "Where did these images come from?", "permalink": "/r/truecreepy/comments/17lnz6n/where_did_these_images_come_from/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Where Did These Images Come From?", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/3oag79hWUMM?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Where Did These Images Come From?\"></iframe>", "author_name": "CJF", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/3oag79hWUMM/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@CJF0"}}, "score": 20, "upvote_ratio": 0.84, "comment_count": 1, "over_18": false}, "16": {"id": "17ilx6p", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "WielderoftheDarkness", "link_flair_text": null, "time": 1699065345.119963, "created_utc": 1698523702.0, "url": "https://www.reddit.com/r/threekings/comments/17ilx6p/vampire_question_and_no_its_not_if_they_exist/", "title": "Vampire question and no, it's not if they exist", "permalink": "/r/threekings/comments/17ilx6p/vampire_question_and_no_its_not_if_they_exist/", "selftext": "Okay, before you roll your eyes and slam your face a few times onto the keyboard.\nTo tell this properly, I must warn you that it's going to be long. So be prepared.\nTo start this off, it will sound silly to many of you and I know what you're thinking. But I have absolutely no interest in trying to prove this microscopic experience as true to anyone, if you are skeptical, you would be better off not reading this at all. I do not take any drugs, meds or alcohol (I'm a teetotaler) that would have induced any sort of altered state, and other than my own work on my spiritual path, there was nothing at the time that would have brought this experience on; it was sudden, completely unexpected.\nI came across \"Ode to the Vampire Mother\" and chanted it one year ago, on the full moon of October 9 (Hunter's Moon/Blood Moon) at 9.30 - 10 PM, facing towards an open window in my room:\n/r/vampires/comments/y66how/consequences_of_casting_a_spell_tested_on_me/\nI repeated the chant out loud for many times (it wasn't a big problem for me, Latin is one of the languages ​​I know: I learnt it at school), twelve if I remember exactly.\nThe same night my family and I heard a lot of creaks in our apartment, at the first we ignored them but it only got worse and worse, screeching loudly and repetitively, and I had a long strange extremely vivid (lucid?) dream, where I was in line with other people for being bitten by a creature of the night (there were two or three male vampires. They stood before us, a vast crowd of humans, waiting) but a boy felt sick, the bite mark showed signs of rejection, so one of them, in order to get rid of the problem, decapitated him...\nAfter that, it was my turn and I was bitten on side of the neck, slightly under one ear.\nThe next morning there was nothing, but...\nFrom that moment onwards, no matter where I went I felt watched, even when alone or in a crowd.\nA few days after, I woke up, I looked in the mirror and noticed two little dark bumps in the exact same spot from my dream like a vampire has attacked me (with photo evidence, posted not on Reddit because I was unable to upload them, but in another website where people are open to testing spells and eventually sharing some of their results), and now my anemia is getting worse and worse (my ferritin, an indirect indicator for how my body's iron stores are doing, is freakishly low. It's at <5.0 ng/mL when it should be 20.0 - 324.0 ng/mL. Iron pills don't work for me 😅 I'm waiting to be admitted for a blood transfusion).\nNo blood on my pillow, house is kept clean, sheets are regularly changed, no evidence of bed bugs, I don't have any pets or allergies. \nI won't hide from you that I'm tempted to try it again for the upcoming full moon.\nI’m not lacking in courage, I “put myself out there” (= get out of your comfort zone, take risks, try new things, don’t allow fear to keep you from growing, use your mistakes as learning experiences rather than letting them drag you down. You have to actively put yourself in the situations necessary to achieve your goals) and I don't care about others' opinions of me. \nAs ridiculous as it sounds, you all can consult your trusty friend Google, if you want some solid evidence of effects:\nhttps://www.gods-and-monsters.com/ode-to-the-vampire-mother-is-real.html\nhttps://www.gods-and-monsters.com/vampire-poem.html\nhttps://www.gods-and-monsters.com/vampire-poem-working.html\nhttps://www.gods-and-monsters.com/selene-prayer-made-for-me-.html\nhttps://www.gods-and-monsters.com/mother-selenes-poem.html\nhttps://www.gods-and-monsters.com/is-it-waiting-for-me.html\nhttps://www.gods-and-monsters.com/have-the-vampires-found-me.html\nhttps://www.gods-and-monsters.com/ode-to-the-vampire-mother-am-i-being-contacted.html\nhttps://www.gods-and-monsters.com/vampire-chant-poem.html\nhttps://www.gods-and-monsters.com/unwanted.html\nhttps://www.gods-and-monsters.com/strange-dream-the-vampire-spell.html\nhttps://www.gods-and-monsters.com/watched.html\nhttps://www.gods-and-monsters.com/relative-went-missing.html\nhttps://www.gods-and-monsters.com/my-accident.html\nhttps://www.gods-and-monsters.com/encounters-with-a-possessive-demon.html\nhttps://www.gods-and-monsters.com/watched-by-unseen-eyes.html\nhttps://www.gods-and-monsters.com/the-hooded-figure.html  \nhttps://forum.becomealivinggod.com/t/ode-to-selene/54403\nhttps://forum.becomealivinggod.com/t/become-a-vampire-spell-poem-to-selene/33041/27\nhttps://forum.becomealivinggod.com/t/when-time-stopped-and-the-man-with-green-eyes-appeared/54533/7\nhttps://www.vampirismforum.com/t1766-my-story-and-sandan-a-coven-recruiting-new-vampire-coven#31031\n/r/Thetruthishere/comments/4y3mec/comment/d6o38ky/\n/r/SupernaturalSightings/comments/8vcsvl/my_weird_current_story/\n/r/Paranormal/comments/6l9oz3/vampire_transformation_urgent_life_may_be_in/\n/r/occult/comments/c99tzx/i_need_help/\nAnyway, anyone experiencing similar things?\nIf you have performed Ode to the Vampire Mother, please tell me if something eerie/unexpected/unexplained happened to you (or a friend or family member).", "media": null, "score": 5, "upvote_ratio": 0.86, "comment_count": 5, "over_18": false}, "17": {"id": "17mjj23", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "unicorn-onesie", "link_flair_text": null, "time": 1699065346.0427086, "created_utc": 1698974821.0, "url": "https://v.redd.it/oknml87fc1yb1", "title": "What do you see here? I'm on a work trip and scared to go back home", "permalink": "/r/Ghosts/comments/17mjj23/what_do_you_see_here_im_on_a_work_trip_and_scared/", "selftext": "So for context i live in a gated condo in a very quiet part of town. Barely any movement past 9pm. This time of the year, there's maybe 6 apartments occupied, as all tge rest are used for summer holidays. My apartment is on the ground floor and my only direct neighbours are not there. Hardly anyone walks on the back during the night.\nI'm currently away from home for work, and when the cleaner went there yesterday,  li asked her to set up the camera just for security.\nVideo was about 2/3h after she left, just after sunset. Like somethin that went to examine the new item on the dresser. Since then, there's been countless videos of smoke and strange sounds like bangs and others that sound like voices. Mostly late at night, when the condo is supposed to be dead silent. Btw all the doors and windows are locked, nothing was left open.\nI wanted to attach the whole thing but I'm still learning how to use reddit. I really need your input as im terrified of going back home now....\nHow can I post the whole thing?", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/oknml87fc1yb1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/oknml87fc1yb1/DASH_96.mp4", "dash_url": "https://v.redd.it/oknml87fc1yb1/DASHPlaylist.mpd?a=1701657345%2CNWIyNjNiY2I3NjJiYTUyYjNlYjNjYjMyMTQwM2UzZTI0OTljOWQ5NjA1NGUzNTE1ZjQ4NzA5ODkyMjA3OWFhMQ%3D%3D&v=1&f=sd", "duration": 10, "hls_url": "https://v.redd.it/oknml87fc1yb1/HLSPlaylist.m3u8?a=1701657345%2CYjI0MDI4NDAxYTlhZGNiMTA4MGM5MzUxMmMxMGIyMDgyOWRiMjY0NzVlN2I2MjM3M2ViODA4MDI0YjFhZDQ2Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 10545, "upvote_ratio": 0.82, "comment_count": 2287, "over_18": false}, "18": {"id": "17jj2mu", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Well_thats_cool", "link_flair_text": "Glitch Gif", "time": 1699065346.4651728, "created_utc": 1698632282.0, "url": "https://v.redd.it/pgbli4su19xb1", "title": "Cloud-like object floating in my street", "permalink": "/r/GlitchInTheMatrix/comments/17jj2mu/cloudlike_object_floating_in_my_street/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/pgbli4su19xb1/DASH_1080.mp4?source=fallback", "has_audio": false, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/pgbli4su19xb1/DASH_96.mp4", "dash_url": "https://v.redd.it/pgbli4su19xb1/DASHPlaylist.mpd?a=1701657346%2CNjFkMDBiN2NiMWRmMTgzMTI4MDBkMWFiYWM5YThhZWVjMGMwZGE4ZTMxNzVhYzJjM2Y3ZGRmMGU4ZTYzZGQyZQ%3D%3D&v=1&f=sd", "duration": 12, "hls_url": "https://v.redd.it/pgbli4su19xb1/HLSPlaylist.m3u8?a=1701657346%2COTcyZTg2NTc5YmIwY2YxMmU1OGFiZGRiYzQ0NjY3MmJiNTcyZmFjZjg0Zjk0OTRkMTNlZGRmNGY5YTBlNDdkYw%3D%3D&v=1&f=sd", "is_gif": true, "transcoding_status": "completed"}}, "score": 3717, "upvote_ratio": 0.94, "comment_count": 376, "over_18": false}, "19": {"id": "17k0bo8", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Soft-Ad-9407", "link_flair_text": "PGF", "time": 1699065347.0594614, "created_utc": 1698691173.0, "url": "https://i.redd.it/7855fpdzwdxb1.jpg", "title": "Bob Heironimus again", "permalink": "/r/bigfoot/comments/17k0bo8/bob_heironimus_again/", "selftext": "More proportional analysis. At least this person isn’t trying to pass it off as science. \nHe does seem to put forward a more convincing argument than thinkerthunker. \nJust a shame the only views are probably coming from himself 😂\nhttps://youtu.be/cGaTskizYMs?si=CXrGobLUIVmv4Awx", "media": null, "score": 421, "upvote_ratio": 0.79, "comment_count": 430, "over_18": false}, "20": {"id": "17knfs0", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1699065347.7033842, "created_utc": 1698765505.0, "url": "https://i.redd.it/8ue4eu902kxb1.jpg", "title": "In 1924 the infamous \"Ape Canyon\" incident occurred. A group of gold prospectors in Washington claimed that they had encountered several apemen. After one prospector shot and wounded an apeman, the apemen retaliated. They surrounded their cabin and threw rocks at it.", "permalink": "/r/Cryptozoology/comments/17knfs0/in_1924_the_infamous_ape_canyon_incident_occurred/", "selftext": "", "media": null, "score": 376, "upvote_ratio": 0.98, "comment_count": 48, "over_18": false}, "21": {"id": "17iqs4w", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "emilos260", "link_flair_text": "Alien", "time": 1699065347.890068, "created_utc": 1698538072.0, "url": "https://www.reddit.com/gallery/17iqs4w", "title": "Dark floating humanoid attacks farmer at San Piero a Sieve, Florence, Italy-September/October, 1989. (full story in the comments)", "permalink": "/r/Humanoidencounters/comments/17iqs4w/dark_floating_humanoid_attacks_farmer_at_san/", "selftext": "", "media": null, "score": 871, "upvote_ratio": 0.98, "comment_count": 73, "over_18": false}, "22": {"id": "17l1c13", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "delola3100", "link_flair_text": null, "time": 1699065348.7176347, "created_utc": 1698803266.0, "url": "https://i.redd.it/895biwia6nxb1.jpg", "title": "My 10yo was Mothman today. No one at school got it but I figured you guys would appreciate it", "permalink": "/r/cryptids/comments/17l1c13/my_10yo_was_mothman_today_no_one_at_school_got_it/", "selftext": "", "media": null, "score": 194, "upvote_ratio": 0.97, "comment_count": 18, "over_18": false}, "23": {"id": "17kuu83", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "JoeHexotic", "link_flair_text": null, "time": 1699065349.8754704, "created_utc": 1698784914.0, "url": "https://i.redd.it/qa2qyazinlxb1.png", "title": "It's getting harder and harder for me to remain impartial and non-partisan on this issue. Anybody else?", "permalink": "/r/conspiracy/comments/17kuu83/its_getting_harder_and_harder_for_me_to_remain/", "selftext": "", "media": null, "score": 1891, "upvote_ratio": 0.83, "comment_count": 940, "over_18": false}, "24": {"id": "17n4b0t", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1699065350.104338, "created_utc": 1699043498.0, "url": "https://youtube.com/live/H4dYe0GHWH4", "title": "What's The Story Behind The Devil's Hand", "permalink": "/r/conspiracyfact/comments/17n4b0t/whats_the_story_behind_the_devils_hand/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 1, "over_18": false}, "25": {"id": "17jkcba", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Awstun_", "link_flair_text": null, "time": 1699065351.5828164, "created_utc": 1698636375.0, "url": "https://i.redd.it/85fx7nu1e9xb1.jpg", "title": "Kirkpatrick tells NASA advisory panel “There is something there.”", "permalink": "/r/ufo/comments/17jkcba/kirkpatrick_tells_nasa_advisory_panel_there_is/", "selftext": "Per Matthew Phelan on X. https://x.com/cbmdp?s=21&t=opb9eXW-fKdqGQhGpx5UkQ", "media": null, "score": 267, "upvote_ratio": 0.95, "comment_count": 107, "over_18": false}, "26": {"id": "17ixoqa", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "DisasterBig", "link_flair_text": "Video", "time": 1699065352.9683554, "created_utc": 1698564433.0, "url": "https://v.redd.it/45re175pf3xb1", "title": "Black Tic-Tac like object recorded by pilot in Monterrey, Mexico on July 5th 2023", "permalink": "/r/UFOs/comments/17ixoqa/black_tictac_like_object_recorded_by_pilot_in/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/45re175pf3xb1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/45re175pf3xb1/DASH_96.mp4", "dash_url": "https://v.redd.it/45re175pf3xb1/DASHPlaylist.mpd?a=1701657352%2CMjViMTQ1ZWFjMjc5ZDc3MGU1NjA1YzM0YzMyNWEzMTBmZTM5ODhhNjZhYjJkZjZmNGFlODE5ZjJlNjU5ZjU0OQ%3D%3D&v=1&f=sd", "duration": 111, "hls_url": "https://v.redd.it/45re175pf3xb1/HLSPlaylist.m3u8?a=1701657352%2CNDFiNWEyNzY4NGQ1NGNkMTcxZGYxNWQ5OWVmNGNjZDUwMzM4NWVlMmQzZTVjN2M3NTY1YTY4M2Y5YThiZjIwZQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2959, "upvote_ratio": 0.92, "comment_count": 611, "over_18": false}, "27": {"id": "17l9nd9", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "StaticBang", "link_flair_text": "Evidence :upvote:", "time": 1699065354.629419, "created_utc": 1698836942.0, "url": "https://v.redd.it/qemd63y0upxb1", "title": "Silent UFO hovers over mans backyard in 2008 in Houston, Texas. . At the end you hear his dog barking at it.", "permalink": "/r/aliens/comments/17l9nd9/silent_ufo_hovers_over_mans_backyard_in_2008_in/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 450, "fallback_url": "https://v.redd.it/qemd63y0upxb1/DASH_270.mp4?source=fallback", "has_audio": true, "height": 240, "width": 320, "scrubber_media_url": "https://v.redd.it/qemd63y0upxb1/DASH_96.mp4", "dash_url": "https://v.redd.it/qemd63y0upxb1/DASHPlaylist.mpd?a=1701657353%2CNmQ3ODY5ZmYxZjQxZTExMmZlMjk0Y2YxMzUwYzNhODY2ZjM5YzExMWRlMDFmZTAxZmU3NzU3ODdmODNjOTViNQ%3D%3D&v=1&f=sd", "duration": 72, "hls_url": "https://v.redd.it/qemd63y0upxb1/HLSPlaylist.m3u8?a=1701657353%2CZmQ4YWEyN2MzNWRmODFiNWE0NTU5NTU1NTVmYjczYzEzNDNmZWUzMDUwOGE0Y2IwNzhkOWMwYzcwODQ4MjI1Zg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4769, "upvote_ratio": 0.75, "comment_count": 1339, "over_18": false}, "28": {"id": "17mhrks", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Video", "time": 1699065355.12198, "created_utc": 1698969771.0, "url": "https://v.redd.it/lxu9phoht0yb1", "title": "Full NewsNation segment with Ross Coulthart | Multiple UAPs detected over the Arctic Circle several days before the Chinese spy balloon incident. Unsuccessful shootdown operation performed by NORAD.", "permalink": "/r/UAP/comments/17mhrks/full_newsnation_segment_with_ross_coulthart/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/lxu9phoht0yb1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/lxu9phoht0yb1/DASH_96.mp4", "dash_url": "https://v.redd.it/lxu9phoht0yb1/DASHPlaylist.mpd?a=1701657354%2CN2EzZDdiM2ZkMjdjZTBmMWMyOWQxN2ZkZGM2ZjU1ZmJiZTY4YTkyMGJhOWFhMGRjNjE4ZThhZDgyMWI4MmVjNA%3D%3D&v=1&f=sd", "duration": 368, "hls_url": "https://v.redd.it/lxu9phoht0yb1/HLSPlaylist.m3u8?a=1701657354%2CMDgxY2U3MTMyYTdhNDE3NDhkNzAwNGI3NjM3MDY4MDcwZWRhZjY1MmI2ZjAzNzk5MzhkNGQyNDM3MjI0ZGI0Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 498, "upvote_ratio": 0.94, "comment_count": 59, "over_18": false}, "29": {"id": "17kt81v", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "AlfredTheJones", "link_flair_text": "Disappearance", "time": 1699065355.6229796, "created_utc": 1698780597.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/17kt81v/young_girl_goes_missing_in_unclear_circumstances/", "title": "Young girl goes missing in unclear circumstances, parents don't report her missing after three weeks, and then give confusing statements. A year later, she is still missing and the case is even more twisted- Where is Madalina Cojocari? (2022)", "permalink": "/r/UnresolvedMysteries/comments/17kt81v/young_girl_goes_missing_in_unclear_circumstances/", "selftext": "Hello everyone! I usually do writeups for Johns and Jane Does, but something about this case has really stayed with me and I can't find any other writeup on it on this sub, so I decided to give it a try! Madalina's case is quite \"new\" compared to a lot of cases on this sub, but that makes it more likely that someone out there remembers seeing or hearing something about Madalina's disappearance.\n​\nA lot of the information in the \"background\" section was compiled by Annie Elise on youtube. It is, however, not entirely a transcript, so I hope that it's okay. Watch her video on the case here.\n​\nBACKGROUND\n​\nMadalina Cojocari was born on April 11th 2011 in Moldova. Her mother, Diana Cojocari, used to work as a translator and came from a well-known musician family. Madalina's father has left the family when she was three, which led to Diana setting up a profile on a \"dating website\" (though according to some it was more like a mail-order bride site) where she met the 22 years older Christopher Palmiter, and subsequently moved to the US with Madalina, where they've gotten married (they were engaged before they've even met in real life).\n​\nThe couple and Madalina lived in Cornelius, in North Carolina, US. It's a fairly affluent neighbourhood with a man-made lake, Lake Norman, nearby, where the family could live thanks to Palmither's well-paying job as a designer in an engineering firm. The neighbours claimed that in the few years that the family has lived there, they've rarely saw Diana outside by herself, and it was Christopher that always accompanied Madalina when she was playing outside or trick-or-treating, though she was allegedy forbidden to her to play outside with other kids with no supervision. They've frequented a local restaurant where they were remembered as a normal family. In 2020 Christopher has lost his job and started his own buisness doing engraved plaques for local buisnesses. Their income has changed quite a lot, but Christopher's firm seemed to be gaining traction and didn't seem to be struggling financially in any way. \n​\nThere appeared to be quite a lot of differences between Madalina's parents when it came to their spiritual beliefs. Diana was a follower of kundalini, a new-age faith that combined spiritual awakening and yoga practices. She continued to support the movement even after its founder and guru, Yogi Bhajan, was outed as a fraud and alleged predator. She also posted videos on her social media accounts where she'd praise violence (a big focus of the kundalini practices). Christopher, on the other hand, seemed to be a conservative man, who praised christian values and was very pro-gun.\n​\nMadalina herself is remembered as a shy, withdrawn girl who loved horseback riding. She had a tendency to wear her jacket even when it was warm out, possibly as a way to comfort herself. Despite all that she was remebered as a sweet, polite and a smart girl that was a joy to have in class.\n​\nDISAPPEARANCE\n​\nThe last confirmed sighting of Madalina was on the 21st of November at 4:59 PM. There's photographic evidence of her being on her school bus.\n​\nOn the 12th of December 2022, the resource officer from Bailey Middle School, where Madalina was a student, has attempted to pay a house visit in relation to a long stretch Madalina's absence in school: The last time she actually attended classes was the 21st of November. Nobody has opened the door, however, and a truancy packet was left at the door.\n​\nOn the 14th of December, Diana Cojocari was supposed to come to her daughter's school (and bring her with her) to have a talk about her daughter's truancy. Diana came to the meeting, but without Madalina, and she has told the councelor that her daughter has been missing since the 23rd of November, 10 P.M. According to court documents, she and Christopher had a fight that night, and the next morning he drove to the home of his family in Michigan to \"recover some items\". Diana said that she has checked on Madalina in her room on the 11:30 AM the next day, but Madalina wasn't there.\n​\nIn the days after Madalina went missing, the neighbours have reported that there was a big fire started in the yard, and that Diana and Christopher have been burning different items for days. It has been confirmed that there was a fire, but the law enforcement have refused to discuss specifics. One of the items that have been allegedly seen burning was a couch cushion.\n​\nMadalina has been officially reported missing to the authorities on the 15th of December. According to the arrest documents, Christopher Palmiter has confirmed his trip to Michigan. He has said that he didn't see Madalina on that day and believed that the last time he saw her was a week before his trip. He claimed that he returned three days later, on the 26th of November, and asked Diana where Madalina was- she said that she \"didn't know\". On the 17th of December, both Diana and Christopher were arrested for failure to report the disappearance of a child to law enforcement. The judge has said that Diana has \"hindered\" the investigation and she \"begrudgingly\" reported her daughter missing. She's held on the bond of 250,000 dollars and is supposed to be under electronic surveillance if she'll pay. Christopher is assigned a public defender and a 200,000 dollars bond.\n​\nDuring the search of family's home, an area of the kitchen boarded up with plywood was discovered. When asked, Palmither claimed that he wanted to make a separate apartment. 25 items were seized, including three iphones. Different passports for Madalina and Diana, alond with a moldovan debit card, in the console of the family car.\n​\nFor a long time, there were no new updates in the case; However, on March 8th, 107 days after Madalina went missing, new documents that have been unsealed that have revealed that Diana has asked a relative to \"smuggle\" her and Madalina away from their home in Cornelius. She claimed that she was unhappy in her relationship with Christopher and that she wanted a divorce. \n​\nOn the 11th of April 2023, Madalina would have her 12th birthday. The community has celebrated it with a vigil in her name.\n​\nOn the 18th of July, newly unsealed documents have revealed that Madalina was likely spotted on surveillance on the 16th of December, a day before her parents were arrested, on Sugar Mountain. Allegedly, she was seen with a man that resembled Octavian Cebanu, her only known blood relative in the States. Palmither was held in a jail with a police informant and his notebooks were seized, but it's not known if anything of value was in them. The documents have also revealed that Diana talked to her mother about a \"bag of cash\", financial deposits and has floated a theory that Christopher might've \"given Madalina away\".  Palmither, on a conversation with his brother and his wife, has said that Diana had a lot of cash and that some financial stuff was coming up, to which his brother told him to \"not worry about\". Additionally, a text message from Diana has been found in which she claimed that Madalina was with her on the 2nd of December, and on 4th she talked about travelling to NC mountains \"claiming to be searching\" (I'm not entirely sure what it means). Diana was seen getting an oil change on the 2nd of December in a shop in Hickory, but Madalina wasn't seen with her.\n​\nOn the 17th of August, Diana Cojocari pleaded not guilty. A day later Christopher was released on bond, though he's supposted to be supervised electronically.\n​\nDuring the trial, it was revealed that Diana has believed that Christopher put her and Madalina in danger by investing into a retirement's savings account and making Diana a beneficiary. She has, however, stressed that she's not afraid of her husband, but of \"others\" who might want to hurt them. The travel Palmither has went on on the 23rd of November was to recover large containers of food, clothing and other items, which was consistent with Diana's plan to hide away somewhere with Madalina. Christopher believes that his wife didn't hurt their daughter and has hidden her away in the mountains. \n​\nCONCLUSION\n​\nThere's a lot of rumors and speculations about this case, which isn't that suprising, given how convoluted all the facts we have are. Theories range from everything, Madalina being murdered by her mother, stepfather, both, of her being smuggled out of the US or sold into human trafficking. There's suprisingly little concrete evidence (at least that we know of) that would point to any one of the possible solutions. It's been almost a year and Madalina is still missing, and it feels like we're no closer to knowing if she's even alive or not. What we can say for sure is that either or both of Madalina's parents are deeply involved in her going missing.\n​\nMadalina's maternal grandmother believes that Christopher has been drugging his wife and daughter, and when Diana fell asleep due to drugs, Pamither has carried Madalina out of the house and sold her for five million dollars. Diana has allegedly been telling her mother that her husband has been drugging her and Madalina for some time, but there's no evidence for that.\n​\nSome speculate that Diana is suffering from some mental issues that make her have severe delusions, including about someone wanting to hurt her and Madalina over the retirement savings account. Again, it's just speculation, as Diana doesn't have a known history of mental illness and she has not been diagnosed while arrested.\n​\nOn the 30th of October 2023, hunters have found human remains near where Madalina was last seen. They're not identified yet, but according to the authorities the remains likely belonged to an elderly man, so it's likely not Madalina. Again, there's no known identity yet. \n​\nWhen Madalina went missing, she was 11 years old, and is now 12. She was 4' 11'' (59 inches) and weighed 90 pounds. She's white (of Moldavian ancestry) and has brown eyes and long hair. She might respond to \"Mari\", \"Madi\", \"Marika\" or \"Maria\". She was last seen wearing a white t-shirt, jacket, jeans, and pink, purple and white Adidas shoes.\n​\nIf you believe that you have any info regarding her disappearance, contact the Cornelius Police Department at (704) 892-1363 (case number 22-1215091).\n​\nSources:\n​\n\nWCCB Charlotte\nFoxnews.com\nDailyMail\nWBTV.com (timeline of her disappearance)\nWBTV.com (warrants)\nWBTV.com (Christopher's bail court appearance)\nABC11.com (Remains in the mountains)\nNamUS\n\n​\n​\n​\n​\nEDIT: I wanted to clarify the part about Diana's spiritual beliefs: Kundalini is a complex practice that is very old and complicated, and Yogi Bhajan was merely one of many teachers that has started a practice of his own method of kundalini. Diana was, however, the follower of his specific practice, and the allegations of him being a fraud and a predator are real.", "media": null, "score": 776, "upvote_ratio": 0.97, "comment_count": 89, "over_18": false}, "30": {"id": "17l4e5d", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "PlantZenGuy", "link_flair_text": null, "time": 1699065355.9368734, "created_utc": 1698813524.0, "url": "https://metro.co.uk/2023/10/31/woman-poisons-boyfriend-inheritance-dump-her-north-dakota-19752707/", "title": "North Dakota woman fatally poisons her boyfriend with antifreeze hours after he inherited $30M", "permalink": "/r/MorbidReality/comments/17l4e5d/north_dakota_woman_fatally_poisons_her_boyfriend/", "selftext": "", "media": null, "score": 3206, "upvote_ratio": 0.99, "comment_count": 231, "over_18": true}, "31": {"id": "17l4kbw", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Business-Theme-5184", "link_flair_text": null, "time": 1699065356.4859688, "created_utc": 1698814210.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/17l4kbw/my_brother_can_see_djinns/", "title": "My brother can see djinns", "permalink": "/r/Thetruthishere/comments/17l4kbw/my_brother_can_see_djinns/", "selftext": "(First things first, we are muslim by faith)\nAnd by things i mean djinn (thats what we assume based off of what he has described to us). \nSo my brother (14) at the time went to a wedding function with my parents. Now keep in mind (bad djinns are usually found in places that are dirty and unsanitary.) \nNow the way to the location of the function is not the most lit (street light wise) and is sketchy. Now everything is fine while going to the event as its 6-7pm but while leaving the venue (12-1am) my brother exited the venue a little earlier than my parents, as they were greeting everyone goodbye. \nNow after a while later when my parents reach my brother , they see him shaking and on the verge of tears (they are aware that he senses/sees djinn as it has happened in the past) so they sensed something was wrong and left the place as fast as they can. My brother was sobbing all the way home and once they reached home he kept repeating “i saw something there/there was something at the location”. Now we just prayed for him and went to bed like usual. \nFast forward the next day, he goes to school like usual and when he comes back he goes to shower and amidst that he calls out to mom stating that his back is burning (due to the shower gel mostly), now what she saw still gives me goosebumps, scratch marks all across his back. Not just small scratches that can happen when we itch too hard,  these were stretched out from the upper back to the lower back red and irritated. now as soon as we saw it we called home imam (religious expert) and he confirmed that there was a negative presence that had come along with him home.", "media": null, "score": 145, "upvote_ratio": 0.83, "comment_count": 71, "over_18": false}, "32": {"id": "17kqfmz", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "4409293", "link_flair_text": null, "time": 1699065356.6926281, "created_utc": 1698773383.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/17kqfmz/creepy_guy_at_my_door/", "title": "Creepy Guy At My Door", "permalink": "/r/LetsNotMeet/comments/17kqfmz/creepy_guy_at_my_door/", "selftext": "Not sure if my story belongs here but I've always been creeped out by it.\nI, a female, was 25 at the time. This was 2018 and I lived with my boyfriend in our hometown. It's a small city that's relatively poor and has some drug problems as there's not much to do. My boyfriend, now husband, was at his friends house. It was a Saturday night and he said he'd be home around 9. He was about 2 towns over, a 20 minute drive. At the time, we lived in a duplex, split upstairs and downstairs. It used to be a big house, converted into a duplex. My cousin actually rented the downstairs apartment and she was kind of loud. I knew when she was and wasn't home. She wasn't home this night.\nThe way our street was situated, the backs of the houses on my street, and the parallel street, all faced a narrow alley and the driveways were (mostly) only accessible this way. The downstairs unit had a front porch with a door, and a side door. Our upstairs unit had the back door and it was at the top of an outside set of wooden stairs. \nSo anyway, I'm home watching tv alone. I hear someone coming up the stairs and knock on the door. It's 8:30. It wouldn't be that unusual for my boyfriend to be home early. Maybe they got bored playing video games, or he just felt like leaving. I usually would unlock the door for him when he came home instead of him using his keys because it was dark and could be a hassle. So I got up and opened the door to someone who was not my boyfriend.\nIt was a pretty thin man, wearing too big jeans and hoodie. He had about 4 teeth and was teetering back and forth. I was so shocked considering I was positive it was my boyfriend coming home. The guy at the door asks me \"Can I use your phone?\". Behind him, down the stairs and in the alley, I see a big SUV, Ford Explorer type of vehicle just idling, with someone in the drivers seat. I panic and just say \"Yeah, hold on\". I then shut and lock the door.\nI think I was more shocked that it was a stranger at my door and not my boyfriend than anything else. I hide so he cannot see me through the front doors window and am frozen. Something was just telling me this was not okay. After a few minutes, I hear him start walking down the stairs. I go over to the door and see the car drive away down the alley.\nI call my boyfriend and tell him and he says he'll leave, but like I said, it was a 20 minute drive, he was about to leave anyway. After he got home, I calmed down and honestly felt silly. Why not just lend him my phone? Was it really that weird?\nBut then I thought about it more over the next few days, it was 2018. This guy and whoever was driving, between the two of them neither one had a phone? And it wasn't like they were having car trouble, what would they want a strangers phone for? They also went down an alley, and to the back side of a house, up some stairs, to ask for a phone? They didn't go to my cousins front door downstairs, I would have heard someone on the porch. They did not go to any other house, I saw them leave the street entirely. Also why go to a house to ask for a phone when there was no car in the driveway? And of course, our battery powered security camera, was dead at the time. \nI genuinely am not sure what they wanted, if anyone has any idea or thinks I'm overthinking it, let me know, but, creepy guy at my door, let's not meet again.", "media": null, "score": 172, "upvote_ratio": 0.97, "comment_count": 26, "over_18": true}, "33": {"id": "17kgiad", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "HistoryTodaymagazine", "link_flair_text": null, "time": 1699065356.9082732, "created_utc": 1698742228.0, "url": "https://www.historytoday.com/archive/review/bone-chests-cat-jarman-review", "title": "The Bone Chests: Unlocking the Secrets of the Anglo-Saxons by Cat Jarman is an enthusiastic guide through the human remains of England’s early medieval past.", "permalink": "/r/MorbidHistory/comments/17kgiad/the_bone_chests_unlocking_the_secrets_of_the/", "selftext": "", "media": null, "score": 6, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "34": {"id": "17n6tpq", "locked": false, "subreddit": "crimescene", "stickied": false, "category": "Crime", "author": "vaughndag", "link_flair_text": null, "time": 1699065357.1128552, "created_utc": 1699050291.0, "url": "https://www.reddit.com/gallery/17n6tpq", "title": "Behind a Fence in Ixtapaluca", "permalink": "/r/CrimeScene/comments/17n6tpq/behind_a_fence_in_ixtapaluca/", "selftext": "", "media": null, "score": 198, "upvote_ratio": 0.97, "comment_count": 15, "over_18": true}, "35": {"id": "17mw80d", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "under_supervised", "link_flair_text": null, "time": 1699065357.3199072, "created_utc": 1699021313.0, "url": "https://i.redd.it/tpavc6ru25yb1.jpg", "title": "The Florida Skunk Ape", "permalink": "/r/truecreepy/comments/17mw80d/the_florida_skunk_ape/", "selftext": "", "media": null, "score": 4, "upvote_ratio": 0.63, "comment_count": 0, "over_18": false}, "36": {"id": "17jalje", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "YMCALegpress", "link_flair_text": null, "time": 1699065357.475304, "created_utc": 1698607941.0, "url": "https://www.reddit.com/r/threekings/comments/17jalje/would_someone_under_demonic_possession_be_unable/", "title": "Would someone under demonic possession be unable to read holy scriptures?", "permalink": "/r/threekings/comments/17jalje/would_someone_under_demonic_possession_be_unable/", "selftext": "Documented cases always say people possessed by demons cannot touch holy objects nor can they stand recitation of scripture and religious music. So would asking someone to read a piece of paper with Biblical verses and seeing them unable to say the verse a red flag of demonic possession or at least demonic influence? I'm an agnostic so I have no agenda in asking this, I'm simply researching.", "media": null, "score": 5, "upvote_ratio": 1.0, "comment_count": 1, "over_18": false}, "37": {"id": "17iswrx", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "frg00_", "link_flair_text": null, "time": 1699065358.2409146, "created_utc": 1698545179.0, "url": "https://v.redd.it/jlg7rjxtu1xb1", "title": "My mom caught my dead dog in a live video ", "permalink": "/r/Ghosts/comments/17iswrx/my_mom_caught_my_dead_dog_in_a_live_video/", "selftext": "My dog died about a year before this was taken.  My mom was taking a picture of a decoration on my dining room table and realized something in the back of the live picture.  I slowed it down so you guys can take a look and lmk what you think.", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/jlg7rjxtu1xb1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 592, "scrubber_media_url": "https://v.redd.it/jlg7rjxtu1xb1/DASH_96.mp4", "dash_url": "https://v.redd.it/jlg7rjxtu1xb1/DASHPlaylist.mpd?a=1701657357%2COTQ5NzIzYmUzMjY1ZWI5NzQ3NzVhNTUzNzY4MDNkMTFjOGJkOGEwYzM5NDc5MjAxZTc0MzA1MTQ1ODdlMTVhMw%3D%3D&v=1&f=sd", "duration": 9, "hls_url": "https://v.redd.it/jlg7rjxtu1xb1/HLSPlaylist.m3u8?a=1701657357%2CNmQ5NThjMmU2NzczZjI4NmU0MGIyMWMzMzg0YmIwMTRjYzJjNWU5YWUyMWVjM2M2YTgyNDExMzE1YWZjZWU5YQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 6455, "upvote_ratio": 0.89, "comment_count": 457, "over_18": false}, "38": {"id": "17ihqom", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Smol_froggi", "link_flair_text": "Glitch Pic", "time": 1699065358.6816719, "created_utc": 1698511530.0, "url": "https://i.redd.it/1ya9z5vr2zwb1.jpg", "title": "My KitKat is just chocolate??", "permalink": "/r/GlitchInTheMatrix/comments/17ihqom/my_kitkat_is_just_chocolate/", "selftext": "", "media": null, "score": 243, "upvote_ratio": 0.93, "comment_count": 48, "over_18": false}, "39": {"id": "17kn80d", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Fleegle1834", "link_flair_text": "holiday cheer", "time": 1699065359.2854917, "created_utc": 1698764932.0, "url": "https://i.redd.it/b614l99b0kxb1.jpg", "title": "Happy Halloween", "permalink": "/r/bigfoot/comments/17kn80d/happy_halloween/", "selftext": "", "media": null, "score": 401, "upvote_ratio": 0.96, "comment_count": 21, "over_18": false}, "40": {"id": "17k1qrh", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "VampiricDemon", "link_flair_text": "Question", "time": 1699065359.8822145, "created_utc": 1698694920.0, "url": "https://www.reddit.com/gallery/17k1qrh", "title": "The Carolina parakeet was declared extinct in 1939, however the reasons for its disappearance remain unclear. Alleged sightings of the species after 1939 are seemingly non-existent. Would you still consider it a cryptid? Or is it a closed case?", "permalink": "/r/Cryptozoology/comments/17k1qrh/the_carolina_parakeet_was_declared_extinct_in/", "selftext": "", "media": null, "score": 263, "upvote_ratio": 0.98, "comment_count": 52, "over_18": false}, "41": {"id": "17j7jvn", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "emilos260", "link_flair_text": "Alien", "time": 1699065360.0730271, "created_utc": 1698599571.0, "url": "https://www.reddit.com/gallery/17j7jvn", "title": "Close encounter with two humanoid aliens near Chałupy, Hel Peninsula, Poland-August 8th, 1981 (full story in the comments)", "permalink": "/r/Humanoidencounters/comments/17j7jvn/close_encounter_with_two_humanoid_aliens_near/", "selftext": "", "media": null, "score": 161, "upvote_ratio": 0.99, "comment_count": 14, "over_18": false}, "42": {"id": "17mgph8", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "confusedsirenlady", "link_flair_text": null, "time": 1699065361.1105545, "created_utc": 1698966821.0, "url": "https://i.redd.it/bxj1hbqmo0yb1.jpg", "title": "Found this on FB.", "permalink": "/r/cryptids/comments/17mgph8/found_this_on_fb/", "selftext": "I personally think this would be so cool. Like have a Cryptid special edition currency for every state. I would be on the hunt to collect every single one. I would officially be into coin collecting if this were a thing. \nSource:\n https://m.facebook.com/story.php?story_fbid=pfbid037Cf2MY8XvRvYeU3ouyeN9JSkqiTX5ziAEAzXP7xxyiKN4eKmLnK1jPFb7xKzfXAal&id=683541454&post_id=683541454_pfbid037Cf2MY8XvRvYeU3ouyeN9JSkqiTX5ziAEAzXP7xxyiKN4eKmLnK1jPFb7xKzfXAal&mibextid=K8Wfd2", "media": null, "score": 194, "upvote_ratio": 1.0, "comment_count": 7, "over_18": false}, "43": {"id": "17lyi7h", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "softserveicebeam", "link_flair_text": null, "time": 1699065362.3355484, "created_utc": 1698912056.0, "url": "https://i.redd.it/37juffhs5wxb1.jpg", "title": "A major story about a pedophile ring has disappeared from the internet with no update on the case. Is this another case of elites protecting their own?", "permalink": "/r/conspiracy/comments/17lyi7h/a_major_story_about_a_pedophile_ring_has/", "selftext": "", "media": null, "score": 1854, "upvote_ratio": 0.83, "comment_count": 403, "over_18": false}, "44": {"id": "17md305", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1699065362.5675747, "created_utc": 1698957368.0, "url": "https://youtube.com/live/mS-akNKkdk0", "title": "Interpreting Ghost Stories: Fake Or Not?", "permalink": "/r/conspiracyfact/comments/17md305/interpreting_ghost_stories_fake_or_not/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 3, "over_18": false}, "45": {"id": "17mdk37", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "throwaway16830261", "link_flair_text": "Article", "time": 1699065364.0016155, "created_utc": 1698958585.0, "url": "https://www.ncregister.com/cna/pope-francis-calls-for-paradigm-shift-in-theology-for-world-of-today", "title": "Pope Francis Calls for ‘Paradigm Shift’ in Theology for World of Today: \"...new statutes issued for...Pontifical Academy of Theology...shifted...focus from “promoting the dialogue between reason and faith” to...“transdisciplinary dialogue with philosophies, sciences, arts, and all other knowledge.”\"", "permalink": "/r/ufo/comments/17mdk37/pope_francis_calls_for_paradigm_shift_in_theology/", "selftext": "", "media": null, "score": 231, "upvote_ratio": 0.95, "comment_count": 41, "over_18": false}, "46": {"id": "17lpkc7", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "InventedInternet", "link_flair_text": "Photo", "time": 1699065365.4692495, "created_utc": 1698881433.0, "url": "https://i.redd.it/jcf4smiqmtxb1.jpg", "title": "Did my gf randomly get a UFO photo?", "permalink": "/r/UFOs/comments/17lpkc7/did_my_gf_randomly_get_a_ufo_photo/", "selftext": "It was an iPhone pic so it has short video along with it too I can post", "media": null, "score": 2922, "upvote_ratio": 0.77, "comment_count": 753, "over_18": false}, "47": {"id": "17ibi2b", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Arroz-Con-Culo", "link_flair_text": "Image 📷", "time": 1699065367.5205514, "created_utc": 1698491391.0, "url": "https://i.redd.it/mhi08prxexwb1.jpg", "title": "“Pelacaras” from Peru sightings", "permalink": "/r/aliens/comments/17ibi2b/pelacaras_from_peru_sightings/", "selftext": "An unconfirmed photo of a being from the Peru sightings “Pelacaras”\nSome are hooded, some are armored, some are reptilians. (Does not seem to be AI generated, does not to seem to be cgi)\nSource.", "media": null, "score": 2202, "upvote_ratio": 0.82, "comment_count": 548, "over_18": false}, "48": {"id": "17kynzo", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "News", "time": 1699065367.9917157, "created_utc": 1698795273.0, "url": "https://x.com/rosscoulthart/status/1719493463321059415?s=20", "title": "[Ross Coulthart] Remember the Feb shootdowns, when US @NORADCommand fighters fired missiles at #UAPs over American airspace for the first time in its 65 year history? There's much more to that story, which I reveal on @NewsNation with @EVargasTV this Thursday 6pm.", "permalink": "/r/UAP/comments/17kynzo/ross_coulthart_remember_the_feb_shootdowns_when/", "selftext": "", "media": null, "score": 405, "upvote_ratio": 0.92, "comment_count": 141, "over_18": false}, "49": {"id": "17l7xgf", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "supergodmasterforce", "link_flair_text": "Disappearance", "time": 1699065368.465086, "created_utc": 1698829481.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/17l7xgf/its_not_too_late_to_come_forward_twenty_years_on/", "title": "\"It's not too late to come forward...\": Twenty years on, a new appeal is launched. What happened to Charlene Downes? The mystery of a missing 14-year-old girl from Blackpool, UK", "permalink": "/r/UnresolvedMysteries/comments/17l7xgf/its_not_too_late_to_come_forward_twenty_years_on/", "selftext": "Lanacashire Police have recently launched a new campaign for information on the disappearance of 14 year old Charlene Downes.\nIt is believed that she was murdered however no body has ever been recovered or information given leading to a conviction despite a £100,000 reward on offer. \nAs per the linked article, Charlene was last seen on November 1, 2003, having spent part of the day with her sister and then stopping to see their mum, Karen, before meeting up with friends. Extensive efforts to trace her last movements resulted in CCTV images of her walking along Bank Hey Street and later inside Carousel Bar on the North Pier.\nThe last confirmed sighting was at Abington Street at around 11pm when she parted ways with a friend near to an alleyway and various takeaway shops. Information of that final sighting was not reported to the police until months after the investigation launched.\nOn November 3, two days after she was last seen, Charlene was reported missing by Karen. In extracts of the 999 call, the mum was asked why she had not called earlier and she explained it was not uncommon for Charlene to stay at a friend's house. She also explained she had gone missing once before, around two years earlier, and on that occasion spent around four days in Wolverhampton.\nOne of the more disturbing aspects of this case is that it is alleged that Charlene was groomed by a gang of men, murdered and her body was disposed of in a horrific way.. \nIn 2007, Iyad Albattikhi, who ran the Funny Boyz takeaway in the town, stood trial for Charlene's murder. His landlord and business partner Mohammed Reveshi was charged with helping him dispose of her body.\nThe jury heard taped conversations in which it was alleged Albattikhi had joked that he killed the girl, that she was 'chopped up' and her body had 'gone into the kebabs'.\nThe jury failed to reach a verdict and a retrial collapsed after a police watchdog found the investigation by Lancashire Constabulary was 'handled unprofessionally' and plagued by a 'catalogue of errors'.\nHer mother is quoted has saying that \"\"She once came home with £70 and we couldn’t get the truth out of her. We didn’t know where it had come from. She had cigarettes too and we didn’t know who was buying them for her\"\nThis has interested me ever since I watched a documentary on the disappearance. It reminds me of Andrew Gosden in many ways. I just hope this new appeal leads to something conclusive.", "media": null, "score": 656, "upvote_ratio": 0.98, "comment_count": 88, "over_18": false}, "50": {"id": "17j4tmr", "locked": true, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "evening_shop", "link_flair_text": null, "time": 1699065368.740433, "created_utc": 1698591848.0, "url": "https://www.reddit.com/r/MorbidReality/comments/17j4tmr/over_400_children_in_ghaza_killedinjured_daily/", "title": "Over 400 children in Ghaza killed/injured daily.", "permalink": "/r/MorbidReality/comments/17j4tmr/over_400_children_in_ghaza_killedinjured_daily/", "selftext": "https://www.unicef.org/press-releases/child-casualties-gaza-growing-stain-our-collective-conscience#:~:text=NEW%20YORK%2FAMMAN%2C%2024%20October,either%20killed%20or%20injured%20daily.\nOver the past 18 days, the Gaza Strip has borne witness to a devastating toll on its children, with a reported 2,360 fatalities and a reported 5,364 injuries due to unrelenting attacks, or more than 400 children reportedly either killed or injured daily.\n\"The footage of children being rescued from beneath the rubble, injured and in distress, while trembling in hospitals as they await treatment, portrays the immense horror these children are enduring. But without humanitarian access, the deaths from attacks could be the tip of the iceberg,\" said Khodr. \"The death toll will increase exponentially if incubators start to fail, if hospitals go dark, if children continue to drink unsafe water and have no access to medicine when they get sick.”", "media": null, "score": 2204, "upvote_ratio": 0.81, "comment_count": 798, "over_18": true}, "51": {"id": "17irbdm", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Cowabongya", "link_flair_text": "Theory/Debunking", "time": 1699065369.270473, "created_utc": 1698539770.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/17irbdm/three_more_creepy_instances_with_my_motorola_phone/", "title": "Three more creepy instances with my Motorola phone.", "permalink": "/r/Thetruthishere/comments/17irbdm/three_more_creepy_instances_with_my_motorola_phone/", "selftext": "I've had many of these experiences in the past few years but these last three are especially weird. Can our phones read our minds?\nThe first one I left my phone in my bedroom and was in the kitchen (far distance away). Sleep apnea was mentioned in a conversation and a little while later on my phone I'm getting recommended sleep apnea machines. I'm not connected to any wifi either in the house. I though maybe robot vacuum but that would be WiFi ? Roku is never plugged in unless in use. Nothing else that has a connection in the area. Another phone was in the area but how would it communicate to my phone ? \nSecond one was on here and a promoted ad that was for a butter holder. I thought nothing  untill I remember seeing butter still in the wrapper on the table at dinner which is usally in a holder.  I asked one of my roommates if they had spoke about it and they had said the old holder snapped and conversed about buying a new one BUT never searched for one. \nBest for last because this one is definitely the strangest. I thought about getting new doggy steps, soft ones not like the hard ones I have now. I just thought this to myself and said it to no one. Next thing I know  4 step, soft doggy stairs are being recommended.\nIf you search for these things happening many others experience them as well. \nTry googling  \" Android phone reading mind reddit\"", "media": null, "score": 90, "upvote_ratio": 0.93, "comment_count": 68, "over_18": false}, "52": {"id": "17lqjam", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Typical-Television-9", "link_flair_text": null, "time": 1699065369.5152571, "created_utc": 1698884036.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/17lqjam/the_last_tram/", "title": "The last tram", "permalink": "/r/LetsNotMeet/comments/17lqjam/the_last_tram/", "selftext": "So this happened years ago, when I was a dumb teen (girl) who loved walking the city alone after dark. This took place in Eastern Europe, for context, in a city with a tramway system. \nOn this one night, I sat in a tram station, waiting to catch the last tram home. 3 trams stopped at this station, 2 of which went where I was going - important info for later. It was around 10pm, and as I sat there waiting, lost in thought, I barely registered a man quietly walking up and standing by the shelter. I thought nothing of it, just someone else waiting for the tram.. until I started feeling weird. The streets were quiet and dark, and there was no one else in sight, just me and this guy, and I started wondering why he chose to stand this close to me when he had so much space to avoid dealing with people. I couldn't comprehend anyone wanting to socialise this late at night, given that I was not very social myself.\nSo I glanced at him, trying not to overthink it. He was a bald-headed, beady-eyed \"giant\". Tall, and built like a bear, big belly, and big arms and legs. I was 5'2\" and scrawny, but that wasn't what scared me.. it was the fact that he was staring right at me, unblinking and expressionless, not even attempting to look away or act embarrased. No, this guy wanted me to feel uncomfortable.\nI instantly felt weak and shaky, cold shivers down my spine, this was NOT normal. I realised quickly that I was not in a good situation, I couldn't miss the last tram, walking home was out of the question, and my phone was almost dead. I was a shy kid and didn't have what it takes to scare this guy away, I knew that, but I had to at least try. I only managed to utter a small \"hi..?\", trying my best to startle him out of whatever he was thinking, but my attempt failed in the face of his silent threatening aura. He kept staring, no sign of intent to reply. He was enjoying this. Feeling the panic rising inside me, I told myself to stay calm and think rationally. Maybe he didn't hear me?\nMinutes passed, his stare continued to burn on my skin, and there was no tram in sight. ignoring him didn't work.\nSo I mustered the courage to speak once again, this time louder: \"What do you want?? Stop staring!\" No answer. He definitely heard me this time. I felt myself start to get angry. I didn't want to let this guy get to me anymore, I didn't want to continue to give him the satisfaction of watching me squirm nervously and pretend that his behaviour didn't bother me. \nI took a deep breath and forced myself to start thinking, I knew what I can't do: I can't fight him off if he makes a move, and there's nothing I can say or do that will get him to stop. I didn't know what his intentions were, but I knew they weren't good. If I tried to walk away, he would probably follow. I could run, but he would most likely catch up to me before I can tire him out, since his legs were much longer than mine. Even if I managed to somehow lose him, walking home through dark alleys, past the junkies and gypsies that were always prowling about, could land me in an even worse situation. I could pretend to call someone, but he might feel compelled to act much sooner if he felt threatened. So what can I do? The only thing I could realistically be able to do was to try and outsmart him somehow.\nSo I started developing a few plans, depending on which trams showed up, trying to confirm whether he was just amusing himself and actually waiting for a tram too, or popped over for other, more suspicious reasons, and whether i could get any kind of help. i couldn't let him see where i lived, so if he followed me i'd have to be prepared to employ whatever strategy available, and for that, i needed to stay rational and aware of my surroundings.\nWhile I was still thinking, the first tram showed up. It was one I could've taken home, but this one pulled into the depot right in my neighbourhood, forcing me to lead him to my home. I hoped he would board it and leave me be, but he didn't, he kept watching me carefully. I let the tram go, desperately hoping it wasn't the last one to head home. He continued to watch, and I sensed that he was quite happy with how things were going.\nI put up with it for another 15 minutes, trying to focus on another plan of action. I could now pretend that I needed the other tram, the one going to a different area of the city, and just ride to the next station, getting off as soon as possible, so I don't end up too far and miss the tram I need.\nThis tram showed up next. With my heart in my throat, I boarded it and sat down by the door. He got on it too, but sat himself in the back, pretty far from where I was. I let out a sigh of relief, thinking this might still go well. When the tram reached the next station, I got up and out, not looking back and hoping it was all over.. but when I stepped on the pavement and watched the tram drive away, I couldn't see him in it. I turned my head slowly and was terrified to see him walking towards me, looking slightly pissed off. He stopped just a few steps away and resumed staring, this time with a clear hint of malice, still in silence.\nMy vision blurred as I fought back tears of despair. He was not going to let me go. The helplessness I felt was unbearable, but I couldn't cry, I couldn't give up, I had to find a way, I had to get home tonight. The prospect of what might happen to me anytime now, if I didn't, was becoming too real. My head was full of unanswered questions, regrets and horrible scenarios. I wanted so badly to not have to think anymore, to not have to fight back the tears and stay composed, but I knew this would be his cue to enact whatever fucked up plan he had in mind. I couldn't let that happen. \nThen, I saw the final tram approach, the only one I could take now, and got on as quickly as my trembling legs would allow me to. When I was in, bright lights enveloping me, my mind snapped out of its nightmarish spiral of fear, and allowed me a moment of clarity. i had 3 stops to figure this out.\nI sat down at the front and looked at the driver. He was a frail old man, blisfully unaware of my distress. getting the driver's attention was a no-go. we passed one stop, there was no one else waiting to climb aboard. i turned around fully expecting to see that the psycho had followed me again, but i did not expect him to be sitting right behind me! he was not taking any chances, he was making sure i won't try anything like last time. i shot him a hateful glare and allowed my anger to overcome my fear, i stood up and purposefully walked over to another seat, in the middle of the tram car. i wanted to make it clear, i will not put up with his bs any longer. he got up too and slowly walked up to a spot 2 seats behind and diagonally from me, then sat down with the tiniest arrogant grin on his face. already expecting it, i shot up and stood by the middle door instead, determined to keep him on his toes - if i stood right by the door he won't have any idea which station i planned to get off at.\nHe remained where he was this time, conviced that I was bluffing. After all, this was really the last tram, there was nothing else I could possibly do to escape now - he must have reckoned, so my defiance was just a funny act to him.\nThis was my chance. I had to take the risk, it had to work. There were 3 doors on the tram, and they all opened and closed at the same time, and stayed opened for around 5 seconds before closing again if no buttons were pressed or people detected on the threshold. \nThe next stop - the only one left before mine - came into view. The tram slowed to a stop. \nThe doors opened. I made no move.\n5 long seconds passed. The doors started to close.\nI bolted out and ran for it, reaching the back door as fast as I could, and slamming the button to open it again. \nMy whole body tense with adrenaline, I waited a long, painful second, and jumped back in, keeping my head low, holding my breath, and crouching behind the nearest seat.\nI shut my eyes tightly and exhaled slowly while thanking the gods I didn't believe in for that button working, and wishing with all my might for him to not have seen me before I got back in. As I was waiting to hear his footsteps approaching, I pictured him frantically looking for me. Was he still on the tram, face screwed up in anger, head turning like a fat, ugly meerkat? Or was he catching his breath on the pavement of the last station, mad eyes searching the darkness for me?\nAs the tram continued its loud journey, banging and clanging in sync with my heartbeat, I dared smile to myself, imagining his face when he realised he fucked up. \nHand on my chest, I did my best to stealthily look around the corner, and found no one looking back. I stood up in excitement and threw myself at the foggy back window. there he was, standing alone and victimless on that slowly-fading-out-of-sight station, watching me leave him and his vile plans behind. Giving someone the middle finger never felt so good. \nI made it home and told no one my story, for fear I'd be admonished for my naivety, but I was safe, I was proud of myself, and I learned my lesson. \nCreepy stranger, I hope the events of that day taught you to not underestimate girls, and prevented you becoming a criminal for the rest of your life. Let's never meet again.", "media": null, "score": 126, "upvote_ratio": 0.97, "comment_count": 33, "over_18": true}, "53": {"id": "17ld1k4", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "GeneralDavis87", "link_flair_text": null, "time": 1699065369.7469482, "created_utc": 1698847937.0, "url": "https://youtu.be/QdEfjMhJiGk?si=TaZG9Rjf6lM4U-LO", "title": "Battle of Saigon 1968 - Saigon Target Zero Documentary", "permalink": "/r/MorbidHistory/comments/17ld1k4/battle_of_saigon_1968_saigon_target_zero/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Battle of Saigon 1968 - Saigon Target Zero Documentary", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/QdEfjMhJiGk?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Battle of Saigon 1968 - Saigon Target Zero Documentary\"></iframe>", "author_name": "Marvelous Movies", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/QdEfjMhJiGk/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@Marvelous_Movies"}}, "score": 3, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "54": {"id": "17lgqvz", "locked": false, "subreddit": "crimescene", "stickied": true, "category": "Crime", "author": "AutoModerator", "link_flair_text": "META", "time": 1699065369.9296725, "created_utc": 1698858018.0, "url": "https://www.reddit.com/r/CrimeScene/comments/17lgqvz/monthly_discussion_thread_november_2023/", "title": "MONTHLY DISCUSSION THREAD! | November 2023", "permalink": "/r/CrimeScene/comments/17lgqvz/monthly_discussion_thread_november_2023/", "selftext": "Welcome to the weekly discussion thread, come and talk about anything you'd like!\nA new discussion thread is posted on the first day of each month at 1 PM EST.", "media": null, "score": 13, "upvote_ratio": 0.85, "comment_count": 5, "over_18": true}, "55": {"id": "17mxibb", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "tyeishing", "link_flair_text": null, "time": 1699065370.141822, "created_utc": 1699024964.0, "url": "https://store.steampowered.com/app/1961330/Yuma_Will_Burn/", "title": "In the permadeath narrative survival game Yuma Will Burn, the world shivers when humans spend too much time physically close to each other. These shivers get worse and worse until they separate or die. No one can save you here besides yourself- If you like that concept, try the demo!", "permalink": "/r/truecreepy/comments/17mxibb/in_the_permadeath_narrative_survival_game_yuma/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.29, "comment_count": 0, "over_18": false}, "56": {"id": "17jh2mh", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "CarelessLet4431", "link_flair_text": null, "time": 1699065371.3527346, "created_utc": 1698626086.0, "url": "https://v.redd.it/jssmyvhgj8xb1", "title": "Finally a real video - lights flashing without human interaction!", "permalink": "/r/Ghosts/comments/17jh2mh/finally_a_real_video_lights_flashing_without/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 450, "fallback_url": "https://v.redd.it/jssmyvhgj8xb1/DASH_270.mp4?source=fallback", "has_audio": false, "height": 444, "width": 270, "scrubber_media_url": "https://v.redd.it/jssmyvhgj8xb1/DASH_96.mp4", "dash_url": "https://v.redd.it/jssmyvhgj8xb1/DASHPlaylist.mpd?a=1701657370%2CZDgzZjA1ZDMwYzliMzgxZGUyN2QyYzc2YThkZDZlNzA3OTUwOGY1Y2JkOTY1MDYxNzFhOTQyNzA2NzJhMTUwNA%3D%3D&v=1&f=sd", "duration": 11, "hls_url": "https://v.redd.it/jssmyvhgj8xb1/HLSPlaylist.m3u8?a=1701657370%2CMTg3OTA1YmU3YWE3NDk5ZjNkNmRlNWYyNGI0Y2EwYzFhMDg1NzU2ZTZlODUxOWQyNzFlMzcyMTQ0NjZjZGEyYw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1974, "upvote_ratio": 0.97, "comment_count": 55, "over_18": false}, "57": {"id": "17lxqln", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "EaseCurrent582", "link_flair_text": "Glitch Vid", "time": 1699065371.750461, "created_utc": 1698908416.0, "url": "https://v.redd.it/9z5xboo6uvxb1", "title": "Tree in mirror perfectly lined up with tree out windshield", "permalink": "/r/GlitchInTheMatrix/comments/17lxqln/tree_in_mirror_perfectly_lined_up_with_tree_out/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/9z5xboo6uvxb1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1920, "width": 1080, "scrubber_media_url": "https://v.redd.it/9z5xboo6uvxb1/DASH_96.mp4", "dash_url": "https://v.redd.it/9z5xboo6uvxb1/DASHPlaylist.mpd?a=1701657371%2COTg0M2NmNDU3NDllNDRhOTZkNjAwNjlmYWY0MWRjNjJiYWE3NTNjZjU1ZmVkMTllOThkNDg1ZDlhYzkwMTI2Mg%3D%3D&v=1&f=sd", "duration": 6, "hls_url": "https://v.redd.it/9z5xboo6uvxb1/HLSPlaylist.m3u8?a=1701657371%2CN2Q2ZTgzY2ViZjExYmE0MGUwODMzNTIyNWE1NzJmYmVkMmJkMGUwNjZhZTAxZWI2ZjkyYmZjNjliOWU2NmZmNQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 178, "upvote_ratio": 0.96, "comment_count": 8, "over_18": false}, "58": {"id": "17lyoln", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "IncoherentBoogNoises", "link_flair_text": "encounter story", "time": 1699065372.414626, "created_utc": 1698912886.0, "url": "https://www.reddit.com/r/bigfoot/comments/17lyoln/im_now_a_firm_believer_and_so_are_the_2_other/", "title": "I'm now a firm believer. And so are the 2 other guys that were there", "permalink": "/r/bigfoot/comments/17lyoln/im_now_a_firm_believer_and_so_are_the_2_other/", "selftext": "This is a long ass read. I apologize for writing a novel but I had to get this out there and tell people what me and 2 other guys experienced. \nAnyway, I live in the Pacific Northwest on 82 acres and it's pretty rural. My property backs up into thousands of acres of privately owned timber land (warehouser, port blakely etc). I have one neighbor about 100 yards past my house. We live on a dead end road that just so happens to end at a cemetery. My property borders said cemetery.\nA few days ago me and my buddy were loading up my truck and getting ready to go out and cut some firewood. It was about 5 AM so the sun wasn't up yet. I have a few extremely bright LED auxiliary lights on my work truck. I mean these things light up the night like it's day time. I was parked facing my open field that has a heavily wooded treeline about 50 yards away from where we were parked loading up our gear for the day. I had all 6 of my aux lights blasting out into the field so we could see what we were doing. The field was lit up like the 4th of fuckin July all the way to the treeline and then some. Directly across from my field across the one way dead end road is my neighbors house. he's about 100 yards away from my field up on a little bit of a hill. He has a perfectly clear view of my field and treeline.\nMy buddy who was with me walked off to the side of my truck to pop a piss and get rid of some coffee. I was walking towards my shop to grab more gear and I hear this weird screeching/howling sound. At first I thought my buddy was dragging something across the metal flat bed of my truck. I turned around to ask him wtf he was doing and he's staring directly into the field towards the treeline. I look where he's staring and I see something dark colored hauling ass into the treeline. At first I thought it was a black bear. Pretty common around here. Then I realize it's walking on two feet with arms swinging by it's side taking HUGE strides. As quickly as it appeared it disappeared. I'm in work mode so I continue to head towards the shop to grab my chainsaw not really registering what I had just seen. All the sudden my neighbors truck comes tearing ass out of his driveway. I'm thinking \"damn Jade (my neighbor) is in a big ass hurry to get to work this morning\". He comes flying into where my trucks parked and bails out of his truck and says \"did you mother fuckers just hear and see that shit!?!\" Before I could respond my buddy says \"dude what the fuck was that?\" And my buddy looks scared shitless. It all finally registers in my brain and I say \"what was that howl/scream? And what the fuck was that thing running into the woods?\" Neighbor Jade says \"that was a god damn big foot dude. No way in fuck it was a bear. I watched it well into the treeline and it stayed on 2 feet running like a fucking human man.\" My buddy confirms this by nodding his head and he's still white as a ghost.\nAround 5 AM I have heard that same howl/yell on several occasions. Witnessed by other people as well. Some times I can hear what sounds like big ass sticks hitting something. I'm guessing a tree since it has that solid thud sound. Oddly enough there has been a story I've heard from multiple people out here about \"8 foot tall man\". I always thought it was just some story to scare us kids. Now I'm thinking there's absolutely some truth behind it. \nI've always believed in cryptids and things of that nature. The property I live on has been in my family since the early 1900s. I inherited it a few years back. I grew up here then moved away for awhile and about 5 years ago I built a shop house on the edge of the property that's closest to the cemetery. This is unrelated to the Bigfoot stuff but I've experienced things here that I don't tell people about because they'd think I was full of shit or just insane. Anytime I have guests over and we're hanging out late something weird always happens. Recently I've had a woman's hair pulled so hard that it unsnapped the hat she was wearing. Freaked her the fuck out. Couple days later my other friend and her girlfriend were here hanging out and I was telling them about the chick that had her hair pulled. They were both chuckling a little bit thinking I was trying to scare them. And right as the clock hit 3 AM all of us heard a lady speaking clear as day through the radio. She said \"Don't laugh. It's real.\" They both freeze and look scared shitless. I look up towards the speakers where the voice came from and there is a kid size handprint on the ceiling directly above the speaker. I know it wasn't there before because I just set the speakers up that day. The hand print is still there. I have an old dump truck parked in front of my shop that looks like it came out of a horror movie. One of my other friends says she always sees a weird looking dude sitting in the truck. She calls him dump truck dude. This chick is tough as nails and I've never seen anything scare her before. She won't stay at my house past 2 AM anymore... These are just a few experiences that others have had at my house. I've personally experienced way more shit that I can't explain. \nSo yeah, I'm 100% a firm believer in Bigfoot now. People can think this is just a story but IDGAF what anyone says, I know what me and the 2 other witnesses saw.", "media": null, "score": 327, "upvote_ratio": 0.92, "comment_count": 139, "over_18": false}, "59": {"id": "17m1wux", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Quaternary23", "link_flair_text": null, "time": 1699065373.0266855, "created_utc": 1698926545.0, "url": "https://bioone.org/ContentImages/Journals/tauk/128/4/auk.2011.10271/graphic/f01_671.jpg", "title": "These photos are the only known documentation of the Imperial Woodpecker, the largest species of woodpecker that ever lived. These were taken in 1956 and show a female individual. They are most likely extinct but there’s a small chance a small population could still survive.", "permalink": "/r/Cryptozoology/comments/17m1wux/these_photos_are_the_only_known_documentation_of/", "selftext": "", "media": null, "score": 222, "upvote_ratio": 0.99, "comment_count": 23, "over_18": false}, "60": {"id": "17lhrzi", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "XxPolkadotxX", "link_flair_text": null, "time": 1699065374.0179806, "created_utc": 1698860714.0, "url": "https://i.redd.it/lgsc3bd4xrxb1.jpg", "title": "My Mothman Halloween costume.", "permalink": "/r/cryptids/comments/17lhrzi/my_mothman_halloween_costume/", "selftext": "", "media": null, "score": 154, "upvote_ratio": 1.0, "comment_count": 6, "over_18": false}, "61": {"id": "17k4wiq", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "littleponee", "link_flair_text": null, "time": 1699065375.5994353, "created_utc": 1698703077.0, "url": "https://www.reddit.com/r/conspiracy/comments/17k4wiq/a_lot_of_people_are_just_shells_of_their_former/", "title": "A lot of people are just shells of their former selves after the pandemic.", "permalink": "/r/conspiracy/comments/17k4wiq/a_lot_of_people_are_just_shells_of_their_former/", "selftext": "It’s really weird how we all moved on from the pandemic like it wasn’t a big deal. I can’t help to notice how peoples personalities have changed since the pandemic. I have found that a lot of people who used to be full of joy, and had a little sparkle in their eye now are pretty melancholy, and just dulled down. I have to admit that I feel this way as well. I’m somebody who chose not to get vaccinated and I kind of feel like the whole world turned on me, so maybe that contributes towards it but to be honest, I’m still not over what happened and it really bothers me that life just carried on like they didn’t try to steal our livelihoods by taking our jobs away if you didn’t want to get the experimental vaccine. So many friendship dynamics changed during this time in a lost trust in most people. what is it that has changed our personalities?", "media": null, "score": 1840, "upvote_ratio": 0.89, "comment_count": 568, "over_18": false}, "62": {"id": "17iklp0", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Maslakovic", "link_flair_text": "To The Stars Academy", "time": 1699065377.5000591, "created_utc": 1698519854.0, "url": "https://www.reddit.com/r/ufo/comments/17iklp0/new_tom_delonge_interview_talks_about/", "title": "New Tom Delonge interview: talks about consciousness, life after death", "permalink": "/r/ufo/comments/17iklp0/new_tom_delonge_interview_talks_about/", "selftext": "Here are some quotes:\nDeath is nothing to be scared of. Most civilizations celebrated it because they had a larger understanding of how the universe worked. I think that ancient civilizations were far more advanced than we give them credit for. And I think that their understanding of consciousness in particular is what we’re finally rediscovering now.\nThat is how the universe works. Everything that did happen can happen and will happen, is happening all at once. Time is parallel. It’s not linear; we just think it’s linear. And so you have UFOs, and you have these things that took us literally 70 years to realize: These are not crafts coming from other planets; these are crafts that are traversing the frequencies of time. And it’s complicated. We have to realize that everything we can imagine happening is actually happening. So once we build the tools to discover that, to utilize that, the world is going to change in crazy ways.\nAnd we’re going to learn that there’s multiple things interacting in our environment that have to do with frequency and consciousness and time that are beyond even just a flying saucer in the sky. There are different life forms are all over the Earth and our oceans and our forests that are of varying sizes, shapes, and probably types of consciousnesses that they share — that’s one of them.\nYou’d have no idea the ocean is a lot bigger than the jellyfish. It’s got everything in it, and things in it that make no sense that are left over from somewhere else. That’s kind of the point, is that “paranormal” just means “more than normal.” But pretty soon, it will be just normal. Frequencies of life are intersecting, and in certain locations in certain places, we will see the echoes of that. And we will interact with that. And we will understand that. We won’t call it weird. We are at a point now where it’s an inflection point on our understanding of consciousness.\nLink to interview: https://www.polygon.com/23931532/blink-182-tom-delonge-interview-monsters-california-ufos-bigfoot", "media": null, "score": 178, "upvote_ratio": 0.81, "comment_count": 200, "over_18": false}, "63": {"id": "17if25c", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Able-Opportunity-339", "link_flair_text": "Discussion", "time": 1699065378.9466865, "created_utc": 1698503686.0, "url": "https://www.reddit.com/gallery/17if25c", "title": "What is this? I took these photos this morning. Only \"star\" in the sky, it was a cloudy morning. It was there for at least 2 hours.", "permalink": "/r/UFOs/comments/17if25c/what_is_this_i_took_these_photos_this_morning/", "selftext": "I have no clue. Ask for more info if needed I guess.", "media": null, "score": 2794, "upvote_ratio": 0.86, "comment_count": 760, "over_18": false}, "64": {"id": "17kq8cz", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Bea-Billionaire", "link_flair_text": "Image 📷", "time": 1699065380.6948342, "created_utc": 1698772840.0, "url": "https://i.redd.it/u27oqzutnkxb1.jpg", "title": "Could this be why all the potential \"alien activity\"", "permalink": "/r/aliens/comments/17kq8cz/could_this_be_why_all_the_potential_alien_activity/", "selftext": "I put in quotes because I'm a skeptic but if people think it is true, and how they always come around when nukes are involved, well here you go.", "media": null, "score": 1251, "upvote_ratio": 0.82, "comment_count": 606, "over_18": false}, "65": {"id": "17k953v", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "Article", "time": 1699065381.206703, "created_utc": 1698714627.0, "url": "https://www.liberationtimes.com/home/pentagons-ufo-office-prepares-to-release-more-information-on-february-shootdowns-following-latest-annual-report", "title": "Pentagon’s UFO Office Prepares To Release More Information On February Shootdowns Following Its Latest Report", "permalink": "/r/UAP/comments/17k953v/pentagons_ufo_office_prepares_to_release_more/", "selftext": "", "media": null, "score": 230, "upvote_ratio": 0.98, "comment_count": 20, "over_18": false}, "66": {"id": "17i5o3t", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "Magoatt", "link_flair_text": "Murder", "time": 1699065381.72465, "created_utc": 1698466107.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/17i5o3t/on_october_27th_2007_donnie_farrell_was_murdered/", "title": "On October 27th, 2007 Donnie Farrell Was Murdered on the Campus of Rowan University. His Killer Despite CCTV Footage and a Unique Jacket has never been caught.", "permalink": "/r/UnresolvedMysteries/comments/17i5o3t/on_october_27th_2007_donnie_farrell_was_murdered/", "selftext": "During the later hours of October 27th 2007 Sophmore Rowan University Donnie Farrell was approached by a group of four or five people came up to Donnie who was with his friends near the Triad Apartments. Farrell was asked by the group where party’s on campus were, when he had his back turned he was sucker punched and jumped by the group. Before Donnie’s friends could react the attackers scattered leaving Donnie for dead. The attackers took bloth his wallet and cell phone. Donnie was taken to hospital but later died of a ruptured artery in his neck caused by the attack. \nPrior to the attack one of the suspects had stopped into a Xpress Mart on Route 322 and purchased cigars and was caught on camera. The suspect in the store footage authorities estimated his height was about 6 feet tall along with being between the ages of 18-24 meaning he could possibly be between the ages of 34-40 as of 2023. His clothing consisted of a Coogi hoodie and a New York Yankees baseball cap. \nWhile talking to a woman he called himself “Smoke from AC”, in that same store he was seen wearing the unique Coogie hoodie by the company Coogi. The Australian company Coogi made only 50 of the Coogi Heritage sweatshirt, the one worn by “Smoke”. The hoodies were also sold from just 23 stores in New York and New Jersey, each store was visited and no information was received. Since the attack investigators suspect that the group involved are not from the area.  \nDuring the investigation police found out Smoke had given his phone number to a woman. Once police tracked down the woman and asked for the phone number it turned out she had thrown it out due to finding Smoke creepy. Despite a search by police the paper with the phone number was never recovered. Police also checked in with local jails and nearby county’s hoping for a lead which went nowhere as nobody by the nickname “Smoke” matched the suspect in the footage.\nAs of now a $100,000 reward for information related to Donnie's case remains active. Still 16 years later Donnie’s killer has alluded justice, despite the bad breaks police who have spoken with the media hope DNA technology advancements will allow them to test what little evidence they have and hopefully lead to a conviction. \nSources: \nhttps://www.nj.com/gloucester-county/2017/10/a_misplaced_phone_number_could_have_solved_campus.html\nhttps://nj1015.com/who-killed-donnie-farrell-rowan-death-remains-unsolved-homicide-15-years-later/\nhttps://m.youtube.com/watch?v=-HmAO6WfdmE&embeds_referring_euri=https%3A%2F%2Fwww.nj.com%2F&source_ve_path=MjM4NTE&feature=emb_title", "media": null, "score": 628, "upvote_ratio": 0.96, "comment_count": 79, "over_18": false}, "67": {"id": "17itnja", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "gunz45", "link_flair_text": null, "time": 1699065382.0265036, "created_utc": 1698547718.0, "url": "https://www.reddit.com/r/MorbidReality/comments/17itnja/a_murder_i_saw_when_i_was_about_14/", "title": "A murder I saw when I was about 14", "permalink": "/r/MorbidReality/comments/17itnja/a_murder_i_saw_when_i_was_about_14/", "selftext": "https://radaronline.com/photos/tim-mcgraw-uncle-dennis-mcgraw-crime-scene-photos/?fbclid=IwAR2eQQbYMWJogRwseguERqRM3pzhkm7Rd7DEdmmM-Ssk0YuLVWSTH-8F6Gs\nI saw him chase him around the car. I remember him standing over him shooing his last shot as the guy screamed \"No!\" I remember hearing him screaming and gargling on his blood. I can't believe I was never called as a witness.\nI was watching from before they where even arguing. I saw the cop pass by, and he saw them arguing, as he drove around the block to come back the murder happened. As the cop got out of his car the guy shot the last shot in his head. I can't believe the guy is now free, I wonder if I testified if he would still be locked up.\nFor years I thought it was Jeff Gordon's uncle that shot him. No wonder I couldn't find any news about it throughout the years. A few days ago, my sister who house I was at the time of the murder, told me it was Tim McGraw's uncle that shot him. It's so crazy after all these years to see the crime scene photos. I was at the corner down the street.  I felt like I should share this but I wasn't sure where.\nIs it to late to contact Vallejo PD?", "media": null, "score": 1943, "upvote_ratio": 0.96, "comment_count": 107, "over_18": true}, "68": {"id": "17kqyd2", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Antonius_The_Seeker", "link_flair_text": "Picture/Evidence", "time": 1699065382.543756, "created_utc": 1698774748.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/17kqyd2/i_encountered_a_other_worldly_being/", "title": "I encountered a other worldly being", "permalink": "/r/Thetruthishere/comments/17kqyd2/i_encountered_a_other_worldly_being/", "selftext": "I went on this hike as a spiritual journey in Denver, Colorado.  I was there to attend the PS2023 conference. I decided to hike alone and wander around the Rocky Mountains. I took some mushrooms and planned on some weed later on. The hike was amazing and I got so many beautiful pictures. I was hiking for hours before I started heading towards a pond that a sign pointed to. It was a lot more walking than I thought and being under the influence with night approaching I began to worry. I pressed on and found my desired location and was rewarded with one of the most beautiful views I'd ever seen. it wasn't long after I arrived that I strangely heard my name being called. It was my brother and his girlfriend on top of the cliff! they somehow found me they didn't even come with me to this location although they did know I was there. We talked for a bit and I felt reassured I was safe, so I decided to smoke the weed I had. I did a dance to honor the spirits that guided my journey. as I was leaving I decided to take one last photo with my phone. I pointed it at my brother and his girlfriend on the cliff and took it. after I saw the picture I zoomed in because I was curious what it would look like and I saw an eye-looking shape I had a feeling that a being of overwhelming power was watching me and when I looked up from my phone I saw those eyes in the trees, in the sky, all around me.\nI started walking and words filled my head “Don’t doubt the power” It kept repeating. My footsteps grew heavy and I began feeling like my heart might give out. I stopped and sat on a rock not far from where I took the picture I looked up and I saw the moon between two evergreen trees, I asked the moon for protection and performed a makeshift ritual. As I believed it would help me I asked the moon to use me as her tool to aid myself and humanity. I actually felt \"the moon\" take control of my body and I entered a trance but I got too scared and broke out of it.\nIt was wild. I met up with my brother after waiting on a different rock near the car and I got déjà vu. But it was different I saw an alternate reality of sorts where I died in that moment, but it was more like I remembered I died at that moment. My heart hurt the rest of the night and sometimes I still get pain. I have gone to the doctor about it but they say I’m fine. What do you guys think of this? I have not had anything bad happen to me so far since then and I feel in good standing with all the forces I interact with. Nothing really changed since then.\nI know it is easy to write this off as a psychedelic illusion with a weird picture artifact, but I'm not sure I personally can do that. It all felt so purposeful. I have no doubt that if I had been sober this might not have happened the way it did, but my purpose on this walk was to grow spiritually. I paid respects, I danced wildly, I asked for guidance, and at the very end, I saw it. We know very little about psychedelics and humans have been using them to communicate with otherworldly beings since the shamans maybe even before them. I might be crazy but I just wanted to share this with someone.\nIf you want to see the pictures I can show you. It's that very last picture I decided to take before I experienced the weird stuff. It won't let me post the pictures", "media": null, "score": 31, "upvote_ratio": 0.8, "comment_count": 23, "over_18": false}, "69": {"id": "17mnf3l", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Raviolist123", "link_flair_text": null, "time": 1699065382.842478, "created_utc": 1698987461.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/17mnf3l/i_was_followed_for_months_by_a_man_i_had_met_at/", "title": "I was followed for months by a man I had met at the mall", "permalink": "/r/LetsNotMeet/comments/17mnf3l/i_was_followed_for_months_by_a_man_i_had_met_at/", "selftext": "I've never spoken on this, not even to my parents or anyone around me. I am a 22 year old male, this happened when I was 14 through the age of 15. My friends and I would always hang out at the local mall during our free time. One day I had arrived earlier than my friends, and was waiting at a seating area in the food court. There were a couple of couches around each other, and was a common area for anyone to come sit. So I didn't really notice when a man came over and sat at a couch across from me. I was sitting on my phone not paying attention, until he spoke up and said something along the lines of \"do you come here often?\" I looked up to see a man who was in his late 50's to 60's, I told him I often did with my friends, and he then introduced himself. I still remember his first name as it was the same as my dads. I did not get an initial weird feeling, he looked normal enough and I would have no reason to be initially weirded out by someone. So I told him my name and we started making small talk, I am a sociable person and have been since a young age so I was fine talking with what I assumed was just an older man wanting to talk to someone. He started asking me things I liked to do, I said I enjoyed going out to the local lake and fishing and swimming, to which he said he went out to the same lake every weekend and enjoyed fishing and swimming as well. I said I enjoyed making music and he said he liked making music also. I told him I was an avid piano player, and he excitingly told me he had a piano at his house.. There were a few other things I mentioned and to every one he said he enjoyed doing them also. It all felt normal right at first, but as we talked I kept getting a weirder and weirder feeling. It was almost like with everything he said he was trying to prove something and win me over. He said he had a boat at the lake and that we should go sometime, he even said that he lived right across the street from the mall, and that I was welcome to stop by and play piano. Even going as far as telling me the complex he lived in and how to get there from the mall. He even said if Id like I could go over that same day and play his piano. With every passing minute it felt like he was trying harder and harder to get me to hangout with him. Talking with him honestly gave me the weirdest primitive instinct feeling ever, like I was in the face of evil or bad intentions. after 5-10 minutes of talking with him, I lied and said my friends had arrived and that I was gonna go find them, he somewhat sadly said ok, and wished me well. A couple weeks go by and my friends and I go to the mall once again. We were all walking through the mall, when out of the corner of my eye I see the same man, in a hoodie walking past us in the opposite direction. We locked eyes for a split second and my heart immediately dropped. I didn't look back and I honestly forgot about it not soon after. But for the next 2 or so months I would keep seeing him randomly at the mall. I kept brushing it off as coincidence as there are definitely regulars at the mall who come often. So I  really did not think too much of seeing him, as he never spoke to me since the first day, I would just occasionally see him and he'd be looking at me. I was naïve and had a semi weird feeling anytime I saw him but just brushed it off. Until one day... I went to the mall with my friends, we hung out for a few hours before all leaving and going home our separate ways. I get home, and go into my room. No one else was home and I was by myself for a couple hours. My mom gets home around 7-8pm and comes into my room looking somewhat worried, asking if I noticed a guy outside. I said no, she then showed me her phone. We have 2 cameras, one in the front of the house, and one in the back. About 20 minutes after I got home, someone approached our house. We lived off a very busy street and our front wall blocks a majority of the view to the street. So we did not see a car park or anything, just a man walking up to our house from the street. The camera was located near our front door looking out to the driveway, so as he got closer I realized it was the same man who I had always seen at the mall. I immediately felt sick to my stomach, he came and looked through the front door glass. He walked over to the side of our house near our driveway and left the view of the camera. I remember there was nothing on the back camera, so he had to have stayed by the side of our house for a bit. My room was not located over there, so I have no idea what he could have been doing. He then came back around and looked through the front door again before walking away. I don't know If I was just too embarrassed or scared to say anything, but I said I did not notice and didn't know who that was. My mom found it weird that he was looking in our house, but said it could have been a homeless or a druggy because we live off a busy street with a bus stop right in front of our house, so we just went with that. My dad added more security cameras after this to deter people, and I never admitted to seeing him before. But after he showed up to my house, it was confirmed to me he was following me around and I don't know what his intentions were. He never came back to the house. We moved to a different part of the city not to long after and I was too far to go to that mall again. I have not seen him since and wish to never again. ", "media": null, "score": 116, "upvote_ratio": 0.98, "comment_count": 8, "over_18": true}, "70": {"id": "17natjt", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "YoYoB0B", "link_flair_text": null, "time": 1699065383.0989497, "created_utc": 1699061831.0, "url": "https://i.redd.it/361bcb02j8yb1.jpg", "title": "Italian Bersaglieri executing civilians in occupied Yugoslavia, 1941-43.", "permalink": "/r/MorbidHistory/comments/17natjt/italian_bersaglieri_executing_civilians_in/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "71": {"id": "17l1h24", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "TheSamiG", "link_flair_text": null, "time": 1699065383.5043428, "created_utc": 1698803706.0, "url": "https://www.youtube.com/watch?v=Yj_qx8HM06w", "title": "Origins of Halloween, and dark sides to trick or treating", "permalink": "/r/truecreepy/comments/17l1h24/origins_of_halloween_and_dark_sides_to_trick_or/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Halloween's Darkest Corners: A Closer Look", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/Yj_qx8HM06w?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Halloween&#39;s Darkest Corners: A Closer Look\"></iframe>", "author_name": "TheSamiG", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/Yj_qx8HM06w/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@TheSamiG"}}, "score": 0, "upvote_ratio": 0.44, "comment_count": 0, "over_18": false}, "72": {"id": "17m1f8j", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Karl-XI", "link_flair_text": null, "time": 1699065384.5913858, "created_utc": 1698924728.0, "url": "https://v.redd.it/bl6gaaeg7xxb1", "title": "Captured in a swedish mine called Garpenberg. Someone walking down there when it was allegedly empty.", "permalink": "/r/Ghosts/comments/17m1f8j/captured_in_a_swedish_mine_called_garpenberg/", "selftext": "I’m not the OP, source is from a swedish Facebook page. ", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/bl6gaaeg7xxb1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1052, "width": 720, "scrubber_media_url": "https://v.redd.it/bl6gaaeg7xxb1/DASH_96.mp4", "dash_url": "https://v.redd.it/bl6gaaeg7xxb1/DASHPlaylist.mpd?a=1701657383%2CM2JjZjM0ZWMxZWNlNWY1MmYxOTlhNjI0YWZmZTg5M2E0NTBlMzU5MDdhMjU2NDA0NmI0NDg3ZTc4MjJmNzE5Nw%3D%3D&v=1&f=sd", "duration": 7, "hls_url": "https://v.redd.it/bl6gaaeg7xxb1/HLSPlaylist.m3u8?a=1701657383%2CODNiMTE4YWZlOTc5MDRjYjQxNjk2NjQxMjJjNGMyOTNkNWM4MWRhODNjMWY0Y2JjMDQ0NGY1YTg4ZGM2MDBjZg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 595, "upvote_ratio": 0.93, "comment_count": 50, "over_18": false}, "73": {"id": "17mtr08", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ilovecheese514", "link_flair_text": "Glitch Pic", "time": 1699065385.029395, "created_utc": 1699013854.0, "url": "https://i.redd.it/lr6zf3ohk4yb1.jpg", "title": "when i was 6, I met two brothers. One was wearing the exact same clothes as my brother, and the other wearing the same pants as me.", "permalink": "/r/GlitchInTheMatrix/comments/17mtr08/when_i_was_6_i_met_two_brothers_one_was_wearing/", "selftext": "", "media": null, "score": 118, "upvote_ratio": 0.95, "comment_count": 6, "over_18": false}, "74": {"id": "17m329g", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "ponlork", "link_flair_text": "A.I. generated image.", "time": 1699065385.7123046, "created_utc": 1698930341.0, "url": "https://i.redd.it/y9x36zv1oxxb1.jpg", "title": "Saw this image floating on facebook recently", "permalink": "/r/bigfoot/comments/17m329g/saw_this_image_floating_on_facebook_recently/", "selftext": "", "media": null, "score": 276, "upvote_ratio": 0.86, "comment_count": 112, "over_18": false}, "75": {"id": "17kyqlr", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "MrGoldenEra", "link_flair_text": "Discussion ", "time": 1699065386.3023486, "created_utc": 1698795474.0, "url": "https://i.redd.it/y4czulo4jmxb1.jpg", "title": "Thunderbirds, Reality or Hyperbole?", "permalink": "/r/Cryptozoology/comments/17kyqlr/thunderbirds_reality_or_hyperbole/", "selftext": "Good evening everybody! I’m back with yet another discussion post. Today I’m presenting my views on Thunderbirds and whether they’re just misidentification or surviving specimen of extinct birds of prey. \nThunderbirds are birds of prey or raptor-like birds that are of extreme size, potentially as big as a jet plane to possessing wingspans of over 30 ft.\nOne of my favorite sightings of a Thunderbird was the Marlon Lowe case that occurred in the eveneing of July 25th, 1977 in Lawndale, Illinois. \nMarlon’s mother was doing her daily cleaning at their family home while her son Marlon was playing outside. To her horror she heard noises coming from the front yard and was left with the sight of a huge winged shadow overpowering her yard. Before she could even process what she was seeing she saw huge talons come down and grab Marlon from the yard and proceeded to lift him over two full feet off the ground. She struggled but she managed to fend off the bird and it had let go of her son as onlookers witnessed the event. \nShe was questioned by law enforcement of what she saw, her description was similar to that of an Andean Condor, only bigger. According to Ruth it was black in color with a white ring around the base of the neck, with a tail and wings of at least over 10 feet. \nThere have been many sightings all over the states of thunderbirds, from my hometown region of the Midwest, to even the skies of Papa New Guinea. I believe that many of these cases could be just oversized groups of condors or falcons with great wingspans. However, I believe that these birds of prey being sighted could be surviving descendants of Teratorns. Teratorns are a family of large birds of prey that lived from the late Oligocene to Late Pleistocene era. \nWhat do you guys think? I’m from Wisconsin so hearing about sightings in both Illinois and my hometown is really captivating and really is pushing me to go up north and search for a possible Thunderbird. \n(Sorry all of my posts are very lengthy, I just love the field of Cryptozoology and have a passion for it. Being able to discuss with like-minded people\nmakes it all the better). \nHave a great day!", "media": null, "score": 148, "upvote_ratio": 0.95, "comment_count": 48, "over_18": false}, "76": {"id": "17l2rjy", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "kyoko_the_eevee", "link_flair_text": null, "time": 1699065387.228194, "created_utc": 1698807721.0, "url": "https://i.redd.it/bzz0vnxjjnxb1.jpg", "title": "Got a lot of compliments on my costume at work! Figured y’all would enjoy!", "permalink": "/r/cryptids/comments/17l2rjy/got_a_lot_of_compliments_on_my_costume_at_work/", "selftext": "", "media": null, "score": 148, "upvote_ratio": 0.98, "comment_count": 10, "over_18": false}, "77": {"id": "17kwmdk", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "armedndangerous667", "link_flair_text": null, "time": 1699065388.3264709, "created_utc": 1698789601.0, "url": "https://i.redd.it/acra24sn1mxb1.jpg", "title": "i've seen claims about Israel controlling the US government, people often pass them off as conspiracy theories but to see israel openly admitting to this is bizarre", "permalink": "/r/conspiracy/comments/17kwmdk/ive_seen_claims_about_israel_controlling_the_us/", "selftext": "", "media": null, "score": 1773, "upvote_ratio": 0.92, "comment_count": 245, "over_18": false}, "78": {"id": "17m42qs", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Ad1714", "link_flair_text": null, "time": 1699065390.1153357, "created_utc": 1698933501.0, "url": "https://www.vice.com/en/article/bvjpaz/us-pentagon-ufo-uap-reporting-website-aaro", "title": "Pentagon 'Strongly' Urges Military Members to Report UFO Sightings With New Website. Can someone use a different picture, please!", "permalink": "/r/ufo/comments/17m42qs/pentagon_strongly_urges_military_members_to/", "selftext": "", "media": null, "score": 156, "upvote_ratio": 0.96, "comment_count": 19, "over_18": false}, "79": {"id": "17lixu1", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "xXinsomniakXx", "link_flair_text": "Classic Case", "time": 1699065391.3889618, "created_utc": 1698863814.0, "url": "https://i.redd.it/2up5595c6sxb1.jpg", "title": "Early ufo sighting in Nuremberg modern day Germany in 1561 also posting translation", "permalink": "/r/UFOs/comments/17lixu1/early_ufo_sighting_in_nuremberg_modern_day/", "selftext": "", "media": null, "score": 2338, "upvote_ratio": 0.94, "comment_count": 338, "over_18": false}, "80": {"id": "17j4dxu", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Emmibolt", "link_flair_text": "LMAO :snoo_trollface: (Sundays Only)", "time": 1699065393.1736772, "created_utc": 1698590614.0, "url": "https://i.redd.it/2kscixuyl5xb1.jpg", "title": "I hope they have memes", "permalink": "/r/aliens/comments/17j4dxu/i_hope_they_have_memes/", "selftext": "", "media": null, "score": 994, "upvote_ratio": 0.97, "comment_count": 46, "over_18": false}, "81": {"id": "17lq1dz", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "devoid0101", "link_flair_text": "Article", "time": 1699065393.6780906, "created_utc": 1698882718.0, "url": "https://www.theguardian.com/world/2023/nov/01/pentagon-ufos-online-reports-aaro", "title": "AARO and Kirkpatrick are gearing up to lie to the public", "permalink": "/r/UAP/comments/17lq1dz/aaro_and_kirkpatrick_are_gearing_up_to_lie_to_the/", "selftext": "The Pentagon tool to collect whistleblower testimony about UFO reverse engineering programs from government employees launched TODAY, and he is already saying no such thing exists. It’s a modern-day Robertson panel. He should be fired, and cannot be trusted. Grusch should get a Nobel prize.", "media": null, "score": 200, "upvote_ratio": 0.95, "comment_count": 23, "over_18": false}, "82": {"id": "17k9era", "locked": false, "subreddit": "unresolvedmysteries", "stickied": false, "category": "Crime", "author": "Quirky-Motor", "link_flair_text": "Disappearance", "time": 1699065394.0858715, "created_utc": 1698715420.0, "url": "https://www.reddit.com/r/UnresolvedMysteries/comments/17k9era/in_honor_of_the_international_day_of_older/", "title": "In honor of the International Day of Older Persons and in order to combat ageism in the true crime community, I wanted to share an EXPANDED collection of the stories of older people who have gone missing or whose stories are otherwise unresolved", "permalink": "/r/UnresolvedMysteries/comments/17k9era/in_honor_of_the_international_day_of_older/", "selftext": "International Day of Older Persons is held annually on October 1st, so this October, I wanted to share an EXPANDED collection of stories about missing people who are older adults. I have posted a similar thread the last few years. I wanted to share these stories for another reason, namely ageism in the true crime community, which is something I have rarely seen explicitly addressed. It is something that I have seen in this very community when someone highlights the cases of elderly individuals. It was actually some of this feedback which made me realize the need for a piece like this one. I once had a post reported by a reader because my write up on a missing 86 year old man with dementia was “not a mystery” even though his body was not (and still has not) been recovered. One commenter called the write up “low effort” and another said that there is “no mystery” when an old person goes missing, and a third said that his case was “not good content.” Last year when this was posted, 12 rude or dismissive comments were removed by the moderators. I think it is imperative that we remember as we read about real people’s stories that missing people are NOT content. They are real people who are missing and whether or not the circumstances surrounding their disappearances and final days are mysterious or mundane, their cases deserve exposure and everyone deserves to be laid to rest.\nIt goes without saying that I know most readers are nothing but compassionate and respectful to the people in these stories. Without further ado, here is a collection of stories featuring older individuals. If you know of other cases matching this criteria (let’s say those 60+) please share in the comment section below.\nMissing\nLeo Widicker, 86, of Harvey, North Dakota went missing on November 8th, 2001 from Tabacon Hot Springs, Costa Rica. Leo and his wife of 55 years, Virginia, were part of a pay-your-own way service group called Maranatha Volunteers International, a Christian group that builds homes, churches, and schools. In between two different jobs the group stopped at Tabacon Hot Springs resort for lunch. Leo was last seen sitting on a bench while his wife waded nearby, but within 20 minutes he was gone. Someone drove 10 miles down the road looking for him within minutes of his disappearance but no trace of Leo was ever found, which was especially weird as food and souvenir shops line parts of the road.\nTheories in the case abound. Some think Leo got lost and perished in the volcanic landscape, some think he was hit by a car and flew down the hill into the jungle, while others think he was picked up by someone in a vehicle who did him harm or gave him a ride to another area where he perished from either foul play or misadventure. Leo Widicker is described as a white male, 86 years old in 2001, who was 5’6” and 145 lbs. Leo has blue eyes and is mostly bald. His remaining hair is reportedly blondish- gray. He wears hearing aids and glasses and also has a pacemaker. When last seen he was wearing a white baseball cap, jeans, black shoes, a red and blue plaid shirt, a blue jacket and a name tag. If you have any information on the disappearance of Leo please contact United States Embassy San Jose, Costa Rica Office at 011-506-220-3939. His wife, Virginia, passaed away in 2023. She continued to volunteer for Maranatha until 2015.\nMy full write up on the case is here. https://www.reddit.com/r/UnresolvedMysteries/comments/pct206/he_was_last_seen_walking_down_the_road_within_ten/ https://charleyproject.org/case/leo-widicker\nDonald Richard Delaney, age 60 was last seen in King County Washington in November, 2003. His brother reported him missing after not hearing from his brother for months. Delaney may have gone to Mason county, near the Olympic National forest as he liked to frequent the area, specifically Shelton or Hoodsport. Delaney is legally blind, and suffers from type 2 diabetes. Even though he is legally blind he can reportedly see well enough to live independently but not drive. Because of his diabetes he always travels with a small red and white cooler with a lid, food, protein powder, herbal supplements, vitamins and his medication usually inside. He also carries a black leather backpack with books inside, and a small blue duffle bag sometimes with dry food or extra medication. Delaney is described as a white male, with brown eyes, and graying brown hair. His left eye is partially sewn shut and he usually wears a mustache. He is 5’10” and 220 lbs. Mason County police are investigating Delaney's disappearance, they can be contacted at 360-427-9670 ext. 313 Sources https://charleyproject.org/case/donald-richard-delaney\nRose E. Eaton, age 73, was last seen on July 25th 1994 in Chimacum, an unincorporated area in Jefferson Co. Washington state. Rose was in her son’s car waiting for him to drive her to the dentist when her son noticed that several goats had gotten loose. He told his mom to wait in the car but when he got back 10 minutes later, his mother was gone. Her purse was also missing but the family’s German Shepherd was still in the vehicle. The man looked for his mother for a few minutes but couldn’t find her and he found that the door to their home was still locked. He promptly called the police. Tracking dogs traced Rose’s scent down the dirt road for about ⅓ of a mile to the junction of the main paved road (Beaver Valley Road) when the trail abruptly stopped, leading investigators to think Rose may have entered a motor vehicle at that location.  No other trace of her has ever been found. Rose is described as a white female with gray hair and blue eyes. She is 5’9” and 160 lbs. At the time she lived with her son and had been diagnosed with dementia several years earlier but was reportedly physically in good health. She was last seen wearing a long sky blue coat with buttons down the front, a long light blue dress, a tan purse with little to no money inside, and blue rubber soled orthopedic shoes size 8.5. Rose has previously fractured her upper left arm. She has a small scar on the back of her neck and a scar on her abdomen. She is a non-smoker and non-drinker. She does not drive. Foul play is not suspected in this case but it has not been totally ruled out by law enforcement due to the scent trail found by search dogs. If you have any information please contact the Jefferson County Sheriff's Office at 360-385-3831. https://charleyproject.org/case/rose-e-eaton\nRose's son, Rick, wonders if Rose's disappearance could be related to his sister Janet's 2005 murder, which while solved, the motive is rather murky and senseless. https://www.kitsapsun.com/story/news/2022/10/14/new-charges-against-janet-eatons-killer-revives-memories-she-always-part-bremerton/10490785002/\nJerry Alan Graves was last seen on Dec. 25th 2018 and was reported missing several days later. The 69 year old was reportedly last seen walking down highway 12 away from the ranch he lived at in Clarkston, Washington. He was upset at the idea of moving into a nursing home and threatened to leave the area. It is unknown if this conversation had happened on that day or previously and who he was talking to about this potential move remains unknown. Jerry left behind all of his belongings, money, cell phone, and clothing. He is known to hitchhike between the towns of Clarkston and Pomeroy which are about 30 miles apart. The area Jerry was last seen in is a very rural area with few people near the border with Idaho. Jerry is described as a white male, 5' 7\"-5’8” and 125-130 lbs. with brown gray hair, brown eyes, and a gray beard. He was wearing a dark colored coat and blue jeans when he was last seen. He had a broken leg at the time of his disappearance. He may have had a stroke before he disappeared and was showing possible signs of dementia. If you have any information please contact the Asotin County Sheriff’s Office at 509-758-2331. https://charleyproject.org/case/jerry-alan-graves\nWalter Dunson, a WWI vet was almost a centenarian when he was reported missing in 1998. However, within a week police began to speculate that Walter Dunson had actually died or disappeared fifteen years earlier. Walter is described as a thin black male, 97 years old at the time of last contact. He was about 5’8” and weighed 150 lbs. He was wearing a light brown shirt, dark brown pants, black leather shoes and a dark blue navy pea coat. He was also carrying a black leather wallet with about 15 dollars in it. He may also have a lottery card in his possession. He wears dentures and reading glasses. In his composite he has some facial hair but in real photos he is clean shaven. Some agencies give Dunson's date of birth as July 2, 1899 or July 7, 1900. If alive he would be 122 years old today. If you have any information on the disappearance of Walter Dunson please call Cincinnati Crime Stoppers at 513-352-3040. My full write up can be found here. https://www.reddit.com/r/UnresolvedMysteries/comments/pmedho/what_happened_to_wwi_veteran_walter_dunson_did_he/ https://charleyproject.org/case/walter-dunson\nWhen researching the above case, I came upon a John Doe from Cincinnati who could be a match to Walter Dunson. According to the Ohio State ME’s office, “on 07/08/1986, the remains of a 50-99 year old black male were discovered in an abandoned apartment building on Republic Street in Cincinnati, OH. This individual measured 68\" in height and was wearing a tan long sleeved pullover shirt, a v-neck tan sweater, brown trousers, a brown belt, a tan sweater, white socks with green stripes, brown leather shoes, and a blue baseball cap.” According to Namus the building entrance was barricaded from the inside as if someone was living in the building and the man had been dead for several weeks. The man’s height, age range, and even clothing seems to match with Walter Dunson. Is it possible that Walter, who had been homeless in the past, was again living on the streets or had wandered from son’s home only to pass away while staying in this abandoned building? I have submitted Walter Dunson as a match to this man via both the Hamilton County Coroner's office and Namus. Even if this individual is not Dunson, he still deserves to have his name back. https://www.ohioattorneygeneral.gov/Files/Law-Enforcement/Investigator/Unidentified-Remains/Doe-1982\nIn June of 2018, Sharran Lee Haije, age 78, was last spotted walking down Wright-Bliss Rd off of 105th street just north of the Vaughn Civic Center in Gig Harbor, Washington. She was wearing a blue nightgown and green rubber gardening clogs. She has been diagnosed with dementia and has limited speech abilities. She may be confused and not know where she lives or how to get home. In the past she has wandered into strangers’ houses. Haije has gray hair dyed a dark red color and blue eyes. She is white and 5’6” tall and weighs between 150-165 lbs. Her last name is pronounced hay-gee and in most publications her name is spelled “Sharron.” According to Pierce County Sheriff's office, the search for Haije was started very soon after she went missing and was exhaustive. Police do not believe Haije is in the area and have reason to believe she entered a car near where she was last seen. Please call 253-798-7530 if you have any information on this case. https://charleyproject.org/case/sharran-lee-haije\nDong Chull Jung disappeared within minutes in Lakewood, Washington. The 78 year old was residing at the Golden Lion Motel on Tacoma Way in Lakewood, Washington. The establishment has long been a hotbed of criminal activity and violence since at least the 1990s. On average the police responded to incidents at the 24-room hotel over 100 times per year. November 22nd 2003 was one of those times. On that day witnesses called the police after hearing a “disturbance” in Dong’s room. When the authorities arrived, they found a giant pool of blood on the floor as well as Dong’s prescription eyeglasses, but Dong was nowhere to be found. According to the News Tribune, a paper out of Tacoma, one week before Dong’s disappearance he was granted a temporary domestic violence protection order from a Paul C. Jung, who might be Dong’s adult son. In June of 2003, someone named Hae Sung Jung, got a restraining order against Dong. Hae might be the estranged wife of Dong, but this isn’t known for sure. There are vague reports that Dong was having “marital issues'' at the time of his disappearance. Very little information is available in the case. The Golden Lion Inn was finally torn down in 2017 but the fate of the elderly man who resided within remains a mystery. Dong is described as an Asian male, with brown eyes and thinning gray hair. He is 5’6'' and weighs 135 lbs. Dong wears prescription eyeglasses but they were left behind when he vanished. If you have any information regarding the disappearance of Dong Jung please call Pierce County Crime Stoppers 253-591-5959. https://charleyproject.org/case/dong-chull-jung\nRichard Emanuel Lawrence, age 63 left his home in Portland in February of 1986 to attend a religious conference in Tacoma, Washington with his wife. On the 28th of February Richard left his hotel room to get gas for his car at about 5 pm and disappeared. Two months later, Richard’s vehicle was found abandoned on a seldom used logging road in Vadar, Washington 80 miles south of Tacoma. A newspaper from Feb. 28th and a note saying ``Will pick up car tonight or tomorrow\" were found either inside the car or near it. It is believed that Lawrence got lost while attempting to get home to Portland when he parked his car and left the vehicle. Two locals reported seeing a man matching Lawrence’s description walking down the logging road, the day after Lawrence was last seen. Both witnesses reported that Lawrence seemed to be walking somewhere and didn’t seem to be in distress. Local law enforcement thinks it is possible that he was picked up by someone on the road. Lawrence had gotten confused while driving twice in the recent past, once two weeks before his disappearance in Portland and once the day before in Tacoma. He was reportedly upset knowing he might have been in the beginning stages of dementia or another health issue.\nLawrence is described as a black male, with thinning brown hair and brown eyes. He weighed 125 lbs. and stood at only 5’ tall. He was last seen wearing a black rim glasses, with a prescription lens in the right lens; the left lens was plain glass as well as a black fur type knee length coat, black Russian style hat, white shirt with tie and black dress shoes size, 5. He had suffered a heart attack a year before his disappearance, and wore a pacemaker. He was reportedly depressed about his physical condition. If you have any information call the Tacoma Police Department at 253-591-5993. https://charleyproject.org/case/richard-emanuel-lawrence\nCecil Socrates Mann, 76 disappeared from Port Orchard, Washington in 2012. Mann was last seen at 10 am on September 15th leaving his home in his 2007 Ford Focus. Later searches indicated that fishing gear disappeared with Mann and it is speculated he left his home to go fishing. Mann was then seen 3 hours later north of his home buying gas and the clerk reported that he seemed confused or disoriented. Two days later on September 17th, Mann called his daughter on two separate occasions but the reception was so poor no one knew what he was saying. Soon after the phone was turned off and the “pings” came from the Quilcene, Washington area. Later that same day, Mann’s car was found abandoned in the next county over near a Tunnel Creek Trail about 50 miles from his home and ten miles from the town of Quilcene. The car was badly damaged presumably from the rough terrain. Tragically, no trace of Cecil Mann was ever found. Mann did not have any mental health concerns at the time of his disappearance and had never shown signs of dementia, however, he was new to the Port Orchard area and wasn’t yet familiar with the area. At the time of his disappearance he was recovering from a bout with prostate cancer.\nMann is described as a white male who is balding with some gray hair. He has blue eyes and wears bifocals with wire frames. He weighed only 135 lbs. and stood at 5’8”. He was last seen wearing a tan or green windbreaker jacket, blue jeans, gray sneakers and a watch. If you have any information please call the Kitsap County Sheriff's Office at 360-337-4642. https://charleyproject.org/case/cecil-socrates-mann\nChristine Shields Wagner, 67 years old went missing from Olympia Washington in 2016. She was last spotted leaving her home in early October of that year. Her cell phone has been turned off since she disappeared. About two weeks later her car was found abandoned at the Harmony Farm conservation easement on Johnson Point Road in Olympia. Her car was parked normally. Harmony Farm easement borders on a large wetland reserve. Christine is described as a white female with brown eyes and brown hair. She wears glasses and she is 5 ft. 3 in tall and weighs 130 to 180 lbs. In the past she has made attempts to harm herself. There is very little information available about this disappearance. Thurston County Sheriff's Office 360-786-5500 is investigating. https://charleyproject.org/case/christine-shields-wagner\nEstelle Lois Abbott of Inchelium, Washington went missing in 2017. Estelle was 83 years old and has been diagnosed with Alzheimer's. She left home with her dog, a gray or tan Pitbull named Jay, to check the mail and never returned. It is unknown if Jay was ever found. Searches on foot, horseback, and ATV started right away but no sign was ever found of Estelle Abbott. Estelle is described as a white female with blonde hair and blue eyes. She's about 5’ 7” in height, 150 lbs. and she was last seen wearing a red sweater and blue jeans. In the past Estelle has lived in Spokane, Washington and Sonoma, California and her loved ones are worried she may have tried to travel there. Estelle lived on the Colville Indian Reservation and tribal police are investigating. They can be reached at 509-634-2472. Source: https://echoespath.com/estelle-abbott/\nBernard Schieber, 86, of Yakima, Washington has not been seen since Aug. 8, 2019, when he left his home in the 2500 block of South 84th Avenue in Yakima. His black, full-size Chevrolet pickup was found a few weeks later in a closed portion of the Yakama Nation reservation. It appears to have been parked normally and not crashed or damaged. When he left his home in the city of Yakima, Bernard had only ¼ tank of gas and no money. He suffers from dementia. Bernard is described as a white male with blue eyes and gray hair. He weighs 190 lbs. and stands 5’ 11” tall. Anyone with any information about Schieber is asked to call the Yakima County Sheriff's Office at 509-574-2500. He is still missing. https://www.yakimaherald.com/news/local/man-suffering-from-dementia-still-missing-from-yakima/article_310ceb57-ac6f-54e1-aeaf-b92199d5f21c.html\nLawrence Jay \"Larry\" Riegel, 57 of Yakima, Washington worked as a carpenter and contract pilot before breaking four vertebrae, an injury that left him disabled. Right before going missing Larry had a surgery on his neck and some sources claim he was in a neck brace. Unable to work, Riegel was collecting disability and had lost his pilot license due to his injury. The last contact anyone had with Larry took place on Christmas day, 2009. He contacted several relatives and friends including a call to his mother to thank her for some clothes she bought him for the holiday. He was supposed to join his family in Yakima for a belated Christmas dinner on Dec. 26, 2009, but he never showed up or called. Riegel’s family described him as a “chatty Cathy” who talked to just about anyone and had daily phone contact with his friends and family.\nRiegel lived with his girlfriend, Ladena Mann before he went missing. Mann claimed that the couple argued on Christmas day and Riegel left the home presumably to go see his tenants. She also claimed that Riegel assaulted her either on Christmas day or on January 4th before disappearing. When Mann tried to report this assault weeks later, she was unable because she had no injuries or proof of violence. Mann used Riegel’s money and EBT card after he disappeared as well as applied for her own EBT card claiming she still lived with Larry. Mann was charged with welfare fraud and perjury, but charges were dropped when she paid back the money and entered a diversion program. In one media interview she claimed that Larry is still alive and that he has “contacted several people” since going missing. She called some of Larry's former coworkers and his boss to share this information. She thinks Larry is residing in Idaho or Montana and has accused his family of knowing where he is. Ladena Mann is a person of interest in Larry’s disappearance, the last known people to have spoken to him.\nRiegel’s family is offering $25,000 for information in the homicide investigation that leads to his remains. They have billboards all over the Yakima valley asking for information. Larry’s mother, aged in her 90s, still drives around rural areas searching for his body.\nRiegel is described as a white male with gray hair, a gray mustache, and hazel eyes. He is 6’2'' and weighs 200 lbs. He has surgical scars on his left knee and a prominent vertical scar on his neck from recent surgery to fix four broken vertebrae. He often wears eyeglasses and he has a limp in his left leg. He is also an alcoholic who frequented neighborhood bars. He has lived in Yakima his whole life.He may wear a neck brace. The Yakima Police Department (509-576-6573) is investigating.\nThe last time I wrote about this case, most articles mentioned that Riegel’s last phone call took place at approximately 5:30 pm on Christmas day. It is believed that the call was made to Riegel’s tenants who rented a farm from him in Union Gap, a town on the Yakama reservation. His tenants owed him $3000 in back rent. However, this is no longer reported in the most recent articles. I am not sure how important this is but I wanted to mention it nonetheless. https://charleyproject.org/case/lawrence-jay-riegel\nDonnie Sampson, 71, a well-known religious leader, had been serving for eight years on the Yakama Tribal Council’s Code of Ethics Committee when he disappeared in the fall of 1994 while hunting elk about 45 miles west of White Swan, Washington, near Mt. Adams. Donnie had a heart problem and had been prescribed nitroglycerin as a result. Right before his disappearance, he told his daughter that he (and the ethics committee) “was getting into something that’s going to make everybody mad.” He even went so far to tell her that he would be “making enemies” and that she and the community would hear about his findings soon enough. He had been investigating rumors of corruption in the tribal council and the housing authority before he went missing, but other committee members refused to elaborate on the matter.\nDonnie’s truck was found Oct. 30, 1994, in the foothills of Mount Adams by volunteer searchers, but searchers found no trace of Sampson. His nitroglycerin, lunch, clothing and three rifles were found in his truck. A fourth rifle he left home with disappeared with him. Donnie’s children say tribal police have done little to investigate the disappearance, which they believe is a result of foul play. For example, his children were never interviewed and his truck was found by volunteers, not official search and rescue. Tribal authorities believe that the elderly Sampson simply got lost while hunting. There are no photos or description of Donnie Sampson available. Tribal police are investigating. https://www.yakimaherald.com/news/local/relatives-friends-of-missing-and-murdered-indigenous-women-gather-to-honor-them/article_3ecdbfb9-6622-591e-b32e-72e5eedf2a5e.html\nRobert \"Bob\" Harrod, has been missing since 2009, when he was 81, from his Placentia, Ca. home. His disappearance was featured on an episode of Disappeared. He'd recently reunited with and rather quickly married his long-lost love after having been apart for more than 50 years. Bob was in the process of preparing his house for her to move from Missouri to California. As she was packing her things halfway across the country, tragedy struck: Bob abruptly vanished. His disappearance and probable death were most likely at the hands of someone he knew and trusted. Bob was quite wealthy at the time he went missing, which lends some credence to this theory. He had previously been involved with a woman who allegedly owed him more than $80,000; in addition Bob's own children and other family members were said to be very unhappy with Bob's new and sudden marriage and a heated \"family meeting\" regarding Bob's estate and assets supposedly occurred just prior to his disappearance. Bob is described as a Caucasian male with gray hair and blue/gray eyes. Harrod keeps his hair very short and he is bald on the top. His nickname is Bob. He is supposed to wear eyeglasses, but they were left behind. He is 5’11” and weights 140-170 lbs. He has last seen wearing white shorts, a white v-neck undershirt, white knee socks, a white belt, a white hat, white Reebok sneakers, a plain gold wedding band on his left ring finger and possibly a Masonic ring with a red stone and a Masonic symbol on his right ring finger. In 2019 two \"persons of interest\" were arrested but later released. There have been no other updates. Here's a link to his Charley Project- Robert Harrod\nVincent Wesselmann, 75, of Breese, IL was last seen at around 5 pm on April 21st, 2011. He was walking to the post office. He was single and lived alone, although he still lived near his siblings and many other family members. His bike, wallet, and car were at his house, and he had his church clothes laid out for the next day. He was a recent retiree who had money in the bank and his home was paid off. Vince enjoyed gardening and volunteering. He was active in his local church and with several charitable organizations. Vince is described as a white male, 75 years old, 5'9-6'0\", 210-235 pounds, with thinning gray-brown hair, blue eyes. He was possibly wearing a dark blue baseball cap, watch, dark blue pants, and black heavy ankle work shoes. He was declared legally dead in 2018 and no trace of him has ever been found. https://www.riverbender.com/articles/details/today-marks-10-years-since-vincent-wesselmann-vanished-from-breese-illinois-49611.cfm A full write up can be found here. https://www.reddit.com/r/UnresolvedMysteries/comments/yg4ge2/vincent_wesselmann_spent_all_of_his_time/\nMarian “Mimi” Wallace was a 71 year old Alzheimer or dementia sufferer, who went missing from her care home on Bribie Island, Queensland, Australia in September 2014. She was likely missing for up to two hours by the time someone noticed her gone. The family had warned the facility she was a wanderer. Sadly, Mimi has never been found. She has gray hair, blue eyes, and has previously injured her hip. http://www.australianmissingpersonsregister.com/MarianWallace.htm\nAnnie Laurie Hearin was a 72 year old woman who was kidnapped and presumably murdered in 1988. The prime suspect was convicted of kidnapping but not murder, and her body has never been found. It's a strange case involving multiple suspects and accomplices, and a ransom letter from Annie herself begging her husband to save her. The case is tough to summarize so I would suggest you read the whole story here. Annie is described as a white female with auburn hair and gray eyes. She weighed 120 lbs. and stood at 5’4”. She has scoliosis and arthritis.\nPeter Achermann, was 82 at time of disappearance on July 24th, 2009. He was last seen in his car crossing the bridge on Warner Rd in Staples, MN between 12 and 1 pm that day. He had been doing errands and was expected home by 2 pm. The next day, his car was later found stuck in the mud off Country Road 32 in a town about ten miles from his home. Groceries and medicine he had bought for his wife the day before were found in the car. The area was so muddy it was determined that Peter couldn’t have gone very far. Despite extensive searching, no trace of Peter was ever found. At the time of his disappearance, Peter was in good mental health and he did not have Dementia or Alzheimer's disease. He had, however, had a hip replacement and walked with a cane as a result. Peter is a native of Switzerland and was in the US on a green card. When he disappeared he was only carrying $30, his driver's license, and his green card. He had been married for 50 years and had 11 children (8 who were still living), 13 foster children, and 23 grandchildren. He was supposed to attend his granddaughter's wedding the next day and give a speech but he never arrived. Peter is described as a white man who was 5’7” and weighed 170 lb. He has jaundice, which is a condition which makes your skin yellow. He has no other medical conditions that require treatment or daily medication. He has gray hair, brown eyes, a full set of dentures, a strawberry colored birthmark on the back of his neck, glasses and a long salt and pepper colored beard. He has a scar from his hip replacement surgery and walks with a cane. He was last seen wearing a tan and brown cotton button-down shirt, Tan cargo pants, boxers, a leather belt with a Native American saying printed on it, tan socks with rust-colored toes, brown Dr. Scholl's shoes with Velcro closures, a floppy red, white and blue crocheted beret, and silver crucifix necklace. https://charleyproject.org/case/peter-achermann\nNellie Herriott, was 96 years old, when she was last seen getting off a bus in Whitehawk, Brighton in the UK in April, 2012. She has never been found. She is white and described as thin and only 4ft 9in tall. Her family has a Facebook page and they are still looking for her. https://www.bbc.com/news/uk-england-sussex-27135935\nMaud Crawford, age 63, was last seen in Camden, Arkansas on March 2nd, 1957. Maud was a one the of the first female lawyers in Arkansas and she had a reputation for helping others such as defending an elderly woman named Rose, who Maud believed was being taken advantage of by her extended family. Maud's case was very publicized and is very convoluted. Rather than try to summarize it, you can read about it here. Maud is described as a white female, 5’5” and 165 lbs. She has graying red hair, glasses, and pierced ears.\nEva Mae Hale, 79, of Terre Haute, Indiana was visiting her brother’s grave at the Marco cemetery in the town of Marco on October 15th, 1996 when she inexplicably vanished. Eva was visiting to decorate the grave with a pumpkin and to visit the graves of several family members who were buried there. She normally visited about three times a year. She always parked in the same spot, about 40 feet from her brother’s grave. A local called the police when he noticed the car had been there all day. It is a pretty rural area with police claiming that one afternoon during the investigation only three vehicles drove by on the road. When contacted, Eva’s son Guy went to search for his mother and he realized that her car was parked in a different spot than she normally parked in but her keys were on the ground where she normally parked. Her purse was on the front seat and a few dollars were found hidden inside. She normally carried her cash in a bank envelope but no envelopes were found in the car. Police used searchers and a helicopter to search for Eva but nothing was ever found. Police believe foul play is involved and believe her disappearance might be connect to the murder of a 88 year old woman three months earlier and two other women who disappeared in the several years beforehand. Her son Guy and other family members are still searching for Eva. Eva is described as a white female who was 4’10” and weighed 98 lbs. She has thinning brown hair with some gray and blue eyes. She wears glasses and her ears are pierced. Eva Mae Hale Charley Project Her son’s site Previous thread by u/TrueDilemma\nKay Wood, age 72, was last seen on July 30, 2011. Late that evening firefighters responded to fire at the Woods' home. Her husband's, James William \"Bill\" Woods, body was found in the burned rubble of their home. He had been murdered. The couple's car was located 200 miles south of their Norwalk, Iowa home, in Kansas Cit,  Missouri. It had been abandoned at an apartment complex by a tall man with gray hair. A detailed article can be found here. https://iowacoldcases.org/case-summaries/bill-and-kay-wood/\nAn unidentified decendent known as Grandma Doe was found drowned in the Niagra River on  September 26, 1995. You can read about her here. https://www.doenetwork.org/cases/511ufny.html\nIn 2021, Glenda Parton aged 80 went missing while looking for her missing son, Dwayne Selby. Sadly, both bodies were found together in August of 2023. The duo was found near the body of another man, their friend Jack Grimes. The bizarre case is now a triple homicide investigation. Article here-https://www.koamnewsnow.com/news/crime/2-bodies-found-oklahoma-missing-persons-case-now-triple-homicide/article_e35874de-3c80-11ee-a106-4fd45f5f462e.html", "media": null, "score": 482, "upvote_ratio": 0.95, "comment_count": 48, "over_18": false}, "83": {"id": "17lgznz", "locked": false, "subreddit": "morbidreality", "stickied": false, "category": "Crime", "author": "morbidology", "link_flair_text": null, "time": 1699065394.3862681, "created_utc": 1698858619.0, "url": "https://www.reddit.com/r/MorbidReality/comments/17lgznz/ronnie_paris_was_removed_from_his_parents_care/", "title": "Ronnie Paris was removed from his parents’ care for abuse. He was returned to them two years later. Within two months, his father beat him to death; he feared he “might be gay.” He was just three-years-old.", "permalink": "/r/MorbidReality/comments/17lgznz/ronnie_paris_was_removed_from_his_parents_care/", "selftext": "https://morbidology.com/ronnie-paris-a-dcf-failure/", "media": null, "score": 1852, "upvote_ratio": 0.98, "comment_count": 70, "over_18": true}, "84": {"id": "17l655a", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Impressive-Union-234", "link_flair_text": null, "time": 1699065394.8920102, "created_utc": 1698821007.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/17l655a/footsteps/", "title": "Footsteps", "permalink": "/r/Thetruthishere/comments/17l655a/footsteps/", "selftext": "When I was around 8 or 9 I used to sleep with my father so,one day I woke up at around 12pm just to hear footsteps on my stairs I used to hear it for 1month then it just stopped (it was loud and clear), but when I turned 13 i heard it for last time it stills creeps me out.", "media": null, "score": 10, "upvote_ratio": 1.0, "comment_count": 2, "over_18": false}, "85": {"id": "17jk7z2", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Simple0nes", "link_flair_text": null, "time": 1699065395.141306, "created_utc": 1698635968.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/17jk7z2/clown_in_the_woods/", "title": "Clown in the woods?", "permalink": "/r/LetsNotMeet/comments/17jk7z2/clown_in_the_woods/", "selftext": "I’m from the UK if that’s any context. So way back in 2016 when the whole killer clown epidemic was huge, I was walking through the woods at around 10pm alone in order to get to a party/gathering that was happening in a secluded part of the forest.\nIt was almost pitch black and I could barely see in front of me besides the flash on my phone and everything seemed normal as I was walking to the party. I got to a long stretch of woods with no defined path but it was the quickest way to the party so I took it. As I got around mid-way through, I heard something to my left. I turned and saw a shadowy figure sat on a fallen log. I was understandably unnerved but I couldn’t make out if it was just shadows from the moonlight or if it was an actual person. I made the mistake of shining my phone light directly at it and I was instantly terrified.\nSat there, alone in the middle of the woods was a large-ish man dressed as a clown with full face-paint and sporting the creepiest smile imaginable.\nI tried to call 5 different people as I was passing him and then I heard him get up behind me. I instantly started sprinting towards the end of the long stretch onto a path which had a barbed wire fence down the side of it. During the sprint I was pretending to be on the phone with one of my friends and I could hear him running after me but there was no chance in hell that I would be turning around to see if I was right. When I got to the path I jumped over the fence as fast as I could and sliced my hands open as I did so. I then turned around and kept running backwards as I saw the clown, stood behind the fence just staring at me and smiling. I didn’t stop running until I got to the party and I was scared for a very long time after this.\nYou have to bear in mind that there were so many rumours of people being killed by people dressed as clowns at the time and while I will never know if the man had evil intentions or was just trying to scare me, it was extremely strange and scary to live through. So in conclusion, killer clown man from the woods, let’s not meet.", "media": null, "score": 102, "upvote_ratio": 0.96, "comment_count": 12, "over_18": true}, "86": {"id": "17lx7jj", "locked": false, "subreddit": "morbidhistory", "stickied": false, "category": "Crime", "author": "GeneralDavis87", "link_flair_text": null, "time": 1699065395.4113717, "created_utc": 1698905995.0, "url": "https://youtu.be/ET4TOqFXUDg?si=S3ie9EAqqgQNMv0n", "title": "Gulf of Sidra Incident Footage", "permalink": "/r/MorbidHistory/comments/17lx7jj/gulf_of_sidra_incident_footage/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Gulf of Sidra Incident Footage", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/ET4TOqFXUDg?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen title=\"Gulf of Sidra Incident Footage\"></iframe>", "author_name": "Future of Tomorrow", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/ET4TOqFXUDg/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@futureoftomorrow4354"}}, "score": 1, "upvote_ratio": 0.67, "comment_count": 0, "over_18": false}, "87": {"id": "17l9bhp", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Affectionate-Leek421", "link_flair_text": null, "time": 1699065396.8803532, "created_utc": 1698835660.0, "url": "https://i.redd.it/wrqlpfjmupxb1.jpg", "title": "Took very ghostly image of my son. Cameras do weird things, guys. Posting for example", "permalink": "/r/Ghosts/comments/17l9bhp/took_very_ghostly_image_of_my_son_cameras_do/", "selftext": "", "media": null, "score": 517, "upvote_ratio": 0.92, "comment_count": 43, "over_18": false}, "88": {"id": "17l349m", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "viresbot", "link_flair_text": "Glitch Pic", "time": 1699065397.3109593, "created_utc": 1698808871.0, "url": "https://i.redd.it/a85x3txymnxb1.jpg", "title": "I think someone forgot to assign this asset a name", "permalink": "/r/GlitchInTheMatrix/comments/17l349m/i_think_someone_forgot_to_assign_this_asset_a_name/", "selftext": "", "media": null, "score": 87, "upvote_ratio": 0.96, "comment_count": 3, "over_18": false}, "89": {"id": "17kp7pf", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "BoonDragoon", "link_flair_text": "humor", "time": 1699065397.9548175, "created_utc": 1698770128.0, "url": "https://i.redd.it/k4p78mlrfkxb1.png", "title": "Sasquats sighting at my local gym. Legitimate???", "permalink": "/r/bigfoot/comments/17kp7pf/sasquats_sighting_at_my_local_gym_legitimate/", "selftext": "", "media": null, "score": 172, "upvote_ratio": 0.76, "comment_count": 58, "over_18": false}, "90": {"id": "17lk72l", "locked": false, "subreddit": "cryptozoology", "stickied": true, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Lore ", "time": 1699065398.5778828, "created_utc": 1698867158.0, "url": "https://i.redd.it/sxvbo1s7gsxb1.png", "title": "The Eastern Cougar: Cryptid of the Month (November 2023)", "permalink": "/r/Cryptozoology/comments/17lk72l/the_eastern_cougar_cryptid_of_the_month_november/", "selftext": "", "media": null, "score": 128, "upvote_ratio": 0.98, "comment_count": 20, "over_18": false}, "91": {"id": "17i3r2w", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Evkami", "link_flair_text": null, "time": 1699065399.5991745, "created_utc": 1698459291.0, "url": "https://i.redd.it/nv5gbcrhruwb1.jpg", "title": "Time to get weird", "permalink": "/r/cryptids/comments/17i3r2w/time_to_get_weird/", "selftext": "", "media": null, "score": 134, "upvote_ratio": 0.96, "comment_count": 15, "over_18": false}}}