{"_default": {"1": {"id": "1haawzw", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Left_Ad_7088", "link_flair_text": null, "time": 1734145808.9375398, "created_utc": 1733754497.0, "url": "https://i.redd.it/x5j2op892u5e1.jpeg", "title": "I am Korean, and I think my ancestors may have witnessed UFOs", "permalink": "/r/ufo/comments/1haawzw/i_am_korean_and_i_think_my_ancestors_may_have/", "selftext": "During the Joseon dynasty, when Korea was known as Joseon, the royal court had a tradition of recording everything, even if the king didn't want. This tradition resulted in the Annals of the Joseon Dynasty (aka Joseon Wangjo Sillok), a comprehensive historical record. Among its entries, I found something strange—it seems my ancestors may have witnessed UFOs. Here’s the excerpt:\nKing Gwanghae\nAugust 25\n“In Gangneung, an object resembling a gourd bottle appeared in the sky, with a pointed top and a large bottom. It seemed to fall towards the ground, as if about to crash. It was red in color, and as it passed, a white aura emerged in its trail. After the object disappeared, a thunderous sound was heard.\nIn Yangyang, at Kim Mun-wi’s house, something round and shiny, like a washbasin, suddenly appeared. It seemed to descend to the ground but then rose back into the sky.”\nAccording to the Annals of the Joseon Dynasty, this phenomenon was observed on Tuesday, September 22, 1609 (the 25th day of the 8th lunar month in the first year of King Gwanghae’s reign), between 9 a.m. and 3 p.m. (from ‘Sasi’ to ‘Misi’, which is the way Korea measured time in the past) in the areas of Seoul, Pyeongan Province, and Gangwon Province.\nWhat do you all think about this?", "media": null, "score": 6140, "upvote_ratio": 0.97, "comment_count": 236, "over_18": false}, "2": {"id": "1hd2d3h", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Aza_Never", "link_flair_text": "Photo", "time": 1734145810.0741756, "created_utc": 1734057558.0, "url": "https://i.redd.it/r8acurye3j6e1.jpeg", "title": "911 calls of a “drone down” in Morris, northern New Jersey", "permalink": "/r/UFOs/comments/1hd2d3h/911_calls_of_a_drone_down_in_morris_northern_new/", "selftext": "Someone go check it out ☠️", "media": null, "score": 14841, "upvote_ratio": 0.87, "comment_count": 4199, "over_18": false}, "3": {"id": "1h900p1", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "d-slam", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1734145811.9672194, "created_utc": 1733599404.0, "url": "https://i.redd.it/nphaer539h5e1.jpeg", "title": "Ok shits starting to get real!", "permalink": "/r/aliens/comments/1h900p1/ok_shits_starting_to_get_real/", "selftext": "", "media": null, "score": 12627, "upvote_ratio": 0.74, "comment_count": 1486, "over_18": false}, "4": {"id": "1hcuxpe", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": "Video", "time": 1734145813.8284543, "created_utc": 1734036475.0, "url": "https://v.redd.it/0w3w0a4och6e1", "title": "White House Just Blatantly Denies Jersey Drone Wave. This happened today during a press conference ", "permalink": "/r/UAP/comments/1hcuxpe/white_house_just_blatantly_denies_jersey_drone/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/0w3w0a4och6e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/0w3w0a4och6e1/DASH_96.mp4", "dash_url": "https://v.redd.it/0w3w0a4och6e1/DASHPlaylist.mpd?a=1736737812%2CYjQzNmZhYmM3Mzc0NmY4NDAxMzAyNWJlMzQ1M2Y1NDQ1Mzc1MWY3NzdiNmMyYzc4MGUyYWUzZjg5NzNjNWUxNA%3D%3D&v=1&f=sd", "duration": 117, "hls_url": "https://v.redd.it/0w3w0a4och6e1/HLSPlaylist.m3u8?a=1736737812%2CODRlMDc3MDY3MTkxNDMxMDNhNTM2OTgxMTBiM2IzMzQ5NDJkNjE0YjRmMTg3NmIxMDUyMTFiYjlhMTAwZWY5Ng%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1593, "upvote_ratio": 0.92, "comment_count": 551, "over_18": false}, "5": {"id": "1h98gua", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "HUGE-Dip", "link_flair_text": null, "time": 1734145815.1778274, "created_utc": 1733624049.0, "url": "https://i.redd.it/n5shjf8daj5e1.jpeg", "title": "December 1994: A scientist discovered how to manipulate reality. 12 hours later, he vanished.", "permalink": "/r/conspiracy/comments/1h98gua/december_1994_a_scientist_discovered_how_to/", "selftext": "December 1994: A scientist discovered how to manipulate reality.\n12 hours later, he vanished.\nHis lab was emptied.\nHis research - erased.\nHis body - never found.\nSome say the CIA “disappeared” him. Some say his experiment failed.\nMeet Dr. Jacobo Grinberg.\nHe was no ordinary scientist. \n- A psychologist and consciousness researcher\n- He explored telepathy and extraocular vision\n- He bridged ancient shamanic wisdom and quantum physics \nGrinberg proposed that reality is not what it seems. We don’t just observe the world. We create it.\nHe believed that our brains interact with an “informational matrix”—a hologram where perception and consciousness merge.\nHe even proved it:\nIn physics, the Lattice is the structure that underpins space-time.\nGrinberg gave this a new meaning.\nHe claimed that by tapping into this lattice through consciousness, we could change space-time itself.\nThat’s bending reality is not an illusion, but a conscious act.\nHis theory was called Syntergy—a blend of synthesis and energy.\nDr. Grinberg’s research discovered:\n- Our brains decode reality, forming a bridge with the lattice\n- Conscious thought can create changes in space-time\n- We’re participants, not spectators, in reality\nIf the brain’s “neuronal field” syncs with space’s energy field, consciousness could affect the fabric of existence.\nThink about that:\nYour mind, altering the blueprint of reality itself.\nThis theory challenges everything we know.\nGrinberg’s work mirrored the “implicate order theory” by physicist David Bohm.\nBohm described space as a “holographic sea of potentialities”—where the universe and consciousness unfold together.\nBut, Grinberg’s ideas could explain nonlocality: instant connections beyond space.\nHe didn’t just theorize.\nHe experimented.\nDr. Grinberg conducted telepathy tests, proving that two meditating brains could sync—showing identical brain patterns without physical connection.\nHe called this phenomenon Transferred Potential (TP).\nGrinberg’s fieldwork with Mexican shamans revealed astounding abilities.\nThey could “see” without eyes, heal with intention, and manipulate reality.\nHe believed these practices showed a highly neurosyntergic brain, capable of altering the hologram itself.\nImagine having a brain so synchronized, it warps reality.\nGrinberg’s studies hinted at a chilling conclusion:\nWe inhabit a Matrix.\nNot just metaphorically, but as an energetic construct shaped by collective thought.\nAnd mastering it meant… transcending it.\nDecember 8, 1994.\nDr. Jacobo Grinberg vanishes.\nNo signs of struggle. No evidence. Nothing.\nHis wife claimed innocence.\nInvestigators were left baffled.\nRumors flew:\n- CIA involvement\n- Rivalry abduction\n- A self-experiment gone wrong\nHis final paper contained this warning:\n“When you understand how The Lattice works you may simply… disappear.”\nIs this ascension?\nYe shall be as Gods on Earth.\nDo you see how powerful we all are? Do you now understand how much religion banning pretty much everything keeps us mentally in the dark ages?\nThere isn’t much more to this, but I believe Terrence Howard figured out the lattice of the flower of life, the oldest symbol on earth.\nAnd we still think the ancients were retarded.\nWake up everyone!", "media": null, "score": 7951, "upvote_ratio": 0.92, "comment_count": 1212, "over_18": false}, "6": {"id": "1hb376w", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Disastrous_Monk_4079", "link_flair_text": null, "time": 1734145815.3684487, "created_utc": 1733841566.0, "url": "https://i.redd.it/zrzvjla5916e1.jpeg", "title": "Anti vaxx cartoon from 1892 ", "permalink": "/r/conspiracyfact/comments/1hb376w/anti_vaxx_cartoon_from_1892/", "selftext": "", "media": null, "score": 6, "upvote_ratio": 0.75, "comment_count": 3, "over_18": false}, "7": {"id": "1ha8p3i", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Jake_Monr0e83", "link_flair_text": "humor", "time": 1734145815.9209514, "created_utc": 1733747620.0, "url": "https://i.redd.it/f84lhu3tht5e1.jpeg", "title": "Got Bigfoot on camera again.. 😂", "permalink": "/r/bigfoot/comments/1ha8p3i/got_bigfoot_on_camera_again/", "selftext": "", "media": null, "score": 1728, "upvote_ratio": 0.95, "comment_count": 71, "over_18": false}, "8": {"id": "1h9kexl", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Realistic-mammoth-91", "link_flair_text": null, "time": 1734145816.4331377, "created_utc": 1733669437.0, "url": "https://www.reddit.com/gallery/1h9kexl", "title": "My opinion on woolly mammoth sightings", "permalink": "/r/Cryptozoology/comments/1h9kexl/my_opinion_on_woolly_mammoth_sightings/", "selftext": "In many sightings (especially ones where the animals are in water) it can be interpreted that those are frozen specimens that had died a long time ago (like 10000 years ago) this could explain a good amount of reports. Others like the ones based on stories can be passed on the generations when mammoths were still roaming the regions in this world.\nWhat is your explanation ?", "media": null, "score": 477, "upvote_ratio": 0.98, "comment_count": 57, "over_18": false}, "9": {"id": "1h9zo1o", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Plaidweasel", "link_flair_text": "Possible abduction", "time": 1734145816.6065018, "created_utc": 1733711920.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1h9zo1o/1996_eastern_canada_encounter_with_sandown_clown/", "title": "1996, Eastern Canada, Encounter with Sandown Clown", "permalink": "/r/Humanoidencounters/comments/1h9zo1o/1996_eastern_canada_encounter_with_sandown_clown/", "selftext": "For the sake of not just forwarding to my post on another Reddit group, I will just repeat it in full here.\nAt 5, I encountered, spoke to and physically touched the Sandown Clown\nMy experience was the subject of a listener episode of the Cryptonauts Podcast, but I will do my best to give the CliffNotes of my experience:\nAt the time of the event, I was 4 or 5 years old and the sun was beginning to descend, so late afternoon at best. My memory of what happened sticks out because it would shape the things I would draw as I grew older. I was sitting on a large boulder in my grandparents backyard. It had been dug out some time before me to make way for a large decorative fishpond that by my time, was rarely used except to entertain me. My grandfather had just gone inside, and I knew enough to not go swimming in the gross water.\nIt was at this moment I heard a noise to my right and turned. To the right of my grandparents home was the neighbors massive field. I can't remember what crop they grew, but the tall grass at the time probably means it hadn't been used in a while. Standing in the grass was a figure, with a scarecrow pose. Arms out, straight body. His hat was cone-shaped, his face features wooden. He had a Jack-o-lantern face with an empty nose hole, but he still looked alive. But when he talked, his mouth didn't move. I could hear him in my head, like telepathy. He gave off major clown vibes, which I was comfortable with as both parents did charity events as clowns.\nI would say he was roughly 6-7 feet tall, with wide shoulders. He wore \"scarecrow clothes\", with patches of bright colors over pale brown and black. But what he said to me was what your podcast resparked in my memory, and left me with the distinct knowledge that not only was I not the only one anymore to have seen him, but that a vivid experience could have been something more sinister.\nHe waved a wooden hand and I heard a voice say, \"Hello, Sam. We are all colors?\"\nI remember distinctly that he asked it as a question, and I responded with, \"My name is Luke, not Sam.\" I wasn't scared, I felt calm and relaxed until the end of the encounter.\nHe pointed at himself, and did a short bow, then reached out into the field next to him and opened a door. The door had not been there before, and was not attached to anything. I could see inside the gap of the door, and the room inside was green, with wooden chairs.\nHe motioned for me to come with him. I remember getting up off the boulder, walking with him through the door, and being enveloped by bright red and green Christmas lights. They were as bright as the sun, and I had to close my eyes to keep from going blind, or so I thought.\nI woke up laying on my grandparents couch. It was dark outside, and my parents rushed in when I called out to them. They had found me half an hour before, asleep in the middle of the field, having called for me and not hearing me answer when things got dark\nIt was last year when I first started hearing about the Sam the Sandown Clown encounter, and I remarked how similar it was to my own encounter. I honestly believe they were either the same, or slightly different, entity as my own encounter. As it's been months seen my encounter appeared on the podcast, I've been able to deal better with the newer information connected to my experience.\nSam didn't try any tricks with me, like with the children from the Isle of Man. Sam's voice wasn't vocal, if that makes sense. It was like an echo hitting off something and hearing that inside my head rather than through my ears. Thinking it over, I believe the full sentence was, \"Hello, Sam. We are all colors? Skip, the starlight.\"\nThe inside of the green room has come up again in my mind. I've tried remembering other details, and when I sat down and tried to nail down anything else about it, I distinctly recall that there were two empty wooden chairs, and two occupied chairs further back. The door was see-through, I never saw a doorknob.  I couldn't make out details about the other people sitting in the chairs, but they had the same outline as, well, \"Sam\", the hat, the head shape, long arms and legs. But details are just a void. Like when someone's face gets blurred to protect their identity. \nI thought I would share my experience here, finally, as I feel much better about it than initially.", "media": null, "score": 178, "upvote_ratio": 0.99, "comment_count": 28, "over_18": false}, "10": {"id": "1hblbu4", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Murky_Current", "link_flair_text": null, "time": 1734145817.0596092, "created_utc": 1733890878.0, "url": "https://i.redd.it/1y572wcsb56e1.jpeg", "title": "Dogman?", "permalink": "/r/cryptids/comments/1hblbu4/dogman/", "selftext": "", "media": null, "score": 598, "upvote_ratio": 0.98, "comment_count": 32, "over_18": false}, "11": {"id": "1h8kb48", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Upper_Technician_964", "link_flair_text": "Picture/Evidence", "time": 1734145817.2270775, "created_utc": 1733544751.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1h8kb48/half_buried_school_bus/", "title": "half buried school bus ", "permalink": "/r/Thetruthishere/comments/1h8kb48/half_buried_school_bus/", "selftext": "On July 15, 2019, me and my sister went to Bragg Road (Saratoga). We have been many times and had some odd interactions but nothing really weird, except for that day. We went through one end of the road and drove the 8 or so miles to the opposite end. When we got to that end, there was a school bus half buried in the ground, along with a children’s backpack in the middle of the road. We took a picture and drove away quickly. Once we exited and got onto a main street around 12:30-1:00am another school bus started to tail us. It was a one way street so there was not much we could do. The bus sped up very fast and followed on our ass for what felt like forever but was probably 2-3 minutes. We naturally started going faster to get away until we were out of sight and we never saw it again. Probably a month after the incident we decided to go back and see if the buried bus was still there. When we went back there was absolutely nothing and the ground looked like it hadn’t even been distributed in a very long time. I think of this night often and wonder what happened. https://imgur.com/a/Brt07AE", "media": null, "score": 81, "upvote_ratio": 0.97, "comment_count": 5, "over_18": false}, "12": {"id": "1h9yx7y", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "sanrioscr", "link_flair_text": null, "time": 1734145817.4606254, "created_utc": 1733709543.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1h9yx7y/man_with_jaw_hung_open_in_my_backyard/", "title": "man with jaw hung open in my backyard ", "permalink": "/r/LetsNotMeet/comments/1h9yx7y/man_with_jaw_hung_open_in_my_backyard/", "selftext": "Surprisingly this is one of those stories I forgot about until a few days ago, when I was talking to a school friend on call and I got reminded of this. She was pretty freaked when I told her and I got recommended to put it here, so here I am lol\nThis happened when I was roughly maybe seven or eight so some of the details are fuzzy, but i remember it pretty vividly. This may seem like unimportant context but my family had just moved to America and were renting the top portion of your regular suburban house in a pretty safe cul-de-sac. \nI had friends (they were triplets) about three or four houses down. Not far at all. Every day i’d go hang out with them, and around nine or ten in the night, my older brother (around eleven or twelve I’d say) would make the two minute walk and come get me and walk me home since I was pretty young. \nOne night he came to get me as usual. The sun wasn’t fully down but it was getting pretty dark. We started down the walk as normal when he started casting glances over his shoulder. \nI didn’t really notice until he shoved me hard away from the sidewalk and between two houses. Each house had a huge fence that separated their backyard (not ours, though) and he made me crouch behind the fence. I remember being really scared, but more so confused since I had no damn idea what the hell was going on. More specifically he was a pretty big prankster (once he convinced me my older sister crashed her car into the ocean) so I didn’t really believe him when he turned and said “walk behind the houses. I think someone’s following us.”\nLooking back now, he was probably trying to keep me calm. However whatever ‘calm’ was left in my tiny eight year old body was gone the moment I turned around and looked. \nThe man had followed us behind the houses, and he was just by the edge of a few houses down near a different fence line. He had a black hoodie on (with the hood up) black sweatpants, and white sneakers. I have pretty bad eyesight now due to some health problems, but back then it was crystal clear. And I could see, with horrifying clarity, that his jaw was hung open. \nLike he was just standing there. With his jaw hung open. It was horrifying. I think now that i’m older maybe he had some kind of medical condition that affected his jaw. Or maybe he did crack. I dunno. But back then I could’ve sworn on god I was seeing some kind of demon. \nAnyway, my brother, when he saw me looking and getting ready to freak out, told me to “just run” as fast as i can to our house. We booked it. Neither of us looked back, but we were scared out of our minds. Like i said, we only rented the top portion of the house So the bottom (with the sliding door in the backyard) belonged to the some other tenant. I don’t remember if she was home or not, but I remember tugging that thing open and locking it as fast as I can. And when I looked up, he was there in the yard, a little way away from the door. Staring at us. \nMe and my brother told my sister and my mother immediately (my father was away on a work trip) but nothing came of it. Not until the day after. \nWe went to go meet my dad at his warehouse, which had a small live-in portion above it where we lazed around until he was ready to head home with us. Around dusk, he came up and told us we might have to wait since the police were here. He walked us around to the back window of the small area to show us police all around the backyard area of the warehouses (there a few in a line) to a white van parked on the grass by the edge of the woods. \nLike i said i was pretty young, so i don’t remember many details of what actually happened, but i do remember my dad (who hadn’t been told about the day prior) telling us that they found a man and a woman in the van. The man, he said, had his mouth hung wide open. \nHe seemed really disturbed telling me about the whole thing and wouldn’t answer any more questions about the woman. Maybe she was dead. I’ve got zero idea. I do know they were arrested on trespassing charges. \nI don’t know anything else, and I haven’t asked about it and I doubt he’d remember (it’s been over a decade and he’s pushing 70) but it freaks me out to this day. I still can’t believe it happened and I don’t have any answers for it. I talked to my brother briefly about it in hopes he remembered more than I do, but all I got was a long tirade about whatever medical condition the guy probably had for his mouth to be like that (he’s a annoying medical student now). Sometimes I think maybe he didn’t mean any harm and was just drugged out of his mind, but this was like in the world’s safest neighborhood and doesn’t explain why or HOW he showed up at my dads workplace. ", "media": null, "score": 166, "upvote_ratio": 0.96, "comment_count": 13, "over_18": true}, "13": {"id": "1had79g", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "littlequeef99", "link_flair_text": null, "time": 1734145817.5893824, "created_utc": 1733760614.0, "url": "https://i.redd.it/mb2nufneku5e1.png", "title": "This is how the police found policeman Sergio Pucheta after he had been missing for 18 hours. Huddled in a ditch, scared and 20 km away from the place where his belongings were found, after encountering \"two small beings, with red eyes, who were chasing him and giving him orders telepathically\"", "permalink": "/r/truecreepy/comments/1had79g/this_is_how_the_police_found_policeman_sergio/", "selftext": "", "media": null, "score": 182, "upvote_ratio": 0.97, "comment_count": 6, "over_18": false}, "14": {"id": "1h9sjau", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "SeikoStarsong", "link_flair_text": null, "time": 1734145817.719004, "created_utc": 1733691187.0, "url": "https://www.reddit.com/r/threekings/comments/1h9sjau/any_rituals_for_new_years/", "title": "any rituals for new years? ", "permalink": "/r/threekings/comments/1h9sjau/any_rituals_for_new_years/", "selftext": "Preferably something that could maybe grant a wish, or help make my wish come true.  On another note, are there any other rituals I can do to make a wish come true? For example summoning an entity that may grant your wish if you win a game or something like that, or even something that takes place multiple days. It could be anything, as long as it helps make my wish come true. Any answers/suggestions are greatly appreciated! Thx in advance! ", "media": null, "score": 9, "upvote_ratio": 1.0, "comment_count": 6, "over_18": false}, "15": {"id": "1h955t1", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Youngsweppy", "link_flair_text": "Captured Apparition ", "time": 1734145818.6674042, "created_utc": 1733613911.0, "url": "https://i.redd.it/za62avx7gi5e1.jpeg", "title": "Pictures taken from sons baby camera at my home", "permalink": "/r/Ghosts/comments/1h955t1/pictures_taken_from_sons_baby_camera_at_my_home/", "selftext": "I woke up to my son babbling and seen this on his camera. I took a pictures and went in the room expecting someone. It was gone. Only time i’ve ever actually been scared in my home. \nThis happened a little while back and I still get goosebumps thinking about it. ", "media": null, "score": 57881, "upvote_ratio": 0.79, "comment_count": 4375, "over_18": false}, "16": {"id": "1hd46cr", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "SwirlyCloudHunters", "link_flair_text": "Glitch Vid", "time": 1734145818.8146625, "created_utc": 1734063479.0, "url": "https://v.redd.it/a2za6avukj6e1", "title": "A tear in the fabric of reality", "permalink": "/r/GlitchInTheMatrix/comments/1hd46cr/a_tear_in_the_fabric_of_reality/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/a2za6avukj6e1/DASH_720.mp4?source=fallback", "has_audio": false, "height": 1280, "width": 592, "scrubber_media_url": "https://v.redd.it/a2za6avukj6e1/DASH_96.mp4", "dash_url": "https://v.redd.it/a2za6avukj6e1/DASHPlaylist.mpd?a=1736737818%2CMDYxZjhlOTAwNzY1OGQ5Nzk2YzUwZTEyNjFmMjhmZTJkYjk5YTRjNjFjZGVmYWVjNmQxNDhiZDc4ODg1M2RlNA%3D%3D&v=1&f=sd", "duration": 35, "hls_url": "https://v.redd.it/a2za6avukj6e1/HLSPlaylist.m3u8?a=1736737818%2CYmMzNjMxNjc2ZjU3ZGFhMTBjNmViOGIyNmZhOWQ0ZDQ1NzkwM2Q3NGY3OWFiMmVhN2JkZmI2MTdlMDMyODU3Mg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1441, "upvote_ratio": 0.98, "comment_count": 111, "over_18": false}, "17": {"id": "1h9pg3l", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Odd-Ad1714", "link_flair_text": null, "time": 1734145820.1973996, "created_utc": 1733683018.0, "url": "https://www.ibtimes.sg/ufo-fever-grips-world-conspiracy-theorists-say-alien-invasion-imminent-77296", "title": "UFO Fever Grips World; Conspiracy Theorists Say Alien Invasion Imminent", "permalink": "/r/ufo/comments/1h9pg3l/ufo_fever_grips_world_conspiracy_theorists_say/", "selftext": "", "media": null, "score": 1449, "upvote_ratio": 0.9, "comment_count": 632, "over_18": false}, "18": {"id": "1hc1l58", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "APensiveMonkey", "link_flair_text": "Clipping", "time": 1734145821.5897756, "created_utc": 1733944921.0, "url": "https://v.redd.it/2gy86kzgs96e1", "title": "Pentagon: No evidence it’s any foreign entity. It’s not Iran. It’s not our own tech. Which leaves…?", "permalink": "/r/UFOs/comments/1hc1l58/pentagon_no_evidence_its_any_foreign_entity_its/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/2gy86kzgs96e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 590, "width": 1280, "scrubber_media_url": "https://v.redd.it/2gy86kzgs96e1/DASH_96.mp4", "dash_url": "https://v.redd.it/2gy86kzgs96e1/DASHPlaylist.mpd?a=1736737820%2CZDE3YjVhZDZmNTc4OTMyNGYxMmRiYzMxZTg4M2U2ZWVhZWM1MzRlMzBmODc2NDExODQ2MGY5NWY5NTAzZjc1YQ%3D%3D&v=1&f=sd", "duration": 67, "hls_url": "https://v.redd.it/2gy86kzgs96e1/HLSPlaylist.m3u8?a=1736737820%2CZTFjNjNlY2NkMDg3NThkNjJhYTA0MTM2OWJhZTQ3ZTZlZmUwM2M0N2E4MDNkZTU0ZWI0MWU0YmY3Mzg1YTkwOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 13732, "upvote_ratio": 0.82, "comment_count": 5643, "over_18": false}, "19": {"id": "1hdk92f", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "bwf456", "link_flair_text": "Image 📷", "time": 1734145822.899739, "created_utc": 1734118377.0, "url": "https://i.redd.it/dcozmdg54o6e1.png", "title": "Is everyone just secretly hoping for an alien invasion so we don't have to work again? lol", "permalink": "/r/aliens/comments/1hdk92f/is_everyone_just_secretly_hoping_for_an_alien/", "selftext": "", "media": null, "score": 7606, "upvote_ratio": 0.89, "comment_count": 1155, "over_18": false}, "20": {"id": "1hdc959", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "Accurate_Tax_1302", "link_flair_text": "Discussion", "time": 1734145824.393967, "created_utc": 1734096701.0, "url": "https://i.redd.it/kf8be4nmbm6e1.jpeg", "title": "Notice to NJ Fire Departments, Downed or landed drones should not be approached", "permalink": "/r/UAP/comments/1hdc959/notice_to_nj_fire_departments_downed_or_landed/", "selftext": "", "media": null, "score": 1112, "upvote_ratio": 0.94, "comment_count": 308, "over_18": false}, "21": {"id": "1hc220l", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "AnArmChairAnalyst", "link_flair_text": null, "time": 1734145825.4481492, "created_utc": 1733946094.0, "url": "https://www.reddit.com/gallery/1hc220l", "title": "“This is an insult to the intelligence of the American people” - Luigi Mangione", "permalink": "/r/conspiracy/comments/1hc220l/this_is_an_insult_to_the_intelligence_of_the/", "selftext": "", "media": null, "score": 7717, "upvote_ratio": 0.95, "comment_count": 837, "over_18": false}, "22": {"id": "1h8wytn", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "CoC_Axis_of_Evil", "link_flair_text": null, "time": 1734145825.6341796, "created_utc": 1733591231.0, "url": "/r/PodcastGuestExchange/comments/1fm8fhu/irtr_podcast_looking_for_cohost_and_guests/", "title": "[IRTR] podcast looking for co-host and guests", "permalink": "/r/conspiracyfact/comments/1h8wytn/irtr_podcast_looking_for_cohost_and_guests/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 0.67, "comment_count": 0, "over_18": false}, "23": {"id": "1hcddft", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "SquidTeats", "link_flair_text": "humor", "time": 1734145826.2915, "created_utc": 1733978600.0, "url": "https://v.redd.it/dfqwzt9xhc6e1", "title": "Bigfoot!! Bigfoot!!", "permalink": "/r/bigfoot/comments/1hcddft/bigfoot_bigfoot/", "selftext": "", "media": null, "score": 436, "upvote_ratio": 0.86, "comment_count": 48, "over_18": false}, "24": {"id": "1hc4nyc", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "AliveAd8736", "link_flair_text": null, "time": 1734145826.8481317, "created_utc": 1733952666.0, "url": "https://i.redd.it/usw7lzmifa6e1.jpeg", "title": "Is it possible that some cryptids are actually the same animal that inspired more than one cryptid due to different descriptions?", "permalink": "/r/Cryptozoology/comments/1hc4nyc/is_it_possible_that_some_cryptids_are_actually/", "selftext": "For example, could it be that the Sasquatch and the Michigan Dogman are actually both the same creature that have been confused for two different ones due to differing accounts?", "media": null, "score": 239, "upvote_ratio": 0.95, "comment_count": 49, "over_18": false}, "25": {"id": "1haiurn", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "Johanharry74", "link_flair_text": "U.F.O. Humanoid", "time": 1734145827.017835, "created_utc": 1733774516.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1haiurn/humanoid_close_encounter_cases_from_the_nordic/", "title": "Humanoid close encounter cases from the Nordic countries - Special Edition", "permalink": "/r/Humanoidencounters/comments/1haiurn/humanoid_close_encounter_cases_from_the_nordic/", "selftext": "Many of you wanted more humanoid-tales from the Nordic. So I have decided to create an extra episode for you, since I had some more cases to present. This one is a thicker Special Edition with more stories than usual. So hopefully we can have a break from all these Drone related threads that is flowing over all UFO sub-Reddits and dive into some old classic cases.\nMerry Christmas!\nThe people with square hats, the boneless young woman and other strange encounters.\nSvanhals, eastern Sweden, winter 1935.\nCarl-Axel Jonzon is a well-known name in Sweden's UFO circles, as he is one of the founders of UFO-Sweden. He was born in 1928 and grew up in the countryside about 40 km (25 miles) from the small town of Motala. CAJ became interested in UFOs at a young age since he himself had an unexplainable experience as a child. As a young man he moved to Motala and over the years he had many different jobs, and it was when he worked as a technician at the Air Force Base in Linköping in the early 60s that he came into contact with other UFO enthusiasts. A few years later, CAJ started its own association, which became UFO-Motala in 1968. And it was this association that later published the well-known magazine \"UFO Information\" (from which I myself have found a lot of material). In 1970, Carl-Axel Jonzon began the work of starting up a nationwide UFO organization that would later become UFO-Sweden. Over the years CAJ would have many UFO experiences and he also experimented with other paranormal phenomena such as astral travel, mind reading and seeing into the future.\nCarl-Axel Jonzon nicknamed \\\"CAJ\\\" is sitting at his desk at UFO-Sweden 1973 (source: AFU)\nIt was one morning at 8:00 in the countryside around Svanhals in the winter of 1935 and the 7-year-old boy Carl-Axel Jonzon was on his way to school. There was a lot of snow on the roads and bad plowing, and it was difficult to get there even on foot. On this day, CAJ was going to pick up his cousin Britta with whom they lived next door. They used to go to school together sometimes. After plodding along the road, CAJ saw his uncle walking further away. He had a milk jug on his back that he was going to give to the boy's father before he went to the dairy. Just before they met, CAJ saw something out in the snow covered meadow on his right about 50 - 100 meters (55 – 100 Yards) away from him, which looked like a dark upside down bowl or dome (some sources say the distance was longer) . He thought it appeared to be a craft of some kind which he estimated to be 5 meters (15 feet) in diameter.\n4 - 5 strange people pludded around in the snow around the object (some sources even say there were as many as 6 - 8 beings). They appeared to be slightly shorter than full grown men and CAJ believed they were perhaps 1,6 to 1,7 meters (5.3 – 5.5 feet) tall. They were dressed in what looked like black, clumsy, old-fashioned rubber diving suits, and on their heads were black square hats similar in shape to those worn by beekeepers. When the humanoids moved and walked, the boy thought they had an almost ape-like behavior. When Carl-Axel Jonzon's uncle came up to him, CAJ asked \"What is that?\". The uncle shoved the hat behind his neck with his hand and said \"Who the Hell knows!?\". They looked at the craft and the beings for barely a minute, then the Uncle had to go in order to leave the milk for the boy's father before he left for the dairy.\nWhen CAJ was 7 years old he had a strange encounter one morning on his way to school\nNow Carl-Axel started to be late for school and he therefore thought of crossing the field to his cousin's house. But as soon as he set foot on the field, he was enveloped in a dense fog. It was like walking in cotton candy. He didn't know where he was, and he walked in the direction of what he thought was his cousin's house. After much effort, where he had to jump over a ditch, the fog cleared and he arrived at a place he recognized, a road by an old burial mound that he knew led to the school. When he arrived at the schoolyard, he saw that the children were already sitting down and eating their packed lunch. It was now past 11:00 AM. Almost 3 hours had thus disappeared. Where had he been? A female teacher came up and wondered where he had been. CAJ said he had wandered around in the fog and couldn't find his way out. The teacher became angry and told him to stop lying because there had been no fog that morning.\nCarl-Axel Jonzon's experience that winter morning was one of his several encounters with alleged visitors from space. Another time was 1953 and CAJ was then living in the city of Avesta and working in a hotel as a janitor. The pay wasn't the best, so CAJ also worked extra as a hypnotist, mind reader and magician at various fairs, markets and entertainment venues in the region. In 1953 (or if it was 1954? - CAJ can't remember for sure), he and a friend were at a dance place outside a small community called Krylbo. The night didn't go well for CAJ, even though he was quite tall and handsome no girls wanted to dance with him, since he was notorious in the area and considered weird due to his side job in the supernatural and paranormal.\nWhile walking home after a dance in the early 1950s CAJ met a man and a woman. The unknown man left, and CAJ put his arms around the woman. It was like as if she didn't have any bones in her body\nSo when the evening was over, he could not find his friend and therefore he wandered alone along a small road towards Krylbo. In front of him he saw a woman and a man of his own age standing and arguing with each other. They were both short and tanned with a Southern European/ Italian appearance and both were well dressed. The guy had a darker suit with a tie and the girl had a short dark green dress patterned with light green four-leaf clovers, which was a bit against the fashion of that time with dresses that went down past the knees. The dress almost looked like it was painted on the body. She was very cute, almost like a doll and she was probably one of the most beautiful girls he had ever seen. CAJ who was tall walked up to the shorter man and told him to get out of here or he would be in trouble, and that he was now going to take care of the girl. The man walked away and Carl-Axel put his arm around the girl. He remembered that she was very soft. It felt strange because there was like no resistance. They went and sat down on a low roof of an earthen cellar that was next to the road. He put his arm around her waist and there was no resistance either. CAJ was now both a little embarrassed and also a little worried. Something wasn't right.\nHe put his arm around her shoulder again and found that he could push his hand all the way to her throat. It was as if the girl was made of foam and had no bones in her body, like she was a rubber doll. However, Carl-Axel was still interested in her and asked if they could meet again. The girl replied that they could only meet this one time. CAJ asked where she lived, and she pointed down towards the Dalälven (Dale river). CAJ said that there was only the railway and trees and bushes and then the river. But the girl insisted that it was down there where she lived. According to Carl-Axel, she also spoke in a strange way with an odd sentence structure and elements of older words, in a way that no younger person in the 50s should express themselves. After that they parted and went their separate ways and he never saw the girl again. He began to think about whether it was perhaps a woman from Mars or some other planet that he had met. What happened to CAJ, others have also experienced. There are more stories of eerie encounters with people who didn't seem fully human and with a doll-like or mannequin-like appearance and who seem to have completely lacked bones in their bodies or had limbs that could bend at strange angles.\nOne winter in the late 60s or early 70s CAJ and his wife met a flying car that shot straight up into the air and disappeared.\nOver the years, Carl-Axel Jonzon would experience more strange things. In an interview in the newspaper Trelleborgs Allehanda on August 29, 1974, he told about an incident that happened when he and his wife were out driving a few years earlier. It was winter and they were driving on a road surrounded by high snowbanks on both sides. Suddenly, they saw a car coming towards them from far away, but then the car took off from the road and began to fly, only to disappear straight up into the sky. Another time, they both saw a flying saucer land on a road, and then almost immediately it took off again. In the Ölandsbladet newspaper on June 1, 1976, CAJ told about an occasion when he was alone in his car and went to his work in Malmslätt, and then saw a small disc-shaped craft the size of a soccer ball flying parallel to his car for a short while. He was sure it was an alien reconnaissance probe of some kind and they were watching him.\nIn his last years after he had retired, Carl-Axel Jonzon began to devote more time to his hobby, restoring old radios. And it was in his workshop that he had a strange encounter once, when CAJ was trying to fix a radio from the 1930s. He had the front door open because it was summer and hot outside and he was sitting with his back to it. Suddenly there was a knock. Surprised, he turned around and said \"Come in!\". An older man, 60 - 65 years old, entered. He was dressed in a grey-brown suit with small black patterns on it and he also wore a shirt and tie. The strange thing was that there was gravel out in the yard, so CAJ should have heard the man walking from afar. Nor had he heard any cars parked outside. The man could, of course, have parked the car up by the country road and walked down to Carl-Axel's house. But then he would have heard someone walking in the gravel anyway. CAJ asked the man if he could help him with anything. The man said he was looking for old telephones. CAJ replied that he only dealt with old radios, but he knew where he might find old phones. He explained to the man that he should go to an antique shop in nearby Skänninge and he explained how to get there. \"What is Skänninge?\" the man wondered. \"It's a small village.\" CAJ replied and he then began to wonder what kind of strange man he was actually talking to. The man hurriedly said \"Thank you and goodbye!\" and disappeared out the door.\nSome years after his retirement CAJ was spending much time in his hobby-workshop, repairing old radios. One day a mysterious man came in...\nTwo seconds later, Carl-Axel followed out into the yard, but then the man was gone without a trace. He could not have disappeared in such a short time, either by car or on foot. It was impossible and incomprehensible. CAJ found it difficult to concentrate on working with the radio for the rest of the afternoon. He thought of the mysterious man who just went up in smoke and had an uneasy feeling. This wierd feeling lingered for several days and he never forgot this encounter.\nCarl-Axel Jonzon became a central figure in UFO-Sweden for several years. And because of his own experiences with the supernatural, he had a great understanding of what other people experienced when they shared what they had been through. In 1979, CAJ left UFO-Sweden after a dispute with the management, but he got to see the organization he started turn 50 years in March 2020. A few months later, Carl-Axel Jonzon passed away at an age of 91 years old.\nSources: UFO-Sweden, UFO med mera, Håkan Blomqvist blog.\nJosef Maliszewski and the visitors from planet Zutorn.\nSønderborg, southern Denmark, July 19 1951.\nJosef Maliszewski was born in Poltava in Ukraine in 1900. During the First World War he served in the German army, and after the war he settled down in Denmark, where in the mid-1920s he got a job at a gas station in Sønderborg, near the German border. Joseph was described as a philosopher and lover of nature – a man who praised the Lord for every day he experienced, right up until he himself left earth and met God.\nJosef Maliszewski (source: Skeptica)\nIn the morning at 3:30 on July 19, 1951, Josef got up in the middle of the night to go to the toilet. When he came back out, he heard a whistling sound. It came from a large saucer-like machine that landed in a field next to the garden colony where he lived. Josef became curious and ran towards the craft, but when he was about 50 meters (55 yards), he was stopped by an invisible force. He was now as if paralyzed, but could still hear and see. As he stood there, he noticed that even the horses and cows in the field could not move. Even the birds had fallen silent. Maliszewski was afraid that the craft had come to steal the cattle, but then he heard a voice in his head: \"Don't be afraid, we won't take them!\".\nNow Joseph saw eight small round objects coming out of the sides of the craft. They flew up high above the landscape, where they then hovered with rocking movements. Then a hatch was opened in the ship and some kind of escalator came out. Down this came four tall men. When they stepped on the grass they then went to the starboard side of the craft, where they began to repair something. Maliszewski described the men as 2 meters (6.5 feet) tall, dark-skinned and handsome. On their heads they wore helmets that were like transparent domes, and half their faces were covered by what looked like oxygen masks. On their bodies they wore a dark blue, glittering full-body suit. On their backs the strangers had what looked like containers. Josef could also see other men inside windows of the ship, who seemed to be working on something.\nAfter 15 minutes, the stairs rolled back into the spaceship with the four men, and Josef claimed that at the same moment he received a telepathic message that read: \"Goodbye, see you again.\". The saucer then rose into the air and disappeared. Maliszewski discovered that he was no longer paralyzed, and he saw that the horses and cattle could also move. The birds started chirping happily again and it was like a normal early summer morning.\nA flying saucer landing near Josef's home one early morning. He saw 4 men in space suits stepping out of the craft.\nJosef Maliszewski later recounted that as he stood there watching the spaceship and the men walking about on the ground, he said to himself something like, \"How stupid we are on this earth!\" and then received an immediate telepathic response, which contained a message that we were no dumber than the space people. But we earthlings had entered the atomic age, and now they had come to warn us, since we ourselves had no control over the situation.\nAfter the meeting, Josef's watch had stopped at 2.30 AM and he discovered later that day that the craft had left tracks in the field. The area of the tracks was 4 meters (12 feet) by 2 meters (6 feet) and there were 35 large footprints between the tracks. According to a former neighbor of Maliszewski's, crowds of people later came to the field to look at the supposed landing site. After this experience Josef Maliszewski had a sour taste in his mouth and he had diarrhea and could not sleep for several nights afterwards.\nBut Josef Maliszewski would meet the visitors more times in the future, just as they said. On May 18, 1954, he met his friends from space for the second time. Josef was out fishing in his boat one early morning, when a small spaceship came flying low over the water. A hatch opened in the side as the craft was right next to him and a spaceman stepped forward. He urged Maliszewski not to be afraid and offered him a calming drink and something resembling bread. The visitor also said he came from a planet called \"Zutorn\".\nTwo weeks later, Josef Maliszewski said that he had been on an interstellar trip with the space people and had met a female space pilot whom he described as \"the most beautiful young lady he had ever seen\". She was dressed in a sparkly blouse, a short skirt that went halfway down her thighs, and wore a cape over her back. She spoke Danish, and Maliszewski says, \"She kissed me on both sides of my cheeks and finally one on my forehead. Then she said, 'You are my brother and I am your sister. You must not think that you are alone here in the mighty universe.\"\nJosef later travelled in space with the alien people from Zutorn. On the starship he met a very beautiful female officer. But it is not impossible that she only existed in his vivid imagination.\nJosef Maliszewski's first encounter felt like a unique but fairly typical UFO experience and was even briefly published in Jacques Vallee's book \"Passport to Magonia\". Over the years, Josef would tell more and more stories about the encounters with the visitors from the planet Zutorn. However, those stories became more and more far-fetched and fragmentary, and he received a lot of criticism from Danish Ufologists, as they believed that he only made bad imitations of UFO cases from other countries or simply made things up.\nMany years later, Josef Maliszewski became very ill, and he could no longer work physically. He was therefor helped by others in the Garden Colony with food and other things. Josef thought it was radioactive rays from the flying saucer from his first encounter that made him sick. Over the years, the Danish newspapers had made some fun of him and his strange and slightly exaggerated stories, and that made him depressed and he therefore lived withdrawn in his last years of life. Josef Maliszewski became 63 years old and passed away on October 26, 1963, and was mourned by his adult son.\nSources: Skeptica dot dk, Ufoer over Danmark by Willy Wegner, Passport to Magonia by Jacques Vallee\nJosef Maliszewski's first encounter was featured in Jacques Vallees book \\\"Passport to Magonia\\\"\nHelping hands from space during harvest?\nEjstrupholm, Jutland in western Denmark, August 1957.\nThis is yet another of many UFO landings in Denmark. And it follows the pattern of a lot of others around the world and is quite similar to what Josef Maliszewski experienced a few years earlier, with a mysterious craft landing in a field and with several humanoids emerging with transparent glass domes over their heads. Only that in this case the beings are much shorter.\nA 15-year-old boy was working picking barley in a field. This was in late summer or early autumn (probably in August). The field was approximately 2 km (1.2 miles) from the village of Ejstrupholm. It was between 2 - 3 o’clock in the afternoon and the weather was windless and cloudy with a prospect of rain. While the boy was walking alone in the field working, he suddenly felt watched. He stopped and looked around. In front of him he saw nothing, but when he turned around he saw something surprising and unusual. 35 meters (115 feet) from him, there was a strange object on the ground.\nThe craft was described as grey-metallic and oval with a hump/dome on the top. The boy estimated the size to be about 2 meters high and 2.5 meters wide (6.5 x 8.2 feet). It stood on the ground with the help of three landing legs. In front of the saucer stood two short humanoids, who watched the boy. They were only 90 cm tall (3 feet), and they were dressed in a tight suit that was dark green-glossy and rubbery. He didn't see any buttons, zippers or other things holding it together. Something that was striking was that the arms of the suit extended over the hands like large mittens. On their heads, the humanoids had round transparent dome-like helmets. On top of the helmets they had two rear-facing antennae (at least it looked that way). Through the glass the boy could see the faces of the creatures and they looked like ordinary people with brown skin. They now had their faces turned towards each other.\nSmall humanoids were seen outside of the craft. (source: UFO-Nyt)\nThe 15-year-old boy, who was very shocked, watched the craft and the humanoids for a few minutes. He became so nervous that he began to think about throwing stones at them, if they came any closer. Then both of the beings turned at the same time and looked sharply at the boy. Then there was a blinding flash of light, and then the humanoids were gone. At the same time the craft began to move rapidly upwards and then it was gone in a few seconds. The whole experience had taken about 5 minutes and no sound had been heard, which is the typical \"Oz factor\" that often occurs in such abnormal contexts. After the meeting, the boy went to the place where the craft had been and he could then see that the vegetation was bent where the landing legs had been, but no imprints in the soil could be noted. Afterwards the boy felt stupid and he himself had a hard time believing what he had seen. He never told anyone other than his immediate family what he had been through, because he was afraid that his friends would tease and laugh at him.\nThis case came to SUFOI's attention much later. In 1972 there was a UFO lecture in Virum, and afterwards a woman came forward from the audience and told about the case. She helped the investigator X. P. Madsen to get in touch with the witness. The boy, who was now a grown man, was happy to tell about what he saw that afternoon in 1957. The investigator got a good impression of the witness who was calm and balanced and he seemed to be a reliable and honest person according to his friends. There would later be several fruitful meetings with the man.\nSources: UFO-Nyt #6 1975, https://hiddenmark.dk/ufos/the-ejstrupholm-landing-2/\nThe two strange men at the ferry port.\nVardø, northen Norway, September 1966.\nThis case takes place in northern Norway and almost as far east as you can get in the country. The Russian border is not far from here. Just off the coast here on an island, lies the small village of Vardø. Nowadays you can reach the island by car through an underwater tunnel, but in the 60s you had to take a car ferry to the island. And just south of the ferry port on the mainland, at that time there was an airfield that belonged to the Norwegian Air Force. Nowadays, the airfield has been rebuilt to also be a civilian airport.\nLater photo from above of Svartnes port. The island of Vardø and the village can be seen on the north east. \nA man (who wished to remain anonymous) was sometime in September 1966 heading in his car towards the ferry port in Svartnes on the mainland. It was about 4:00 in the afternoon. When he arrived at the quay, the witness saw something a short distance away, which appeared to be a car of modern design for the time. It was red in color and it had front and rear lights and windows and doors that cars usually have. The strange thing was that it did not seem to have any wheels. It was as if it was floating above the ground. Two men in sunglasses, dark blue coats with belts stood next to the car.\nAs there were no other people on the dock, the witness, who was social and curious, started talking to the two mysterious men. The witness was now standing close to the other two, and he could then see that behind the sunglasses they appeared to have yellow eyes. He could also see that the men had six fingers on their hands. By this, the witness meant that they were exposed as visitors from space. After this followed the usual conversations, which we so often hear in stories like these. About all the wars man has started, various diseases, disasters and other misery, and that we humans are so unreasonable that we allow ourselves to end up in these situations. The men then asked the witness what the roads everywhere were for, and why they did not continue straight out into the water. One might wonder if interplanetary travelers from an advanced civilization should not understand such simple things. But in many cases it is actually the visitors from space themselves who display an astonishing ignorance and naivety, almost bordering on stupidity.\nThe man met two odd strangers and a their red car-like vehicle on the docks of Svartnes ferry port.\nAccording to the witness, the communication was carried out only through telepathy and a bit into the conversation he was offered to come along in the men's strange \"car\", but he was worried that they only wanted him as a guinea pig for some experiment, so he kindly declined. On the other hand, he said that he would be happy to come along another time, if the madness of the world had spread to up here in the north as well. With that, they said goodbye to each other and the witness returned to his own car. When he went back, the man could also see something metallic that resembled a large ship that lay still far out at sea. He estimated it to be 200–250 meters (600–750 feet) long.\nThis case came in as a letter to UFO-Norway. It was sloppily written, contained many typo’s and it did not give a good impression of the man and his account. But perhaps the witness had been part of something that he found unexplainable after all. Maybe it really was galactic visitors from somewhere in our universe he met that day? Or maybe he just saw the car from a weird angle, where he didn't see the tires at all and thought it was floating and actually talked to normal people and let his imagination run wild? There is also the possibility that he thought the men seemed strange because he had talked to Russian spies, that behaved odd. We should be aware that the naval base at Murmansk in Russia is only 178 km (110 miles) as the crow flies from Svartnes/Vardø. But what we know is, that this is another one of those many weird UFO – and humanoid cases that involves strange and mysterious cars.\nSource: UFO – Temahefte 2 - Norske nærkontakter av 3. Grad\nThe hovering humanoids.\nSmedjebacken, middle of Sweden, August 1968.\nThe province of Dalarna is known as Sweden's heartland and it is a beautiful undulating landscape with vast forests and many large lakes, and it is here that the country's iconic images of Midsummer celebrations usually come from. But Dalarna is also known for its many mines. Mining in the region for silver, copper and other metals began already in the Middle Ages, and continues even today. But unfortunately many mines are closed today, and it is in the vicinity of such an abandoned facility that this story takes place.\nIt was in the late summer of 1968 and 11-year-old Benny Magnusson was playing with his friends in an abandoned mining area in the woods at Smedjebacken. There was a large group of fifteen boys aged 11 – 15 who were here this late afternoon. They were staying at an empty earthen cellar. An old mining area might not be the safest place, but this was a favorite spot, where they had played war and other games several times before, and they had never felt unsafe or experienced anything unusual before. But this time it would be different...\nStollberget Mining Area near Smedjebacken (source: Nya Ludvika Tidning)\nTowards the evening it was time for Benny and the others to go home and on the way they passed some old mine holes. The boys were walking on a trail out in a meadow opposite them, when they suddenly saw some white-clad beings coming towards them in the direction of the holes, and then stand in front of them some distance away. The group of boys also stopped and they started to become disoriented and anxious. Although the beings resembled humans somewhat, Benny and his friends soon realized that they were not human. It was noted, among other things, by their way of moving…they hovered a bit above the ground. The boys were paralyzed with shock, and when they started walking again after a short while, the beings hovered after them parallel to the trail.\nBenny remembered many, many years later clearly what the beings looked like. They were large and about 2.40 meters tall (7.8 feet), and they were dressed in white coveralls with hoods over their heads. The head was round, slightly larger than a human's, and the skin was greyish white. They had black, large eyes, a long, narrow and pointed nose and a mouth as small as a line, with no visible lips. In one of their hands, each beings carried what looked like a white document briefcase.\nBenny and his nervous friends walked parallel to the hovering beings for a short while, but then one of the boys panicked and started running, and then everyone in the group ran. One of the boys dropped his glasses in the grass and didn't dare stop to look for them, instead he ran on. Even though Benny and one of his friends were also very scared, they stopped and picked up the glasses. The tall and white-clad beings were then only 4 - 5 meters (13 - 16 feet) from Benny. Looking up, he made eye contact with one of them, and it was a gaze he would never forget. He felt as if the being saw right through him and could read his thoughts and knew everything about him. Benny ran for his life and caught up with the other boys. When they got out onto the larger forest road, they took their parked bikes and mopeds and drove away as fast as they could. They had no idea if the beings were still after them and none of them wanted to stop and have a look…\nThe group of boys encountered two tall humanoids that were floating above the ground. The kids were terrified and ran away.\nAfter this incident none of the boys ever went back up to the old abandoned mining area. They talked about it, but none of them dared. And in time, only three of the boys remembered exactly what happened that night. Everyone else had seemed to repress it or pretend not to remember. In addition to Benny Magnusson, it was also Kjell Östling and Staffan Helander who remembered what happened at the mining area. All three have given statements that are similar to each other.\nBenny Magnusson would have many, many more UFO experiences over the years. He believes that this first encounter with the beings opened up his mind and he became more receptive to the phenomenon. He began to see UFO:s everywhere. Sometimes he was alone and sometimes together with his friend Kjell Östling and other times in the company of other people. Later, Benny also began to study the UFO phenomenon and he became a Ufologist. He is convinced that one day they will appear to us en masse, and when that day comes, the world will be different. Then all the knowledge we have now about the origin of man and life in the universe will be obsolete, he believes.\nSource: UFO-Information no 1 1995\nAn encounter on a snowy night.\nLappeenranta (Villmanstrand), eastern Finland, March 1970.\nPauli \"Pate\" Niiranen was born in 1938 and grew up in the town of Lappeenranta near the border with Russia. He started early with music and playing instruments, and it was the tones of jazz that captivated him the most. Pauli also worked for many years as a sheet metal worker, but music was always there as a hobby and he was a well-known profile as a saxophonist at Jazz festivals in southern Finland throughout his life. Pauli Niiranen was also a devoted socialist and supporter of the Workers' Party and a friend of Russia. He was still playing jazz right up until his death in 2019. But one snowy night 49 years before his passing, he had a strange encounter that had nothing to do with either sheet metal or music. It was one of a series of strange UFO-related events in Finland during the early 70s.\nAn older Pauli Niiranen (source: Jazzrytmit)\nIt was in March 1970 and Pauli Niiranen was on his way home in his car to Lappeenranta after a late jazz gig with his band. It was about 2:00 AM at night. The weather was really bad and it was dark and it was snowing heavily, with a strong wind causing snow drifts on the roads. It was hard to see and Pauli was quite tired and wished he was home soon. As he drove down a street at the eastern end of Lappeenranta's airfield, he saw a small being standing at an intersection 200 meters (220 yards) away. The humanoid was standing in the middle of the road and it seemed like it was looking around as it turned its head in different directions. As Pauli drove slowly closer, he spotted four other similar beings, three on the north side of the intersection, and one behind them on a road leading to the military barracks. The humanoids were short and only about 1 meter (3 feet) in height. They had a big head, were thinly built, and they had a glossy green color on their clothing. But it was the eyes that scared Pauli the most. They were long and oval and slightly slanted upwards, with a blue color that almost seemed to glow a little in the dark. It looked like they were all staring at him intensely.\nOn that snowy night Pauli saw some strange beings on a lonely road. He never forgot those shiny blue eyes.\nAfter Pauli had observed the humanoids for about half a minute, he was seized with an uncontrollable panic, and he quickly turned his car around and drove home another way. The next day he read in the local paper that someone had reported a depressed, round melt mark on the road where he had had his sighting. Pauli did not report to the newspaper what he had seen. The only people he told were the other members of his band. But whether they believed him or not is unclear. It was not clear either if the aliens were fans of jazz. 😊\nSource: Mervi Virtanen\nThe being on top of the craft.\nVest-Agder, Southern tip of Norway, May or June 1988.\nIt was around 5 o'clock and the observer, who wished to remain anonymous, was this afternoon a witness to a strange event near the home. A UFO sighting that lasted almost 2 hours. According to the witness, the following happened:\n”One afternoon in the early summer of 1988, I was sitting and casually looked out of the window now and then. I was together with two other people. Suddenly I noticed many different colors flashing behind a nearby mountain, mostly green and red and they were very strong. It was a little strange, but I thought nothing more about it, until suddenly I saw a red dot far away in the sky, that came closer towards us. It only got bigger and bigger the closer it got. It jumped up and down and went sideways left and right and sometimes it even stood completely still. After a while the object slowly descended down towards the ground and landed on the mountain right next to a signal transmitter mast that was placed there. I followed this for a long time. Suddenly I caught sight of a human-like figure on top of the craft, then another, and they seemed to be coming up from a hatch on the top-side of the craft. A little later they climbed back down and the hatch was closed. And after a while the craft was also suddenly gone”.\nBeings were seen on top of the craft. They came out from a hatch. (source: UFO no 1, 1995)\nIn addition to the craft glowing red from afar, the observer described the object as soundless and metallic as it approached closer, with flashing lights on the hull and a faint yellow corona around. Unfortunately, the witness could not see what the humanoids looked like, as the distance was too far to make out any details. A few days later, the witness got the impression of being followed by a similar craft. When the report was printed in the magazine UFO no 1 in 1995, no investigation of the case had yet been made by field investigators from UFO-Norway.\nSource: UFO no 1, 1995\nWoman runs over humanoid with her car.\nSuomenniemi, eastern Finland, June 25 1992.\nIt was 9:00 o’clock on a summer evening in June and a 54-year-old woman was on her way to her vacation cottage in Ristiina. It was dusk and she was driving on a narrow country road through the forest. Along the road it was mostly pine trees, green birch forest and under vegetation such as grass and bushes. Every now and then she drove past a few residential houses along the road and she did not meet many other cars.\nThis incident allegedly happen on route 409. Picture showing a typical strech of that road. (source: Google Maps)\nAfter a long straightaway, there was a curve up a hill. As she came over the crest, she detected movement on the road in front of her in the low light from the car. She thought it was some animal, but as she got closer, she saw that it was two small creatures, who seemed to be busy measuring or analyzing something on the road. The first was squatting in the middle of the road and the second was crouched by the side of the road. They were so focused on their work that they didn't even notice the approaching car until it was very close to them.\nWhen they discovered the car, the humanoid at the side of the road jumped into the ditch, while the other being in the middle of the road froze. The woman didn't have time to stop and drove right over him, while trying to steer away so as not to hit him. When she drove over the humanoid, she heard a whining sound similar to \"niuuhh\" under the car. She braked the car and got out to investigate, but there was no sign of the creature she ran over. She also looked in the ditches, but could not find anything. The only thing she saw was a piece of plastic from the car lying on the road. It had torn away from the underside.\nSuddenly the woman saw a creature sitting on the road in front of her. She tried to avoid it, but she didn't manage and it went under the car.\nThe woman later described the humanoids as small creatures similar to humans, yet not. They were between 60 cm – 90 cm tall (2 – 3 feet). Their heads were round, and they seemed to have no hair. They also had large dark eyes or eye sockets. On the body they were dressed in a gray tight overall with black belts around the waist.\nThis is yet another of the strange humanoid sightings in Karelia, the eastern part of Finland. And as usual, small short bald creatures with large black eyes are often sighted, and they bear similarities in appearance to many other cases from around the world. So was it a typical Gray that the woman ran over? Or was it something else? Or just an animal and she saw wrong? But if it was an animal, shouldn’t it have remained on the road? Like many other cases with only one witness, evidence is lacking, and unfortunately we only have the witness's account to go by. And we can only choose to believe their story or not.\nSource: Mervi Virtanen", "media": null, "score": 39, "upvote_ratio": 0.9, "comment_count": 16, "over_18": false}, "26": {"id": "1h9oxx3", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "mice_and_stuff", "link_flair_text": null, "time": 1734145827.4762855, "created_utc": 1733681717.0, "url": "https://v.redd.it/44anrvbu1o5e1", "title": "Lammmmppp", "permalink": "/r/cryptids/comments/1h9oxx3/lammmmppp/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/44anrvbu1o5e1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 640, "width": 480, "scrubber_media_url": "https://v.redd.it/44anrvbu1o5e1/DASH_96.mp4", "dash_url": "https://v.redd.it/44anrvbu1o5e1/DASHPlaylist.mpd?a=1736737827%2CNTFmMjc2Nzg4NmI0ODM4ZjVlNzQ1MTFlNWE2ZDUxOTBmODEyMjE4M2I2N2E5NGZlZDgwNjJjN2ExNWEwMDIwNg%3D%3D&v=1&f=sd", "duration": 5, "hls_url": "https://v.redd.it/44anrvbu1o5e1/HLSPlaylist.m3u8?a=1736737827%2COTkzOThmNTg1ODRiMjA0NTQxNWE0MGYwNTQ3N2Y5NDU3Y2IwYWJjZDE2MGFkOWNkMzVkNDY5MzNmZmMwZjI0NA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 201, "upvote_ratio": 0.99, "comment_count": 5, "over_18": false}, "27": {"id": "1ha28ns", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Still-Indication-362", "link_flair_text": "Discussion/Advice", "time": 1734145827.6536129, "created_utc": 1733720508.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1ha28ns/my_experience/", "title": "My experience ", "permalink": "/r/Thetruthishere/comments/1ha28ns/my_experience/", "selftext": "One time when I was 14 and in school I was talking with my friends and my teacher had gotten a phone call telling us it was a lockdown drill and to lock all doors and windows we were all sitting in a corner for a good 10 minutes when we heard automatic gunshots and a animal roar of some sort it was deafening we waited for a while before our teacher had looked at us and told us we need to get out so we open the door and we see a red dog thing from the glance I got from it was big bigger than a regular dog then we started running once we got out a military looking team with D.O.D. on their helmets they had taken us away in a armored truck after that my family had to move far far away from the town we were in this happened in 1987 I think it was traumatizing the personnel were really on edge when we came out of the building.\nEdit: I've read the comments and people want the town and other stuff it was in Eagle Mountain California, After this happened 5 hours later we were forced to grab our shit and move away to a town in Montana I'm still in today, I have no contact with my friends or the other students I had in that school I try to go and find them on social media and there's no fucking trace of them the dog like things we have seen in the hallway they had no fur from what I could tell I'm not 100 on that.\nI just found out I'm on Reddit today and found all these accounts. I might have created this while tripping, sorry about that. It's a pretty good story, though.", "media": null, "score": 34, "upvote_ratio": 0.83, "comment_count": 37, "over_18": false}, "28": {"id": "1hb76mo", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Fine-Ad541", "link_flair_text": null, "time": 1734145827.81507, "created_utc": 1733851919.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hb76mo/man_in_van_that_tried_to_steal_a_4yo_girl/", "title": "Man in Van that Tried to Steal a 4yo Girl", "permalink": "/r/LetsNotMeet/comments/1hb76mo/man_in_van_that_tried_to_steal_a_4yo_girl/", "selftext": "This is a short story but it's still the scariest thing that happened to me as a child. I guess what's most chilling is I didn't realize how big of a threat it was until I was older.  \nThis happened to me when I was 4 years old, living in Memphis, Tennessee. It was around 1990, and my mom had gotten me one of those kid sized electric cars that children can ride in, run on batteries. At that time, this toy was top of the line, rare, and I was ecstatic to get one. Because I was only 4, I don't really remember the specifics, or how I was allowed to ride the toy car on the streets, but I'm assuming there was an adult supervising me until maybe they were distracted or had to leave me momentarily.\nFrom my memory, it was a suburban area with small streets and very light traffic. I don't remember if I was on the road or the sidewalk, but I ended up on a street a couple blocks away from my house. But I wasn't scared, I was just having a blast riding my new toy up and down the street. And then I remember a white van that came to a stop right next to me and a man leaned out the window and smiled at me.  I remember it was a big old grin that showed all his teeth.   \nHe then proceeded to talk to me, although I don't recall what he said. I also remember not being frightened because he was being nice. I just felt a little wary because an adult was speaking to me, but unaware that this man was a danger and I shouldn't be speaking to strangers. Then I remember the man getting out of his car and motioning me to come closer to him. I hesitated, not because I was afraid, but more because I didn't know what to do. I was taught to listen to adults, so I did start to move closer to him. He motioned me to come closer and started to head towards the back of his vehicle. When I didn’t move from my spot, he came closer and held out his hand. That was when a woman opened her front door and walked out. It was a house right in front of where I was standing. I don't think the woman's intention was to save me from this stranger, I think she just happened to leave the house then. Suddenly, I noticed the stranger head straight back to the driver's door, close it, and speed off. Honestly, I didn't think much of it because at that age, I never registered it as a threat. So I just got back in my toy car and drove back to my house, and I never told anyone in my family. Now as an adult, whenever my mind wanders to that day, I get shivers down my back. I think about the random woman who probably saved my life just by walking out her front door, and how different my life would be, or if I’d still be alive. I can't imagine what that man would have done to me if he was able to kidnap me, but I have no doubt that was his intention.   \nAs a child, you are afraid because you don't know the horrors that await you; as an adult, you're terrified because you do. To the man in the van, let’s not meet again, ever.", "media": null, "score": 94, "upvote_ratio": 0.98, "comment_count": 10, "over_18": true}, "29": {"id": "1hc3kx7", "locked": false, "subreddit": "truecreepy", "stickied": false, "category": "Paranormal", "author": "dangerdangerman", "link_flair_text": null, "time": 1734145827.9426758, "created_utc": 1733949905.0, "url": "https://i.redd.it/l9d0bjl67a6e1.png", "title": "Despite the popularity of \"Stranger Things\" it is little known that it is actually based on Montauk Project, a conspiracy that supposedly involved the kidnapping of orphans who were subjected to physical & psychological torture to research possibility of time travel, teleportation, and mind control", "permalink": "/r/truecreepy/comments/1hc3kx7/despite_the_popularity_of_stranger_things_it_is/", "selftext": "", "media": null, "score": 56, "upvote_ratio": 0.95, "comment_count": 1, "over_18": false}, "30": {"id": "1hadqjg", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "No_Bike_7482", "link_flair_text": null, "time": 1734145828.3729749, "created_utc": 1733761963.0, "url": "https://www.reddit.com/r/threekings/comments/1hadqjg/need_some_advice/", "title": "Need some advice", "permalink": "/r/threekings/comments/1hadqjg/need_some_advice/", "selftext": "Okay so this is going to sound a bit weird, but myself and two other people several years ago did a few rituals from here and ever since things have been really weird.\nTo start off, it was Halloween 2015 and we got bored so we decided to come on here to do some “harmless” rituals. First one involved us finding out how we all would die, seemed relatively harmless and I admit I didn’t believe it even to this day, but we ended up doing a couple to tell us how we’d die, if our lives would be successful and stuff like that but we saw one I can’t recall the name of and it involved making a circle with salt, pricking your finger then drop it in the centre. Ever since then, I’ve had the same dream, the room is ridiculously uncomfortable to be in, the back of my neck burns at random every time I’m in there, the door moves on it’s own sometimes and we’ve heard voice manifestations here and there. I’m not sure what to do, we’re debating smudging the entire house and cleansing everything but I thought I’d ask what the best next move would be as I haven’t really dealt with something this severe before.", "media": null, "score": 5, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "31": {"id": "1h9prdl", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Zippping", "link_flair_text": "Captured Apparition ", "time": 1734145829.5629718, "created_utc": 1733683838.0, "url": "https://www.reddit.com/gallery/1h9prdl", "title": "Photo taken by me on an Old Melbourne Gaol tour in Victoria Australia. ", "permalink": "/r/Ghosts/comments/1h9prdl/photo_taken_by_me_on_an_old_melbourne_gaol_tour/", "selftext": "Took the photo for the entrances on the second level. There was no one else on that level at the time of this photo as I would have waited for them to be out of frame if they were. Noticed it months after it was taken. ", "media": null, "score": 2474, "upvote_ratio": 0.99, "comment_count": 71, "over_18": false}, "32": {"id": "1h9mwor", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Jagwyrd", "link_flair_text": "Glitch Pic", "time": 1734145829.7144034, "created_utc": 1733676344.0, "url": "https://i.redd.it/3ba42n3ygm5e1.jpeg", "title": "Saw this trailer while I was at the gym", "permalink": "/r/GlitchInTheMatrix/comments/1h9mwor/saw_this_trailer_while_i_was_at_the_gym/", "selftext": "", "media": null, "score": 163, "upvote_ratio": 0.94, "comment_count": 5, "over_18": false}, "33": {"id": "1hd0omd", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "-LeftShark", "link_flair_text": null, "time": 1734145831.0796657, "created_utc": 1734052376.0, "url": "https://www.reddit.com/gallery/1hd0omd", "title": "You are seeing only military aircraft here. Last night there were maybe 15 visible military aircraft across the entire country. Here something comes!", "permalink": "/r/ufo/comments/1hd0omd/you_are_seeing_only_military_aircraft_here_last/", "selftext": "", "media": null, "score": 1412, "upvote_ratio": 0.89, "comment_count": 404, "over_18": false}, "34": {"id": "1h96cv1", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "mindlesscollective", "link_flair_text": "Video", "time": 1734145832.166536, "created_utc": 1733617463.0, "url": "https://v.redd.it/ss63ao4sqi5e1", "title": "Confirming the cross-shaped ufo is indeed a visibility marker on power lines  ", "permalink": "/r/UFOs/comments/1h96cv1/confirming_the_crossshaped_ufo_is_indeed_a/", "selftext": "Video taken this evening, December 7th at 7:05pm by lamp 73 at Hackettstown Medical Center. Very clearly a visibility marker on power lines, not a drone. \nThis is confirming u/jarlrmai2’s post on here earlier. https://www.reddit.com/r/UFOs/s/y4rwTiBDww", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/ss63ao4sqi5e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/ss63ao4sqi5e1/DASH_96.mp4", "dash_url": "https://v.redd.it/ss63ao4sqi5e1/DASHPlaylist.mpd?a=1736737831%2CNjk2NWUyNGY1ODllMzZkMTJjNGZkMmM5NGZmOTZjMTJjNTY2NjNiYTQ5OTNkYzI4Y2NkODFmZGNiZDViNGMxOA%3D%3D&v=1&f=sd", "duration": 8, "hls_url": "https://v.redd.it/ss63ao4sqi5e1/HLSPlaylist.m3u8?a=1736737831%2CNjE3NTg1NTI1NWU2ZTAwNjg5NmMzNDRlOThhNjcwZjcwZDRhMjE0ZWYyNzM3MDAwNTBiZWVlMzQ2NmZjOWQ3Yg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 13313, "upvote_ratio": 0.93, "comment_count": 1082, "over_18": false}, "35": {"id": "1hdaoi5", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Healthy_Ad6253", "link_flair_text": "Image 📷", "time": 1734145833.8096976, "created_utc": 1734091192.0, "url": "https://i.redd.it/lzv3w1bfvl6e1.gif", "title": "The whole sub when the sun starts going down", "permalink": "/r/aliens/comments/1hdaoi5/the_whole_sub_when_the_sun_starts_going_down/", "selftext": "", "media": null, "score": 4966, "upvote_ratio": 0.96, "comment_count": 130, "over_18": false}, "36": {"id": "1hbdst1", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "News", "time": 1734145835.25154, "created_utc": 1733868628.0, "url": "https://v.redd.it/62yac7bih36e1", "title": "[Matt Laslo] A Commanding Officer in New Jersey Coast Guard told Rep. Chris Smith his 47-foot ship “was followed by between 12 and 30 of these drones as they went through the water — followed, right behind them,” Smith told FBI, DOJ & CBP officials today.", "permalink": "/r/UAP/comments/1hbdst1/matt_laslo_a_commanding_officer_in_new_jersey/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/62yac7bih36e1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 714, "width": 1280, "scrubber_media_url": "https://v.redd.it/62yac7bih36e1/DASH_96.mp4", "dash_url": "https://v.redd.it/62yac7bih36e1/DASHPlaylist.mpd?a=1736737834%2CMDhjNzM1MGE1Nzc0OTAzZGRiYzliMzlhYjY5ODQ3Yjg5MzUyYTZkODIxMTY4NjczMTE5OTk3MTkyMzVhZTJkYQ%3D%3D&v=1&f=sd", "duration": 91, "hls_url": "https://v.redd.it/62yac7bih36e1/HLSPlaylist.m3u8?a=1736737834%2CMDkzYWE2MTY3MmNlYTIxNGZkYzY1MzFmZDA2MzFkMjRlYTAwMGJhMzNjM2U1NDM1N2Y0NjUyNzI0OGU3Y2MwOA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 933, "upvote_ratio": 0.99, "comment_count": 133, "over_18": false}, "37": {"id": "1hc6ilc", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "ZING-GOD", "link_flair_text": "Rule 10 Reminder", "time": 1734145836.4701622, "created_utc": 1733957506.0, "url": "https://i.redd.it/87fignowta6e1.png", "title": "What the assassination attempt a farce? Is the CEO assassin a patsy? ", "permalink": "/r/conspiracy/comments/1hc6ilc/what_the_assassination_attempt_a_farce_is_the_ceo/", "selftext": "", "media": null, "score": 5293, "upvote_ratio": 0.96, "comment_count": 270, "over_18": false}, "38": {"id": "1hbygmv", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "NewWorm", "link_flair_text": null, "time": 1734145836.6318119, "created_utc": 1733937185.0, "url": "https://i.redd.it/f2z7er2f596e1.jpeg", "title": "Conspiracy kicked me out :-( ", "permalink": "/r/conspiracyfact/comments/1hbygmv/conspiracy_kicked_me_out/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.49, "comment_count": 11, "over_18": false}, "39": {"id": "1hb8xoe", "locked": true, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "mtvisualbox", "link_flair_text": "A.I. generated image.", "time": 1734145837.2211318, "created_utc": 1733856304.0, "url": "https://www.reddit.com/gallery/1hb8xoe", "title": "My upscaling of Patty", "permalink": "/r/bigfoot/comments/1hb8xoe/my_upscaling_of_patty/", "selftext": "", "media": null, "score": 292, "upvote_ratio": 0.87, "comment_count": 22, "over_18": false}, "40": {"id": "1h9xzq5", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Intelligent_Oil4005", "link_flair_text": "Hoax", "time": 1734145837.7555292, "created_utc": 1733706631.0, "url": "https://i.redd.it/hvr4yjlt3q5e1.jpeg", "title": "A picture of the Minnesota Iceman, one of the most famous hoaxes in all of cryptozoology. It had wound up being so convincing the statue itself almost managed to have a place in the Smithsonian Museum!", "permalink": "/r/Cryptozoology/comments/1h9xzq5/a_picture_of_the_minnesota_iceman_one_of_the_most/", "selftext": "", "media": null, "score": 237, "upvote_ratio": 0.98, "comment_count": 42, "over_18": false}, "41": {"id": "1h9dczw", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Iwantahonda", "link_flair_text": null, "time": 1734145838.2915049, "created_utc": 1733641811.0, "url": "https://i.redd.it/p1yihtm6rk5e1.jpeg", "title": "Who is this fella?", "permalink": "/r/cryptids/comments/1h9dczw/who_is_this_fella/", "selftext": "Original photo btw ", "media": null, "score": 158, "upvote_ratio": 0.85, "comment_count": 77, "over_18": false}, "42": {"id": "1hbbrtb", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "No-Highway8703", "link_flair_text": "Discussion/Advice", "time": 1734145838.472031, "created_utc": 1733863455.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1hbbrtb/strangers_in_the_woods/", "title": "Strangers in the woods?", "permalink": "/r/Thetruthishere/comments/1hbbrtb/strangers_in_the_woods/", "selftext": "Hello, I’ve never really shared this story with anyone other than a few select individuals, I’m unsure of what to make of this story since I experienced it into the early hours of the morning (I think it was roughly 2:40am) when me and a few close friends had gone to a house party out of town and most of us had a few drinks apart from the designated driver of the group so we would be able to get driven home. After the scene had died down a bit and we were all feeling worn out we decided to call it a night and head home, we all piled into the car and started the drive home, about 45 minuets into the drive, our driver said he needed to pull over quickly to use the restroom so we pulled up into a small dirt clearing off to the side of the road that was at the edge of a forrest where he could go in the shrubs since there was no gas stations or stores near by, while the rest of us waited for him in the car, one of us thought it’d be a good idea to go down a small unmarked trail on the other side of the clearing. We discussed the idea for a few minuets, long enough for the driver to finish his business and get back into the car where he also joined in on the convo. We all decided to spend at most 20 minuets going down the trail and we all got out the car, taking a flashlight what was stashed in the glove compartment before closing the car doors and locking it. As we progressed down the path, I swear I could see dark silhouettes in between the trees just on the edge of the cone of light of the flashlight, at first I thought it was just my imagination and the alcohol in my system playing tricks on me so I said nothing of it. I was taken aback when another person in the group claimed he saw the same figures staring at us ominously from just beyond the tree lines, me and him discussed the features of the figures and determined we had seen the same things, the rest of the friend group just looked at us with pretentious expressions. When we decided to turn back and go to the car, I swear I heard a low voice whisper “Do you think they saw us?” come from the shrubs a few feet next to me, now if this was just another group of people like us just trying to get a good scare I could understand but it’s odd that’d be on some random unmarked trail in the middle of nowhere. Whatever it was,I said nothing of it and we all got back to car and returned to driving home.\nI’m sure it was just our minds playing tricks on us due to the state we were in because when I asked the driver if he had seen or heard anything he just shrugged it off and thought nothing of it. Till this day, I remember it very vividly.", "media": null, "score": 19, "upvote_ratio": 0.88, "comment_count": 2, "over_18": false}, "43": {"id": "1hd4sew", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "ICannotSayThisOnMain", "link_flair_text": null, "time": 1734145838.6348467, "created_utc": 1734065630.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1hd4sew/first_date_turned_into_stalking_with_a_twist/", "title": "First date turned into stalking (with a twist) ", "permalink": "/r/LetsNotMeet/comments/1hd4sew/first_date_turned_into_stalking_with_a_twist/", "selftext": "No narration requests please. \nWhen I was about 19(F), I was on all kinds of dating apps because I had low self esteem and a real desire for connection. One day, I got a message on OkCupid from this guy we’ll call Brent. Brent had a lot of shared interests with me—video games and other nerdy hobbies—and seemed like a nice enough guy, so I decided to agree to meet for a date. He looked familiar, but I couldn’t place him in my mind so I just assumed it was the result of us living in a decently small city at the time. \nThe day of our date came and I got ready, making sure I looked presentable but not overdressed since he was taking me to Red Lobster (we were in college, so it didn’t seem like that bad a choice for broke kids on a first date).\nWhen he showed up, though, he looked visibly dirty and much less well-groomed than any of his photos. Not one to judge, I wrote it off and tried to give the date a real chance. Then came strike number two. When I went to order chicken (not being a fan of seafood) he made a big public show of frustration. He was insistent that I should’ve ordered seafood since he specifically took us to a seafood restaurant. I explained I didn’t like seafood, and tried to deescalate the conversation. Obviously from then on the date was very awkward, but I was sure he felt mutually turned off (given his outburst) and assumed when it was over we would part ways pretty quickly. How wrong I was. \nInstead, he walked me back to my car, suddenly very invested again in trying to maintain subtle physical contact with me, and acted as if we had just had the most wonderful evening. He kept making moves to kiss me which I somehow avoided, and eventually I managed to end the evening with a very awkward and prolonged series of goodbyes. \nAs soon as I got home, I had many, many texts waiting for me. I assumed he was going to be bitter about the seafood again or something, but instead it was a very passionate profession of feelings for me. He waxed poetic about how perfect we were for one another and how he couldn’t wait for another date. \nI ignored his messages and went to bed, wanting to talk to my roommate in the morning about what to do. I was obviously not interested in pursuing him, but felt cruel just blocking him outright. I probably should have. It’s what my roommate suggested. \nHe began texting daily over the next couple of days, expressing how we were “statistically” perfect for each other (based on some quiz on the site where we had met) and he believed wholeheartedly we were logistically ideal as a match. I tried gently letting him down  but he laughed it off and said he would help me understand someday. I really should have blocked him by then, but I am very much a pushover—even more so at that age. \nDuring one such conversation about our supposedly inevitably future, he texted me that he was outside. Then, I heard knocking on my bedroom window. I absolutely panicked. I responded to ask what he was doing and he confessed very casually that he worked at my apartment complex doing maintenance and janitorial tasks. That is where I recognized him, I realized too late. As it turns out, he had recognized me from the moment he sent his message, and told me he had always known we would be together. That’s right: the date didn’t turn into him stalking me. He already had been. \nI lost my cool and sent him a very long message full of venom and threats of what I would do if he didn’t leave me alone, and it didn’t work. He told me I was being silly and would come to understand soon. He told me it was inevitable and I was just being stubborn. He acted like I was denying the existence of gravity. He was so overly affectionate and so condescending regarding my refusals. \nOf course. I blocked his number, but that only resulted in him coming to my window more regularly. I should’ve done this much sooner, but I eventually contacted my landlord. I did not contact the police, as I felt at the time it wasn’t “bad enough” to do so. \nThankfully the talk with my landlord slowed his activity significantly, and I moved not long after. Nothing more came of it, and it’s been over 10 years. So to my stalker date: let’s not meet. ", "media": null, "score": 84, "upvote_ratio": 0.95, "comment_count": 19, "over_18": true}, "44": {"id": "1ha2jy4", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Acceptable_Yam_5231", "link_flair_text": null, "time": 1734145838.9009972, "created_utc": 1733721614.0, "url": "https://www.reddit.com/r/threekings/comments/1ha2jy4/curious_beginner_here_any_tips_for_starting_out/", "title": "Curious beginner here. Any tips for starting out?", "permalink": "/r/threekings/comments/1ha2jy4/curious_beginner_here_any_tips_for_starting_out/", "selftext": "I’m really big into mythology and religion and lately I’ve gotten really interested in rituals. Any good books or websites you folks recommend?", "media": null, "score": 4, "upvote_ratio": 0.83, "comment_count": 0, "over_18": false}, "45": {"id": "1h94n8v", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Emotional-Strength45", "link_flair_text": null, "time": 1734145839.9673562, "created_utc": 1733612402.0, "url": "https://v.redd.it/3g9k2g8jbi5e1", "title": "Whispers heard in abandoned coal mine by YouTube explorer", "permalink": "/r/Ghosts/comments/1h94n8v/whispers_heard_in_abandoned_coal_mine_by_youtube/", "selftext": "Unsure if this has been posted here before but I came across this video & wanted to share!\nApparently this guy had a YouTube channel with hundreds of videos exploring coal mines & this is the only video he’s posted with any paranormal activities.", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/3g9k2g8jbi5e1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 480, "width": 500, "scrubber_media_url": "https://v.redd.it/3g9k2g8jbi5e1/DASH_96.mp4", "dash_url": "https://v.redd.it/3g9k2g8jbi5e1/DASHPlaylist.mpd?a=1736737839%2CODQ4MDIzZjI2YmUxNDVmMmQ1NGE5OWRlZjIzZGY4M2Y4NWMzNWM2NzgzMDkyYzlmYWQ3ODA3YWFkZGI1NzEwNA%3D%3D&v=1&f=sd", "duration": 48, "hls_url": "https://v.redd.it/3g9k2g8jbi5e1/HLSPlaylist.m3u8?a=1736737839%2CZTMwZGFjZWRjYzY3NzdlYTAxYzM2YmZkOTkxODJmZDQ4ZTJhMDU1MDlhNDcyZjBkZjA3ODNhMWM2MjQ0OTZkMQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1742, "upvote_ratio": 0.87, "comment_count": 113, "over_18": false}, "46": {"id": "1h9zwzy", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "ovariandancer", "link_flair_text": "Glitch Pic", "time": 1734145840.1192827, "created_utc": 1733712728.0, "url": "https://i.redd.it/bcrueo12mq5e1.jpeg", "title": "Cloud? Spaceship?", "permalink": "/r/GlitchInTheMatrix/comments/1h9zwzy/cloud_spaceship/", "selftext": "", "media": null, "score": 26, "upvote_ratio": 0.75, "comment_count": 7, "over_18": false}, "47": {"id": "1hc6lsl", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "VishnuOsiris", "link_flair_text": null, "time": 1734145841.3722906, "created_utc": 1733957745.0, "url": "https://techcrunch.com/2024/12/11/pentagon-says-mystery-drones-over-new-jersey-are-not-us-military-not-likely-foreign/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAEPdqMTGF27gnxq-GLVJkqdq2vD5guPHK8x62OITfp6-uMHZxkiXKVYa_xltG3lWehBwkhWLRxdbaJ7NWIyC4llcJ0fA-LLwDrc53VyU-gSd9JGcAv858P2UcsAykRSvN2Lu529-rpilwmBL6PcCVfAOQbGvNvIj_DiQtNcFwWte", "title": "Pentagon says mystery drones over New Jersey are ‘not US military,’ not likely foreign", "permalink": "/r/ufo/comments/1hc6lsl/pentagon_says_mystery_drones_over_new_jersey_are/", "selftext": "", "media": null, "score": 1238, "upvote_ratio": 0.97, "comment_count": 580, "over_18": false}, "48": {"id": "1hcvfs6", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "amvion", "link_flair_text": "Video", "time": 1734145842.578194, "created_utc": 1734037686.0, "url": "https://v.redd.it/xtbwovn7gh6e1", "title": "Reporter calls out Pentagon gaslighting: They're adequately investigating the drones, but not thoroughly enough to claim possession of still imagery, yet they are able to determine that the drones pose no threat. \"Make it make sense\" ", "permalink": "/r/UFOs/comments/1hcvfs6/reporter_calls_out_pentagon_gaslighting_theyre/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 800, "fallback_url": "https://v.redd.it/xtbwovn7gh6e1/DASH_360.mp4?source=fallback", "has_audio": true, "height": 356, "width": 640, "scrubber_media_url": "https://v.redd.it/xtbwovn7gh6e1/DASH_96.mp4", "dash_url": "https://v.redd.it/xtbwovn7gh6e1/DASHPlaylist.mpd?a=1736737841%2CYzljYzc4Zjc4MTJlYmY4MmUxZDM1YTkxYTkyYmJiODVjZWQwYTQ4YjI5ZTc4ZjNiODRhOWI5ZWEzOGIwN2UyOA%3D%3D&v=1&f=sd", "duration": 345, "hls_url": "https://v.redd.it/xtbwovn7gh6e1/HLSPlaylist.m3u8?a=1736737841%2CMWVhY2JmMmU0ZmM0OThjMjFjMDUyZGQ5YjIxZmY3NTkyN2ZkYWMyZjRiZTI3ZTc3ZmUyNjY1MGQ1NTM4M2UyZA%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 10332, "upvote_ratio": 0.9, "comment_count": 1883, "over_18": false}, "49": {"id": "1hcj76c", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "littlespacemochi", "link_flair_text": "Video", "time": 1734145843.8567772, "created_utc": 1734003395.0, "url": "https://v.redd.it/4hzl13e8me6e1", "title": "Iranian air defenses attempted to shoot down a Drone/UAP and failed", "permalink": "/r/aliens/comments/1hcj76c/iranian_air_defenses_attempted_to_shoot_down_a/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 1200, "fallback_url": "https://v.redd.it/4hzl13e8me6e1/DASH_480.mp4?source=fallback", "has_audio": true, "height": 854, "width": 456, "scrubber_media_url": "https://v.redd.it/4hzl13e8me6e1/DASH_96.mp4", "dash_url": "https://v.redd.it/4hzl13e8me6e1/DASHPlaylist.mpd?a=1736737842%2CNTY4YTA2MGZkZGQ1NTYyODYxNDdkM2M2OWZjNjY3ODkwZjVjNmQyMTIwZTZmOTk3NzYxYjA2ZmY5NzZiMjUwNg%3D%3D&v=1&f=sd", "duration": 67, "hls_url": "https://v.redd.it/4hzl13e8me6e1/HLSPlaylist.m3u8?a=1736737842%2CMDhjZjEyMzI4ZmZjNDU1MGEwNDczYzRkODJkMDMxYjRkNjY0ODFkYmY4NDJhZTc3ODRjYWFlY2RlZGY1OWQzNw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 4464, "upvote_ratio": 0.9, "comment_count": 764, "over_18": false}, "50": {"id": "1hc28ao", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "News", "time": 1734145845.2378793, "created_utc": 1733946537.0, "url": "https://v.redd.it/2gy86kzgs96e1", "title": "Pentagon: No evidence it’s any foreign entity. It’s not Iran. It’s not our own tech. Which leaves…?", "permalink": "/r/UAP/comments/1hc28ao/pentagon_no_evidence_its_any_foreign_entity_its/", "selftext": "", "media": null, "score": 630, "upvote_ratio": 0.96, "comment_count": 326, "over_18": false}, "51": {"id": "1harg90", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "External-Noise-4832", "link_flair_text": null, "time": 1734145846.2870128, "created_utc": 1733797942.0, "url": "https://i.redd.it/ahhanywfnx5e1.jpeg", "title": "Is this a cover up arrest to put the story to rest because they can’t find the actual guy?", "permalink": "/r/conspiracy/comments/1harg90/is_this_a_cover_up_arrest_to_put_the_story_to/", "selftext": "", "media": null, "score": 5263, "upvote_ratio": 0.97, "comment_count": 469, "over_18": false}, "52": {"id": "1h941lm", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Kooky-Macaroon-4630", "link_flair_text": "humor", "time": 1734145847.0740938, "created_utc": 1733610650.0, "url": "https://i.redd.it/f9wgiw0j6i5e1.jpeg", "title": "I believe ", "permalink": "/r/bigfoot/comments/1h941lm/i_believe/", "selftext": "", "media": null, "score": 190, "upvote_ratio": 0.97, "comment_count": 4, "over_18": false}, "53": {"id": "1h9c3lo", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "peggedsquare", "link_flair_text": null, "time": 1734145847.6621532, "created_utc": 1733636707.0, "url": "https://www.reddit.com/gallery/1h9c3lo", "title": "For your consideration. ", "permalink": "/r/Cryptozoology/comments/1h9c3lo/for_your_consideration/", "selftext": "Recently visited the Bigfoot Museum in Hastings, NE.", "media": null, "score": 208, "upvote_ratio": 0.98, "comment_count": 17, "over_18": false}, "54": {"id": "1hbpcez", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "christsmother", "link_flair_text": null, "time": 1734145848.2792745, "created_utc": 1733907243.0, "url": "https://i.redd.it/he6roh8go66e1.jpeg", "title": "Can someone tell me what this encounter may have been? There are no stupid answers.", "permalink": "/r/cryptids/comments/1hbpcez/can_someone_tell_me_what_this_encounter_may_have/", "selftext": "I haven’t told anyone this story yet. I have still been trying to find an answer but I have given up on figuring out a “logical explanation” at this point. Please hear me out and let me know if this sounds like any cryptid you know of.\nIt was 3 days after Halloween. I live in Southwest Georgia, and my home backs up to a rather large forest. It was about 2/3am and I couldn’t sleep so I went on my back porch to read and smoke and have some tea. I was out there maybe 25 minutes when suddenly I hear what sounded like something heavy falling/jumping from a tree and hitting the forest floor violently. I thought maybe a tree fell at first, until right where I heard the noise come from, i immediately after began hearing what sounded like something walking around on all fours. Something large. Now I assume, bear? There is a fence directly in front of me so I know I can dart inside before it can reach me, so I stay sat, curiously hopeful to see this “bear”, my eyes set diligently on the dark forest. Then for a split second, illuminated by my porch light, I can see a shadowy figure of whatever it is.. It wasn’t furry, nor cute, nor bear.. It was all black, huge, limbering, and humanoid. And crawling around on all 4s.  Scurrying around, ducking and diving behind the trees maybe 15 feet in front of me in the darkness. And then.. the laughter begins.\nThe best way to describe this laugh was like a stereotypical witch with some uncanny animalistic distortion. It was cackling so loudly, psychotically, manically, mockingly… I thought surely my neighbors would be coming outside any moment. I was absolutely frozen in fear. I couldn’t move, I didn’t want to move, I thought if I did whatever it was would give chase. So I sat frozen staring back blankly at the forest that mocked me. This laughing/staring match went on for 3 long minutes.\nFinally I found the courage to look down long enough to grab my phone, and record a video with flashlight. The moment the flashlight hit the trees the laughter subsided (of course), but the scurrying around continued. Finally I loudly yelled “fuck this!” and dashed inside.\nA week later I was awake late again, this time in my bedroom, and hear what sounded like human footsteps running around on my roof in circles. It lasted maybe 4/5 minutes. That was the last anything has happened though. \nI moved in this new place back in july. When i first arrived items kept disappearing and reappearing but that eventually stopped too.\nI just don’t know what to make of any of it. Any advice or knowledge or anything at all is appreciated.\n(btw this is not a fiction piece though it reads like it, this is just exactly what happened the best way I know how to describe it)", "media": null, "score": 151, "upvote_ratio": 0.86, "comment_count": 109, "over_18": false}, "55": {"id": "1hdln1p", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Capable-Active1656", "link_flair_text": null, "time": 1734145848.4567463, "created_utc": 1734122149.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1hdln1p/has_anyone_here_heard_of_projects_shatter_and/", "title": "Has anyone here heard of Projects SHATTER and STATIC?", "permalink": "/r/Thetruthishere/comments/1hdln1p/has_anyone_here_heard_of_projects_shatter_and/", "selftext": "From what I've been able to find and put together, they were both subprojects of research done as a continuation of MKULTRA and MKSEARCH. They both ran in tandem with public schools, funneling kids who were labelled as \"gifted\" into different research pools. The projects seem to have only happened in certain states; I personally went through the two mentioned above in Texas around 1996 or so, but from other stories it seems like kids in Florida, Ohio and Montana were also used.\nSHATTER and STATIC both used terror disguised as something wholesome to make us too afraid to step out of line; I can only really remember the details of one of the \"experiences\", which was basically this play or skit that tried to explain how  'jailbirds' were ruining our lives, and we were given examples of what makes someone a 'jailbird', like doing drugs. That specific thing was drilled into us, so I imagine now looking back that the 'jailbird' in our skit was just some random drug user they abducted. But the skit ended with the 'jailbird' being burned alive in a giant birdcage. \nI've told a few people about this memory over the years, and I can tell that none of them believe me at all, but I'm damn sure I was there, and I was somehow part of all of this. Does anyone else here have similar memories, or have any of you heard of anything that meshes with this? Feeling like I'm on the right trail but somehow I keep missing some obvious and important facts, like my memory still has this big black hole.", "media": null, "score": 12, "upvote_ratio": 0.8, "comment_count": 8, "over_18": false}, "56": {"id": "1han25e", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "havenhale", "link_flair_text": null, "time": 1734145848.624213, "created_utc": 1733785204.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1han25e/the_time_i_almost_got_kidnapped/", "title": "The time I almost got KIDNAPPED. ", "permalink": "/r/LetsNotMeet/comments/1han25e/the_time_i_almost_got_kidnapped/", "selftext": "Hi guys, this is my mom's story. She finally felt like she wanted to share it with the world, even though she’s always tried to forget it. She narrated the story to me so I could share it here. Hope you like it.\nThis happened to me in the early 80's when I was about 14 or 15 years old.\nI lived on a quiet street in the suburbs of my city, in a small place you wouldn't call the country side, but close, in a Spanish island of the Atlantic Ocean. It was known locally back then that little girls started disappearing more often, but it wasn’t yet a topic of conversation between the towns and neighborhoods. \nMost of my friends lived in the city, so I would often take the bus to go meet them. That day at around 5 or 6 pm, I decided to start walking to the bus stop, since I was going to meet my friend that evening. The bus stop wasn’t actually that far from my house, maybe a half a mile in distance. It was located on a quiet street with few cars or people around & lined with old streetlamps that flickered even in the daylight.\nI had taken this route so many times that I didn’t really think anything of it. When I got there the street was dead and had no cars or nobody to be seen around, so I just stood up for a few minutes waiting for my bus.\nA while later a white van slowly approached my direction and started slowing down right next to the bus stop. I didn't think much of it... like maybe they were just parking or looking for something. But then two men got out and started walking towards me. One of them looked normal enough, but the other man caught my attention because his face was kind of deformed, with one hollow eye socket where his left eye should’ve been. His other eye locked onto mine, and the intensity of his gaze made me freeze on the spot.\nBefore I could even process what was happening, they had a hold of me. One grabbed my arm with a grip so tight it felt like my bones were gonna snap, and the other wrapped his arm around my waist, dragging me towards the van. Neither of them said a word, although to be honest, their silence was worse than anything they could’ve said.\nI started screaming and kicking as hard as I could but there was literally nobody I could see around. I remember I even started yelling \"fire, fire!\", since my mom had told me it was like a code for people who were getting abducted. It really was a horrible feeling seeing myself getting pulled closer to the van knowing I couldn't do anything to avoid it.\nThey shoved me into the van, and as I landed on the floor, I saw a third man with a bandana covering his face and a Doberman that were staring at me with a disgusting creepy face that still haunts me to this day. It was in that moment that I started to think that no one would help me or even hear me at all. \nI started struggling and fighting back and I kind of managed to get them off me for a second, but they kept grabbing me and pulling me back in. I remember this distinctive metallic smell inside the van, like rust or maybe blood.\nI felt like probably the luckiest person on Earth when, out of nowhere, my older brother showed up. He didn’t live with us at the time, so coincidently he was probably visiting us that day; I don't really remember why he was there. \nHe started yelling and throwing punches at the men. In the struggle, they let go of me and I managed to pull myself free and back away. The men seemed to be caught off guard. After a few seconds of fighting, they ran back to their van, slammed the doors, and sped off. \nRight after that moment we ran home and I started crying in desperation. The walk home was hard, since my legs were shaking non-stop. I felt overwhelmed and couldn't really process what just happened to me. People who have experienced something similar to this know how shocked and paranoid you start feeling after this.  \nWe reported it to the police later that night, but they didn’t do much. Things like this weren’t taken very seriously back then.\nTo those men: let’s never, ever meet again.", "media": null, "score": 74, "upvote_ratio": 0.94, "comment_count": 2, "over_18": true}, "57": {"id": "1hbzbq2", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Equivalent_Bison4182", "link_flair_text": null, "time": 1734145848.8621821, "created_utc": 1733939333.0, "url": "https://www.reddit.com/r/threekings/comments/1hbzbq2/altering_the_past/", "title": "Altering the Past", "permalink": "/r/threekings/comments/1hbzbq2/altering_the_past/", "selftext": "I need a ritual for changing something in the past or contacting my past self to alter my present/future (if possible). I mean going into another reality where I did things right would even work (tried reality shifting and LOA etc. but nothing worked there). Anyways I want some real world experience or results here if anyone has any as I am a very logical person. I am desperate and am willing to do anything but put my family in danger.", "media": null, "score": 3, "upvote_ratio": 0.8, "comment_count": 4, "over_18": false}, "58": {"id": "1h9clds", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "q0mega", "link_flair_text": "Captured Apparition ", "time": 1734145850.0810845, "created_utc": 1733638637.0, "url": "https://www.reddit.com/gallery/1h9clds", "title": "Zoom in! Taken by my coworker in Alaska on a ski trip. Every person was accounted for. ", "permalink": "/r/Ghosts/comments/1h9clds/zoom_in_taken_by_my_coworker_in_alaska_on_a_ski/", "selftext": "Zoom in at the very back of the four wheeler. You can see what appears to be a head with two eyes and a hand.", "media": null, "score": 953, "upvote_ratio": 0.94, "comment_count": 73, "over_18": false}, "59": {"id": "1hb1ncq", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "PositiveSong2293", "link_flair_text": null, "time": 1734145852.3037431, "created_utc": 1733837043.0, "url": "https://ovniologia.com.br/2024/12/exercito-confirma-11-incursoes-de-drones-sobre-a-base-militar-de-arsenal-picatinny.html", "title": "This is worrying: Army confirms 11 drone incursions on Arsenal Picatinny military base", "permalink": "/r/ufo/comments/1hb1ncq/this_is_worrying_army_confirms_11_drone/", "selftext": "", "media": null, "score": 827, "upvote_ratio": 0.96, "comment_count": 216, "over_18": false}, "60": {"id": "1h9zwm6", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Niceotropic", "link_flair_text": "Discussion", "time": 1734145853.3452086, "created_utc": 1733712690.0, "url": "https://www.reddit.com/r/UFOs/comments/1h9zwm6/there_is_zero_chance_in_a_post911_us_that_unknown/", "title": "There is zero chance in a post-9/11 US that unknown aircraft would just be allowed to prance in our airspace, and so this obviously is our own military. ", "permalink": "/r/UFOs/comments/1h9zwm6/there_is_zero_chance_in_a_post911_us_that_unknown/", "selftext": "Does anyone actually believe that these are actually unknown to our military?  Just a bunch of slow, regular, massive drones that we just \"can't do anything about\" in a heavily populated part of New Jersey?\nWhy are we even talking about this in this subreddit? It's also like journalistic malpractice that nobody has asked straight up questions like:\n\nIf the aren't ours, why haven't they been shot down or disabled?\nWhere are they refueling from?\nCan the Pentagon make a clear statement about them?\nAre these just our own drones/planes, and why can't you make that clear?\n\nThese are definitely not aliens, please, and I believe in the phenomena.", "media": null, "score": 8626, "upvote_ratio": 0.89, "comment_count": 1709, "over_18": false}, "61": {"id": "1haotru", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "greenturman", "link_flair_text": "Discussion :table:", "time": 1734145854.6736236, "created_utc": 1733790109.0, "url": "https://i.redd.it/0ejxnhd50x5e1.jpeg", "title": "[SERIOUS] Update 4: The Alaskan Dark Pyramid", "permalink": "/r/aliens/comments/1haotru/serious_update_4_the_alaskan_dark_pyramid/", "selftext": "Hey again, just giving an update on our expedition. Still haven’t finalized the team or our exact landing point. I landed in Alaska 2 days ago for business but I’ve been taking the time to get to know the area. I’m on my way from Fairbanks to Anchorage via Alaskan Airlines.\nUnfortunately I didn’t receive my starlink mini in time for my trip. I was hoping to test it while on this trip. Either way this expedition is happening and just wanted to keep you all in the loop.\nGodspeed,\nGW", "media": null, "score": 4375, "upvote_ratio": 0.92, "comment_count": 534, "over_18": false}, "62": {"id": "1hbp54i", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "ARCreef", "link_flair_text": "Discussion", "time": 1734145856.0833654, "created_utc": 1733906255.0, "url": "https://www.reddit.com/r/UAP/comments/1hbp54i/chinese_national_just_arrested_for_drone_over/", "title": "Chinese National just arrested for Drone over Vandenburg Airbase", "permalink": "/r/UAP/comments/1hbp54i/chinese_national_just_arrested_for_drone_over/", "selftext": "39 year old Jin Pow Jing was just arrested at San Diego Airport for drone spying.  He flew a drone for 1 hour over Vandenberg Airbase on Nov 30th.  The drone was recovered with the footage of the base on it.   He was boarding a flight to China.  This may be the beginning of arrests or maybe just a 1 off, time will tell.  (It didn't mention type or size of drone) I'm guessing it was more DJI sized.", "media": null, "score": 617, "upvote_ratio": 0.91, "comment_count": 158, "over_18": false}, "63": {"id": "1h9x828", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "gayjesustheone", "link_flair_text": null, "time": 1734145857.4052794, "created_utc": 1733704287.0, "url": "https://www.reddit.com/r/conspiracy/comments/1h9x828/jay_z_accused_of_r_13_year_old_girl_with_p_diddy/", "title": "Jay Z accused of r* 13 year old girl with P Diddy, today. ", "permalink": "/r/conspiracy/comments/1h9x828/jay_z_accused_of_r_13_year_old_girl_with_p_diddy/", "selftext": "https://www.nbcnews.com/news/us-news/jay-z-accused-civil-lawsuit-raping-13-year-old-girl-2000-sean-diddy-co-rcna183376\nThis stuff is gonna keep coming out. I LOVE to see it. There have been whistleblowers in the black community for YEARS that everyone called crazy. These motherf*ckers have been running Epstein like black mail rings in music and Hollywood since their foundation. \nWe really need to go after the CEOs and executives who trained people like Diddy and Jay. ", "media": null, "score": 4690, "upvote_ratio": 0.95, "comment_count": 786, "over_18": false}, "64": {"id": "1hcwpi3", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Whims1cal_cauldr0n", "link_flair_text": null, "time": 1734145858.6464138, "created_utc": 1734040986.0, "url": "https://i.redd.it/cupndog4qh6e1.jpeg", "title": "Made this for my spouse", "permalink": "/r/bigfoot/comments/1hcwpi3/made_this_for_my_spouse/", "selftext": "He loved it and said I should post it here. ", "media": null, "score": 152, "upvote_ratio": 0.98, "comment_count": 22, "over_18": false}, "65": {"id": "1h943hh", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Monkey_Pro11", "link_flair_text": null, "time": 1734145859.165659, "created_utc": 1733610795.0, "url": "https://i.redd.it/a2aumwgy6i5e1.jpeg", "title": "Whats the best cryptozoology book?", "permalink": "/r/Cryptozoology/comments/1h943hh/whats_the_best_cryptozoology_book/", "selftext": "", "media": null, "score": 181, "upvote_ratio": 0.99, "comment_count": 45, "over_18": false}, "66": {"id": "1hcputf", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Cicada_Shack", "link_flair_text": null, "time": 1734145859.8229733, "created_utc": 1734023392.0, "url": "https://i.redd.it/uq1jffkt9g6e1.jpeg", "title": "Do you guys think the Ivory Billed Woodpecker is still out there?", "permalink": "/r/cryptids/comments/1hcputf/do_you_guys_think_the_ivory_billed_woodpecker_is/", "selftext": "", "media": null, "score": 147, "upvote_ratio": 0.96, "comment_count": 37, "over_18": false}, "67": {"id": "1hakmja", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "NoCommunication7", "link_flair_text": "Discussion/Advice", "time": 1734145859.9700503, "created_utc": 1733778929.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1hakmja/is_my_car_haunted_or_cursed/", "title": "Is my car haunted or cursed?", "permalink": "/r/Thetruthishere/comments/1hakmja/is_my_car_haunted_or_cursed/", "selftext": "After many years of searching and talking i finally got one of my dream cars, an older jaguar, unfortunatly i think it may be cursed, werid stuff just keeps happening with it.\n​\nFirst of all i get strange vibes off it, especially at night, at day it's fine but at night something feels really unwelcoming about it and it feels later then it actually is, there's almost a time dilation about it, and i know the night feeling, this is not the night feeling, this is something entirely different and not pleasent, there's some mood lighting too that often makes me think the headlining is on fire.\n​\nAlso very werid things have happened on the road, i should admit i don't drive myself (even if i did they'd charge too much for insurance because a young man driving a JAAAAG) so my dad drives, one of the first times he drove it, he managed to cleanly shear the side indicator off on a bollard, not to mention scratch the hell out of the area, another driver also seemed to attempt to ram us once, basically every time we drive it something werid happens.\n​\nEarly in ownership we also found the tires were really low, almost flat, the dealer had neglected to tell us about this, while pumping up the tires with a rarely used compressor, it died! it started making a squealing noise and wouldn't create any pressure anymore, so we had to dig out a shanty powered pump that was years old, it was almost as if the car didn't want us pumping the tires up.\n​\nMore recently one of the rear door handles has packed up, malfunctioned, it no longer opens the door, only from the inside now and it's not the child locks, it's like it's trying to reject any passengers, going to have to take it to a specialist to fix that.\n​\nOther cars also pass scarily close to it, even when parked, not sure if that's my dad or if that's how it feels in a full size car.\n​\nIt also smells strange, almost like fresh paint inside and can cause your nose to become blocked, the cabin air filter has been replaced.\n​\nIs this just new car anxiety combined with a driver who hasn't driven a car of a similar size for at least 7 years now or is it something supernatural? if so what i can do? already have a bible in there, been thinking of smudging it (and lighting the sage from the built in cigar lighter) but i really don't want to risk burning the interior, my dad smokes in it as it is and i don't like that, i also want to get a st christopher and a carbon monoxide detector just in case it's that, and a tracking device because why not.", "media": null, "score": 10, "upvote_ratio": 0.73, "comment_count": 13, "over_18": false}, "68": {"id": "1h8juxy", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "ICannotSayThisOnMain", "link_flair_text": null, "time": 1734145860.1523716, "created_utc": 1733543208.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1h8juxy/neighbor_exaggerated_visual_impairment_to_get/", "title": "Neighbor exaggerated visual impairment to get into my apartment and fondle my shoes ", "permalink": "/r/LetsNotMeet/comments/1h8juxy/neighbor_exaggerated_visual_impairment_to_get/", "selftext": "[No narration requests please]\nYou read the title right. I hate to claim anyone is exaggerating a disability without hard proof, but the evidence was pretty damning, as you’ll read shortly. \nWhen I was younger (18 or 19F) I lived in an apartment with my former best friend—another girl the same age. \nOne day when both of us had the day off of work, we returned to the apartment from running an errand and found our neighbor (40s M) standing in the hallway and looking troubled. We hadn’t spoken to him before, but he lived diagonally across the hall from us so we were familiar with him. We knew he lived there with his wife, and given that he occasionally used a cane on his walks to guide himself when he was alone, we knew he was visually impaired. This is important later. \nHe approached us and explained he had locked himself out of his apartment and that his wife wasn’t answering her phone and he didn’t know when she would be back. He then asked if he could come into our apartment to wait for her.\nI know at this point you may be wondering why we let him in—which we did. The answer is simply that we were young and, despite admittedly both giving each other hesitant looks, we were too naïve to say no. We felt bad he was stuck, and we assumed with two of us and one of him we could be safe if he tried something. \nHe comes into our apartment at this point and immediately, despite being in a new environment, was much more capable of navigating than we assumed he would be. I chalked this up to his unit being similar and perhaps my own implicit bias, as I wasn’t particularly educated on the spectrum of visual impairment. \nThis wasn’t what creeped us out though. An hour came and went, and still no answer from his wife. Then two. Then he asked to use my phone when his “died.” (I’m not sure I believe it did, for reasons I will explain later—I think he wanted an excuse to use my phone to call.) He gave me her number and I dialed for him, but still no answer. \nThree hours went by and at this point he had become very comfortable in the apartment. So comfortable that the conversation he had been holding nonstop with us for the entire duration of his stay turned to a topic I could not have predicted: my roommate and I’s feet. \nNot only did he remark on the respective size, shape, and arch of them (all visual factors that he expressed as plainly as if he was describing the weather) but he picked up different pairs of shoes from beside our front door and guessed which was whose based on the aforementioned factors. \nWorst of all, he guessed mostly correct and his descriptions were accurate—if overly…excited. \nWe didn’t say anything because frankly at this point we were both terrified. We had no idea if this was premeditated and although we had seen his wife and therefore knew she existed, we were fully aware that either his story was completely a lie, or that he was using his circumstances to act on creepy impulses. Either way, he was in no rush to leave. All attempts to contact his wife were initiated by us. \nHis behavior was very casual and “friendly” but I feel this may have been part of the game for him—to see if we would react or call him out. I’m not sure. Eventually we excused ourselves together to the farthest room away. I don’t remember what excuse we used but we weren’t going to leave one of us alone with him. We called my parents and, in a whisper, asked for advice and, after they thoroughly chastised me for my poor decisions thus far, they told me we needed to get him out at any cost. Obviously. \nWe pretended at that point we needed to go to work, and since we both routinely carpooled to our shared workplace we knew it wouldn’t be odd to him for us to both need to go. At this point, we felt he had been watching us and probably knew at least a little about the fact that we worked together, and hoped he would buy that we needed to go now. We locked the door, changed into our Target uniforms, and went out to tell him we were sorry but we had to go. I did also make another call to my dad, who lived an hour away, in front of him so he would know someone was aware he had been there. I made the call seem casual, hoping to pass off my conversation as me naively telling my parents I was “helping my neighbor” to avoid him thinking I’d caught on to any insidious intent. I was scared that if he thought I was suspicious, he might not react well. \nReluctantly, he left. When we walked into the hall, he resumed standing out there as he had been. We ended up going to a friend’s place to wait it out a while.\nThe next day, his wife called my number (which she had from when he had used my phone) to “thank me for helping”. She was so “grateful” in fact that she and her husband repeatedly invited me, alone, to their apartment for “dinner”, which I declined. She called several times over the course of about a month, sometimes calling multiple times a day. I stopped answering after the first couple of calls, but she continued leaving voicemails. \nEventually the calls stopped and not much else happened. But every time I saw them from then on, I was scared they would approach me. They never did again. \nI deeply regret that we did not notify our landlord, and hope they did not go on to hurt anyone. \nI’m not sure if they were hoping to have a threesome with me or had even worse intentions, but to my former neighbors: let’s not meet. \nTL;DR: My neighbor who I believed to be severely visually impaired convinced me to let him come into my apartment, then made weird comments about how my feet look. ", "media": null, "score": 76, "upvote_ratio": 0.96, "comment_count": 5, "over_18": true}, "69": {"id": "1hasq1j", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Rude-Promise-1059", "link_flair_text": null, "time": 1734145860.4010913, "created_utc": 1733801962.0, "url": "https://www.reddit.com/r/threekings/comments/1hasq1j/new_to_this_stuff/", "title": "New to this stuff", "permalink": "/r/threekings/comments/1hasq1j/new_to_this_stuff/", "selftext": "So. I'm New to the..community(?)..BUT! Does anybody know of any rituals or other things to scare the shit out of myself or any friends I have over? I've heard of others, like the three kings, (only one I can think of rn) but can anybody mention any others, what they are and how to do them?", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 4, "over_18": false}, "70": {"id": "1h98nxh", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Baronsamedi13", "link_flair_text": "Personal Encounter ", "time": 1734145861.3567784, "created_utc": 1733624702.0, "url": "https://www.reddit.com/gallery/1h98nxh", "title": "Two apparitions in acemetery. Taken near my home.", "permalink": "/r/Ghosts/comments/1h98nxh/two_apparitions_in_acemetery_taken_near_my_home/", "selftext": "", "media": null, "score": 869, "upvote_ratio": 0.81, "comment_count": 112, "over_18": false}}}