{"_default": {"1": {"id": "1dgte0a", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "Matt_Dallas", "link_flair_text": null, "time": 1719024072.0109506, "created_utc": 1718490798.0, "url": "https://www.reddit.com/r/ufo/comments/1dgte0a/hope_i_live_long_enough_for_disclosure/", "title": "Hope I live long enough for disclosure.", "permalink": "/r/ufo/comments/1dgte0a/hope_i_live_long_enough_for_disclosure/", "selftext": "I'm  65 , hope I live long enough....", "media": null, "score": 318, "upvote_ratio": 0.97, "comment_count": 168, "over_18": false}, "2": {"id": "1di86e6", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "ChrisSpalton", "link_flair_text": "Photo", "time": 1719024073.328135, "created_utc": 1718656306.0, "url": "https://www.reddit.com/gallery/1di86e6", "title": "Did I accidentally capture a UFO at the beach yesterday?", "permalink": "/r/UFOs/comments/1di86e6/did_i_accidentally_capture_a_ufo_at_the_beach/", "selftext": "Last post got taken down due to lack of context so here it is again. Dunwich beach, Suffolk yesterday evening. Didn’t see anything at the time and this is the photo it appears on, maybe a bug, maybe a UFO zipping by? Dunwich is only 13 miles from the location of the famous Rendlesham incident so who knows?", "media": null, "score": 5680, "upvote_ratio": 0.84, "comment_count": 1244, "over_18": false}, "3": {"id": "1dg97ux", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "OregonBlues", "link_flair_text": "Discussion :table:", "time": 1719024074.597642, "created_utc": 1718423542.0, "url": "https://i.redd.it/5dixgp3grn6d1.jpeg", "title": "Which celebrity do you think is an alien among us?", "permalink": "/r/aliens/comments/1dg97ux/which_celebrity_do_you_think_is_an_alien_among_us/", "selftext": "I think of Jennifer aniston with this pic", "media": null, "score": 1359, "upvote_ratio": 0.78, "comment_count": 1212, "over_18": false}, "4": {"id": "1dgni27", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "walk_smoochies", "link_flair_text": "Discussion", "time": 1719024074.9858518, "created_utc": 1718473884.0, "url": "https://i.redd.it/ipqjpqnpieeb1.jpg", "title": "The Hearings Unsung Hero: George Knapp who spent the entire hearing looking like he was flying Spirit Airlines in coach. Bravo George we salute you.", "permalink": "/r/UAP/comments/1dgni27/the_hearings_unsung_hero_george_knapp_who_spent/", "selftext": "", "media": null, "score": 149, "upvote_ratio": 0.95, "comment_count": 7, "over_18": false}, "5": {"id": "1djcpe0", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "FoolOfElysium", "link_flair_text": null, "time": 1719024075.9883096, "created_utc": 1718779644.0, "url": "https://i.redd.it/tc8flssb6h7d1.jpeg", "title": "Friendly Reminder.", "permalink": "/r/conspiracy/comments/1djcpe0/friendly_reminder/", "selftext": "", "media": null, "score": 2632, "upvote_ratio": 0.9, "comment_count": 222, "over_18": false}, "6": {"id": "1dkkzuv", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1719024076.2563128, "created_utc": 1718913696.0, "url": "/r/youtube/comments/1dkkomh/youtube_channel_flwebpro_terminated_over_10_years/", "title": "Youtube Channel @ flwebpro Terminated. Over 10 years work making high quality content, nature videos, time lapse videos shot over several weeks w 10s of thosuands of views Lawnmower repair video with 14k views Also had lots of positive, personal testimonials about life in Florida. Longest day indeed", "permalink": "/r/conspiracyfact/comments/1dkkzuv/youtube_channel_flwebpro_terminated_over_10_years/", "selftext": "", "media": null, "score": 5, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "7": {"id": "1di0ob5", "locked": true, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Cosmicmimicry", "link_flair_text": "PGF", "time": 1719024076.8389158, "created_utc": 1718637651.0, "url": "https://v.redd.it/95b12w34g57d1", "title": "I'm sorry but I simply can't unsee this", "permalink": "/r/bigfoot/comments/1di0ob5/im_sorry_but_i_simply_cant_unsee_this/", "selftext": "Watch the right arm swing through the entirety of this clip.\nThen watch the left arm.\nEven the longer versions show the right arm swinging back and forth, ahead and behind through the entire duration of the film.\nThe left arm stops just before it swings behind, everytime.\nThere is purposeful intent to not swing her left arm as loosely and extensively as her right.", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/95b12w34g57d1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 720, "width": 1280, "scrubber_media_url": "https://v.redd.it/95b12w34g57d1/DASH_96.mp4", "dash_url": "https://v.redd.it/95b12w34g57d1/DASHPlaylist.mpd?a=1721616076%2CZWU5ZTE3MjBiNmQxNzdmMTg1YjE0MGY2MDdkNDE0ZmZhNzU1Mzk3N2Y5ZDkxZDQ3MmFmZjhlZWJhZTQyMjYyNw%3D%3D&v=1&f=sd", "duration": 9, "hls_url": "https://v.redd.it/95b12w34g57d1/HLSPlaylist.m3u8?a=1721616076%2CMWM0OWQxNDQ3ZWZiYjNhZTk2Y2MxOGRlZGFlN2VlN2M2YjliN2YyZjI3NGUxNTlmNzgyMmM4MzE2MzE4ZWQ4YQ%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1824, "upvote_ratio": 0.88, "comment_count": 661, "over_18": false}, "8": {"id": "1dggko2", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "ApprehensiveRead2408", "link_flair_text": "Discussion ", "time": 1719024077.1964352, "created_utc": 1718453443.0, "url": "https://www.reddit.com/gallery/1dggko2", "title": "Which recently extinct carnivore do you think had higher chance to get rediscovered between Javan Tiger,Thylacine,& Japanese wolf?", "permalink": "/r/Cryptozoology/comments/1dggko2/which_recently_extinct_carnivore_do_you_think_had/", "selftext": "", "media": null, "score": 735, "upvote_ratio": 0.98, "comment_count": 116, "over_18": false}, "9": {"id": "1dgvck2", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "HullJack96", "link_flair_text": "Humanoid", "time": 1719024077.3403122, "created_utc": 1718496884.0, "url": "https://www.reddit.com/r/Humanoidencounters/comments/1dgvck2/black_stick_man_phenomenon/", "title": "Black Stick Man Phenomenon ", "permalink": "/r/Humanoidencounters/comments/1dgvck2/black_stick_man_phenomenon/", "selftext": "I have always denied anything supernatural, but this experience changed my view on the world. I am now obsessed with reading people's stories or anything new that has been posted about these things specifically.\nHere is my story to share with all you open-minded folk. \nFirst of all, here is a little bit about the area it happened in...\nI live just off The Isle of Skye in Scotland. In the village where i live, there's 2 bridges linking the mainland to Skye. Between the bridges is a wee island that has a lighthouse and 2 cottages going back hundreds of years (famously gavin maxwell resided in one of them). Anyway, there's always been a lot of folklore around the lighthouse. Everyone who has worked there over the centuries has always said the same story. Which is that they heard loud voices calling loudly outside the building and a massive change in atmosphere... but none of the workers who  stayed there (from countries all over the world mind) could ever identify where exactly it was coming from or understand what the language was... nor did they see who or what was calling out... Regardless of this, I don't know if perhaps my experience is linked to the folklore, but It happened in the exact same area, which for me personally made my encounter all the more creepy.\nThe encounter....\nOne night in the spring of 2019, i was running the Skye bridge after work at around 9 pm. I stopped to take rest on the first smaller bridge between the cottages and the mainland. The bridge was in complete darkenss and i was using my torch to see where i was going. I leaned on the barrier to catch my breath, looking out over the moon lit loch. When I  turned my head and looked in the direction of the distant  street lights about 100 metres or so away... i was utterly stunned!  The hairs stood up all over me, and my nerves were shot to pieces. I locked my eyes on what seemed to be a 12-foot giant blurry stick figure cross the road. Almost the height of the street lights. It had no features other then see through shades of dark blue and black. Its legs and arms were the same long, thin shape of its body, as was its tall, featurless squeared head. What's more disturbing is the millisecond I saw it I felt an overwhelming feeling of vulnerability and dread. It was a dramatic change in the air and a very terrible atmosphere.\nThe scariest part for me was that when i watched this thing cross the road from the right side of the road (my side)  to left... It took long, smooth, slow strides and didn't seem to make contact with the ground. It glided with its steps... when it reached the other side, it went through the stone wall that follows along the road, into the blackness, and then instantly reappaeared back on my side. It then proceeded to cross the road over and over. This happened  around 5 times until it never reappeared. This is the only thing  I've ever witnessed in my life I can not explain, and it utterly shocked me to my core, and now I really am just mesmerised. There really are weird things going on in the world.\nSince that day, im very nervous about going through there.  It' always in the  back of my mind even when I  drive to work in daylight. \nPlease, if anyone on here has had a similar experience, please contact me. \n I had never even heard of anything like this before... not everln bloody slender man... then I find online that people have had  incredibly similar experiences to me. That made it crystal clear in my mind that i really had seen something, and it can't be a coincidence.  I've been fascinated ever since! \nThank you. \nThe Bridge & Lighthouse", "media": null, "score": 45, "upvote_ratio": 0.93, "comment_count": 24, "over_18": false}, "10": {"id": "1dgrvro", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Remarkable_Act1048", "link_flair_text": null, "time": 1719024077.868563, "created_utc": 1718486303.0, "url": "https://i.redd.it/i4gui492ys6d1.jpeg", "title": "Wendigo", "permalink": "/r/cryptids/comments/1dgrvro/wendigo/", "selftext": "The Wendigo is my favorite cryptid (any opinions)", "media": null, "score": 704, "upvote_ratio": 0.93, "comment_count": 116, "over_18": false}, "11": {"id": "1dgm20k", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Ysulyan", "link_flair_text": "Lights/Glows", "time": 1719024078.0110765, "created_utc": 1718469789.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1dgm20k/roughly_20_years_later_still_trying_to_find_out/", "title": "Roughly 20 years later, still trying to find out what caused these.", "permalink": "/r/Thetruthishere/comments/1dgm20k/roughly_20_years_later_still_trying_to_find_out/", "selftext": "I was going to post this on r/dreams but then realized I wasn't technically dreaming when experiencing this.\nAround the age of 8 I'd wake up in the middle of the night in my room and see things on the floor that emitted a eery white glow. It creeped me out because I was fully conscious while witnessing them. It was no moonlight because we had roller shutters that completely blocked off light and the fact that these happened across the span of several months makes me determine they happened during new moons and cloudy nights too. This was back in like the late 90s so I didn't even have a means to take pictures or anything as I didn't own a mobile phone until I was in my mid teens, so I can't share proof. And I was too scared to prod or even get close to them or look at them for a long time.\nIt would happen every other day and always for no apparent reason. The lights had abstract shapes and never really made sense and despite them never moving or doing anything, they'd never be in the same place or have the same shapes as the ones preceding or superseding them; one night they might be next to my bed, the other night by the door.\nWhat's more disturbing is one night I'd wake my brother up, who slept on a bed next to mine, and ask him if he could see what I was seeing and he would say he didn't. And these were not dreams because up to this day me, my mom and brother still recall the time in which I had these weird apparitions in the night because I'd always nag at them and talk to them about them.\nThe worst part is that one day I asked my brother to turn on the lights which caused the glow to disappear but as soon as he turned off the lights the glow would return to the floor.\nEventually I learned to ignore it and the glows never returned although they were soon replaced by sleep paralysis and later on in life other disturbing yet normal nightmares.", "media": null, "score": 56, "upvote_ratio": 0.92, "comment_count": 15, "over_18": false}, "12": {"id": "1dhuy84", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Formal-River-9239", "link_flair_text": null, "time": 1719024078.162584, "created_utc": 1718620531.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1dhuy84/my_kidnappers/", "title": "My kidnappers.", "permalink": "/r/LetsNotMeet/comments/1dhuy84/my_kidnappers/", "selftext": "It was the summer of 1978 and we had just moved from Canada to Kuala Lumpur, Malaysia. As a seven year old child I was excited about moving to a new country and the adventures that awaited me. I had no idea that one of my first adventures would be so sinister.\nWe end up staying at the Hilton hotel with other expat families while we waited for the company supplied home to be ready for us to move into. As a 2nd grader staying in a hotel for one-two weeks was exciting and seemed like a camping trip spent in luxury.  Since other expat families were also staying at the hotel I had lots of other children to play with. One of the games we would play was hide n' seek - this meant using the elevator to hide out on the other 30 some floors or in the stairwells. The hotel gave us children a false sense of security.\nOne day when we were playing 'hide n' seek' I took the elevator alone to the top floor in the building, I believe it was the 30th floor, and exited the elevator. As I rounded the corner from the bank of elevators I ran into a man and woman. They looked to be in their 30s and looked native to the country. I recall they did not look frightening and were dressed nicely. While they looked normal their actions immediately said something different.\nThe man tried to grab my arm and I pulled away. I immediately backed away from the couple till we were standing about ten-fifteen feet apart. I of course was on the edge of turning and running, but understood that I had no where to run to if a pursuit did occur. A short lived stand off ensued. I assumed the man wanted to convince me to come with them willingly because if I screamed it could attract the attention of other guests staying on that floor. So from fifteen apart we stared each other down.\nI was standing closest to the bank of elevators and they were standing between me and the stairwell. The man took a chocolate bar out of his pocket and held it out to me. This of course would mean approaching the couple to take it and there was no way in hell I was going to do that. The man and woman were staring at me with creepy fake smiles and I could see that their body positioning screamed 'we may lunge at you at any moment'.\nAs a side note I remember the chocolate bar had nuts in it and I hated nuts in chocolate bars. When it was clear that I wasn't going to come to them I could see the man's stance start to change into 'I am about to lunge at you' and my stance changed to 'I think its time to run'. Right when it looked like the man was going to lunge at me the elevator doors dinged and someone got off on that floor.\nI don't remember who it was or what they looked like because as soon as I heard that sound I turned and bolted past that person and into the open elevator doors. I recall that the man and woman retreated in the opposite direction at that sound, maybe to their room or to the stairwell.\nI never told anyone what had happened till decades later and as a child quickly pushed it to the back of my mind till I was much older.\nIt is sobering how the smallest things in life can be so life changing. I don't remember who got off on that floor but I remain eternally grateful to them, and to that couple I say lets not meet again.", "media": null, "score": 93, "upvote_ratio": 0.91, "comment_count": 8, "over_18": true}, "13": {"id": "1dgh3dr", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Thefemcelbreederfan", "link_flair_text": null, "time": 1719024078.3527663, "created_utc": 1718455242.0, "url": "https://www.reddit.com/r/threekings/comments/1dgh3dr/any_beginner_rituals_that_can_improve_my_skill/", "title": "Any beginner rituals that can improve my skill? ", "permalink": "/r/threekings/comments/1dgh3dr/any_beginner_rituals_that_can_improve_my_skill/", "selftext": "I have never done any of these rituals before, and honestly after watching a few videos and this sub  as a curiosity, I am incredibly frightened by the stories here.\nPerhaps its not as terrifying but some of the rituals literally invite a spirit and contain strict instructions that can be easy to miss and as well certain objectives that can't be achieved with my current status.\nThat being said, I. Am. Very desperate to get good at something, I have tried practicing for weeks yet the fruit laid is minimal and my core problem has not yet been fixed. I feel like I'm falling behind my friends and while I always knew it, am incredibly mediocre and lacking talent. It's a sad truth, and one I've tried to change, yet life isn't always so lucky. \nI've decided that instead of doing the same repetitive task in the vein hope of a little sprinkle of progress while my dreams get crushed by the hopelessness of reality. I've decided to finally do some of these rituals. That out of the way, I'm still a teenager living in his parent's house so I am incredibly restricted on what I could do. A ritual that uses strange items like goats blood, a thrown out plushie, or three mirrors can be doable but will probably invite a few painmoments \ntldr, I wanna do an easy ritual to help me get good  because I'm not talented and I'm insecure ", "media": null, "score": 12, "upvote_ratio": 0.94, "comment_count": 12, "over_18": false}, "14": {"id": "1dkw6x9", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Healthy_Magician_895", "link_flair_text": "Is this paranormal?", "time": 1719024078.6015315, "created_utc": 1718946851.0, "url": "https://www.reddit.com/gallery/1dkw6x9", "title": "I saw something in the corner of my door", "permalink": "/r/Ghosts/comments/1dkw6x9/i_saw_something_in_the_corner_of_my_door/", "selftext": "I was messing around in my mom’s room taking a video whenever my friend pointed out something at the corner of the door. At the end of the video I went back to the mirror but it was gone. Can somebody explain this? I’m genuinely creeped out.", "media": null, "score": 1157, "upvote_ratio": 0.9, "comment_count": 347, "over_18": false}, "15": {"id": "1dhez53", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "vegaspaul", "link_flair_text": "Glitch Pic", "time": 1719024078.8497708, "created_utc": 1718565487.0, "url": "https://i.redd.it/jbo4csw5hz6d1.jpeg", "title": "Came home from a trip and found that my welcome mat had cloned itself", "permalink": "/r/GlitchInTheMatrix/comments/1dhez53/came_home_from_a_trip_and_found_that_my_welcome/", "selftext": "", "media": null, "score": 1781, "upvote_ratio": 0.99, "comment_count": 37, "over_18": false}, "16": {"id": "1djtzot", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "TomasVrboda", "link_flair_text": "Discussion", "time": 1719024080.4751813, "created_utc": 1718830993.0, "url": "https://i.redd.it/mp6pn5l0fl7d1.png", "title": "I had never heard of the 2020 Magé Brazil incident before now. How is it not being referenced constantly. It's exactly how I would imagine a modern day Roswell.", "permalink": "/r/ufo/comments/1djtzot/i_had_never_heard_of_the_2020_magé_brazil/", "selftext": "The incident in Magé Brazil that happened the 12th of May 2020 is one of the most convincing encounters I have seen in modern history. It is extremely well documented through social media and the images and videos actually do seem to show unknown crafts and then one of them being shot down. If I had to picture a modern day version of Roswell, I don't think I could come up with better than this. I'm surprised seeing it in a UFO Recreation video is the first I have heard about it. It was never on the Weaponized podcast that I noticed and I haven't ever heard James Fox talk about it.\nIt just seems extremely surprising given the amount and quality of evidence. If I had to point to anything and say this is a smoking gun, it would be this evidence. There's even a supposed video of one of the aliens, though that may be CGI. But it does switch right back to an Unreal Engine 5 render of the aliens and the differencein quality is huge.\nI just wanted to bring this to your attention, because I hadn't heard of it before and I consider myself fairly well studied on the subject.\nHere is the video link:\nhttps://m.youtube.com/watch?v=wOmnfrr7k54", "media": null, "score": 221, "upvote_ratio": 0.88, "comment_count": 109, "over_18": false}, "17": {"id": "1dgk5fj", "locked": true, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "Magog14", "link_flair_text": "Document/Research", "time": 1719024081.810043, "created_utc": 1718464396.0, "url": "https://www.reddit.com/gallery/1dgk5fj", "title": "The most comprehensive analysis of an alien implant to date has revealed a ceramic covering over a meteor sourced metal core which contains a further ceramic lattice and carbon nanotubes which are never found in nature. It also contains crystalline radio transmitters and 51 unique elements", "permalink": "/r/UFOs/comments/1dgk5fj/the_most_comprehensive_analysis_of_an_alien/", "selftext": "", "media": null, "score": 2952, "upvote_ratio": 0.83, "comment_count": 958, "over_18": false}, "18": {"id": "1dhebab", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "FunkleKnuck291", "link_flair_text": "Speculation", "time": 1719024083.243254, "created_utc": 1718563620.0, "url": "https://v.redd.it/osb5tbwmhv6d1", "title": "Possible explanation for “Jetpack” sightings", "permalink": "/r/aliens/comments/1dhebab/possible_explanation_for_jetpack_sightings/", "selftext": "", "media": null, "score": 1249, "upvote_ratio": 0.88, "comment_count": 165, "over_18": false}, "19": {"id": "1dg86yt", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "percypersimmon", "link_flair_text": "Discussion", "time": 1719024083.633156, "created_utc": 1718419918.0, "url": "https://www.reddit.com/r/UAP/comments/1dg86yt/what_types_of_objects_fly_at_night_without/", "title": "What types of objects fly at night without flashing lights?", "permalink": "/r/UAP/comments/1dg86yt/what_types_of_objects_fly_at_night_without/", "selftext": "Hope this doesn’t violate rules- this isn’t a “personal sighting report” but a question about what I saw. \nJust 20 minutes ago there was a I thought I saw a plane. I’m camping and always look at FlightRadar bc it’s fun to see where all the planes are going (I’m with family so we gotta do something).\nWhen nothing showed up on the app, a family member pointed out that it wasn’t at all flashing. I then noticed that it was just a solid light, moving about the speed of a plane without a sound. We followed it South to North until it flew behind the tree line. \nCould it be a military plane? Even if they’re off the record they’d still need flashing lights, right?\nETA: It seemed to be SO low to be a satellite- that’s why I asked. I’ve never seen one that seemed to be 20k feet up before. ", "media": null, "score": 49, "upvote_ratio": 0.85, "comment_count": 69, "over_18": false}, "20": {"id": "1dhih7b", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "JesusWasASocialist_", "link_flair_text": "Rule 5 Warning", "time": 1719024084.8420866, "created_utc": 1718575159.0, "url": "https://www.reddit.com/gallery/1dhih7b", "title": "Turns our they COULD lower prices all along 🤔", "permalink": "/r/conspiracy/comments/1dhih7b/turns_our_they_could_lower_prices_all_along/", "selftext": "Despite right-wing media Outlets continuing to push the myth of inflation it has become evident to most Americans that higher prices have been driven by corporate greed rather than actual inflation. \nThink about that for a minute they took advantage of consumers just to be greedy. On top of that all the lies they told to raise the prices in the first place. It's crazy how horrible these people are.in our time of need with most Americans struggling, they think hey let's raise prices on stuff the need to survive. These are the people paying our politicians! Kinda scary!", "media": null, "score": 2000, "upvote_ratio": 0.89, "comment_count": 329, "over_18": false}, "21": {"id": "1dl81oq", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "set-monkey", "link_flair_text": null, "time": 1719024085.0885563, "created_utc": 1718987062.0, "url": "/r/BrowardCountyFLTruth/comments/1dl80c7/youtube_hates_florida_sandbagged_florida_channel/", "title": "YouTube hates Florida. Sandbagged Florida channel for 10 yrs. Yesterday, 1st time put link to my nonmonetized channel in some comments to boost subscriptions like everyone does. YouTube pounced.. Removed channel permanently. Called it spam even for no money.. No appeal. I fell in the trap they set.", "permalink": "/r/conspiracyfact/comments/1dl81oq/youtube_hates_florida_sandbagged_florida_channel/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "22": {"id": "1djmrv3", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Ajiatsukinowaguma", "link_flair_text": "chat", "time": 1719024085.6996815, "created_utc": 1718812912.0, "url": "https://i.redd.it/bjrr2kf8xj7d1.jpeg", "title": "Do you actually believe in Bigfoot or do you just the thought of him existing?", "permalink": "/r/bigfoot/comments/1djmrv3/do_you_actually_believe_in_bigfoot_or_do_you_just/", "selftext": "", "media": null, "score": 1171, "upvote_ratio": 0.95, "comment_count": 598, "over_18": false}, "23": {"id": "1dhul1d", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "truthisfictionyt", "link_flair_text": "Info", "time": 1719024086.0524983, "created_utc": 1718619040.0, "url": "https://i.redd.it/o1hnj6jrw37d1.png", "title": "Both father and son Zane and Loren Grey claimed to have seen giant sharks. Zane allegedly saw a giant around 1928 near the Polynesian island of Rangiroa. Shortly after the first sighting Loren saw one near the same island.", "permalink": "/r/Cryptozoology/comments/1dhul1d/both_father_and_son_zane_and_loren_grey_claimed/", "selftext": "", "media": null, "score": 298, "upvote_ratio": 0.97, "comment_count": 33, "over_18": false}, "24": {"id": "1dlgf0s", "locked": false, "subreddit": "humanoidencounters", "stickied": false, "category": "Cryptozoology", "author": "KOPHER_", "link_flair_text": "U.F.O. Humanoid", "time": 1719024086.1797097, "created_utc": 1719008644.0, "url": "https://www.reddit.com/gallery/1dlgf0s", "title": "strange beings with hazmat-like suits in Pampa de Agnia, Chubut, Argentina on October 12, 1978", "permalink": "/r/Humanoidencounters/comments/1dlgf0s/strange_beings_with_hazmatlike_suits_in_pampa_de/", "selftext": "Driving two F-100 pickup trucks, Alfredo Giannoni and Jorge Castillo were faced with the prospect of a 634 kilometer drive along National Route 25, linking the communities of Trelew and Esquel, communities located in the Province of Chubut.\nThey had departed at 19:00 hours on 12 October 1978, driving at an average speed of 80 Kmh. Upon reaching the Las Chapas Wilderness, Castillo overtook his companion and remained at a close distance. Around 22:00, and some 10-15 Km after Las Plumas, in the Los Altares Valley, Castillo was startled to see a small light in the sky through the windshield: it increased in magnitude, toward the right and running distantly to the left.\nAs the source of silvery light grew in intensity, Castillo’s disquiet toward the phenomenon also rose. He decided to stop and consult with Giannoni about the observation, who unhesitatingly tells him it is a “flying saucer”\nThe shocking presence of the UFO: After filling up, the headed to the restaurant of the Automovil Club hostelry, where they state having eaten fish and consumed some cold sodas. Feeling considerably more tranquil, they discussed their experience with the person running the location – which we have been able to confirm – and renewed their journey at 02:15 in the morning. They would stop every so often along the road, chatting a while to keep from falling asleep and staying close to each other at a 30 meter distance. Giannoni was up ahead until he stopped at a given point, complaining of a headache, and saying he could go no further. Castillo replied that he would go ahead, as they were very near their destination. At that time, he was about to get down from the pickup truck when both men witnessed an object measuring 3 meters in diameter with an intense white, phosphorescent light that appeared to emit a sound similar to that of a teletype machine (“beep-beep-beep”). The object was suspended one meter above the ground and some 10 meters from the startled witnesses. Upon seeing this portent, Jorge Castillo entered the pickup truck while Alfredo Gianonni – still drowsy and feeling the headache – managed to quickly pull away from the site.\nIt was then that UFO rose into the air, making itself plainly visible in a matter of seconds. Castillo, stepping on the gas, managed to catch up with his traveling companion.\nThe strange occupants: In these conditions, a startled Jorge Castillo looked through his rear view mirror and saw “a thing with many lights and two square things in the rear of the pickup truck” where he carried four drums of ink for the Esquel newspaper in the city of the same name.\nAfter having driven some 10 kilometers and around 3 in the morning, near Pampa de Agnia – a locality that only appears on the map – Castillo looked through the mirror again and saw four “square” figures in the payload that appeared to be “looking” at the drums. He continued driving nervously, glancing at the figures without stopping. According to one version of the story (2), upon delivering the ink, operators found it to be much more fluid than previous deliveries from the same factory and lot number.\nThey had covered another 15 kilometers prior to going up a long, steep rise when Giannoni, who was following closely but without seeing anything odd, said he was going to stay behind, as he was fatigued. Curiously enough, Castillo said that he could still see the humanoid figures through the mirror as well as an oval grey cloud that appeared to follow him on the side. Nonetheless, the witness gave the impression of contradicting himself when he points out Giannoni’s location with regard to his own. It is necessary to add here that at no point did Giannoni see or become aware of the presence of the alleged occupants, despite the fact that they shouted to each other from within the cabs of their pickup trucks, driving close together along the road.\nWhen he saw those figures, Castillo was driving at some 70 Kmh (bear in mind that the vehicles were in a break-in period) and when he turned on the cabin lights to see if the beings were still behind him, since the sight couldn’t be clear, he noticed to his surprise that there was nothing there, just the four ink drums. However, when he turned off the light, he could see them once more.\nView of the mountains: Alfredo Giannoni could go no further and decided to stop a while to sleep. Castillo, on the other hand, chose to continue the trip with great fear. Upon reaching a steep rise, he noticed that “the mountains on the side of the road joined as if they were made of rubber – they joined together and shut the road before me. Perhaps I was ill and grabbing my head, I stopped and thought: do I go through or not go through, will they take me away or not take me away…” However, moments after turning off his lights, the mountains returned to their rightful places. Suddenly, he sees two humanoids approaching him swiftly, walking along the desolate Patagonian road. They were a meter and a half tall, looking like astronauts in white outfits. Upon seeing them, he turned on the lights again and the disquieting vision vanished. He figures that it lasted barely a second.\nFacing this circumstance, he tried in vain to go and find Giannoni, as he was exhausted and with a pounding headache, and pain in his arm. His pickup truck was diagonally across the road, with all of its lights on. He tumbled onto the seat, covering himself with some rugs he carried as samples, allowing an indefinite period of time to go by. Giannoni appeared out of nowhere, urging him to continue the trip. Traveling at 80 kmh, Castillo was some 10 to 20 meters behind, all the time seeing the mysterious cloudy object through his rear view mirror.\nAn unusual turn of events? : With less than 60 km to reach Esquel, in the vicinity of the Tecka River, Giannoni’s pickup truck “slid on the shoulder and went up in the air, landing in a very deep ditch,” according to the description given by Castillo, who did not hesitate in ascribing it to the strange phenomenon he was seeing, adding that the vehicle “was lifted from the front, without overturning any cement barriers, passing over them as though lifted. Furthermore, there’s nothing broken on it. Just a dented roof, as if they’d lifted it and turned it around.” Giannoni rested against the steering wheel, and while somewhat bruised and with a clamped leg, he exclaimed that he was okay. Castillo then got down rendering assistance and getting the motor going again with the lights on. He brought his companion back to his own pickup and they arrived in that vehicle, reaching Esquel after 6 in the morning.\nSource :https://inexplicata.blogspot.com/2013/11/argentina-humanoids-at-pampa-de-agnia.html?m=1", "media": null, "score": 38, "upvote_ratio": 0.91, "comment_count": 6, "over_18": false}, "25": {"id": "1diha2f", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "McDirken_Dirkenstein", "link_flair_text": null, "time": 1719024086.6692903, "created_utc": 1718682144.0, "url": "https://i.redd.it/c4v0kawe497d1.jpeg", "title": "Listen just tell me I’m crazy.", "permalink": "/r/cryptids/comments/1diha2f/listen_just_tell_me_im_crazy/", "selftext": "I have heard weird stuff around my house my entire life at night, things scratching on the screen on the second floor, bangs on the door , cats freaking out for no apparent reason. I was outside about an hour ago, and heard weird screaming from the woods. Like a woman but off somehow. Took a picture , didn’t see anything at first. ", "media": null, "score": 284, "upvote_ratio": 0.91, "comment_count": 164, "over_18": false}, "26": {"id": "1di6y9f", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "Storm-Queen5", "link_flair_text": "Discussion/Advice", "time": 1719024086.811646, "created_utc": 1718653270.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1di6y9f/a_strange_bell_can_be_heard_from_outside/", "title": "A strange bell can be heard from outside ", "permalink": "/r/Thetruthishere/comments/1di6y9f/a_strange_bell_can_be_heard_from_outside/", "selftext": "We just moved into a very old, big house, actually it's more of a mansion. It's a 15 minute walk to a somewhat small forest and a 15 minute drive to a big town, so you can't tell it's in the middle of nowhere, but it's still a bit secluded. \nLate at night I hear a lot of creepy and unsettling things, but I also have a big imagination and I'm a coward, so I might just freak myself up for nothing.\nThere are a lot of stray dogs outside my house, they are usually quiet and friendly but for the last 4 days every night after 2am they go crazy and start barking aggressively. In between barks though I can here a bell, a bell that 'plays' the first 2 notes of a popular song from my home country and then stops only to start again in 10-15 seconds. \nAfter about 20 minutes, all filaments stop. It happened every night, every time between 2 and 3 in the morning, and every night the bell gets louder and louder(only by a bit each day) \nI want to know if anyone has gone through something similar, or if you've heard of something like this before, I have no idea what it could be, but I'm sorry from the bottom of my heart that I'm just worring myself for nothing.\nThere are other scary things that happened in the area, but I can find an explanation for those. \nI found trees tied with string through the forest and the sensor light in the garden sometimes turns on for no reason, and there are nights when the dogs' barks seem fake (idk how to describe them, they are just not right) but those things don't freak me out as much", "media": null, "score": 43, "upvote_ratio": 0.94, "comment_count": 6, "over_18": false}, "27": {"id": "1didg0u", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "WriterMcAuthorFace", "link_flair_text": null, "time": 1719024086.9655092, "created_utc": 1718670224.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1didg0u/i_was_served_chicken_wings_by_a_future_murderer/", "title": "I was served chicken wings by a future murderer", "permalink": "/r/LetsNotMeet/comments/1didg0u/i_was_served_chicken_wings_by_a_future_murderer/", "selftext": "I live in Pennsylvania just outside Philly and the following happened a few years ago. \nIt was a late November evening and my wife and I were craving wings. A quick search brought up a new joint in Royersford, PA that had just opened. I put it an online order and zip on by. The man behind the counter, middle aged African American gentleman with a jovial disposition and a hearty laugh. \nWe talked about the Eagles while he got my food ready. I thanked him and left. \nA few months later he's in the news for killing his business partner. Apparently over a money dispute. She had funds and he wanted them for a new location, but she refused.\nHe buried her out in an industrial area and parked her car elsewhere. The police found evidence of him being in her car, several failed attempts at access to her Cash app/Venmo account, evidence of a struggle in her home and before long, Chicken Wing guy was arrested, tried and convicted of his business partners murder. \nI didn't connect it until later that this was the same guy after an article named the business he owned. The very restaurant I got wings at those few months prior. \nWings weren't that good, I recall. \nSo, convicted murderer \"A.W.\" ... Let's not meet. ", "media": null, "score": 92, "upvote_ratio": 0.92, "comment_count": 8, "over_18": true}, "28": {"id": "1dh7ing", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "Batman3015_", "link_flair_text": null, "time": 1719024087.1459098, "created_utc": 1718544228.0, "url": "https://www.reddit.com/r/threekings/comments/1dh7ing/solo_ritual_ideas/", "title": "Solo Ritual ideas", "permalink": "/r/threekings/comments/1dh7ing/solo_ritual_ideas/", "selftext": "I’m looking for a solo ritual I can do, I don’t have access to very many things EG candles, lighters. ", "media": null, "score": 3, "upvote_ratio": 1.0, "comment_count": 6, "over_18": false}, "29": {"id": "1dhp7f7", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "CyKoAUSSIE", "link_flair_text": null, "time": 1719024087.4058027, "created_utc": 1718596730.0, "url": "https://i.redd.it/3k3omucf227d1.jpeg", "title": "Anyone seen ANYTHING like this?Just came back inside at night and as I turned to close the door I had this “thing” staring at me. It filled the door and had these green/white strips around its body. Pitch black..", "permalink": "/r/Ghosts/comments/1dhp7f7/anyone_seen_anything_like_thisjust_came_back/", "selftext": "I’ve experienced shadow people before, but not this large, and not with these green/white glowing strips around its body.\nWhat could it have been?!", "media": null, "score": 823, "upvote_ratio": 0.9, "comment_count": 304, "over_18": false}, "30": {"id": "1dggirw", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "wahgwahg", "link_flair_text": "Glitch Vid", "time": 1719024087.6177986, "created_utc": 1718453269.0, "url": "https://v.redd.it/2uescmpcpb6d1", "title": "Blud is NPC glitching", "permalink": "/r/GlitchInTheMatrix/comments/1dggirw/blud_is_npc_glitching/", "selftext": "", "media": null, "score": 202, "upvote_ratio": 0.75, "comment_count": 105, "over_18": false}, "31": {"id": "1dh3ufg", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "speakersushi", "link_flair_text": null, "time": 1719024089.2959657, "created_utc": 1718529854.0, "url": "https://i.redd.it/cw2fq1n5i9c71.jpg", "title": "Looks like Tic Tacs jumped on the bandwagon.", "permalink": "/r/ufo/comments/1dh3ufg/looks_like_tic_tacs_jumped_on_the_bandwagon/", "selftext": "", "media": null, "score": 200, "upvote_ratio": 0.91, "comment_count": 31, "over_18": false}, "32": {"id": "1djjint", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "dhr2330", "link_flair_text": "Discussion", "time": 1719024090.4285574, "created_utc": 1718804626.0, "url": "https://v.redd.it/a06qxea78j7d1", "title": "Three perfect spheres in the form of a triangle captured by a woman in North Central Texas", "permalink": "/r/UFOs/comments/1djjint/three_perfect_spheres_in_the_form_of_a_triangle/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 2400, "fallback_url": "https://v.redd.it/a06qxea78j7d1/DASH_720.mp4?source=fallback", "has_audio": true, "height": 1280, "width": 720, "scrubber_media_url": "https://v.redd.it/a06qxea78j7d1/DASH_96.mp4", "dash_url": "https://v.redd.it/a06qxea78j7d1/DASHPlaylist.mpd?a=1721616089%2CNzZmMzYxNzUyOWRhYzdhYTFhY2VlMDNjMTIzZjg3M2M2OWRhNWY2N2E5MzAwYzU2M2M5NWM0MDQxOTBmMGE4Mg%3D%3D&v=1&f=sd", "duration": 61, "hls_url": "https://v.redd.it/a06qxea78j7d1/HLSPlaylist.m3u8?a=1721616089%2CZjIyZDk3NjIxMGNhYTY5NGNmY2MxMTAyNDk2MmIxZWZjODhhNTA3YmM3M2Q0Yzg0ZmI2OGQ4YzVkNjc5NDM2Nw%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 2254, "upvote_ratio": 0.84, "comment_count": 511, "over_18": false}, "33": {"id": "1djliwu", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "blit_blit99", "link_flair_text": "Evidence :upvote:", "time": 1719024092.1109586, "created_utc": 1718809807.0, "url": "https://www.reddit.com/r/aliens/comments/1djliwu/aliens_confirm_that_humans_have_a_lightbody/", "title": "Aliens confirm that humans have a \"light-body\" duplicate. This light-body survives after you die.", "permalink": "/r/aliens/comments/1djliwu/aliens_confirm_that_humans_have_a_lightbody/", "selftext": "Excerpt from the book \"The Andreasson Affair\" about the Betty Andreasson UFO abductions in the 1960s thru the 1980s:\n(\"Quazgaa\" is the name of the grey-type alien who has Betty laying on a table aboard a UFO):\nLater, at the June 4 session, it was decided to let Betty actually relive examination as a participant. We began at the point when Betty had been somehow swept off her feet into the air and slowly lowered onto the table.\n“What are you going to do, Quazgaa?” she asked.\n“Just want to measure you for light,” Quazgaa said.\n“That’s what you are going to do?\nJust measure me for light?”\n“We are just going to measure you for light.”\n(snip)\n“You have not understood the word that you have,” Quazgaa told her.\n“You’ve misunderstood some places.… There are spots there from it.… You are not completely filled with the light.”\n(snip)\nIn 1978, Betty and Bob heard a whirring sound above their house. Concurrently, both were lifted out of their bodies and, along with others, entered a huge round amphitheater-like enclosure. They were greeted by tall, robed human-looking entities. They found themselves on a high walkway that surrounded the enclosure. Bob was separated from Betty. He was told that he was not as spiritually advanced as Betty and was held to wait for her. During that time he received answers to many questions that he asked an alien who guarded him. Betty, on the other hand, was allowed to participate with a number of light beings in a fantastic procedure that changed her and them into balls of light and back to their light- being form.\n(snip)\nThe craft returned to earth. Betty was placed back into the blue- glowing orb, which descended to the ground just outside the trailer. She entered and went to the bedroom where Bob was sleeping. She was shocked to the core when she saw her physical body in bed before she entered it. Betty had no idea how her physical body got back to the trailer while she was still in an OBE state of being.\n******************\nFrom the book The Source Field Investigations by David Wilcock:\nThe DNA Phantom Effect\nNow I want to jump ahead in time to 1984, because this was the year our “addiction” to DNA was heavily challenged, if not defeated, by Dr. Peter Gariaev. Gariaev’s discovery also gave us a compelling hint that Gurwitsch’s mitogenetic radiation—the Source Field—may well be operating through our DNA. Furthermore, Gariaev’s discovery suggests that the complete genetic codes for an organism might not actually be found in the DNA molecule after all—at least not as their final location. When Gariaev put a sample of DNA in a tiny quartz container, zapped it with a mild laser, and then observed it with sensitive equipment that could detect even single photons of light, he found that the DNA acted like a light sponge. Somehow, the DNA molecule absorbed all the photons of light in the area, and actually stored them in a corkscrew-shaped spiral.7 This is very, very strange. The DNA apparently created a vortex of some sort that attracted the light, not unlike the idea of a black hole—but on a much, much smaller scale.\n(snip)\nDr. Peter Gariaev’s DNA Phantom Effect proved that the DNA molecule captures and stores light. A mysterious force holds the light in the same place for up to 30 days after the DNA molecule itself has been removed from the area.\n(snip)\nWhatever was holding that light in place, it did not need the DNA molecule at all. It was something else. Something invisible. Something powerful enough to store and control visible light within the shape of the DNA molecule itself. The only rational, scientific explanation is that there has to be an energy field that is paired up with the DNA molecule—as if DNA has an energetic “duplicate.” This duplicate has the same shape as the physical molecule—but once we move the DNA, the duplicate still hangs around in the same spot the molecule was in before. It doesn’t need the DNA molecule to be there in order for it to keep on doing its job—storing visible light. Some force, perhaps akin to gravity, is holding the photons in place.\n(snip)\nThe implications of this are mind-boggling. Obviously, in the case of a human body we have far more than one DNA molecule to consider—we have untold trillions of them, in a very highly structured arrangement. We have bone DNA, organ DNA, blood DNA, muscle DNA, tendon DNA, skin DNA, nervous-system DNA and brain DNA. So, just by a simple extension of Gariaev’s experiment, it is very likely that our entire body must have an energetic duplicate. This fits in perfectly with what Driesch, Gurwitsch, Burr and Becker all theorized and observed—there is an information field that tells our cells what to do, and where to do it. Once we add Gariaev’s discovery in, we find out that perhaps the most important thing the DNA molecule does is store light—both in our physical body and in our energetic duplicate body as well.\n(snip)\nHowever, it does fit in very nicely with what we’ve been calling the Source Field. On a microbiological level, it appears that we have an energetic duplicate. Our DNA is somehow interfacing with an energy field that has remained largely unknown to Western scientists, and which leaves behind a phantom that can easily be measured.\n(snip)\nIt’s like a perfect hologram of your physical body—which is correct down to the tiniest cell.\n(snip)\nIn 1907, as published in the American Medicine journal, Dr. Duncan MacDougall found that his patients suddenly lost a little over one ounce of weight directly after their physical death. In these studies, the patients were kept on beds within a metallic basin that would catch any bodily fluids. The air they exhaled from their lungs upon death did not weigh anywhere near one ounce—nonetheless, the weight loss remained consistent in every case.\nIn 1975, Dr. Hereward Carrington and associates found that the average person would lose two and a quarter ounces of weight while they were having an out-of-body experience. When they returned to the body, the missing mass immediately returned. It appears there is an “energetic” component of our bodies that may be withdrawing from each and every cell, and projecting to other locations— either at death, when remote viewing or when having an out-of-body experience.\n*************\nEdit: add link to \"Body of Light\" Wikipedia entry below.\nBody of light - Wikipedia", "media": null, "score": 1196, "upvote_ratio": 0.84, "comment_count": 504, "over_18": false}, "34": {"id": "1dhr8is", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "ufoarchivist", "link_flair_text": "Video", "time": 1719024092.4928448, "created_utc": 1718604616.0, "url": "https://youtu.be/K-xKex5-_Qc", "title": "Paul Hellyer testifying at the Citizen Hearing on UFO Disclosure in Washington, D.C.", "permalink": "/r/UAP/comments/1dhr8is/paul_hellyer_testifying_at_the_citizen_hearing_on/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Paul Hellyer testifying at the Citizen Hearing on UFO Disclosure in Washington, D.C.", "type": "video", "thumbnail_width": 480, "height": 200, "width": 267, "html": "<iframe width=\"267\" height=\"200\" src=\"https://www.youtube.com/embed/K-xKex5-_Qc?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Paul Hellyer testifying at the Citizen Hearing on UFO Disclosure in Washington, D.C.\"></iframe>", "author_name": "UFO Archives", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/K-xKex5-_Qc/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@UFOArchivist"}}, "score": 44, "upvote_ratio": 0.84, "comment_count": 4, "over_18": false}, "35": {"id": "1dkm52i", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "FreedomVegan", "link_flair_text": null, "time": 1719024093.5604596, "created_utc": 1718916616.0, "url": "https://i.redd.it/t6gzf26mhs7d1.jpeg", "title": "In case anyone forgot…", "permalink": "/r/conspiracy/comments/1dkm52i/in_case_anyone_forgot/", "selftext": "Gaslighting 101 - also associate any skepticism with Q anon… mainstream media is just a tool for ruling class. ", "media": null, "score": 1700, "upvote_ratio": 0.86, "comment_count": 305, "over_18": false}, "36": {"id": "1dkjxku", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "GypsyRoadHGHWy", "link_flair_text": null, "time": 1719024093.820056, "created_utc": 1718910999.0, "url": "https://youtube.com/live/IS147NH0lJY", "title": "Existence of Psychics: Truth or Myth?", "permalink": "/r/conspiracyfact/comments/1dkjxku/existence_of_psychics_truth_or_myth/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.75, "comment_count": 1, "over_18": false}, "37": {"id": "1diq0yx", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "Cosmicmimicry", "link_flair_text": "PGF", "time": 1719024094.4252193, "created_utc": 1718715434.0, "url": "https://i.redd.it/e91ih0hevb7d1.gif", "title": "Patterson Gimlin Footage Baby", "permalink": "/r/bigfoot/comments/1diq0yx/patterson_gimlin_footage_baby/", "selftext": "I genuinely believe there is a baby hanging on her left side.\nIt's why she keeps parallel to Roger Pattinson and his camera, it's why she stays calm and doesn't run.\nIt's possibly why her breasts are engorged, as she may be nursing, and it's why her left arms never swings backwards like the right one does.\nI personally can see an arm from the infant wrapped behind the animal, where there is some discoloration on the lower back, gripping the hair to hang on like other primates.\nIf this isn't something you can see, that's alright, but in my mind it's almost certainly the case, and perhaps the only reason we have footage of this animal.", "media": null, "score": 693, "upvote_ratio": 0.9, "comment_count": 332, "over_18": false}, "38": {"id": "1dl5qoz", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Astral_Zeta", "link_flair_text": "Art", "time": 1719024094.746418, "created_utc": 1718981139.0, "url": "https://i.redd.it/7lcinachtx7d1.jpeg", "title": "Here’s this old timey art of the Mothman", "permalink": "/r/Cryptozoology/comments/1dl5qoz/heres_this_old_timey_art_of_the_mothman/", "selftext": "At least I think this drawing is supposed to depict Mothman.  Dude looks like a rejected Showa Kamen Rider villain. ", "media": null, "score": 297, "upvote_ratio": 0.97, "comment_count": 20, "over_18": false}, "39": {"id": "1djc7n7", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Remarkable_Act1048", "link_flair_text": null, "time": 1719024095.3716905, "created_utc": 1718777681.0, "url": "https://i.redd.it/ut5h26th0h7d1.jpeg", "title": "Sorry", "permalink": "/r/cryptids/comments/1djc7n7/sorry/", "selftext": "In another post I depicted the Wendigo as the version with a deer skull people corrected me some being nice about it and others calling me retarded", "media": null, "score": 270, "upvote_ratio": 0.94, "comment_count": 38, "over_18": false}, "40": {"id": "1dkygoq", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "james_doxxinyou", "link_flair_text": "Paranormal Investigation", "time": 1719024095.4936068, "created_utc": 1718955907.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1dkygoq/something_was_at_my_door_at_midnight/", "title": "something was at my door at midnight ", "permalink": "/r/Thetruthishere/comments/1dkygoq/something_was_at_my_door_at_midnight/", "selftext": "on a cold night around 11:50ish pm my sister was just minding her own thing at the living room, at where the entrance of our house was. she started hearing three faint soft knocks on the door while our small dog was barking at the covered window while also taking a sniff underneath the door. she told my mom about it and asked me to come with her outside. after going outside and searching around our area there was nothing to be seen, my mom thinks its the entities that live on the trees near our house particularly large mango trees. as Filipinos we have very strong beliefs about paranormal creatures and this wasn't our first incident with them. almost every night around or past midnight our dog seems to be always barking at the door or the window. also way before our house was built there was a large Narra tree in the lot and we've been living on the same spot for over 55 years now.", "media": null, "score": 39, "upvote_ratio": 0.93, "comment_count": 10, "over_18": false}, "41": {"id": "1dk75z4", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Dull_Bee_8206", "link_flair_text": null, "time": 1719024095.6617794, "created_utc": 1718874419.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1dk75z4/i_was_followed_at_night/", "title": "I was followed at night", "permalink": "/r/LetsNotMeet/comments/1dk75z4/i_was_followed_at_night/", "selftext": "When I was 18, I got sent to live with my dad in South Africa. Normal teenage boy angst. I'm as British as beans on toast, so this was a very new experience. My dad lived near the airport in Joburg. And he was often away for work. So I basically lived alone for long stretches. The shortest was a month, , the longest was three months. \nI essentially did my own shopping and what one would consider mild cooking. I couldn't drive yet, so I walked everywhere. And my dad didn't give me many rules. Just one really. Don't go out alone at night.\nHe didn't mean in our yard, because we lived in a gated community. And there was a security guard at the front. He meant out out. The neighbourhood was different after dark. The nights weren't safe. Robbers, he said. I heard him, but I didn't take it seriously. \nIt used to get really dark by 6pm. It was darker than any night I'd ever encountered in London. Without the street lamps it would have been pure black. One evening, around 7pm, I decided I wanted crisps. Potato chips, to my esteemed American friends. I was home alone, and had been for two weeks. And I was bored. So I broke the only rule I had. \nEven the security guard tried to stop me, when I told him I was going out. He told me he'd buy them for me after his shift in an hour, but I was nearly 19, 6 foot tall, built like a rake with shoulders, no fighting experience at all, but full of bravado. I wasn't scared. \nThe road from my dad's house was brightly lit. The store was about a mile away. But there was an avenue you had to walk through that had loads of trees and no lighting. Pitch black.  There was a cold wind blowing. The sounds of insects and birds felt magnified. And that's when I heard the footsteps. \nI looked back and around, but I couldn't see anyone. So I kept walking. Telling myself I was imagining things. I walked a bit more. Then I heard them again. Footsteps, but again I couldn't see anyone. \nThere was the road, where I was, and then a path on the side lined with trees. I was in the middle of the road because I'd convinced myself it was safer. And I realised the person wasn't in the road, they were on the path. \nI kept walking. Faster this time. Singing loudly. I was convinced I was imagining it, but the footsteps continued. I was feeling more and more frightened. So to assure myself I was just imagining it, I stopped, and turned on the torch on my phone, then pointed it at the path.\nPeeking from behind a tree was a man. He was maybe around 30, and he was watching me. I swear he had something in his hand. I'm not sure if he did. But in my mind, I saw what looked like a knife. \nI turned around and just ran back home. I didn't bother listening for anything. I just ran back as fast as I could. I couldn't breathe, and my chest was on fire. The security guard heard me and had the gate open even before I arrived. He looked at me with a knowing. As I panted, trying to catch my breath. \nHe never asked me about it. But I know he knew what had happened. I never saw the man again, and I don't know what would have happened. I also didn't tell my dad or anyone for that matter. \nThe security guard, got me the crisps, if you're wondering. And for the rest of the year I stayed there, I never went walking alone at night again. ", "media": null, "score": 69, "upvote_ratio": 0.94, "comment_count": 14, "over_18": true}, "42": {"id": "1djcmrk", "locked": false, "subreddit": "threekings", "stickied": false, "category": "Paranormal", "author": "REALSPLIFFLORD", "link_flair_text": null, "time": 1719024095.853994, "created_utc": 1718779353.0, "url": "https://www.reddit.com/r/threekings/comments/1djcmrk/trying_to_worship_saraiel/", "title": "Trying to worship Saraiel", "permalink": "/r/threekings/comments/1djcmrk/trying_to_worship_saraiel/", "selftext": "Need help learning.", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "43": {"id": "1dkgpgk", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "Witty-Cabinet6162", "link_flair_text": "Captured Apparition ", "time": 1719024096.1128724, "created_utc": 1718902941.0, "url": "https://www.reddit.com/gallery/1dkgpgk", "title": "Back on December 28th, 2023 at 2:09 p.m., I captured this spirit at the top of the step at the Devil's Den.", "permalink": "/r/Ghosts/comments/1dkgpgk/back_on_december_28th_2023_at_209_pm_i_captured/", "selftext": "", "media": null, "score": 247, "upvote_ratio": 0.73, "comment_count": 139, "over_18": false}, "44": {"id": "1djvj46", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Weird_Amount_4608", "link_flair_text": "Glitch Vid", "time": 1719024096.335577, "created_utc": 1718834949.0, "url": "https://v.redd.it/mx0116ghrc4d1", "title": "Drone Show in Busan, Gwangalli Beac", "permalink": "/r/GlitchInTheMatrix/comments/1djvj46/drone_show_in_busan_gwangalli_beac/", "selftext": "", "media": null, "score": 52, "upvote_ratio": 0.93, "comment_count": 4, "over_18": false}, "45": {"id": "1dkdh68", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "zilkSilk", "link_flair_text": null, "time": 1719024098.3054004, "created_utc": 1718894912.0, "url": "https://media.giphy.com/media/leYakI3z0mS64/giphy.gif", "title": "To all you aliens are angels/demons/gods folk", "permalink": "/r/ufo/comments/1dkdh68/to_all_you_aliens_are_angelsdemonsgods_folk/", "selftext": "", "media": null, "score": 181, "upvote_ratio": 0.86, "comment_count": 81, "over_18": false}, "46": {"id": "1di0lys", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "NewParadigmInstitute", "link_flair_text": "Compilation", "time": 1719024099.7277286, "created_utc": 1718637489.0, "url": "https://v.redd.it/c93v8ux2f57d1", "title": "WE THE PEOPLE Call On CNN To Include UFO/UAP Disclosure as a topic in the upcoming Presidential Debate on June 27, 2024! 🇺🇸🛸", "permalink": "/r/UFOs/comments/1di0lys/we_the_people_call_on_cnn_to_include_ufouap/", "selftext": "", "media": {"reddit_video": {"bitrate_kbps": 5000, "fallback_url": "https://v.redd.it/c93v8ux2f57d1/DASH_1080.mp4?source=fallback", "has_audio": true, "height": 1080, "width": 1920, "scrubber_media_url": "https://v.redd.it/c93v8ux2f57d1/DASH_96.mp4", "dash_url": "https://v.redd.it/c93v8ux2f57d1/DASHPlaylist.mpd?a=1721616098%2COGNlYzc3ZDNhZGQwZWI5ZWIxOTI0YTAwMzVmYTVkZGM2YThkZjM3N2IwYzE3NjRkMzViOGViNWFmMjQxOTE4MQ%3D%3D&v=1&f=sd", "duration": 177, "hls_url": "https://v.redd.it/c93v8ux2f57d1/HLSPlaylist.m3u8?a=1721616098%2CMDgyNjYzMDAwN2EzNjczOWUxNWI5YTY5ZTUwMmRiZTRlZGQ3OTU5MDY3NjY0YTE1NWZkZDJhNmZhYzAxOTVjNg%3D%3D&v=1&f=sd", "is_gif": false, "transcoding_status": "completed"}}, "score": 1567, "upvote_ratio": 0.91, "comment_count": 99, "over_18": false}, "47": {"id": "1dhhjq9", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "Holiday-Two-2834", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1719024101.0737755, "created_utc": 1718572542.0, "url": "https://www.reddit.com/gallery/1dhhjq9", "title": "What's your favorite Alien invasion movie?", "permalink": "/r/aliens/comments/1dhhjq9/whats_your_favorite_alien_invasion_movie/", "selftext": "", "media": null, "score": 1110, "upvote_ratio": 0.96, "comment_count": 994, "over_18": false}, "48": {"id": "1dix5j5", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "StillChillTrill", "link_flair_text": "Discussion", "time": 1719024101.5875738, "created_utc": 1718733794.0, "url": "/r/UFOs/comments/1dija4q/pt_3_of_3_the_whistleblower_his_investigation_and/", "title": "PT 3 of 3: The Whistleblower, His Investigation, and a Consolidated Timeline", "permalink": "/r/UAP/comments/1dix5j5/pt_3_of_3_the_whistleblower_his_investigation_and/", "selftext": "", "media": null, "score": 25, "upvote_ratio": 0.87, "comment_count": 6, "over_18": false}, "49": {"id": "1dhze1r", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Trainer_Red_Steven", "link_flair_text": null, "time": 1719024103.5200102, "created_utc": 1718634373.0, "url": "https://i.redd.it/8nezqm0d657d1.png", "title": "Anyone else see this? ", "permalink": "/r/conspiracy/comments/1dhze1r/anyone_else_see_this/", "selftext": "", "media": null, "score": 1580, "upvote_ratio": 0.86, "comment_count": 643, "over_18": false}, "50": {"id": "1dhi4p0", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "InternationalForm3", "link_flair_text": null, "time": 1719024103.7537608, "created_utc": 1718574189.0, "url": "https://www.reuters.com/investigates/special-report/usa-covid-propaganda/", "title": "Pentagon ran secret anti-vax campaign to incite fear of China vaccines", "permalink": "/r/conspiracyfact/comments/1dhi4p0/pentagon_ran_secret_antivax_campaign_to_incite/", "selftext": "", "media": null, "score": 2, "upvote_ratio": 0.67, "comment_count": 1, "over_18": false}, "51": {"id": "1djpy4x", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "ThePowersThatBri", "link_flair_text": "bigfoot sign/cutout/statue/etc", "time": 1719024104.373974, "created_utc": 1718820857.0, "url": "https://i.redd.it/e9101hmvkk7d1.jpeg", "title": "Saw this beauty on my commute today", "permalink": "/r/bigfoot/comments/1djpy4x/saw_this_beauty_on_my_commute_today/", "selftext": "I wanna be this guy’s friend. ", "media": null, "score": 336, "upvote_ratio": 0.95, "comment_count": 36, "over_18": false}, "52": {"id": "1dis6bo", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "Thatfelicitykid", "link_flair_text": null, "time": 1719024104.6601286, "created_utc": 1718721290.0, "url": "https://i.redd.it/rfpvuwdtcc7d1.png", "title": "Thylacine de-extinction project!", "permalink": "/r/Cryptozoology/comments/1dis6bo/thylacine_deextinction_project/", "selftext": "Delete if not allowed, this picture was drawn by me out of excitement this morning. I was unaware of this DNA cloning project until a commenter on a recent post brought it up. My question is, what are your guy's thoughts on the cloning aspect being a success? Seeing as though the Bucardo attempt failed, I'm not sure how much effort they're willing to put into the thylacine before they call it quits. Either way, I'm absolutely elated on the idea of bringing back such a wonderful creature!", "media": null, "score": 205, "upvote_ratio": 0.95, "comment_count": 16, "over_18": false}, "53": {"id": "1dgw42d", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Pteroducktyl_", "link_flair_text": null, "time": 1719024105.2854955, "created_utc": 1718499447.0, "url": "https://i.redd.it/ozgvgtw51u6d1.jpeg", "title": "I got this wendigo done about 5 years ago, anyone else have cryptid tattoos?", "permalink": "/r/cryptids/comments/1dgw42d/i_got_this_wendigo_done_about_5_years_ago_anyone/", "selftext": "", "media": null, "score": 236, "upvote_ratio": 0.87, "comment_count": 57, "over_18": false}, "54": {"id": "1dkk5w3", "locked": false, "subreddit": "thetruthishere", "stickied": false, "category": "Paranormal", "author": "thirteenpotts", "link_flair_text": "Theory/Debunking", "time": 1719024105.4111347, "created_utc": 1718911588.0, "url": "https://www.reddit.com/r/Thetruthishere/comments/1dkk5w3/alternate_timelines/", "title": "Alternate timelines?", "permalink": "/r/Thetruthishere/comments/1dkk5w3/alternate_timelines/", "selftext": "Could be just a case of us misremembering but my best friend and I saw an ad for Three network, and she said “oh Three sucks” and I laughed said “I’m on Three.”\nShe’s completely certain I’ve always been on O2 and I’ve been on Three since I got my first phone when I was 10. \nShe usually gets muddled up with stuff like this but always acknowledges it with “oh I might be wrong etc” but she’s so adamant that this was the case. I’ve also almost never heard her so certain about something when it comes to this kind of stuff.\nWeird alternate timeline or just her misremembering?", "media": null, "score": 0, "upvote_ratio": 0.25, "comment_count": 2, "over_18": false}, "55": {"id": "1dl081j", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Asstronauts_", "link_flair_text": null, "time": 1719024105.5660315, "created_utc": 1718963554.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1dl081j/ive_ignored_him_long_enough/", "title": "I’ve Ignored Him Long Enough. ", "permalink": "/r/LetsNotMeet/comments/1dl081j/ive_ignored_him_long_enough/", "selftext": "Disclaimer: Always report incidents like this to trusted adults and authorities immediately. Please do not handle similar situations the way I did. \nIt began the summer before I entered high school (2018) with innocent messages on Facebook. I never understood why he continued to message me. After a couple of days of him texting 6-7 times in a row (without reply), he stated that he was 26, from my hometown but stationed elsewhere in the army, and had plans to find a young wife to cherish. I made it clear that I was 14 and uninterested, then blocked his account. The next day, he made another account, calling me \"babygirl\" and telling me that I was what he wanted in a wife. This wasn't the first time I had dealt with an older man interested in me, naively, I muted the chat and moved on with my life.\nI stopped thinking about him, enjoyed my summer, and then started high school. Everything was going great until the packages started to arrive. First, a necklace with his name on it, then one shaped like a heart. They had receipts and were expensive. I was terrified that he had found my address, so I showed my mom everything. My mom tried to return the gifts (not sure why that was her reaction), but he refused. Showing my mom the messages was the first time I had actually read any of them. They were weird, and some were about eloping with me when I turned 16.\nMy mom found out that he went to high school with both of my older siblings. My sister recalled him as a weird anime nerd, and he was friendly towards my brother, also an anime nerd. I ended up blocking a few more accounts and tried to ignore what I thought wasn’t that serious of a situation. After this we never spoke of him again.\nOne afternoon in November of my freshman year, I was in gym class with friends when I received a call with no ID. My friends told me to pick up, thinking it was a telemarketer or spam that we could mess with. We all heard something along the lines of, \"I’m waiting outside of gym for when you get done with class.\" We thought it was another friend pranking us, laughed, and moved on. After class, I had a weird gut feeling and tried to leave through the visitor doors, but the coach told me it wasn't permitted. I walked out, and there he was. He grabbed my throat, jammed his mouth against mine, and told me he was disappointed I wasn’t wearing the jewelry he got me then walked away. I sprinted to my theater teacher, the only teacher I trusted, and cried for the rest of the day until convincing my brother to pick me up. I blamed the tears on the recent passing of my grandpa. \nI kept receiving CDs, mixtapes (he wrote many songs about me), bracelets, and cards until Covid began, but never saw him in person again after that day. \nTL;DR: at 14 I naively let a 26 y/o harass me with messages online and gifts sent to my home. He eventually assaulted me at school. ", "media": null, "score": 62, "upvote_ratio": 0.96, "comment_count": 11, "over_18": true}, "56": {"id": "1dimwu3", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "bakedbeansfordinnerz", "link_flair_text": null, "time": 1719024106.036376, "created_utc": 1718704695.0, "url": "https://i.redd.it/p114gctgza7d1.jpeg", "title": "? Shadow Figure at abandoned retirement home", "permalink": "/r/Ghosts/comments/1dimwu3/shadow_figure_at_abandoned_retirement_home/", "selftext": "A few years ago my friend and i were walking through an abandoned retirement home, taking photos, being silly etc, once we got home we decided look through the photos we took, this one freaked us out!! no way it could’ve been our shadows as it was around a corner. ", "media": null, "score": 120, "upvote_ratio": 0.88, "comment_count": 14, "over_18": false}, "57": {"id": "1dkxc99", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "DavitoDaCosta", "link_flair_text": "Glitch Pic", "time": 1719024106.261886, "created_utc": 1718951252.0, "url": "https://i.redd.it/hoa0hrxlcv7d1.jpeg", "title": "Am I seeing double/triple?? Maybe there was a sale on lol", "permalink": "/r/GlitchInTheMatrix/comments/1dkxc99/am_i_seeing_doubletriple_maybe_there_was_a_sale/", "selftext": "", "media": null, "score": 6, "upvote_ratio": 0.61, "comment_count": 1, "over_18": false}, "58": {"id": "1dg7ng9", "locked": false, "subreddit": "ufo", "stickied": false, "category": "Aliens", "author": "lastofthefinest", "link_flair_text": null, "time": 1719024108.0441144, "created_utc": 1718418099.0, "url": "https://www.reddit.com/r/ufo/comments/1dg7ng9/im_honored_to_be_sharing_my_story_with_ross/", "title": "I’m honored to be sharing my story with Ross Coulthart on News Nation soon.", "permalink": "/r/ufo/comments/1dg7ng9/im_honored_to_be_sharing_my_story_with_ross/", "selftext": "Over a year ago, before David Grusch came forward and the Congressmen traveled to Eglin demanding to interview the pilots that captured UAPs on their phones, I shared my experience on Eglin Air Force Base. Here’s the original post https://www.reddit.com/r/UFOs/s/3WmwHLdD8L . I’m happy Ross and News Nation appreciate the significance of what I had to say. I hope it helps illuminate some of the mysteries of what goes on at one of the biggest military bases in the United States. You can read more about the facility here https://en.m.wikipedia.org/wiki/Eglin_AFB_Site_C-6 . Nobody has the right to suppress the presence of UAPs/UFOs from the citizens of the world. ", "media": null, "score": 141, "upvote_ratio": 0.91, "comment_count": 47, "over_18": false}, "59": {"id": "1dhx2no", "locked": false, "subreddit": "ufos", "stickied": false, "category": "Aliens", "author": "TommyShelbyPFB", "link_flair_text": "News", "time": 1719024109.4181755, "created_utc": 1718627981.0, "url": "https://www.foxnews.com/us/ufos-soar-taboo-presidential-time-come-inject-uaps-elections-institute-says", "title": "UFOs soar from taboo to presidential. Time has come to inject UAPs into the ... elections,  institute says. A social media campaign — #DisclosureDebate — is catching on to convince moderators of presidential debates to ask about UFOs.", "permalink": "/r/UFOs/comments/1dhx2no/ufos_soar_from_taboo_to_presidential_time_has/", "selftext": "", "media": null, "score": 1432, "upvote_ratio": 0.89, "comment_count": 166, "over_18": false}, "60": {"id": "1dhb8g9", "locked": false, "subreddit": "aliens", "stickied": false, "category": "Aliens", "author": "CheapCrystalFarts", "link_flair_text": "shitpost sunday:snoo_trollface: (Sundays Only)", "time": 1719024110.7964647, "created_utc": 1718555071.0, "url": "https://i.redd.it/s7jm4a7kmy6d1.jpeg", "title": "TFW you try and warn them but get yeeted instead ", "permalink": "/r/aliens/comments/1dhb8g9/tfw_you_try_and_warn_them_but_get_yeeted_instead/", "selftext": "", "media": null, "score": 1003, "upvote_ratio": 0.95, "comment_count": 56, "over_18": false}, "61": {"id": "1dgxb8y", "locked": false, "subreddit": "uap", "stickied": false, "category": "Aliens", "author": "bmfalbo", "link_flair_text": "News", "time": 1719024111.2361252, "created_utc": 1718503502.0, "url": "https://www.askapol.com/p/next-uap-hearing-after-august", "title": "[AskaPol] Luna & Burchett: Next UAP hearing likely to come after August recess", "permalink": "/r/UAP/comments/1dgxb8y/askapol_luna_burchett_next_uap_hearing_likely_to/", "selftext": "", "media": null, "score": 24, "upvote_ratio": 0.91, "comment_count": 1, "over_18": false}, "62": {"id": "1dkolp4", "locked": false, "subreddit": "conspiracy", "stickied": false, "category": "Consipiracy", "author": "Technical_Ad7620", "link_flair_text": null, "time": 1719024112.3534315, "created_utc": 1718923070.0, "url": "https://i.redd.it/04qer68t0t7d1.jpeg", "title": "Dropping this before they change history again", "permalink": "/r/conspiracy/comments/1dkolp4/dropping_this_before_they_change_history_again/", "selftext": "", "media": null, "score": 1490, "upvote_ratio": 0.89, "comment_count": 427, "over_18": false}, "63": {"id": "1dlg91g", "locked": false, "subreddit": "conspiracyfact", "stickied": false, "category": "Consipiracy", "author": "Affectionate_Bet_793", "link_flair_text": null, "time": 1719024112.5902762, "created_utc": 1719008189.0, "url": "https://podcasters.spotify.com/pod/show/alien-tom/episodes/New-Normal-News-16-June-21--2024-e2l4m9k", "title": "Under the Radar News & Headlines Not Covered by MSM This Week's Podcast (June 21, 2024) ", "permalink": "/r/conspiracyfact/comments/1dlg91g/under_the_radar_news_headlines_not_covered_by_msm/", "selftext": "", "media": null, "score": 1, "upvote_ratio": 1.0, "comment_count": 0, "over_18": false}, "64": {"id": "1dk8cdy", "locked": false, "subreddit": "bigfoot", "stickied": false, "category": "Cryptozoology", "author": "downupstair", "link_flair_text": "bigfoot sign/cutout/statue/etc", "time": 1719024113.1399, "created_utc": 1718879382.0, "url": "https://i.redd.it/ihdx6g8wep7d1.jpeg", "title": "Museum in Portland, Maine - Recomend", "permalink": "/r/bigfoot/comments/1dk8cdy/museum_in_portland_maine_recomend/", "selftext": "", "media": null, "score": 192, "upvote_ratio": 0.98, "comment_count": 27, "over_18": false}, "65": {"id": "1djvvwk", "locked": false, "subreddit": "cryptozoology", "stickied": false, "category": "Cryptozoology", "author": "wild_world80", "link_flair_text": "Video ", "time": 1719024113.4334688, "created_utc": 1718835866.0, "url": "https://youtu.be/TwuZqa3B3Nw", "title": "Why do People Still Believe in the Loch Ness Monster?", "permalink": "/r/Cryptozoology/comments/1djvvwk/why_do_people_still_believe_in_the_loch_ness/", "selftext": "", "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "Why do People Still Believe in the Loch Ness Monster?", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/TwuZqa3B3Nw?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen title=\"Why do People Still Believe in the Loch Ness Monster?\"></iframe>", "author_name": "Wild World", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/TwuZqa3B3Nw/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/@wildworld6264"}}, "score": 136, "upvote_ratio": 0.83, "comment_count": 116, "over_18": false}, "66": {"id": "1dhcse9", "locked": false, "subreddit": "cryptids", "stickied": false, "category": "Cryptozoology", "author": "Sillymillie_eel", "link_flair_text": null, "time": 1719024113.9917932, "created_utc": 1718559424.0, "url": "https://www.reddit.com/r/cryptids/comments/1dhcse9/what_is_one_cryptid_your_willing_to_die_believing/", "title": "What is one cryptid your willing to die believing in?", "permalink": "/r/cryptids/comments/1dhcse9/what_is_one_cryptid_your_willing_to_die_believing/", "selftext": "For me it’s definitely Nessie ", "media": null, "score": 197, "upvote_ratio": 0.95, "comment_count": 636, "over_18": false}, "67": {"id": "1dhuhwt", "locked": false, "subreddit": "letsnotmeet", "stickied": false, "category": "Paranormal", "author": "Formal-River-9239", "link_flair_text": null, "time": 1719024114.281779, "created_utc": 1718618679.0, "url": "https://www.reddit.com/r/LetsNotMeet/comments/1dhuhwt/my_follower/", "title": "My follower.", "permalink": "/r/LetsNotMeet/comments/1dhuhwt/my_follower/", "selftext": "When I was a teenager in high school I drove my mom's  jeep a lot; she didn't use it a lot and was kind enough to let me use it. One late night on a weekend, maybe around 1 am, I was leaving a friend's house, driving, when I noticed a car was following me. I have a feeling they started following me shortly after I left my friend's house but I didn't really notice them till about 10 minutes into my drive. I never got a clear look at the driver as they were remained a shadowy outline, but I will refer to them as \"he\" as that is likely what gender they were. I myself am male and at the time was 16 or 17 years old, but I looked about 14 years old.  \nThe distance between my friend's house and my house was about a 30 minute drive and so it didn't take long to see that \"he\" did not coincidentally have the same route as me.   At one point I even made a wild turn across a grass median and \"he\" followed me. Like a stupid teenager I actually found it sort of exciting so I dragged out my 30 minute drive home into a 60 minute drive home trying to lose him. I was in a jeep that had a top speed of 80 km/hr. that was unlikely to happen.  \nAt one point I had to stop at a red light and he was right behind me. I locked my doors and got ready to run the red light if \"he\" got out of his car. He didn't get out of his car. Even though all I could see was his shadowy outline in my rearview mirror I could feel his eyes eerily locked on me the whole time. I should have been scared but for some reason I felt safe from \"him\" from within my vehicle; as a side note I feel super comfortable in cars, later becoming a stunt driver, so the car tended to lull me into a false sense of security. \nAfter having him follow me for almost an hour I made another unwise teenage decision and lead the creepy person following me right to my home. When I pulled into the driveway of my parent's house I immediately threw the vehicle into park and hopped out of the car. I don't know why but I decided to approach him. Ironically I scared \"him\" and he threw his car in reverse. His tires squealed so I assumed he panicked at my unexpected and bold action. He quickly threw his car back into drive and sped off before I could get a good look at \"him\".  \nSort of ironic that the \"man\" with probably nefarious intentions was scared off by my actions. I should have been scared myself but I was more curious about who he was and what he wanted. Still curious to this day about what he intended, but that said lets not meet again.", "media": null, "score": 35, "upvote_ratio": 0.95, "comment_count": 9, "over_18": true}, "68": {"id": "1dh8kfk", "locked": false, "subreddit": "ghosts", "stickied": false, "category": "Paranormal", "author": "A__I_1", "link_flair_text": "Captured Apparition ", "time": 1719024114.7493217, "created_utc": 1718547504.0, "url": "https://i.redd.it/dl37em420y6d1.jpeg", "title": "A mystique being caught in the camera of night watch men.", "permalink": "/r/Ghosts/comments/1dh8kfk/a_mystique_being_caught_in_the_camera_of_night/", "selftext": "", "media": null, "score": 61, "upvote_ratio": 0.81, "comment_count": 12, "over_18": false}, "69": {"id": "1dh6l7x", "locked": false, "subreddit": "glitchinthematrix", "stickied": false, "category": "Paranormal", "author": "Academic-Tension1271", "link_flair_text": "Glitch Vid", "time": 1719024114.9657125, "created_utc": 1718541142.0, "url": "https://youtube.com/shorts/Lqj3T_df7a8?si=919CtxMhy742OszA", "title": "Playground Has Real Life Glitch", "permalink": "/r/GlitchInTheMatrix/comments/1dh6l7x/playground_has_real_life_glitch/", "selftext": "", "media": null, "score": 0, "upvote_ratio": 0.5, "comment_count": 0, "over_18": false}}}